# Issue 23312: documentation and implementation disagree for BooleanPolynomialRing constructor

archive/issues_023075.json:
```json
{
    "body": "\n```\nsage: BooleanPolynomialRing?\nSignature:      BooleanPolynomialRing(n=None, names=None, order='lex')\nDocstring:     \n   Construct a boolean polynomial ring with the following parameters:\n\n   INPUT:\n\n   * \"n\" -- number of variables (an integer > 1)\n\n   * \"names\" -- names of ring variables, may be a string or\n     list/tuple of strings\n\n   * \"order\" -- term order (default: lex)\n```\n\nSo we need `n > 1`.  And the error message for `n=0` agrees:\n\n```\nsage: B = BooleanPolynomialRing(0)\n[...]\nValueError: Number of variables must be greater than 1.\n```\n\nHowever, the implementation allows `n=1`:\n\n```\nsage: B = BooleanPolynomialRing(1)\nsage: B\nBoolean PolynomialRing in None\n```\nand even negative `n`:\n\n```\nsage: B = BooleanPolynomialRing(-2)\nsage: B\nBoolean PolynomialRing in None\n```\n\nThe `n=1` case appears to work fine, so I do not know why it is called out in the documentation. The 'n<0' cases must be a missing error check in the code.\n\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/23312\n\n",
    "created_at": "2017-06-22T19:14:08Z",
    "labels": [
        "component: algebra",
        "trivial",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-8.0",
    "title": "documentation and implementation disagree for BooleanPolynomialRing constructor",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/23312",
    "user": "https://trac.sagemath.org/admin/accounts/users/msaaltink"
}
```

```
sage: BooleanPolynomialRing?
Signature:      BooleanPolynomialRing(n=None, names=None, order='lex')
Docstring:     
   Construct a boolean polynomial ring with the following parameters:

   INPUT:

   * "n" -- number of variables (an integer > 1)

   * "names" -- names of ring variables, may be a string or
     list/tuple of strings

   * "order" -- term order (default: lex)
```

So we need `n > 1`.  And the error message for `n=0` agrees:

```
sage: B = BooleanPolynomialRing(0)
[...]
ValueError: Number of variables must be greater than 1.
```

However, the implementation allows `n=1`:

```
sage: B = BooleanPolynomialRing(1)
sage: B
Boolean PolynomialRing in None
```
and even negative `n`:

```
sage: B = BooleanPolynomialRing(-2)
sage: B
Boolean PolynomialRing in None
```

The `n=1` case appears to work fine, so I do not know why it is called out in the documentation. The 'n<0' cases must be a missing error check in the code.



Issue created by migration from https://trac.sagemath.org/ticket/23312


