# Issue 23350: Doctest: gamma() and log_gamma() return types

archive/issues_023113.json:
```json
{
    "body": "`gamma` and `log_gamma` don't return the input type. This should be the correct behaviour but actually `CC` elements are returned at the moment:\n\n```\nsage: gamma(CDF(1,1))\n0.49801566811835607 - 0.15494982830181067*I\nsage: type(_)\n<type 'sage.rings.complex_double.ComplexDoubleElement'>\nsage: gamma(CIF(1,1))\n0.49801566811835607? - 0.15494982830181068?*I\nsage: type(_)\n<type 'sage.rings.complex_interval.ComplexIntervalFieldElement'>\n\nsage: log_gamma(RDF(-2.5))\n-0.056243716497674054 - 9.42477796076938*I\nsage: type(_)\n<type 'sage.rings.complex_double.ComplexDoubleElement'>\nsage: log_gamma(RIF(-2.5))\n-0.056243716497674054? - 9.4247779607693794?*I\nsage: type(_)\n<type 'sage.rings.complex_interval.ComplexIntervalFieldElement'>\n```\n\n**Upstream:** Fixed upstream, in a later stable release.\n\n**Dependencies:** pynac-0.7.10\n\nIssue created by migration from https://trac.sagemath.org/ticket/23350\n\n",
    "closed_at": "2017-12-12T08:23:33Z",
    "created_at": "2017-07-02T07:23:53Z",
    "labels": [
        "component: symbolics",
        "bug",
        "wontfix"
    ],
    "title": "Doctest: gamma() and log_gamma() return types",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/23350",
    "user": "https://github.com/rwst"
}
```
`gamma` and `log_gamma` don't return the input type. This should be the correct behaviour but actually `CC` elements are returned at the moment:

```
sage: gamma(CDF(1,1))
0.49801566811835607 - 0.15494982830181067*I
sage: type(_)
<type 'sage.rings.complex_double.ComplexDoubleElement'>
sage: gamma(CIF(1,1))
0.49801566811835607? - 0.15494982830181068?*I
sage: type(_)
<type 'sage.rings.complex_interval.ComplexIntervalFieldElement'>

sage: log_gamma(RDF(-2.5))
-0.056243716497674054 - 9.42477796076938*I
sage: type(_)
<type 'sage.rings.complex_double.ComplexDoubleElement'>
sage: log_gamma(RIF(-2.5))
-0.056243716497674054? - 9.4247779607693794?*I
sage: type(_)
<type 'sage.rings.complex_interval.ComplexIntervalFieldElement'>
```

**Upstream:** Fixed upstream, in a later stable release.

**Dependencies:** pynac-0.7.10

Issue created by migration from https://trac.sagemath.org/ticket/23350





---

archive/issue_comments_353157.json:
```json
{
    "body": "<a id='comment:1'></a>\nWith `log_gamma` it seems we follow the RR convention of switching to complex for negative input. This means either this convention has to be changed or the point is moot.",
    "created_at": "2017-12-03T16:53:19Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23350",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23350#issuecomment-353157",
    "user": "https://github.com/rwst"
}
```

<a id='comment:1'></a>
With `log_gamma` it seems we follow the RR convention of switching to complex for negative input. This means either this convention has to be changed or the point is moot.



---

archive/issue_events_207851.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2017-12-03T16:53:19Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/23350",
    "milestone": "sage-8.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/23350#event-207851"
}
```



---

archive/issue_events_207852.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2017-12-03T16:53:19Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sagetest/issues/23350",
    "label": "needs review",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/23350#event-207852"
}
```



---

archive/issue_events_207853.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2017-12-03T16:53:34Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sagetest/issues/23350",
    "label": "needs review",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/23350#event-207853"
}
```



---

archive/issue_events_207854.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2017-12-03T16:53:34Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sagetest/issues/23350",
    "label": "positive review",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/23350#event-207854"
}
```



---

archive/issue_events_207855.json:
```json
{
    "actor": "https://github.com/embray",
    "created_at": "2017-12-12T08:23:33Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sagetest/issues/23350",
    "label": "wontfix",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/23350#event-207855"
}
```



---

archive/issue_events_207856.json:
```json
{
    "actor": "https://github.com/embray",
    "created_at": "2017-12-12T08:23:33Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sagetest/issues/23350",
    "label": "positive review",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/23350#event-207856"
}
```



---

archive/issue_events_207857.json:
```json
{
    "actor": "https://github.com/embray",
    "created_at": "2017-12-12T08:23:33Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/23350",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/23350#event-207857"
}
```



---

archive/issue_comments_353158.json:
```json
{
    "body": "<a id='comment:4'></a>\nwith which version of Sage was it? With Sage 8.0 I get:\n\n```\nsage: gamma(CIF(1,1))\n0.498015668118356 - 0.154949828301811*I\nsage: type(_)\n<type 'sage.rings.complex_number.ComplexNumber'>\n```\nthus I don't get `ComplexIntervalFieldElement` as in the description.",
    "created_at": "2017-12-12T14:01:00Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23350",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23350#issuecomment-353158",
    "user": "https://github.com/zimmermann6"
}
```

<a id='comment:4'></a>
with which version of Sage was it? With Sage 8.0 I get:

```
sage: gamma(CIF(1,1))
0.498015668118356 - 0.154949828301811*I
sage: type(_)
<type 'sage.rings.complex_number.ComplexNumber'>
```
thus I don't get `ComplexIntervalFieldElement` as in the description.



---

archive/issue_comments_353159.json:
```json
{
    "body": "<a id='comment:5'></a>\nWith 8.1:\n\n```\nsage: gamma(CIF(1,1))\n0.49801566811835607? - 0.15494982830181068?*I\nsage: type(_)\n<type 'sage.rings.complex_interval.ComplexIntervalFieldElement'>\n```",
    "created_at": "2017-12-12T14:04:30Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23350",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23350#issuecomment-353159",
    "user": "https://github.com/rwst"
}
```

<a id='comment:5'></a>
With 8.1:

```
sage: gamma(CIF(1,1))
0.49801566811835607? - 0.15494982830181068?*I
sage: type(_)
<type 'sage.rings.complex_interval.ComplexIntervalFieldElement'>
```
