# Issue 23350: Doctest: gamma() and log_gamma() return types

archive/issues_023113.json:
```json
{
    "body": "`gamma` and `log_gamma` don't return the input type. This should be the correct behaviour but actually `CC` elements are returned at the moment:\n\n```\nsage: gamma(CDF(1,1))\n0.49801566811835607 - 0.15494982830181067*I\nsage: type(_)\n<type 'sage.rings.complex_double.ComplexDoubleElement'>\nsage: gamma(CIF(1,1))\n0.49801566811835607? - 0.15494982830181068?*I\nsage: type(_)\n<type 'sage.rings.complex_interval.ComplexIntervalFieldElement'>\n\nsage: log_gamma(RDF(-2.5))\n-0.056243716497674054 - 9.42477796076938*I\nsage: type(_)\n<type 'sage.rings.complex_double.ComplexDoubleElement'>\nsage: log_gamma(RIF(-2.5))\n-0.056243716497674054? - 9.4247779607693794?*I\nsage: type(_)\n<type 'sage.rings.complex_interval.ComplexIntervalFieldElement'>\n```\n\nUpstream: Fixed upstream, in a later stable release.\n\nDependencies: pynac-0.7.10\n\nResolution: wontfix\n\nIssue created by migration from https://trac.sagemath.org/ticket/23350\n\n",
    "closed_at": "2017-12-12T08:23:33Z",
    "created_at": "2017-07-02T07:23:53Z",
    "labels": [
        "component: symbolics",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-duplicate/invalid/wontfix",
    "title": "Doctest: gamma() and log_gamma() return types",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/23350",
    "user": "https://github.com/rwst"
}
```
`gamma` and `log_gamma` don't return the input type. This should be the correct behaviour but actually `CC` elements are returned at the moment:

```
sage: gamma(CDF(1,1))
0.49801566811835607 - 0.15494982830181067*I
sage: type(_)
<type 'sage.rings.complex_double.ComplexDoubleElement'>
sage: gamma(CIF(1,1))
0.49801566811835607? - 0.15494982830181068?*I
sage: type(_)
<type 'sage.rings.complex_interval.ComplexIntervalFieldElement'>

sage: log_gamma(RDF(-2.5))
-0.056243716497674054 - 9.42477796076938*I
sage: type(_)
<type 'sage.rings.complex_double.ComplexDoubleElement'>
sage: log_gamma(RIF(-2.5))
-0.056243716497674054? - 9.4247779607693794?*I
sage: type(_)
<type 'sage.rings.complex_interval.ComplexIntervalFieldElement'>
```

Upstream: Fixed upstream, in a later stable release.

Dependencies: pynac-0.7.10

Resolution: wontfix

Issue created by migration from https://trac.sagemath.org/ticket/23350





---

archive/issue_comments_433130.json:
```json
{
    "body": "<a id='comment:1'></a>\nWith `log_gamma` it seems we follow the RR convention of switching to complex for negative input. This means either this convention has to be changed or the point is moot.",
    "created_at": "2017-12-03T16:53:19Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23350",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23350#issuecomment-433130",
    "user": "https://github.com/rwst"
}
```

<a id='comment:1'></a>
With `log_gamma` it seems we follow the RR convention of switching to complex for negative input. This means either this convention has to be changed or the point is moot.



---

archive/issue_events_076168.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2017-12-03T16:53:19Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/23350",
    "milestone": "sage-duplicate/invalid/wontfix",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/23350#event-76168"
}
```



---

archive/issue_comments_433131.json:
```json
{
    "body": "Changing status from new to needs_review.",
    "created_at": "2017-12-03T16:53:19Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23350",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23350#issuecomment-433131",
    "user": "https://github.com/rwst"
}
```

Changing status from new to needs_review.



---

archive/issue_comments_433132.json:
```json
{
    "body": "Changing status from needs_review to positive_review.",
    "created_at": "2017-12-03T16:53:34Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23350",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23350#issuecomment-433132",
    "user": "https://github.com/rwst"
}
```

Changing status from needs_review to positive_review.



---

archive/issue_comments_433133.json:
```json
{
    "body": "Resolution: wontfix",
    "created_at": "2017-12-12T08:23:33Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23350",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23350#issuecomment-433133",
    "user": "https://github.com/embray"
}
```

Resolution: wontfix



---

archive/issue_events_076169.json:
```json
{
    "actor": "https://github.com/embray",
    "created_at": "2017-12-12T08:23:33Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/23350",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/23350#event-76169"
}
```



---

archive/issue_comments_433134.json:
```json
{
    "body": "<a id='comment:4'></a>\nwith which version of Sage was it? With Sage 8.0 I get:\n\n```\nsage: gamma(CIF(1,1))\n0.498015668118356 - 0.154949828301811*I\nsage: type(_)\n<type 'sage.rings.complex_number.ComplexNumber'>\n```\nthus I don't get `ComplexIntervalFieldElement` as in the description.",
    "created_at": "2017-12-12T14:01:00Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23350",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23350#issuecomment-433134",
    "user": "https://github.com/zimmermann6"
}
```

<a id='comment:4'></a>
with which version of Sage was it? With Sage 8.0 I get:

```
sage: gamma(CIF(1,1))
0.498015668118356 - 0.154949828301811*I
sage: type(_)
<type 'sage.rings.complex_number.ComplexNumber'>
```
thus I don't get `ComplexIntervalFieldElement` as in the description.



---

archive/issue_comments_433135.json:
```json
{
    "body": "<a id='comment:5'></a>\nWith 8.1:\n\n```\nsage: gamma(CIF(1,1))\n0.49801566811835607? - 0.15494982830181068?*I\nsage: type(_)\n<type 'sage.rings.complex_interval.ComplexIntervalFieldElement'>\n```",
    "created_at": "2017-12-12T14:04:30Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23350",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23350#issuecomment-433135",
    "user": "https://github.com/rwst"
}
```

<a id='comment:5'></a>
With 8.1:

```
sage: gamma(CIF(1,1))
0.49801566811835607? - 0.15494982830181068?*I
sage: type(_)
<type 'sage.rings.complex_interval.ComplexIntervalFieldElement'>
```
