# Issue 23621: Fix quotients of univariate polynomial rings over ZZ

archive/issues_023384.json:
```json
{
    "assignees": [],
    "body": "The quotient of `ZZ[x]` by the ideal `(x, 2)`\nworks fine using a multivariate polynomial ring:\n\n```\nsage: R.<x> = PolynomialRing(ZZ, 1)\nsage: I = R.ideal([x, 2])\nsage: I\nIdeal (x, 2) of Multivariate Polynomial Ring in x over Integer Ring\nsage: S = R.quo(I)\nsage: [[S(a) == S(b) for b in (0, 2, x)] for a in (0, 2, x)]\n[[True, True, True], [True, True, True], [True, True, True]]\n```\nbut it fails using a univariate polynomial ring,\nreturning mathematically wrong answers:\n\n```\nsage: R.<x> = ZZ[]\nsage: I = R.ideal([x, 2])\nsage: I\nIdeal (x, 2) of Univariate Polynomial Ring in x over Integer Ring\nsage: S = R.quo(I)\nsage: \nsage: [[S(a) == S(b) for b in (0, 2, x)] for a in (0, 2, x)]\n[[True, False, False], [False, True, False], [False, False, True]]\n```\nExpected:\n\n```\n[[True, True, True], [True, True, True], [True, True, True]]\n```\n\n\n**CC:**  @slel\n\n**Keywords:** ideal\n\nIssue created by migration from https://trac.sagemath.org/ticket/23621\n\n",
    "created_at": "2017-08-14T17:03:43Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20commutative%20algebra",
        "https://github.com/sagemath/sage/labels/critical",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-9.8",
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "Fix quotients of univariate polynomial rings over ZZ",
    "type": "issue",
    "updated_at": "2022-09-19T18:58:47Z",
    "url": "https://github.com/sagemath/sage/issues/23621",
    "user": "https://github.com/koffie"
}
```
The quotient of `ZZ[x]` by the ideal `(x, 2)`
works fine using a multivariate polynomial ring:

```
sage: R.<x> = PolynomialRing(ZZ, 1)
sage: I = R.ideal([x, 2])
sage: I
Ideal (x, 2) of Multivariate Polynomial Ring in x over Integer Ring
sage: S = R.quo(I)
sage: [[S(a) == S(b) for b in (0, 2, x)] for a in (0, 2, x)]
[[True, True, True], [True, True, True], [True, True, True]]
```
but it fails using a univariate polynomial ring,
returning mathematically wrong answers:

```
sage: R.<x> = ZZ[]
sage: I = R.ideal([x, 2])
sage: I
Ideal (x, 2) of Univariate Polynomial Ring in x over Integer Ring
sage: S = R.quo(I)
sage: 
sage: [[S(a) == S(b) for b in (0, 2, x)] for a in (0, 2, x)]
[[True, False, False], [False, True, False], [False, False, True]]
```
Expected:

```
[[True, True, True], [True, True, True], [True, True, True]]
```


**CC:**  @slel

**Keywords:** ideal

Issue created by migration from https://trac.sagemath.org/ticket/23621





---

archive/issue_comments_358119.json:
```json
{
    "body": "<a id='comment:1'></a>\nThe problem is that `I` is just a generic ideal and doesn't implement a `reduce` method.",
    "created_at": "2017-08-18T02:34:31Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/23621",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/23621#issuecomment-358119",
    "user": "https://github.com/roed314"
}
```

<a id='comment:1'></a>
The problem is that `I` is just a generic ideal and doesn't implement a `reduce` method.



---

archive/issue_comments_358120.json:
```json
{
    "body": "<a id='comment:2'></a>\nTo solve this, I think one needs to implement a new class for ideals in `ZZ['x']` and set `_ideal_class_` appropriately on `R`.  Of course, one can argue that the default behavior of the `reduce` method on a generic ideal should be to raise an error rather than just return the input unchanged.",
    "created_at": "2017-08-18T02:37:50Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/23621",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/23621#issuecomment-358120",
    "user": "https://github.com/roed314"
}
```

<a id='comment:2'></a>
To solve this, I think one needs to implement a new class for ideals in `ZZ['x']` and set `_ideal_class_` appropriately on `R`.  Of course, one can argue that the default behavior of the `reduce` method on a generic ideal should be to raise an error rather than just return the input unchanged.



---

archive/issue_comments_358121.json:
```json
{
    "body": "<a id='comment:3'></a>\nYeah I totally agree that it should raise an error, because this implementation does not satisfy the assumption on reduce in other parts of the code. For example this is an excerpt from `sage/rings/quotient_ring.py`.\n\n```\nThe only requirement is that the two-sided ideal `I`\nprovides a ``reduce`` method so that ``I.reduce(x)`` is the normal\nform of an element `x` with respect to `I` (i.e., we have\n``I.reduce(x) == I.reduce(y)`` if `x-y \\in I`, and\n``x - I.reduce(x) in I``). H\n```\nAnd I think that this is a logic requirement to put on the reduce method.",
    "created_at": "2017-08-31T08:18:31Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/23621",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/23621#issuecomment-358121",
    "user": "https://github.com/koffie"
}
```

<a id='comment:3'></a>
Yeah I totally agree that it should raise an error, because this implementation does not satisfy the assumption on reduce in other parts of the code. For example this is an excerpt from `sage/rings/quotient_ring.py`.

```
The only requirement is that the two-sided ideal `I`
provides a ``reduce`` method so that ``I.reduce(x)`` is the normal
form of an element `x` with respect to `I` (i.e., we have
``I.reduce(x) == I.reduce(y)`` if `x-y \in I`, and
``x - I.reduce(x) in I``). H
```
And I think that this is a logic requirement to put on the reduce method.



---

archive/issue_comments_358122.json:
```json
{
    "body": "<a id='comment:4'></a>\nOk there are quite a few doctest failures. If I just make it raise an error. Ironically the first failure is\n\n```\nsage: sage: MS = MatrixSpace(GF(5),2,2)\n....: sage: I = MS*[MS.0*MS.1,MS.2+MS.3]*MS\n....: sage: Q = MS.quo(I)\n....: sage: Q.0*Q.1   # indirect doctest\n....: \n---------------------------------------------------------------------------\nNotImplementedError                       Traceback (most recent call last)\n...\nNotImplementedError: reduce not implemented for Twosided Ideal \n(\n  [0 1]\n  [0 0],\n\n  [0 0]\n  [1 1]\n)\n of Full MatrixSpace of 2 by 2 dense matrices over Finite Field of size 5\n```\n\nwhich was added to test that #11068 is fixed, the ticket where the above text about \"The only requirement is that the two-sided ideal I...\" comes from.",
    "created_at": "2017-08-31T08:34:09Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/23621",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/23621#issuecomment-358122",
    "user": "https://github.com/koffie"
}
```

<a id='comment:4'></a>
Ok there are quite a few doctest failures. If I just make it raise an error. Ironically the first failure is

```
sage: sage: MS = MatrixSpace(GF(5),2,2)
....: sage: I = MS*[MS.0*MS.1,MS.2+MS.3]*MS
....: sage: Q = MS.quo(I)
....: sage: Q.0*Q.1   # indirect doctest
....: 
---------------------------------------------------------------------------
NotImplementedError                       Traceback (most recent call last)
...
NotImplementedError: reduce not implemented for Twosided Ideal 
(
  [0 1]
  [0 0],

  [0 0]
  [1 1]
)
 of Full MatrixSpace of 2 by 2 dense matrices over Finite Field of size 5
```

which was added to test that #11068 is fixed, the ticket where the above text about "The only requirement is that the two-sided ideal I..." comes from.



---

archive/issue_comments_358123.json:
```json
{
    "body": "<a id='comment:5'></a>\nThe second failure points at #13999 of which this ticket basically is a dupe.",
    "created_at": "2017-08-31T08:42:53Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/23621",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/23621#issuecomment-358123",
    "user": "https://github.com/koffie"
}
```

<a id='comment:5'></a>
The second failure points at #13999 of which this ticket basically is a dupe.



---

archive/issue_comments_358124.json:
```json
{
    "body": "<a id='comment:6'></a>\nAll failures will probably be fixed if these three tests pass\n\n```\nsage: MS = MatrixSpace(GF(5),2,2)\nsage: I = MS*[MS.0*MS.1,MS.2+MS.3]*MS\nsage: Q = MS.quo(I)\nsage: Q.0*Q.1   # indirect doctest\n[0 1]\n[0 0]\n```\n\n```\nsage: R.<x> = PolynomialRing(ZZ)\nsage: I = R.ideal([4 + 3*x + x^2, 1 + x^2])\nsage: S = R.quotient_ring(I);\nsage: TestSuite(S).run(skip=['_test_nonzero_equal', '_test_elements', '_test_zero'])\n```\n\n```\nsage: S = SteenrodAlgebra(2)\nsage: I = S*[S.0+S.1]*S\nsage: Q = S.quo(I)\nsage: Q.0\nSq(1)\n```\nI consider all three of them bugs, so this strengthens my believe that it is better to raise a NotImplementedError.",
    "created_at": "2017-08-31T08:59:47Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/23621",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/23621#issuecomment-358124",
    "user": "https://github.com/koffie"
}
```

<a id='comment:6'></a>
All failures will probably be fixed if these three tests pass

```
sage: MS = MatrixSpace(GF(5),2,2)
sage: I = MS*[MS.0*MS.1,MS.2+MS.3]*MS
sage: Q = MS.quo(I)
sage: Q.0*Q.1   # indirect doctest
[0 1]
[0 0]
```

```
sage: R.<x> = PolynomialRing(ZZ)
sage: I = R.ideal([4 + 3*x + x^2, 1 + x^2])
sage: S = R.quotient_ring(I);
sage: TestSuite(S).run(skip=['_test_nonzero_equal', '_test_elements', '_test_zero'])
```

```
sage: S = SteenrodAlgebra(2)
sage: I = S*[S.0+S.1]*S
sage: Q = S.quo(I)
sage: Q.0
Sq(1)
```
I consider all three of them bugs, so this strengthens my believe that it is better to raise a NotImplementedError.



---

archive/issue_comments_358125.json:
```json
{
    "body": "<a id='comment:7'></a>\nI think that all the matrix space examples will not give any interesting doctest, since matrix rings over fields are simple and hence there are no two sided ideals. Although this means that the reduce function is very easy to implement! I don't know enough about Steenrod algebra's in order to create a meaningful reduce method.",
    "created_at": "2017-09-02T04:07:49Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/23621",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/23621#issuecomment-358125",
    "user": "https://github.com/koffie"
}
```

<a id='comment:7'></a>
I think that all the matrix space examples will not give any interesting doctest, since matrix rings over fields are simple and hence there are no two sided ideals. Although this means that the reduce function is very easy to implement! I don't know enough about Steenrod algebra's in order to create a meaningful reduce method.



---

archive/issue_comments_358126.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -2,10 +2,7 @@\n ```\n sage: R.<x> = ZZ[]\n sage: I = R.ideal([x,2]); I\n-Ideal (x, 2) of Univariate Polynomial Ring in x over Integer Ring\n sage: S = R.quo(I)\n-sage: S(x)\n-xbar\n sage: S(x)==S(0)\n False\n sage: S(2)==S(2)\n``````\n",
    "created_at": "2021-12-06T17:13:56Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/23621",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/23621#issuecomment-358126",
    "user": "https://github.com/koffie"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -2,10 +2,7 @@
 ```
 sage: R.<x> = ZZ[]
 sage: I = R.ideal([x,2]); I
-Ideal (x, 2) of Univariate Polynomial Ring in x over Integer Ring
 sage: S = R.quo(I)
-sage: S(x)
-xbar
 sage: S(x)==S(0)
 False
 sage: S(2)==S(2)
``````




---

archive/issue_events_210139.json:
```json
{
    "actor": "https://github.com/slel",
    "created_at": "2021-12-07T16:03:20Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/23621",
    "milestone_number": null,
    "milestone_title": "sage-8.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/23621#event-210139"
}
```



---

archive/issue_events_210140.json:
```json
{
    "actor": "https://github.com/slel",
    "created_at": "2021-12-07T16:03:20Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/23621",
    "milestone_number": null,
    "milestone_title": "sage-9.5",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/23621#event-210140"
}
```



---

archive/issue_comments_358127.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -1,25 +1,31 @@\n+The quotient of `ZZ[x]` by the ideal `(x, 2)`\n+works fine using a multivariate polynomial ring:\n+\n+```\n+sage: R.<x> = PolynomialRing(ZZ, 1)\n+sage: I = R.ideal([x, 2])\n+sage: I\n+Ideal (x, 2) of Multivariate Polynomial Ring in x over Integer Ring\n+sage: S = R.quo(I)\n+sage: [[S(a) == S(b) for b in (0, 2, x)] for a in (0, 2, x)]\n+[[True, True, True], [True, True, True], [True, True, True]]\n+```\n+but it fails using a univariate polynomial ring,\n+returning mathematically wrong answers:\n \n ```\n sage: R.<x> = ZZ[]\n-sage: I = R.ideal([x,2]); I\n+sage: I = R.ideal([x, 2])\n+sage: I\n+Ideal (x, 2) of Univariate Polynomial Ring in x over Integer Ring\n sage: S = R.quo(I)\n-sage: S(x)==S(0)\n-False\n-sage: S(2)==S(2)\n-True\n-sage: S(2)==S(0)\n-False\n+sage: \n+sage: [[S(a) == S(b) for b in (0, 2, x)] for a in (0, 2, x)]\n+[[True, False, False], [False, True, False], [False, False, True]]\n+```\n+Expected:\n+\n+```\n+[[True, True, True], [True, True, True], [True, True, True]]\n ```\n \n-Note that if you create the quotient as a multivariate polynomial ring, then it works fine!\n-\n-```\n-sage: R.<x> = PolynomialRing(ZZ,1)\n-sage: I = R.ideal([x,2]); I\n-Ideal (x, 2) of Multivariate Polynomial Ring in x over Integer Ring\n-sage: S = R.quo(I)\n-sage: S(x)==0\n-True\n-sage: S(2)==0\n-True\n-```\n``````\n",
    "created_at": "2021-12-07T16:03:20Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/23621",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/23621#issuecomment-358127",
    "user": "https://github.com/slel"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -1,25 +1,31 @@
+The quotient of `ZZ[x]` by the ideal `(x, 2)`
+works fine using a multivariate polynomial ring:
+
+```
+sage: R.<x> = PolynomialRing(ZZ, 1)
+sage: I = R.ideal([x, 2])
+sage: I
+Ideal (x, 2) of Multivariate Polynomial Ring in x over Integer Ring
+sage: S = R.quo(I)
+sage: [[S(a) == S(b) for b in (0, 2, x)] for a in (0, 2, x)]
+[[True, True, True], [True, True, True], [True, True, True]]
+```
+but it fails using a univariate polynomial ring,
+returning mathematically wrong answers:
 
 ```
 sage: R.<x> = ZZ[]
-sage: I = R.ideal([x,2]); I
+sage: I = R.ideal([x, 2])
+sage: I
+Ideal (x, 2) of Univariate Polynomial Ring in x over Integer Ring
 sage: S = R.quo(I)
-sage: S(x)==S(0)
-False
-sage: S(2)==S(2)
-True
-sage: S(2)==S(0)
-False
+sage: 
+sage: [[S(a) == S(b) for b in (0, 2, x)] for a in (0, 2, x)]
+[[True, False, False], [False, True, False], [False, False, True]]
+```
+Expected:
+
+```
+[[True, True, True], [True, True, True], [True, True, True]]
 ```
 
-Note that if you create the quotient as a multivariate polynomial ring, then it works fine!
-
-```
-sage: R.<x> = PolynomialRing(ZZ,1)
-sage: I = R.ideal([x,2]); I
-Ideal (x, 2) of Multivariate Polynomial Ring in x over Integer Ring
-sage: S = R.quo(I)
-sage: S(x)==0
-True
-sage: S(2)==0
-True
-```
``````




---

archive/issue_events_210141.json:
```json
{
    "actor": "https://github.com/slel",
    "created_at": "2021-12-07T16:03:20Z",
    "event": "renamed",
    "issue": "https://github.com/sagemath/sage/issues/23621",
    "rename": {
        "from": "Quotients of univariate polynomial rings over ZZ return mathematical incorrect answers",
        "to": "Fix quotients of univariate polynomial rings over ZZ"
    },
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/23621#event-210141"
}
```



---

archive/issue_comments_358128.json:
```json
{
    "body": "**Changing keywords** from \"\" to \"ideal\".",
    "created_at": "2021-12-07T16:03:20Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/23621",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/23621#issuecomment-358128",
    "user": "https://github.com/slel"
}
```

**Changing keywords** from "" to "ideal".



---

archive/issue_events_210142.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-01-10T00:37:38Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/23621",
    "milestone_number": null,
    "milestone_title": "sage-9.5",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/23621#event-210142"
}
```



---

archive/issue_events_210143.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-01-10T00:37:38Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/23621",
    "milestone_number": null,
    "milestone_title": "sage-9.6",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/23621#event-210143"
}
```



---

archive/issue_events_210144.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-05-03T15:17:06Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/23621",
    "milestone_number": null,
    "milestone_title": "sage-9.6",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/23621#event-210144"
}
```



---

archive/issue_events_210145.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-05-03T15:17:06Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/23621",
    "milestone_number": null,
    "milestone_title": "sage-9.7",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/23621#event-210145"
}
```



---

archive/issue_events_210146.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-09-19T18:58:47Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/23621",
    "milestone_number": null,
    "milestone_title": "sage-9.7",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/23621#event-210146"
}
```



---

archive/issue_events_210147.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-09-19T18:58:47Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/23621",
    "milestone_number": null,
    "milestone_title": "sage-9.8",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/23621#event-210147"
}
```
