# Issue 23715: most matrices ignore transformation=true in echelon form

archive/issues_023478.json:
```json
{
    "body": "Fine for integers\n\n```\nsage: matrix(ZZ,2,range(4)).echelon_form(transformation=True)\n(\n[2 0]  [-3  1]\n[0 1], [ 1  0]\n)\n```\nBut false for all (?) others\n\n```\nsage: UCF = UniversalCyclotomicField()\nsage: matrix(UCF,2,range(4)).echelon_form(transformation=True)\n[1 0]\n[0 1]\nsage: matrix(QQ,2,range(4)).echelon_form(transformation=True)\n[1 0]\n[0 1]\nsage: matrix(GF(2),2,range(4)).echelon_form(transformation=True)\n[0 1]\n[0 0]\n```\n\n**CC:**  @jplab @slel\n\n**Keywords:** days88, echelon_form, matrix\n\nIssue created by migration from https://trac.sagemath.org/ticket/23715\n\n",
    "created_at": "2017-08-25T16:32:34Z",
    "labels": [
        "component: linear algebra",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-8.1",
    "title": "most matrices ignore transformation=true in echelon form",
    "type": "issue",
    "url": "https://github.com/sagemath/sage/issues/23715",
    "user": "https://github.com/videlec"
}
```
Fine for integers

```
sage: matrix(ZZ,2,range(4)).echelon_form(transformation=True)
(
[2 0]  [-3  1]
[0 1], [ 1  0]
)
```
But false for all (?) others

```
sage: UCF = UniversalCyclotomicField()
sage: matrix(UCF,2,range(4)).echelon_form(transformation=True)
[1 0]
[0 1]
sage: matrix(QQ,2,range(4)).echelon_form(transformation=True)
[1 0]
[0 1]
sage: matrix(GF(2),2,range(4)).echelon_form(transformation=True)
[0 1]
[0 0]
```

**CC:**  @jplab @slel

**Keywords:** days88, echelon_form, matrix

Issue created by migration from https://trac.sagemath.org/ticket/23715





---

archive/issue_events_210920.json:
```json
{
    "actor": "https://github.com/videlec",
    "created_at": "2017-08-25T16:35:26Z",
    "event": "renamed",
    "issue": "https://github.com/sagemath/sage/issues/23715",
    "rename": {
        "from": "rational matrices ignore transformation=true in echelon form",
        "to": "most matrices ignore transformation=true in echelon form"
    },
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/23715#event-210920"
}
```



---

archive/issue_comments_360221.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -1,3 +1,4 @@\n+Fine for integers\n \n ```\n sage: matrix(ZZ,2,range(4)).echelon_form(transformation=True)\n@@ -5,7 +6,18 @@\n [2 0]  [-3  1]\n [0 1], [ 1  0]\n )\n+```\n+But false for all (?) others\n+\n+```\n+sage: UCF = UniversalCyclotomicField()\n+sage: matrix(UCF,2,range(4)).echelon_form(transformation=True)\n+[1 0]\n+[0 1]\n sage: matrix(QQ,2,range(4)).echelon_form(transformation=True)\n [1 0]\n [0 1]\n+sage: matrix(GF(2),2,range(4)).echelon_form(transformation=True)\n+[0 1]\n+[0 0]\n ```\n``````\n",
    "created_at": "2017-08-25T16:35:26Z",
    "issue": "https://github.com/sagemath/sage/issues/23715",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/23715#issuecomment-360221",
    "user": "https://github.com/videlec"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -1,3 +1,4 @@
+Fine for integers
 
 ```
 sage: matrix(ZZ,2,range(4)).echelon_form(transformation=True)
@@ -5,7 +6,18 @@
 [2 0]  [-3  1]
 [0 1], [ 1  0]
 )
+```
+But false for all (?) others
+
+```
+sage: UCF = UniversalCyclotomicField()
+sage: matrix(UCF,2,range(4)).echelon_form(transformation=True)
+[1 0]
+[0 1]
 sage: matrix(QQ,2,range(4)).echelon_form(transformation=True)
 [1 0]
 [0 1]
+sage: matrix(GF(2),2,range(4)).echelon_form(transformation=True)
+[0 1]
+[0 0]
 ```
``````




---

archive/issue_comments_360222.json:
```json
{
    "body": "**Changing keywords** from \"days88\" to \"days88, echelon_form, matrix\".",
    "created_at": "2018-09-11T11:57:14Z",
    "issue": "https://github.com/sagemath/sage/issues/23715",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/23715#issuecomment-360222",
    "user": "https://github.com/slel"
}
```

**Changing keywords** from "days88" to "days88, echelon_form, matrix".



---

archive/issue_comments_360223.json:
```json
{
    "body": "<a id='comment:2'></a>\nRelated: the documentation for `rref` (reduced row-echelon form) claims that\n\n> All arguments are passed on to :meth:`echelon_form`.\n\n\nbut it is not the case; in particular `transformation=True` is not passed on!\n\n```\nsage: a = matrix(ZZ, [[1, 2, 3], [3, 2, 1], [0, 1, 0]])\nsage: a.rref(transformation=True)\n[1 0 0]\n[0 1 0]\n[0 0 1]\nsage: a.echelon_form(transformation=True)\n(\n[1 0 3]  [ 1  0 -2]\n[0 1 0]  [ 0  0  1]\n[0 0 8], [ 3 -1 -4]\n)\n```",
    "created_at": "2018-09-11T11:57:14Z",
    "issue": "https://github.com/sagemath/sage/issues/23715",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/23715#issuecomment-360223",
    "user": "https://github.com/slel"
}
```

<a id='comment:2'></a>
Related: the documentation for `rref` (reduced row-echelon form) claims that

> All arguments are passed on to :meth:`echelon_form`.


but it is not the case; in particular `transformation=True` is not passed on!

```
sage: a = matrix(ZZ, [[1, 2, 3], [3, 2, 1], [0, 1, 0]])
sage: a.rref(transformation=True)
[1 0 0]
[0 1 0]
[0 0 1]
sage: a.echelon_form(transformation=True)
(
[1 0 3]  [ 1  0 -2]
[0 1 0]  [ 0  0  1]
[0 0 8], [ 3 -1 -4]
)
```



---

archive/issue_comments_360224.json:
```json
{
    "body": "<a id='comment:3'></a>\nIs it maybe the case that `transformation=True` is honored by `echelon_form` only if the base ring is not a field?",
    "created_at": "2018-09-11T22:39:10Z",
    "issue": "https://github.com/sagemath/sage/issues/23715",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/23715#issuecomment-360224",
    "user": "https://github.com/slel"
}
```

<a id='comment:3'></a>
Is it maybe the case that `transformation=True` is honored by `echelon_form` only if the base ring is not a field?
