# Issue 23723: Allow iterables in vector constructor

archive/issues_023486.json:
```json
{
    "body": "\n```\nsage: (ZZ**3)(pari([1,2,3]))\n...\nTypeError: can't initialize vector from nonzero non-list\n```\nand\n\n```\nsage: (ZZ^3)(i for i in range(3))\n...\nTypeError: can't initialize vector from nonzero non-list\n```\n\nTogether with #20211, the aim is to have the following construction supported\n\n```\nsage: K = CyclotomicField(10)\nsage: z = K.gen()\nsage: M = MatrixSpace(K, 2)\nsage: m = M([1, z, 1-z, -2/3])\nsage: p = m.__pari__()\nsage: r = p^2 - 2*p + 3\nsage: M(r)\nTraceback (most recent call last):\n...\nTypeError: ... has unsupported PARI type t_MAT\n```\n  (in the above example `r.sage()` does fail with `NameError: name 'y' is not defined`)\n\n**CC:**  @jdemeyer @jplab\n\n**Status:** new\n\nIssue created by migration from https://trac.sagemath.org/ticket/23723\n\n",
    "created_at": "2017-08-26T03:01:06Z",
    "labels": [
        "component: interfaces"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-8.1",
    "title": "Allow iterables in vector constructor",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/23723",
    "user": "https://github.com/videlec"
}
```

```
sage: (ZZ**3)(pari([1,2,3]))
...
TypeError: can't initialize vector from nonzero non-list
```
and

```
sage: (ZZ^3)(i for i in range(3))
...
TypeError: can't initialize vector from nonzero non-list
```

Together with #20211, the aim is to have the following construction supported

```
sage: K = CyclotomicField(10)
sage: z = K.gen()
sage: M = MatrixSpace(K, 2)
sage: m = M([1, z, 1-z, -2/3])
sage: p = m.__pari__()
sage: r = p^2 - 2*p + 3
sage: M(r)
Traceback (most recent call last):
...
TypeError: ... has unsupported PARI type t_MAT
```
  (in the above example `r.sage()` does fail with `NameError: name 'y' is not defined`)

**CC:**  @jdemeyer @jplab

**Status:** new

Issue created by migration from https://trac.sagemath.org/ticket/23723





---

archive/issue_events_068912.json:
```json
{
    "event": "renamed",
    "issue": "https://github.com/sagemath/sagetest/issues/23723",
    "rename": {
        "from": "accept pari input in more parents",
        "to": "Allow iterables in vector constructor"
    },
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/23723#event-68912"
}
```




---

archive/issue_comments_449967.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -1,27 +1,18 @@\n-- vectors\n \n ```\n-sage: V = ZZ**3\n-sage: v = pari([1,2,3])\n-sage: V(v)\n-Traceback (most recent call last):\n+sage: (ZZ**3)(pari([1,2,3]))\n ...\n TypeError: can't initialize vector from nonzero non-list\n ```\n-  (note: in the above example `v.sage()` returns a list)\n-- matrices\n+and\n \n ```\n-sage: M = MatrixSpace(ZZ, 2)\n-sage: p = pari('[1, 2; 3, 4]')\n-sage: M(p)\n-Traceback (most recent call last):\n+sage: (ZZ^3)(i for i in range(3))\n ...\n-TypeError: entries has the wrong length\n+TypeError: can't initialize vector from nonzero non-list\n ```\n-  (note: in the above case `p.sage()` works perfectly)\n \n-The aim is to have the following construction supported\n+Together with #20211, the aim is to have the following construction supported\n \n ```\n sage: K = CyclotomicField(10)\n``````\n",
    "created_at": "2017-08-28T11:07:33Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23723",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23723#issuecomment-449967",
    "user": "https://github.com/jdemeyer"
}
```


**Description changed:**
``````diff
--- 
+++ 
@@ -1,27 +1,18 @@
-- vectors
 
 ```
-sage: V = ZZ**3
-sage: v = pari([1,2,3])
-sage: V(v)
-Traceback (most recent call last):
+sage: (ZZ**3)(pari([1,2,3]))
 ...
 TypeError: can't initialize vector from nonzero non-list
 ```
-  (note: in the above example `v.sage()` returns a list)
-- matrices
+and
 
 ```
-sage: M = MatrixSpace(ZZ, 2)
-sage: p = pari('[1, 2; 3, 4]')
-sage: M(p)
-Traceback (most recent call last):
+sage: (ZZ^3)(i for i in range(3))
 ...
-TypeError: entries has the wrong length
+TypeError: can't initialize vector from nonzero non-list
 ```
-  (note: in the above case `p.sage()` works perfectly)
 
-The aim is to have the following construction supported
+Together with #20211, the aim is to have the following construction supported
 
 ```
 sage: K = CyclotomicField(10)
``````

