# Issue 23723: Allow iterables in vector constructor

archive/issues_023486.json:
```json
{
    "body": "```\nsage: (ZZ**3)(pari([1,2,3]))\n...\nTypeError: can't initialize vector from nonzero non-list\n```\nand\n\n```\nsage: (ZZ^3)(i for i in range(3))\n...\nTypeError: can't initialize vector from nonzero non-list\n```\n\nTogether with #20211, the aim is to have the following construction supported\n\n```\nsage: K = CyclotomicField(10)\nsage: z = K.gen()\nsage: M = MatrixSpace(K, 2)\nsage: m = M([1, z, 1-z, -2/3])\nsage: p = m.__pari__()\nsage: r = p^2 - 2*p + 3\nsage: M(r)\nTraceback (most recent call last):\n...\nTypeError: ... has unsupported PARI type t_MAT\n```\n  (in the above example `r.sage()` does fail with `NameError: name 'y' is not defined`)\n\nCC:  @jdemeyer @jplab\n\nStatus: new\n\nIssue created by migration from https://trac.sagemath.org/ticket/23723\n\n",
    "created_at": "2017-08-26T03:01:06Z",
    "labels": [
        "component: interfaces"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-8.1",
    "title": "Allow iterables in vector constructor",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/23723",
    "user": "https://github.com/videlec"
}
```
```
sage: (ZZ**3)(pari([1,2,3]))
...
TypeError: can't initialize vector from nonzero non-list
```
and

```
sage: (ZZ^3)(i for i in range(3))
...
TypeError: can't initialize vector from nonzero non-list
```

Together with #20211, the aim is to have the following construction supported

```
sage: K = CyclotomicField(10)
sage: z = K.gen()
sage: M = MatrixSpace(K, 2)
sage: m = M([1, z, 1-z, -2/3])
sage: p = m.__pari__()
sage: r = p^2 - 2*p + 3
sage: M(r)
Traceback (most recent call last):
...
TypeError: ... has unsupported PARI type t_MAT
```
  (in the above example `r.sage()` does fail with `NameError: name 'y' is not defined`)

CC:  @jdemeyer @jplab

Status: new

Issue created by migration from https://trac.sagemath.org/ticket/23723


