# Issue 23738: simplify_full() fails to simplify simple constant expressions to zero

archive/issues_023501.json:
```json
{
    "body": "An issue found by Victor Spitzer: Sage fails to simplify\n\n```\nsage: f = log(sqrt(2) - 1) + log(sqrt(2) + 1)\nsage: f.simplify_full()\nlog(sqrt(2) + 1) + log(sqrt(2) - 1)\n```\nwithout help. Doing\n\n```\nsage: f.simplify_real().simplify_log()\n0\n```\nworks, but it would be nice if `simplify_{log,full})` detected by themselves that `simplify_real()` is applicable in this case.\n\n**Status:** new\n\nIssue created by migration from https://trac.sagemath.org/ticket/23738\n\n",
    "created_at": "2017-08-28T19:31:41Z",
    "labels": [
        "component: symbolics"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-wishlist",
    "title": "simplify_full() fails to simplify simple constant expressions to zero",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/23738",
    "user": "https://github.com/mezzarobba"
}
```
An issue found by Victor Spitzer: Sage fails to simplify

```
sage: f = log(sqrt(2) - 1) + log(sqrt(2) + 1)
sage: f.simplify_full()
log(sqrt(2) + 1) + log(sqrt(2) - 1)
```
without help. Doing

```
sage: f.simplify_real().simplify_log()
0
```
works, but it would be nice if `simplify_{log,full})` detected by themselves that `simplify_real()` is applicable in this case.

**Status:** new

Issue created by migration from https://trac.sagemath.org/ticket/23738





---

archive/issue_comments_450292.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -1,10 +1,14 @@\n-In this example:\n+An issue found by Victor Spitzer: Sage fails to simplify\n \n ```\n sage: f = log(sqrt(2) - 1) + log(sqrt(2) + 1)\n sage: f.simplify_full()\n log(sqrt(2) + 1) + log(sqrt(2) - 1)\n+```\n+without help. Doing\n+\n+```\n sage: f.simplify_real().simplify_log()\n 0\n ```\n-it would be nice if `simplify_{log,full})` detected by themselves that `simplify_real()` is applicable.\n+works, but it would be nice if `simplify_{log,full})` detected by themselves that `simplify_real()` is applicable in this case.\n``````\n",
    "created_at": "2017-08-28T19:46:05Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23738",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23738#issuecomment-450292",
    "user": "https://github.com/mezzarobba"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -1,10 +1,14 @@
-In this example:
+An issue found by Victor Spitzer: Sage fails to simplify
 
 ```
 sage: f = log(sqrt(2) - 1) + log(sqrt(2) + 1)
 sage: f.simplify_full()
 log(sqrt(2) + 1) + log(sqrt(2) - 1)
+```
+without help. Doing
+
+```
 sage: f.simplify_real().simplify_log()
 0
 ```
-it would be nice if `simplify_{log,full})` detected by themselves that `simplify_real()` is applicable.
+works, but it would be nice if `simplify_{log,full})` detected by themselves that `simplify_real()` is applicable in this case.
``````

