# Issue 23853: libgap can not use gap packages

archive/issues_023616.json:
```json
{
    "body": "With gap pexpect interface\n\n```\nsage: gap.LoadPackage('\"cryst\"')\ntrue\nsage: gap.SpaceGroupIT(2,14)\nSpaceGroupOnRightIT(2,14,'1')\n```\nWith libgap\n\n```\nsage: libgap.LoadPackage(\"cryst\")\ntrue\nsage: libgap.SpaceGroupIT(2,14)\nTraceback (most recent call last):\n...\nAttributeError: No such attribute: SpaceGroupIT.\n```\n\nAs noticed in #23854, there is the following work around\n\n```\nsage: libgap.eval('SpaceGroupIT')(2,14)\nSpaceGroupOnRightIT(2,14,'1')\n```\n\n**Keywords:** thursdaysbdx\n\n**Resolution:** worksforme\n\nIssue created by migration from https://trac.sagemath.org/ticket/23853\n\n",
    "closed_at": "2021-02-16T13:35:39Z",
    "created_at": "2017-09-14T09:09:22Z",
    "labels": [
        "component: interfaces",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-duplicate/invalid/wontfix",
    "title": "libgap can not use gap packages",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/23853",
    "user": "https://github.com/videlec"
}
```
With gap pexpect interface

```
sage: gap.LoadPackage('"cryst"')
true
sage: gap.SpaceGroupIT(2,14)
SpaceGroupOnRightIT(2,14,'1')
```
With libgap

```
sage: libgap.LoadPackage("cryst")
true
sage: libgap.SpaceGroupIT(2,14)
Traceback (most recent call last):
...
AttributeError: No such attribute: SpaceGroupIT.
```

As noticed in #23854, there is the following work around

```
sage: libgap.eval('SpaceGroupIT')(2,14)
SpaceGroupOnRightIT(2,14,'1')
```

**Keywords:** thursdaysbdx

**Resolution:** worksforme

Issue created by migration from https://trac.sagemath.org/ticket/23853





---

archive/issue_comments_452544.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -16,3 +16,10 @@\n ...\n AttributeError: No such attribute: SpaceGroupIT.\n ```\n+\n+As noticed in #23854, there is the following work around\n+\n+```\n+sage: libgap.eval('SpaceGroupIT')(2,14)\n+SpaceGroupOnRightIT(2,14,'1')\n+```\n``````\n",
    "created_at": "2017-09-14T09:58:47Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23853",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23853#issuecomment-452544",
    "user": "https://github.com/videlec"
}
```


**Description changed:**
``````diff
--- 
+++ 
@@ -16,3 +16,10 @@
 ...
 AttributeError: No such attribute: SpaceGroupIT.
 ```
+
+As noticed in #23854, there is the following work around
+
+```
+sage: libgap.eval('SpaceGroupIT')(2,14)
+SpaceGroupOnRightIT(2,14,'1')
+```
``````




---

archive/issue_events_069100.json:
```json
{
    "actor": "https://github.com/embray",
    "created_at": "2021-02-16T13:30:33Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/23853",
    "milestone": "sage-pending",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/23853#event-69100"
}
```




---

archive/issue_comments_452545.json:
```json
{
    "body": "<a id='comment:3'></a>\nThis is fixed since some time ago.  You could use any package to demonstrate, but I installed the cryst package to demonstrate the same example:\n\n```\nsage: libgap.load_package('cryst')                                                                                                                                                               \ntrue\nsage: libgap.SpaceGroupIT(2,14)                                                                                                                                                                  \nSpaceGroupOnRightIT(2,14,'1')\n```\n\nThis was likely fixed by #27911.",
    "created_at": "2021-02-16T13:35:39Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23853",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23853#issuecomment-452545",
    "user": "https://github.com/embray"
}
```


<a id='comment:3'></a>
This is fixed since some time ago.  You could use any package to demonstrate, but I installed the cryst package to demonstrate the same example:

```
sage: libgap.load_package('cryst')                                                                                                                                                               
true
sage: libgap.SpaceGroupIT(2,14)                                                                                                                                                                  
SpaceGroupOnRightIT(2,14,'1')
```

This was likely fixed by #27911.



---

archive/issue_events_069101.json:
```json
{
    "actor": "https://github.com/embray",
    "created_at": "2021-02-16T13:35:39Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/23853",
    "milestone": "sage-pending",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/23853#event-69101"
}
```




---

archive/issue_events_069102.json:
```json
{
    "actor": "https://github.com/embray",
    "created_at": "2021-02-16T13:35:39Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/23853",
    "milestone": "sage-duplicate/invalid/wontfix",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/23853#event-69102"
}
```




---

archive/issue_comments_452546.json:
```json
{
    "body": "**Resolution:** worksforme",
    "created_at": "2021-02-16T13:35:39Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23853",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23853#issuecomment-452546",
    "user": "https://github.com/embray"
}
```


**Resolution:** worksforme



---

archive/issue_events_069103.json:
```json
{
    "actor": "https://github.com/embray",
    "created_at": "2021-02-16T13:35:39Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/23853",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/23853#event-69103"
}
```

