# Issue 10221: problem in rounding (RealField)

archive/issues_010220.json:
```json
{
    "body": "Consider the following with Sage 4.4.4:\n\n```\nsage: RD = RealField(53, rnd='RNDD')\nsage: RU = RealField(53, rnd='RNDU')\nsage: a=RD(1/3)\nsage: RU(1/a)\n3.00000000000000\nsage: RU(1/a.exact_rational())\n3.00000000000001\n```\nI would expect both results to be equal, since a is exactly representable in 53-bit precision. However it seems in `RU(1/a)`\nthat `1/a` is evaluated with rounding down, whereas I would\nexpect it evaluated with rounding up.\n\nMaybe `1/a` is first evaluated before `RU` is called on it?\n\nPaul\n\n**Assignee:** @aghitza\n\nIssue created by migration from https://trac.sagemath.org/ticket/10221\n\n",
    "closed_at": "2010-11-08T08:09:38Z",
    "created_at": "2010-11-05T12:59:23Z",
    "labels": [
        "component: basic arithmetic",
        "minor",
        "bug",
        "invalid"
    ],
    "title": "problem in rounding (RealField)",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/10221",
    "user": "https://github.com/zimmermann6"
}
```
Consider the following with Sage 4.4.4:

```
sage: RD = RealField(53, rnd='RNDD')
sage: RU = RealField(53, rnd='RNDU')
sage: a=RD(1/3)
sage: RU(1/a)
3.00000000000000
sage: RU(1/a.exact_rational())
3.00000000000001
```
I would expect both results to be equal, since a is exactly representable in 53-bit precision. However it seems in `RU(1/a)`
that `1/a` is evaluated with rounding down, whereas I would
expect it evaluated with rounding up.

Maybe `1/a` is first evaluated before `RU` is called on it?

Paul

**Assignee:** @aghitza

Issue created by migration from https://trac.sagemath.org/ticket/10221





---

archive/issue_comments_096953.json:
```json
{
    "body": "Replying to [ticket:10221 zimmerma]:\n> Maybe `1/a` is first evaluated before `RU` is called on it?\n\n\nYes, this is definitely the case.  `1/a` is evaluated before it even \"sees\" the `RU`.\n\n```\n\nsage: RD = RealField(53, rnd='RNDD')\nsage: RU = RealField(53, rnd='RNDU')\nsage: a=RD(1/3)\nsage: 1/RU(a)\n3.00000000000001\nsage: RU(1/a.exact_rational())\n3.00000000000001\n```",
    "created_at": "2010-11-05T18:52:44Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10221",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10221#issuecomment-96953",
    "user": "https://github.com/mwhansen"
}
```

Replying to [ticket:10221 zimmerma]:
> Maybe `1/a` is first evaluated before `RU` is called on it?


Yes, this is definitely the case.  `1/a` is evaluated before it even "sees" the `RU`.

```

sage: RD = RealField(53, rnd='RNDD')
sage: RU = RealField(53, rnd='RNDU')
sage: a=RD(1/3)
sage: 1/RU(a)
3.00000000000001
sage: RU(1/a.exact_rational())
3.00000000000001
```



---

archive/issue_comments_096954.json:
```json
{
    "body": "<a id='comment:2'></a>\nReplying to [mhansen](#comment%3A1):\n> Replying to [ticket:10221 zimmerma]:\n> > Maybe `1/a` is first evaluated before `RU` is called on it?\n\n> \n> Yes, this is definitely the case.  `1/a` is evaluated before it even \"sees\" the `RU`.\n\n\nok, then I change this ticket as invalid.\n\nPaul",
    "created_at": "2010-11-08T08:09:38Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10221",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10221#issuecomment-96954",
    "user": "https://github.com/zimmermann6"
}
```

<a id='comment:2'></a>
Replying to [mhansen](#comment%3A1):
> Replying to [ticket:10221 zimmerma]:
> > Maybe `1/a` is first evaluated before `RU` is called on it?

> 
> Yes, this is definitely the case.  `1/a` is evaluated before it even "sees" the `RU`.


ok, then I change this ticket as invalid.

Paul



---

archive/issue_events_077784.json:
```json
{
    "actor": "https://github.com/zimmermann6",
    "created_at": "2010-11-08T08:09:38Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/10221",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/10221#event-77784"
}
```



---

archive/issue_events_077785.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/mvngu",
    "created_at": "2010-11-09T09:53:26Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/10221",
    "milestone": "sage-4.6.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/10221#event-77785"
}
```
