# Issue 10308: bug in genus of ideal on 64 bits

archive/issues_010307.json:
```json
{
    "body": "The following problem was discovered by Victor Miller in Sage-support\n\nhttp://groups.google.com/group/sage-support/browse_thread/thread/e30af8c695b6a912\n\n```python\nsage: T.<t1,t2,u1,u2> = QQ[] \nsage: TJ = Ideal([t1^2 + u1^2 - 1,t2^2 + u2^2 - 1, (t1-t2)^2 + (u1-u2)^2 -1]) \nsage: TJ.genus() \n4294967295 \nsage: TJ.dimension() \n1 \n```\n\nI can confirm the bug in debian 64bits. Howeber, in debian 32 bits the answer is\n\n```\nsage: TJ.genus()\n-1\n```\n\nSo it seems to be a problem with 2**32-1 in 32 vs 64 bits.\n\nA simpler example (Ubuntu 64-bit):\n\n```python\nsage: R.<x, y, z> = QQ[]\nsage: C = Curve(x^2 - 2*y^2)\nsage: C.is_singular()\nTrue\nsage: C.genus()\n4294967295\n```\n\nAssignee: @williamstein\n\nKeywords: genus, Singular, 64bits\n\nReviewer: Peter Bruin\n\nAuthor: Luis Felipe Tabera Alonso\n\nMerged: sage-5.11.rc0\n\nResolution: fixed\n\nIssue created by migration from https://trac.sagemath.org/ticket/10308\n\n",
    "closed_at": "2013-07-31T12:53:18Z",
    "created_at": "2010-11-22T08:20:07Z",
    "labels": [
        "component: interfaces",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-5.11",
    "title": "bug in genus of ideal on 64 bits",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/10308",
    "user": "https://github.com/lftabera"
}
```
The following problem was discovered by Victor Miller in Sage-support

http://groups.google.com/group/sage-support/browse_thread/thread/e30af8c695b6a912

```python
sage: T.<t1,t2,u1,u2> = QQ[] 
sage: TJ = Ideal([t1^2 + u1^2 - 1,t2^2 + u2^2 - 1, (t1-t2)^2 + (u1-u2)^2 -1]) 
sage: TJ.genus() 
4294967295 
sage: TJ.dimension() 
1 
```

I can confirm the bug in debian 64bits. Howeber, in debian 32 bits the answer is

```
sage: TJ.genus()
-1
```

So it seems to be a problem with 2**32-1 in 32 vs 64 bits.

A simpler example (Ubuntu 64-bit):

```python
sage: R.<x, y, z> = QQ[]
sage: C = Curve(x^2 - 2*y^2)
sage: C.is_singular()
True
sage: C.genus()
4294967295
```

Assignee: @williamstein

Keywords: genus, Singular, 64bits

Reviewer: Peter Bruin

Author: Luis Felipe Tabera Alonso

Merged: sage-5.11.rc0

Resolution: fixed

Issue created by migration from https://trac.sagemath.org/ticket/10308





---

archive/issue_comments_127134.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -2,7 +2,7 @@\n \n http://groups.google.com/group/sage-support/browse_thread/thread/e30af8c695b6a912\n \n-```\n+```python\n sage: T.<t1,t2,u1,u2> = QQ[] \n sage: TJ = Ideal([t1^2 + u1^2 - 1,t2^2 + u2^2 - 1, (t1-t2)^2 + (u1-u2)^2 -1]) \n sage: TJ.genus() \n@@ -11,7 +11,7 @@\n 1 \n ```\n \n-I can confirm the bug in debian 64bits. Howeber, in debian 32 bits the anser is\n+I can confirm the bug in debian 64bits. Howeber, in debian 32 bits the answer is\n \n ```\n sage: TJ.genus()\n@@ -19,3 +19,14 @@\n ```\n \n So it seems to be a problem with 2**32-1 in 32 vs 64 bits.\n+\n+A simpler example (Ubuntu 64-bit):\n+\n+```python\n+sage: R.<x, y, z> = QQ[]\n+sage: C = Curve(x^2 - 2*y^2)\n+sage: C.is_singular()\n+True\n+sage: C.genus()\n+4294967295\n+```\n``````\n",
    "created_at": "2011-01-24T09:25:03Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10308",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10308#issuecomment-127134",
    "user": "https://github.com/loefflerd"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -2,7 +2,7 @@
 
 http://groups.google.com/group/sage-support/browse_thread/thread/e30af8c695b6a912
 
-```
+```python
 sage: T.<t1,t2,u1,u2> = QQ[] 
 sage: TJ = Ideal([t1^2 + u1^2 - 1,t2^2 + u2^2 - 1, (t1-t2)^2 + (u1-u2)^2 -1]) 
 sage: TJ.genus() 
@@ -11,7 +11,7 @@
 1 
 ```
 
-I can confirm the bug in debian 64bits. Howeber, in debian 32 bits the anser is
+I can confirm the bug in debian 64bits. Howeber, in debian 32 bits the answer is
 
 ```
 sage: TJ.genus()
@@ -19,3 +19,14 @@
 ```
 
 So it seems to be a problem with 2**32-1 in 32 vs 64 bits.
+
+A simpler example (Ubuntu 64-bit):
+
+```python
+sage: R.<x, y, z> = QQ[]
+sage: C = Curve(x^2 - 2*y^2)
+sage: C.is_singular()
+True
+sage: C.genus()
+4294967295
+```
``````




---

archive/issue_comments_127135.json:
```json
{
    "body": "Changing status from new to needs_review.",
    "created_at": "2012-06-22T17:54:03Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10308",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10308#issuecomment-127135",
    "user": "https://github.com/lftabera"
}
```

Changing status from new to needs_review.



---

archive/issue_comments_127136.json:
```json
{
    "body": "<a id='comment:2'></a>\nAttachment [10380.patch](tarball://root/attachments/some-uuid/ticket10308/10380.patch) by @lftabera created at 2012-06-22 17:54:03\n\nIt seems to me that the bug is solved in linux 64 bits with newer versions of Sage.\n\nI attach a doctest for the record.",
    "created_at": "2012-06-22T17:54:03Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10308",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10308#issuecomment-127136",
    "user": "https://github.com/lftabera"
}
```

<a id='comment:2'></a>
Attachment [10380.patch](tarball://root/attachments/some-uuid/ticket10308/10380.patch) by @lftabera created at 2012-06-22 17:54:03

It seems to me that the bug is solved in linux 64 bits with newer versions of Sage.

I attach a doctest for the record.



---

archive/issue_comments_127137.json:
```json
{
    "body": "<a id='comment:3'></a>\nPlease fill in your real name as Author.",
    "created_at": "2012-07-27T20:42:10Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10308",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10308#issuecomment-127137",
    "user": "https://github.com/jdemeyer"
}
```

<a id='comment:3'></a>
Please fill in your real name as Author.



---

archive/issue_comments_127138.json:
```json
{
    "body": "Changing author from \"\" to \"Luis Felipe Tabera Alonso\"",
    "created_at": "2012-07-30T11:12:10Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10308",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10308#issuecomment-127138",
    "user": "https://github.com/lftabera"
}
```

Changing author from "" to "Luis Felipe Tabera Alonso"



---

archive/issue_comments_127139.json:
```json
{
    "body": "<a id='comment:5'></a>\nThe bug does not appear to be present in 5.11.beta3, the patch applies and the tests that it introduces run correctly.  Note that the answer `-1` is really the (geometric) genus, not an error code (as one could be led to suspect by the sage-support discussion cited above).",
    "created_at": "2013-07-05T19:31:22Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10308",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10308#issuecomment-127139",
    "user": "https://github.com/pjbruin"
}
```

<a id='comment:5'></a>
The bug does not appear to be present in 5.11.beta3, the patch applies and the tests that it introduces run correctly.  Note that the answer `-1` is really the (geometric) genus, not an error code (as one could be led to suspect by the sage-support discussion cited above).



---

archive/issue_comments_127140.json:
```json
{
    "body": "Changing status from needs_review to positive_review.",
    "created_at": "2013-07-05T19:31:22Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10308",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10308#issuecomment-127140",
    "user": "https://github.com/pjbruin"
}
```

Changing status from needs_review to positive_review.



---

archive/issue_comments_127141.json:
```json
{
    "body": "Changing reviewer from \"\" to \"Peter Bruin\"",
    "created_at": "2013-07-05T19:31:22Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10308",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10308#issuecomment-127141",
    "user": "https://github.com/pjbruin"
}
```

Changing reviewer from "" to "Peter Bruin"



---

archive/issue_comments_127142.json:
```json
{
    "body": "Resolution: fixed",
    "created_at": "2013-07-31T12:53:18Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10308",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10308#issuecomment-127142",
    "user": "https://github.com/jdemeyer"
}
```

Resolution: fixed



---

archive/issue_comments_127143.json:
```json
{
    "body": "Changing merged from \"\" to \"sage-5.11.rc0\"",
    "created_at": "2013-07-31T12:53:18Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10308",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10308#issuecomment-127143",
    "user": "https://github.com/jdemeyer"
}
```

Changing merged from "" to "sage-5.11.rc0"



---

archive/issue_events_026528.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2013-07-31T12:53:18Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/10308",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/10308#event-26528"
}
```
