# Issue 10308: bug in genus of ideal on 64 bits

archive/issues_010307.json:
```json
{
    "body": "The following problem was discovered by Victor Miller in Sage-support\n\nhttp://groups.google.com/group/sage-support/browse_thread/thread/e30af8c695b6a912\n\n```python\nsage: T.<t1,t2,u1,u2> = QQ[] \nsage: TJ = Ideal([t1^2 + u1^2 - 1,t2^2 + u2^2 - 1, (t1-t2)^2 + (u1-u2)^2 -1]) \nsage: TJ.genus() \n4294967295 \nsage: TJ.dimension() \n1 \n```\n\nI can confirm the bug in debian 64bits. Howeber, in debian 32 bits the answer is\n\n```\nsage: TJ.genus()\n-1\n```\n\nSo it seems to be a problem with 2**32-1 in 32 vs 64 bits.\n\nA simpler example (Ubuntu 64-bit):\n\n```python\nsage: R.<x, y, z> = QQ[]\nsage: C = Curve(x^2 - 2*y^2)\nsage: C.is_singular()\nTrue\nsage: C.genus()\n4294967295\n```\n\n**Assignee:** @williamstein\n\n**Keywords:** genus, Singular, 64bits\n\n**Reviewer:** Peter Bruin\n\n**Author:** Luis Felipe Tabera Alonso\n\n**Merged:** sage-5.11.rc0\n\nIssue created by migration from https://trac.sagemath.org/ticket/10308\n\n",
    "closed_at": "2013-07-31T12:53:18Z",
    "created_at": "2010-11-22T08:20:07Z",
    "labels": [
        "component: interfaces",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-5.11",
    "title": "bug in genus of ideal on 64 bits",
    "type": "issue",
    "url": "https://github.com/sagemath/sage/issues/10308",
    "user": "https://github.com/lftabera"
}
```
The following problem was discovered by Victor Miller in Sage-support

http://groups.google.com/group/sage-support/browse_thread/thread/e30af8c695b6a912

```python
sage: T.<t1,t2,u1,u2> = QQ[] 
sage: TJ = Ideal([t1^2 + u1^2 - 1,t2^2 + u2^2 - 1, (t1-t2)^2 + (u1-u2)^2 -1]) 
sage: TJ.genus() 
4294967295 
sage: TJ.dimension() 
1 
```

I can confirm the bug in debian 64bits. Howeber, in debian 32 bits the answer is

```
sage: TJ.genus()
-1
```

So it seems to be a problem with 2**32-1 in 32 vs 64 bits.

A simpler example (Ubuntu 64-bit):

```python
sage: R.<x, y, z> = QQ[]
sage: C = Curve(x^2 - 2*y^2)
sage: C.is_singular()
True
sage: C.genus()
4294967295
```

**Assignee:** @williamstein

**Keywords:** genus, Singular, 64bits

**Reviewer:** Peter Bruin

**Author:** Luis Felipe Tabera Alonso

**Merged:** sage-5.11.rc0

Issue created by migration from https://trac.sagemath.org/ticket/10308





---

archive/issue_comments_098566.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -2,7 +2,7 @@\n \n http://groups.google.com/group/sage-support/browse_thread/thread/e30af8c695b6a912\n \n-```\n+```python\n sage: T.<t1,t2,u1,u2> = QQ[] \n sage: TJ = Ideal([t1^2 + u1^2 - 1,t2^2 + u2^2 - 1, (t1-t2)^2 + (u1-u2)^2 -1]) \n sage: TJ.genus() \n@@ -11,7 +11,7 @@\n 1 \n ```\n \n-I can confirm the bug in debian 64bits. Howeber, in debian 32 bits the anser is\n+I can confirm the bug in debian 64bits. Howeber, in debian 32 bits the answer is\n \n ```\n sage: TJ.genus()\n@@ -19,3 +19,14 @@\n ```\n \n So it seems to be a problem with 2**32-1 in 32 vs 64 bits.\n+\n+A simpler example (Ubuntu 64-bit):\n+\n+```python\n+sage: R.<x, y, z> = QQ[]\n+sage: C = Curve(x^2 - 2*y^2)\n+sage: C.is_singular()\n+True\n+sage: C.genus()\n+4294967295\n+```\n``````\n",
    "created_at": "2011-01-24T09:25:03Z",
    "issue": "https://github.com/sagemath/sage/issues/10308",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/10308#issuecomment-98566",
    "user": "https://github.com/loefflerd"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -2,7 +2,7 @@
 
 http://groups.google.com/group/sage-support/browse_thread/thread/e30af8c695b6a912
 
-```
+```python
 sage: T.<t1,t2,u1,u2> = QQ[] 
 sage: TJ = Ideal([t1^2 + u1^2 - 1,t2^2 + u2^2 - 1, (t1-t2)^2 + (u1-u2)^2 -1]) 
 sage: TJ.genus() 
@@ -11,7 +11,7 @@
 1 
 ```
 
-I can confirm the bug in debian 64bits. Howeber, in debian 32 bits the anser is
+I can confirm the bug in debian 64bits. Howeber, in debian 32 bits the answer is
 
 ```
 sage: TJ.genus()
@@ -19,3 +19,14 @@
 ```
 
 So it seems to be a problem with 2**32-1 in 32 vs 64 bits.
+
+A simpler example (Ubuntu 64-bit):
+
+```python
+sage: R.<x, y, z> = QQ[]
+sage: C = Curve(x^2 - 2*y^2)
+sage: C.is_singular()
+True
+sage: C.genus()
+4294967295
+```
``````




---

archive/issue_events_078779.json:
```json
{
    "actor": "https://github.com/lftabera",
    "created_at": "2012-06-22T17:54:03Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/10308",
    "label": "needs review",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/10308#event-78779"
}
```



---

archive/attachments_013491.json:
```json
{
    "asset_content_type": "application/octet-stream",
    "asset_name": "10380.patch",
    "asset_url": "tarball://root/attachments/ticket10308/10380.patch",
    "created_at": "2012-06-22T17:54:03Z",
    "issue": "https://github.com/sagemath/sage/issues/10308",
    "type": "attachment",
    "url": "https://github.com/sagemath/sage/files/ticket10308/10380.patch",
    "user": "https://github.com/lftabera"
}
```



---

archive/issue_comments_098567.json:
```json
{
    "body": "<a id='comment:2'></a>\nAttachment [10380.patch](https://github.com/sagemath/sage/files/ticket10308/10380.patch) by @lftabera created at 2012-06-22 17:54:03\n\nIt seems to me that the bug is solved in linux 64 bits with newer versions of Sage.\n\nI attach a doctest for the record.",
    "created_at": "2012-06-22T17:54:03Z",
    "issue": "https://github.com/sagemath/sage/issues/10308",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/10308#issuecomment-98567",
    "user": "https://github.com/lftabera"
}
```

<a id='comment:2'></a>
Attachment [10380.patch](https://github.com/sagemath/sage/files/ticket10308/10380.patch) by @lftabera created at 2012-06-22 17:54:03

It seems to me that the bug is solved in linux 64 bits with newer versions of Sage.

I attach a doctest for the record.



---

archive/issue_comments_098568.json:
```json
{
    "body": "<a id='comment:3'></a>\nPlease fill in your real name as Author.",
    "created_at": "2012-07-27T20:42:10Z",
    "issue": "https://github.com/sagemath/sage/issues/10308",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/10308#issuecomment-98568",
    "user": "https://github.com/jdemeyer"
}
```

<a id='comment:3'></a>
Please fill in your real name as Author.



---

archive/issue_comments_098569.json:
```json
{
    "body": "**Author:** Luis Felipe Tabera Alonso",
    "created_at": "2012-07-30T11:12:10Z",
    "issue": "https://github.com/sagemath/sage/issues/10308",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/10308#issuecomment-98569",
    "user": "https://github.com/lftabera"
}
```

**Author:** Luis Felipe Tabera Alonso



---

archive/issue_comments_098570.json:
```json
{
    "body": "<a id='comment:5'></a>\nThe bug does not appear to be present in 5.11.beta3, the patch applies and the tests that it introduces run correctly.  Note that the answer `-1` is really the (geometric) genus, not an error code (as one could be led to suspect by the sage-support discussion cited above).",
    "created_at": "2013-07-05T19:31:22Z",
    "issue": "https://github.com/sagemath/sage/issues/10308",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/10308#issuecomment-98570",
    "user": "https://github.com/pjbruin"
}
```

<a id='comment:5'></a>
The bug does not appear to be present in 5.11.beta3, the patch applies and the tests that it introduces run correctly.  Note that the answer `-1` is really the (geometric) genus, not an error code (as one could be led to suspect by the sage-support discussion cited above).



---

archive/issue_events_078780.json:
```json
{
    "actor": "https://github.com/pjbruin",
    "created_at": "2013-07-05T19:31:22Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/10308",
    "label": "needs review",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/10308#event-78780"
}
```



---

archive/issue_events_078781.json:
```json
{
    "actor": "https://github.com/pjbruin",
    "created_at": "2013-07-05T19:31:22Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/10308",
    "label": "positive review",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/10308#event-78781"
}
```



---

archive/issue_comments_098571.json:
```json
{
    "body": "**Reviewer:** Peter Bruin",
    "created_at": "2013-07-05T19:31:22Z",
    "issue": "https://github.com/sagemath/sage/issues/10308",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/10308#issuecomment-98571",
    "user": "https://github.com/pjbruin"
}
```

**Reviewer:** Peter Bruin



---

archive/issue_comments_098572.json:
```json
{
    "body": "**Merged:** sage-5.11.rc0",
    "created_at": "2013-07-31T12:53:18Z",
    "issue": "https://github.com/sagemath/sage/issues/10308",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/10308#issuecomment-98572",
    "user": "https://github.com/jdemeyer"
}
```

**Merged:** sage-5.11.rc0



---

archive/issue_events_078782.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2013-07-31T12:53:18Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/10308",
    "label": "positive review",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/10308#event-78782"
}
```



---

archive/issue_events_078783.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2013-07-31T12:53:18Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/10308",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/10308#event-78783"
}
```
