# Issue 10554: Better support for casual usage of symmetric functions

archive/issues_010501.json:
```json
{
    "body": "Following a discussion with Alexandre Casamayou (coauthor of the\nFrench sage book), here is a would-be session for casual usage of\nsymmetric functions (please feel free to extend):\n\n```\n    sage: S = SymmetricFunctions(QQ)\n    sage: e = S.e()\n    sage: var('x,y,z')\n    sage: pol = S.from_polynomial(x^3+y^3+z^3); pol   # or from_expr?\n    m[3]\n    sage: pole = e(pol); pole\n    e[1, 1, 1] - 3*e[2, 1] + 3*e[3]\n    sage: pole([x,y,z])\n    (x + y + z)^3 + 3*x*y*z - 3*(x + y + z)*(x*y + x*z + y*z)\n```\n\nThe best working approximation with the current implementation seems\nto be:\n\n```\n    sage: S = SymmetricFunctions(QQ)\n    sage: e = S.e()\n    sage: QQ.<x,y,z> = QQ[]\n    sage: pol = S.from_polynomial(x^3+y^3+z^3); pol\n    m[3]\n    sage: e(pol)\n    e[1, 1, 1] - 3*e[2, 1] + 3*e[3]\n    sage: e1 = SR(e[1].expand(3,[x,y,z])); e1\n    x + y + z\n    sage: e2 = SR(e[2].expand(3,[x,y,z])); e2\n    x*y + x*z + y*z\n    sage: e3 = SR(e[3].expand(3,[x,y,z])); e3\n    x*y*z\n    sage: e1^3 - 3* e2*e1 + 3*e3\n    (x + y + z)^3 + 3*x*y*z - 3*(x + y + z)*(x*y + x*z + y*z)\n```\n\nWhat needs to be done:\n\n- from_expr (or extend from_polynomial to accept a symbolic expression)\n\n- f(alphabet) for f a symmetric function, and alphabet a list of\n  objects in some ring (possibly supporting plethysm), as implemented\n  in MuPAD-Combinat\n\n\n**Assignee:** sage-combinat\n\n**CC:**  sage-combinat @jbandlow\n\n**Keywords:** Symmetric Functions\n\nIssue created by migration from https://trac.sagemath.org/ticket/10554\n\n",
    "created_at": "2011-01-04T11:49:13Z",
    "labels": [
        "component: combinatorics",
        "enhancement"
    ],
    "title": "Better support for casual usage of symmetric functions",
    "type": "issue",
    "url": "https://github.com/sagemath/sage/issues/10554",
    "user": "https://github.com/nthiery"
}
```
Following a discussion with Alexandre Casamayou (coauthor of the
French sage book), here is a would-be session for casual usage of
symmetric functions (please feel free to extend):

```
    sage: S = SymmetricFunctions(QQ)
    sage: e = S.e()
    sage: var('x,y,z')
    sage: pol = S.from_polynomial(x^3+y^3+z^3); pol   # or from_expr?
    m[3]
    sage: pole = e(pol); pole
    e[1, 1, 1] - 3*e[2, 1] + 3*e[3]
    sage: pole([x,y,z])
    (x + y + z)^3 + 3*x*y*z - 3*(x + y + z)*(x*y + x*z + y*z)
```

The best working approximation with the current implementation seems
to be:

```
    sage: S = SymmetricFunctions(QQ)
    sage: e = S.e()
    sage: QQ.<x,y,z> = QQ[]
    sage: pol = S.from_polynomial(x^3+y^3+z^3); pol
    m[3]
    sage: e(pol)
    e[1, 1, 1] - 3*e[2, 1] + 3*e[3]
    sage: e1 = SR(e[1].expand(3,[x,y,z])); e1
    x + y + z
    sage: e2 = SR(e[2].expand(3,[x,y,z])); e2
    x*y + x*z + y*z
    sage: e3 = SR(e[3].expand(3,[x,y,z])); e3
    x*y*z
    sage: e1^3 - 3* e2*e1 + 3*e3
    (x + y + z)^3 + 3*x*y*z - 3*(x + y + z)*(x*y + x*z + y*z)
```

What needs to be done:

- from_expr (or extend from_polynomial to accept a symbolic expression)

- f(alphabet) for f a symmetric function, and alphabet a list of
  objects in some ring (possibly supporting plethysm), as implemented
  in MuPAD-Combinat


**Assignee:** sage-combinat

**CC:**  sage-combinat @jbandlow

**Keywords:** Symmetric Functions

Issue created by migration from https://trac.sagemath.org/ticket/10554


