# Issue 10576: converting elements into polybori ring uses inconsistent semantics

archive/issues_010523.json:
```json
{
    "assignees": [],
    "body": "\n\n**Assignee:** @malb\n\nIssue created by migration from https://trac.sagemath.org/ticket/10576\n\n",
    "created_at": "2011-01-09T19:01:57Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20commutative%20algebra",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-6.4",
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "converting elements into polybori ring uses inconsistent semantics",
    "type": "issue",
    "updated_at": "2014-08-10T16:51:03Z",
    "url": "https://github.com/sagemath/sage/issues/10576",
    "user": "https://github.com/williamstein"
}
```


**Assignee:** @malb

Issue created by migration from https://trac.sagemath.org/ticket/10576





---

archive/issue_events_117063.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2011-01-09T19:01:57Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/10576",
    "milestone_number": null,
    "milestone_title": "sage-6.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/10576#event-117063"
}
```



---

archive/issue_events_117064.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2011-01-09T19:01:57Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/10576",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20commutative%20algebra",
    "label_color": "08517b",
    "label_name": "component: commutative algebra",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/10576#event-117064"
}
```



---

archive/issue_events_117065.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2011-01-09T19:01:57Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/10576",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "008080",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/10576#event-117065"
}
```



---

archive/issue_comments_102942.json:
```json
{
    "body": "<a id='comment:1'></a>\nConversions between `BooleanPolynomialRings` use name-based semantics rather than index-based ones like other polynomial rings:\n\n```\nsage: R.<x,y> = BooleanPolynomialRing()\nsage: S.<z,x> = BooleanPolynomialRing()\nsage: R(S.0)\n*kaboom*\n```\n\n```\nsage: R.<x,y> = ZZ[]\nsage: S.<z,x> = ZZ[]\nsage: R(S.0)\nx\n```",
    "created_at": "2011-01-09T19:18:23Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/10576",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/10576#issuecomment-102942",
    "user": "https://github.com/wjp"
}
```

<a id='comment:1'></a>
Conversions between `BooleanPolynomialRings` use name-based semantics rather than index-based ones like other polynomial rings:

```
sage: R.<x,y> = BooleanPolynomialRing()
sage: S.<z,x> = BooleanPolynomialRing()
sage: R(S.0)
*kaboom*
```

```
sage: R.<x,y> = ZZ[]
sage: S.<z,x> = ZZ[]
sage: R(S.0)
x
```



---

archive/issue_comments_102943.json:
```json
{
    "body": "<a id='comment:2'></a>\nReplying to [@wjp](#comment%3A1):\n> Conversions between `BooleanPolynomialRings` use name-based semantics rather than index-based ones like other polynomial rings:\n\nOne could argue that the semantics is inconsistent in usual polynomial rings, since it sometimes uses the position and sometimes uses the name.\n\nBy position:\n\n```\nsage: P.<a,b,c>=QQ[]\nsage: Q.<b,c,d>=QQ[]\nsage: Q(P.0)\nb\nsage: Q(P.2)\nd\nsage: P(Q.0)\na\nsage: P(Q.2)\nc\n```\nBy name:\n\n```\nsage: R.<b,c>=QQ[]\nsage: P(R.0)\nb\n```\n\nAnd sometimes it does neither work by name nor by position:\n\n```\nsage: R.<b,x>=QQ[]\nsage: P(R.0)\n<BOOM>\n```\nIt is conversion, not coercion! It *should* give an answer, not an error!\n\nSo, I see no reason to change the behaviour of polybori conversions, which at least is straight forward, unlike the polynomial conversion, which seems like \"use position if the number of variables coincides; use name if the variable names of the first ring are a subset of the variable names of the second ring; raise an error otherwise, even if one simply tries to convert a variable whose name occurs in both rings\".\n\nIn any case: Note that I implemented the new coercion model for pbori in #9138. So, if you really intend to change the semantics then I suggest to work on top of that.\n\nCheers,\nSimon",
    "created_at": "2011-04-25T13:14:53Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/10576",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/10576#issuecomment-102943",
    "user": "https://github.com/simon-king-jena"
}
```

<a id='comment:2'></a>
Replying to [@wjp](#comment%3A1):
> Conversions between `BooleanPolynomialRings` use name-based semantics rather than index-based ones like other polynomial rings:

One could argue that the semantics is inconsistent in usual polynomial rings, since it sometimes uses the position and sometimes uses the name.

By position:

```
sage: P.<a,b,c>=QQ[]
sage: Q.<b,c,d>=QQ[]
sage: Q(P.0)
b
sage: Q(P.2)
d
sage: P(Q.0)
a
sage: P(Q.2)
c
```
By name:

```
sage: R.<b,c>=QQ[]
sage: P(R.0)
b
```

And sometimes it does neither work by name nor by position:

```
sage: R.<b,x>=QQ[]
sage: P(R.0)
<BOOM>
```
It is conversion, not coercion! It *should* give an answer, not an error!

So, I see no reason to change the behaviour of polybori conversions, which at least is straight forward, unlike the polynomial conversion, which seems like "use position if the number of variables coincides; use name if the variable names of the first ring are a subset of the variable names of the second ring; raise an error otherwise, even if one simply tries to convert a variable whose name occurs in both rings".

In any case: Note that I implemented the new coercion model for pbori in #9138. So, if you really intend to change the semantics then I suggest to work on top of that.

Cheers,
Simon



---

archive/issue_events_117066.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2013-08-13T15:35:53Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/10576",
    "milestone_number": null,
    "milestone_title": "sage-5.11",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/10576#event-117066"
}
```



---

archive/issue_events_117067.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2013-08-13T15:35:53Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/10576",
    "milestone_number": null,
    "milestone_title": "sage-5.12",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/10576#event-117067"
}
```



---

archive/issue_events_117068.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-01-30T21:20:52Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/10576",
    "milestone_number": null,
    "milestone_title": "sage-6.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/10576#event-117068"
}
```



---

archive/issue_events_117069.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-01-30T21:20:52Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/10576",
    "milestone_number": null,
    "milestone_title": "sage-6.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/10576#event-117069"
}
```



---

archive/issue_events_117070.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-05-06T15:20:58Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/10576",
    "milestone_number": null,
    "milestone_title": "sage-6.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/10576#event-117070"
}
```



---

archive/issue_events_117071.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-05-06T15:20:58Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/10576",
    "milestone_number": null,
    "milestone_title": "sage-6.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/10576#event-117071"
}
```



---

archive/issue_events_117072.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-08-10T16:51:03Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/10576",
    "milestone_number": null,
    "milestone_title": "sage-6.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/10576#event-117072"
}
```



---

archive/issue_events_117073.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-08-10T16:51:03Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/10576",
    "milestone_number": null,
    "milestone_title": "sage-6.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/10576#event-117073"
}
```
