# Issue 10696: SymmetricGroup function doesn't seem to do arbitrary sets

archive/issues_010640.json:
```json
{
    "body": "The following doesn't seem right to me.  I tried this on sage 4.5.3 and 4.6.  My impression is that the SymmetricGroup function can take a list of distinct integers X as an argument and give the symmetric group S_X.  However, we can try the following.\n\n```\nsage: f=SymmetricGroup([1,2,4]) \nsage: for i in f: \n....:     print i\n....:\n() \n(2,3) \n(1,2) \n(1,2,3) \n(1,3,2) \n(1,3) \nsage: f[3] \n(1,2,3) \nsage: f[3](4) \n4 \nsage: f[3](3) \n1 \nsage: f.set() \n(1, 2, 4)\n```\n\nThus, it seems that f.set() returns the right support, but in fact the support for the group is 1,2,3.  This suggests to me that S_X = S_{1,2,3}.\n\n**Assignee:** sage-combinat\n\n**CC:**  @jdemeyer\n\n**Keywords:** SymmetricGroup\n\n**Reviewer:** Mike Hansen\n\nIssue created by migration from https://trac.sagemath.org/ticket/10696\n\n",
    "closed_at": "2012-05-21T08:01:41Z",
    "created_at": "2011-01-26T16:43:30Z",
    "labels": [
        "component: combinatorics",
        "minor",
        "bug",
        "duplicate"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-duplicate/invalid/wontfix",
    "title": "SymmetricGroup function doesn't seem to do arbitrary sets",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/10696",
    "user": "https://trac.sagemath.org/admin/accounts/users/arattan"
}
```
The following doesn't seem right to me.  I tried this on sage 4.5.3 and 4.6.  My impression is that the SymmetricGroup function can take a list of distinct integers X as an argument and give the symmetric group S_X.  However, we can try the following.

```
sage: f=SymmetricGroup([1,2,4]) 
sage: for i in f: 
....:     print i
....:
() 
(2,3) 
(1,2) 
(1,2,3) 
(1,3,2) 
(1,3) 
sage: f[3] 
(1,2,3) 
sage: f[3](4) 
4 
sage: f[3](3) 
1 
sage: f.set() 
(1, 2, 4)
```

Thus, it seems that f.set() returns the right support, but in fact the support for the group is 1,2,3.  This suggests to me that S_X = S_{1,2,3}.

**Assignee:** sage-combinat

**CC:**  @jdemeyer

**Keywords:** SymmetricGroup

**Reviewer:** Mike Hansen

Issue created by migration from https://trac.sagemath.org/ticket/10696





---

archive/issue_comments_130177.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -1,23 +1,39 @@\n The following doesn't seem right to me.  I tried this on sage 4.5.3 and 4.6.  My impression is that the SymmetricGroup function can take a list of distinct integers X as an argument and give the symmetric group S_X.  However, we can try the following.\n \n-sage: f=SymmetricGroup([1,2,4])\n-sage: for i in f:\n+sage: f=SymmetricGroup([1,2,4]) \n+\n+sage: for i in f: \n+\n ....:     print i\n-....: \n \n-()\n-(2,3)\n-(1,2)\n-(1,2,3)\n-(1,3,2)\n-(1,3)\n-sage: f[3]\n-(1,2,3)\n-sage: f[3](4)\n-4\n-sage: f[3](3)\n-1\n-sage: f.set()\n+....:\n+\n+() \n+\n+(2,3) \n+\n+(1,2) \n+\n+(1,2,3) \n+\n+(1,3,2) \n+\n+(1,3) \n+\n+sage: f[3] \n+\n+(1,2,3) \n+\n+sage: f[3](4) \n+\n+4 \n+\n+sage: f[3](3) \n+\n+1 \n+\n+sage: f.set() \n+\n (1, 2, 4)\n \n-Thus, it seems that f.set() returns that right support, but in fact the support for the group is 1,2,3.  This suggests to me that S_X = S_{1,2,3}.\n+Thus, it seems that f.set() returns the right support, but in fact the support for the group is 1,2,3.  This suggests to me that S_X = S_{1,2,3}.\n``````\n",
    "created_at": "2011-01-26T16:45:36Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10696",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10696#issuecomment-130177",
    "user": "https://trac.sagemath.org/admin/accounts/users/arattan"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -1,23 +1,39 @@
 The following doesn't seem right to me.  I tried this on sage 4.5.3 and 4.6.  My impression is that the SymmetricGroup function can take a list of distinct integers X as an argument and give the symmetric group S_X.  However, we can try the following.
 
-sage: f=SymmetricGroup([1,2,4])
-sage: for i in f:
+sage: f=SymmetricGroup([1,2,4]) 
+
+sage: for i in f: 
+
 ....:     print i
-....: 
 
-()
-(2,3)
-(1,2)
-(1,2,3)
-(1,3,2)
-(1,3)
-sage: f[3]
-(1,2,3)
-sage: f[3](4)
-4
-sage: f[3](3)
-1
-sage: f.set()
+....:
+
+() 
+
+(2,3) 
+
+(1,2) 
+
+(1,2,3) 
+
+(1,3,2) 
+
+(1,3) 
+
+sage: f[3] 
+
+(1,2,3) 
+
+sage: f[3](4) 
+
+4 
+
+sage: f[3](3) 
+
+1 
+
+sage: f.set() 
+
 (1, 2, 4)
 
-Thus, it seems that f.set() returns that right support, but in fact the support for the group is 1,2,3.  This suggests to me that S_X = S_{1,2,3}.
+Thus, it seems that f.set() returns the right support, but in fact the support for the group is 1,2,3.  This suggests to me that S_X = S_{1,2,3}.
``````




---

archive/issue_comments_130178.json:
```json
{
    "body": "<a id='comment:2'></a>\nThis should be fixed by #10335",
    "created_at": "2011-01-26T16:52:12Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10696",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10696#issuecomment-130178",
    "user": "https://github.com/mwhansen"
}
```

<a id='comment:2'></a>
This should be fixed by #10335



---

archive/issue_comments_130179.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -1,39 +1,24 @@\n The following doesn't seem right to me.  I tried this on sage 4.5.3 and 4.6.  My impression is that the SymmetricGroup function can take a list of distinct integers X as an argument and give the symmetric group S_X.  However, we can try the following.\n \n+```\n sage: f=SymmetricGroup([1,2,4]) \n-\n sage: for i in f: \n-\n ....:     print i\n-\n ....:\n-\n () \n-\n (2,3) \n-\n (1,2) \n-\n (1,2,3) \n-\n (1,3,2) \n-\n (1,3) \n-\n sage: f[3] \n-\n (1,2,3) \n-\n sage: f[3](4) \n-\n 4 \n-\n sage: f[3](3) \n-\n 1 \n-\n sage: f.set() \n-\n (1, 2, 4)\n+```\n \n Thus, it seems that f.set() returns the right support, but in fact the support for the group is 1,2,3.  This suggests to me that S_X = S_{1,2,3}.\n``````\n",
    "created_at": "2012-03-29T07:16:18Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10696",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10696#issuecomment-130179",
    "user": "https://github.com/mwhansen"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -1,39 +1,24 @@
 The following doesn't seem right to me.  I tried this on sage 4.5.3 and 4.6.  My impression is that the SymmetricGroup function can take a list of distinct integers X as an argument and give the symmetric group S_X.  However, we can try the following.
 
+```
 sage: f=SymmetricGroup([1,2,4]) 
-
 sage: for i in f: 
-
 ....:     print i
-
 ....:
-
 () 
-
 (2,3) 
-
 (1,2) 
-
 (1,2,3) 
-
 (1,3,2) 
-
 (1,3) 
-
 sage: f[3] 
-
 (1,2,3) 
-
 sage: f[3](4) 
-
 4 
-
 sage: f[3](3) 
-
 1 
-
 sage: f.set() 
-
 (1, 2, 4)
+```
 
 Thus, it seems that f.set() returns the right support, but in fact the support for the group is 1,2,3.  This suggests to me that S_X = S_{1,2,3}.
``````




---

archive/issue_comments_130180.json:
```json
{
    "body": "<a id='comment:4'></a>\nThis can indeed be closed:\n\n```\n\nsage: f=SymmetricGroup([1,2,4])\nsage: for i in f:        \n....:     print i\n....:     \n()\n(2,4)\n(1,2)\n(1,2,4)\n(1,4,2)\n(1,4)\nsage: f[3] \n(1,2,4)\nsage: f[3](4)\n1\nsage: f[3](3)\n3\nsage: f.set()\n/opt/sage/local/bin/sage-ipython:1: DeprecationWarning: (Since Sage Version 4.7.1) set is deprecated. Please use domain instead.\n  #!/usr/bin/env python\n{1, 2, 4}\n```",
    "created_at": "2012-03-29T07:18:10Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10696",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10696#issuecomment-130180",
    "user": "https://github.com/mwhansen"
}
```

<a id='comment:4'></a>
This can indeed be closed:

```

sage: f=SymmetricGroup([1,2,4])
sage: for i in f:        
....:     print i
....:     
()
(2,4)
(1,2)
(1,2,4)
(1,4,2)
(1,4)
sage: f[3] 
(1,2,4)
sage: f[3](4)
1
sage: f[3](3)
3
sage: f.set()
/opt/sage/local/bin/sage-ipython:1: DeprecationWarning: (Since Sage Version 4.7.1) set is deprecated. Please use domain instead.
  #!/usr/bin/env python
{1, 2, 4}
```



---

archive/issue_comments_130181.json:
```json
{
    "body": "<a id='comment:5'></a>\nVerified results that this can be closed.",
    "created_at": "2012-05-11T22:40:15Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10696",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10696#issuecomment-130181",
    "user": "https://github.com/tscrim"
}
```

<a id='comment:5'></a>
Verified results that this can be closed.



---

archive/issue_comments_130182.json:
```json
{
    "body": "**Changing status** from new to needs_review.",
    "created_at": "2012-05-11T22:40:15Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10696",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10696#issuecomment-130182",
    "user": "https://github.com/tscrim"
}
```

**Changing status** from new to needs_review.



---

archive/issue_comments_130183.json:
```json
{
    "body": "**Changing status** from needs_review to positive_review.",
    "created_at": "2012-05-11T22:40:37Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10696",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10696#issuecomment-130183",
    "user": "https://github.com/tscrim"
}
```

**Changing status** from needs_review to positive_review.



---

archive/issue_comments_130184.json:
```json
{
    "body": "<a id='comment:7'></a>\nTo mark as ticket as needing to be closed, you should put the milestone to *sage-duplicate/invalid/wontfix*.",
    "created_at": "2012-05-13T20:19:59Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10696",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10696#issuecomment-130184",
    "user": "https://github.com/jdemeyer"
}
```

<a id='comment:7'></a>
To mark as ticket as needing to be closed, you should put the milestone to *sage-duplicate/invalid/wontfix*.



---

archive/issue_comments_130185.json:
```json
{
    "body": "**Reviewer:** Mike Hansen",
    "created_at": "2012-05-13T20:19:59Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10696",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10696#issuecomment-130185",
    "user": "https://github.com/jdemeyer"
}
```

**Reviewer:** Mike Hansen



---

archive/issue_events_033194.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2012-05-13T20:19:59Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/10696",
    "milestone": "sage-duplicate/invalid/wontfix",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/10696#event-33194"
}
```



---

archive/issue_events_033195.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2012-05-21T08:01:41Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/10696",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/10696#event-33195"
}
```
