# Issue 10698: error in padic power series construction

archive/issues_010642.json:
```json
{
    "assignees": [
        "https://github.com/roed314"
    ],
    "body": "<div id=\"comment:0\"></div>\n\nHere is an example of a bug in constructing a power series with coefficient in an extension of Qp.\n\n```\nsage: A = Qp(3,5)\nsage: Po.<X> = A[]\nsage: f = Po([3,0,-1])\nsage: K = f.root_field('a')\nsage: a = K.gen()\nsage: R.<T> = K[[]]\nsage: b = A(0).add_bigoh(-1)\nsage: b\nO(3^-1)\nsage: v = [a,b,b*a,b*(1+a)]\nsage: v\n[(1 + O(3^5))*a, O(3^-1), (O(3^-1))*a, (O(3^-1))*a + (O(3^-1))]\nsage: R(v,4)\n(1 + O(3^5))*a + O(T^4)\n```\n\nNote that the coefficients with low precision were just set to 0\n\n```\nsage: g = R(v,4)\nsage: g[1][0].precision_absolute()\n+Infinity\n```\n\n\nComponent: **padics**\n\nKeywords: **padic power series**\n\nStopgaps: **todo**\n\n_Issue created by migration from https://trac.sagemath.org/ticket/10698_\n\n",
    "created_at": "2011-01-26T18:08:43Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/c%3A%20padics",
        "https://github.com/sagemath/sage/labels/p%3A%20major%20/%203",
        "https://github.com/sagemath/sage/labels/bug",
        "https://github.com/sagemath/sage/labels/c%3A%20padics"
    ],
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "error in padic power series construction",
    "type": "issue",
    "updated_at": "2018-05-24T20:02:46Z",
    "url": "https://github.com/sagemath/sage/issues/10698",
    "user": "https://github.com/categorie"
}
```
<div id="comment:0"></div>

Here is an example of a bug in constructing a power series with coefficient in an extension of Qp.

```
sage: A = Qp(3,5)
sage: Po.<X> = A[]
sage: f = Po([3,0,-1])
sage: K = f.root_field('a')
sage: a = K.gen()
sage: R.<T> = K[[]]
sage: b = A(0).add_bigoh(-1)
sage: b
O(3^-1)
sage: v = [a,b,b*a,b*(1+a)]
sage: v
[(1 + O(3^5))*a, O(3^-1), (O(3^-1))*a, (O(3^-1))*a + (O(3^-1))]
sage: R(v,4)
(1 + O(3^5))*a + O(T^4)
```

Note that the coefficients with low precision were just set to 0

```
sage: g = R(v,4)
sage: g[1][0].precision_absolute()
+Infinity
```


Component: **padics**

Keywords: **padic power series**

Stopgaps: **todo**

_Issue created by migration from https://trac.sagemath.org/ticket/10698_





---

archive/issue_events_139830.json:
```json
{
    "actor": "https://github.com/categorie",
    "created_at": "2011-01-26T18:08:43Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/10698",
    "label": "https://github.com/sagemath/sage/labels/c%3A%20padics",
    "label_color": "0000ff",
    "label_name": "c: padics",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/10698#event-139830"
}
```



---

archive/issue_events_139831.json:
```json
{
    "actor": "https://github.com/categorie",
    "created_at": "2011-01-26T18:08:43Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/10698",
    "label": "https://github.com/sagemath/sage/labels/p%3A%20major%20/%203",
    "label_color": "ffbb00",
    "label_name": "p: major / 3",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/10698#event-139831"
}
```



---

archive/issue_events_139832.json:
```json
{
    "actor": "https://github.com/categorie",
    "created_at": "2011-01-26T18:08:43Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/10698",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "d73a4a",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/10698#event-139832"
}
```



---

archive/issue_events_139833.json:
```json
{
    "actor": "https://github.com/categorie",
    "created_at": "2011-01-26T18:08:43Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/10698",
    "label": "https://github.com/sagemath/sage/labels/c%3A%20padics",
    "label_color": "0000ff",
    "label_name": "c: padics",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/10698#event-139833"
}
```



---

archive/issue_events_139834.json:
```json
{
    "actor": "https://github.com/roed314",
    "created_at": "2011-01-26T18:08:43Z",
    "event": "assigned",
    "issue": "https://github.com/sagemath/sage/issues/10698",
    "subject": "https://github.com/categorie",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/10698#event-139834"
}
```



---

archive/issue_comments_102693.json:
```json
{
    "body": "<div id=\"comment:1\" align=\"right\">comment:1</div>\n\nThis may be linked to #4656. It was discovered while working on #10280 and it appears in the docstring of `pAdicLseriesOrdinary.series`.",
    "created_at": "2011-01-26T18:10:27Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/10698",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/10698#issuecomment-102693",
    "user": "https://github.com/categorie"
}
```

<div id="comment:1" align="right">comment:1</div>

This may be linked to #4656. It was discovered while working on #10280 and it appears in the docstring of `pAdicLseriesOrdinary.series`.



---

archive/issue_comments_102694.json:
```json
{
    "body": "Stopgaps: **todo**",
    "created_at": "2015-08-25T15:25:42Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/10698",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/10698#issuecomment-102694",
    "user": "https://github.com/sagetrac-jakobkroeker"
}
```

Stopgaps: **todo**



---

archive/issue_comments_102695.json:
```json
{
    "body": "<div id=\"comment:3\" align=\"right\">comment:3</div>\n\nSo, one problem is that `f.root_field` should give the same result as `A.ext(f)`, rather than creating a polynomial quotient ring.  But this change isn't enough to fix the underlying precision issue.",
    "created_at": "2016-02-16T21:02:47Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/10698",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/10698#issuecomment-102695",
    "user": "https://github.com/roed314"
}
```

<div id="comment:3" align="right">comment:3</div>

So, one problem is that `f.root_field` should give the same result as `A.ext(f)`, rather than creating a polynomial quotient ring.  But this change isn't enough to fix the underlying precision issue.



---

archive/issue_comments_102696.json:
```json
{
    "body": "<div id=\"comment:4\" align=\"right\">comment:4</div>\n\nCurrently (probably after #20310) `g[1][0].precision_absolute()` raises an error because `g[1][0]` is an integer. Should we consider that the problem is fixed? :-)",
    "created_at": "2018-05-23T15:55:12Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/10698",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/10698#issuecomment-102696",
    "user": "https://github.com/xcaruso"
}
```

<div id="comment:4" align="right">comment:4</div>

Currently (probably after #20310) `g[1][0].precision_absolute()` raises an error because `g[1][0]` is an integer. Should we consider that the problem is fixed? :-)



---

archive/issue_comments_102697.json:
```json
{
    "body": "<div id=\"comment:5\" align=\"right\">comment:5</div>\n\nWith  8.3.beta2, including #20310, I still get exactly the same error:\n\n```\nsage: v\n[a + O(a^11), O(3^-1), O(a^-1), O(a^-2)]\nsage: R(v,4)\na + O(a^11) + O(T^4)\nsage: s = _\nsage: s[0]\na + O(a^11)\nsage: s[1]\n0\n```\n\nThe coefficients for T and `T^2` are set to zero in the powerseries despite that we give `O(3^-1)`",
    "created_at": "2018-05-23T19:45:58Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/10698",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/10698#issuecomment-102697",
    "user": "https://github.com/categorie"
}
```

<div id="comment:5" align="right">comment:5</div>

With  8.3.beta2, including #20310, I still get exactly the same error:

```
sage: v
[a + O(a^11), O(3^-1), O(a^-1), O(a^-2)]
sage: R(v,4)
a + O(a^11) + O(T^4)
sage: s = _
sage: s[0]
a + O(a^11)
sage: s[1]
0
```

The coefficients for T and `T^2` are set to zero in the powerseries despite that we give `O(3^-1)`



---

archive/issue_comments_102698.json:
```json
{
    "body": "<div id=\"comment:6\" align=\"right\">comment:6</div>\n\nYeah, I agree that this ticket is not resolved.",
    "created_at": "2018-05-24T20:02:46Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/10698",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/10698#issuecomment-102698",
    "user": "https://github.com/roed314"
}
```

<div id="comment:6" align="right">comment:6</div>

Yeah, I agree that this ticket is not resolved.
