# Issue 10698: error in padic power series construction

archive/issues_010642.json:
```json
{
    "body": "Here is an example of a bug in constructing a power series with coefficient in an extension of Qp.\n\n```\nsage: A = Qp(3,5)\nsage: Po.<X> = A[]\nsage: f = Po([3,0,-1])\nsage: K = f.root_field('a')\nsage: a = K.gen()\nsage: R.<T> = K[[]]\nsage: b = A(0).add_bigoh(-1)\nsage: b\nO(3^-1)\nsage: v = [a,b,b*a,b*(1+a)]\nsage: v\n[(1 + O(3^5))*a, O(3^-1), (O(3^-1))*a, (O(3^-1))*a + (O(3^-1))]\nsage: R(v,4)\n(1 + O(3^5))*a + O(T^4)\n```\n\nNote that the coefficients with low precision were just set to 0\n\n```\nsage: g = R(v,4)\nsage: g[1][0].precision_absolute()\n+Infinity\n```\n\n\n**Assignee:** @roed314\n\n**Keywords:** padic power series\n\n**Stopgaps:** todo\n\n**Status:** new\n\nIssue created by migration from https://trac.sagemath.org/ticket/10698\n\n",
    "created_at": "2011-01-26T18:08:43Z",
    "labels": [
        "component: padics",
        "bug"
    ],
    "title": "error in padic power series construction",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/10698",
    "user": "https://github.com/categorie"
}
```
Here is an example of a bug in constructing a power series with coefficient in an extension of Qp.

```
sage: A = Qp(3,5)
sage: Po.<X> = A[]
sage: f = Po([3,0,-1])
sage: K = f.root_field('a')
sage: a = K.gen()
sage: R.<T> = K[[]]
sage: b = A(0).add_bigoh(-1)
sage: b
O(3^-1)
sage: v = [a,b,b*a,b*(1+a)]
sage: v
[(1 + O(3^5))*a, O(3^-1), (O(3^-1))*a, (O(3^-1))*a + (O(3^-1))]
sage: R(v,4)
(1 + O(3^5))*a + O(T^4)
```

Note that the coefficients with low precision were just set to 0

```
sage: g = R(v,4)
sage: g[1][0].precision_absolute()
+Infinity
```


**Assignee:** @roed314

**Keywords:** padic power series

**Stopgaps:** todo

**Status:** new

Issue created by migration from https://trac.sagemath.org/ticket/10698





---

archive/issue_comments_130192.json:
```json
{
    "body": "<a id='comment:1'></a>\nThis may be linked to #4656. It was discovered while working on #10280 and it appears in the docstring of `pAdicLseriesOrdinary.series`.",
    "created_at": "2011-01-26T18:10:27Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10698",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10698#issuecomment-130192",
    "user": "https://github.com/categorie"
}
```

<a id='comment:1'></a>
This may be linked to #4656. It was discovered while working on #10280 and it appears in the docstring of `pAdicLseriesOrdinary.series`.



---

archive/issue_comments_130193.json:
```json
{
    "body": "**Stopgaps:** todo",
    "created_at": "2015-08-25T15:25:42Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10698",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10698#issuecomment-130193",
    "user": "https://trac.sagemath.org/admin/accounts/users/jakobkroeker"
}
```

**Stopgaps:** todo



---

archive/issue_comments_130194.json:
```json
{
    "body": "<a id='comment:3'></a>\nSo, one problem is that `f.root_field` should give the same result as `A.ext(f)`, rather than creating a polynomial quotient ring.  But this change isn't enough to fix the underlying precision issue.",
    "created_at": "2016-02-16T21:02:47Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10698",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10698#issuecomment-130194",
    "user": "https://github.com/roed314"
}
```

<a id='comment:3'></a>
So, one problem is that `f.root_field` should give the same result as `A.ext(f)`, rather than creating a polynomial quotient ring.  But this change isn't enough to fix the underlying precision issue.



---

archive/issue_comments_130195.json:
```json
{
    "body": "<a id='comment:4'></a>\nCurrently (probably after #20310) `g[1][0].precision_absolute()` raises an error because `g[1][0]` is an integer. Should we consider that the problem is fixed? :-)",
    "created_at": "2018-05-23T15:55:12Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10698",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10698#issuecomment-130195",
    "user": "https://github.com/xcaruso"
}
```

<a id='comment:4'></a>
Currently (probably after #20310) `g[1][0].precision_absolute()` raises an error because `g[1][0]` is an integer. Should we consider that the problem is fixed? :-)



---

archive/issue_comments_130196.json:
```json
{
    "body": "<a id='comment:5'></a>\nWith  8.3.beta2, including #20310, I still get exactly the same error:\n\n```\nsage: v\n[a + O(a^11), O(3^-1), O(a^-1), O(a^-2)]\nsage: R(v,4)\na + O(a^11) + O(T^4)\nsage: s = _\nsage: s[0]\na + O(a^11)\nsage: s[1]\n0\n```\n\nThe coefficients for T and `T^2` are set to zero in the powerseries despite that we give `O(3^-1)`",
    "created_at": "2018-05-23T19:45:58Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10698",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10698#issuecomment-130196",
    "user": "https://github.com/categorie"
}
```

<a id='comment:5'></a>
With  8.3.beta2, including #20310, I still get exactly the same error:

```
sage: v
[a + O(a^11), O(3^-1), O(a^-1), O(a^-2)]
sage: R(v,4)
a + O(a^11) + O(T^4)
sage: s = _
sage: s[0]
a + O(a^11)
sage: s[1]
0
```

The coefficients for T and `T^2` are set to zero in the powerseries despite that we give `O(3^-1)`



---

archive/issue_comments_130197.json:
```json
{
    "body": "<a id='comment:6'></a>\nYeah, I agree that this ticket is not resolved.",
    "created_at": "2018-05-24T20:02:46Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10698",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10698#issuecomment-130197",
    "user": "https://github.com/roed314"
}
```

<a id='comment:6'></a>
Yeah, I agree that this ticket is not resolved.
