# Issue 10696: SymmetricGroup function doesn't seem to do arbitrary sets

archive/issues_010640.json:
```json
{
    "assignees": [],
    "body": "The following doesn't seem right to me.  I tried this on sage 4.5.3 and 4.6.  My impression is that the SymmetricGroup function can take a list of distinct integers X as an argument and give the symmetric group S_X.  However, we can try the following.\n\n```\nsage: f=SymmetricGroup([1,2,4]) \nsage: for i in f: \n....:     print i\n....:\n() \n(2,3) \n(1,2) \n(1,2,3) \n(1,3,2) \n(1,3) \nsage: f[3] \n(1,2,3) \nsage: f[3](4) \n4 \nsage: f[3](3) \n1 \nsage: f.set() \n(1, 2, 4)\n```\n\nThus, it seems that f.set() returns the right support, but in fact the support for the group is 1,2,3.  This suggests to me that S_X = S_{1,2,3}.\n\n**Assignee:** sage-combinat\n\n**CC:**  @jdemeyer\n\n**Keywords:** SymmetricGroup\n\n**Reviewer:** Mike Hansen\n\nIssue created by migration from https://trac.sagemath.org/ticket/10696\n\n",
    "closed_at": "2012-05-21T08:01:41Z",
    "created_at": "2011-01-26T16:43:30Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20combinatorics",
        "https://github.com/sagemath/sage/labels/minor",
        "https://github.com/sagemath/sage/labels/bug",
        "https://github.com/sagemath/sage/labels/duplicate"
    ],
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "SymmetricGroup function doesn't seem to do arbitrary sets",
    "type": "issue",
    "updated_at": "2012-05-21T08:01:41Z",
    "url": "https://github.com/sagemath/sage/issues/10696",
    "user": "https://github.com/sagetrac-arattan"
}
```
The following doesn't seem right to me.  I tried this on sage 4.5.3 and 4.6.  My impression is that the SymmetricGroup function can take a list of distinct integers X as an argument and give the symmetric group S_X.  However, we can try the following.

```
sage: f=SymmetricGroup([1,2,4]) 
sage: for i in f: 
....:     print i
....:
() 
(2,3) 
(1,2) 
(1,2,3) 
(1,3,2) 
(1,3) 
sage: f[3] 
(1,2,3) 
sage: f[3](4) 
4 
sage: f[3](3) 
1 
sage: f.set() 
(1, 2, 4)
```

Thus, it seems that f.set() returns the right support, but in fact the support for the group is 1,2,3.  This suggests to me that S_X = S_{1,2,3}.

**Assignee:** sage-combinat

**CC:**  @jdemeyer

**Keywords:** SymmetricGroup

**Reviewer:** Mike Hansen

Issue created by migration from https://trac.sagemath.org/ticket/10696





---

archive/issue_events_118749.json:
```json
{
    "actor": "https://github.com/sagetrac-arattan",
    "created_at": "2011-01-26T16:43:30Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/10696",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20combinatorics",
    "label_color": "08517b",
    "label_name": "component: combinatorics",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/10696#event-118749"
}
```



---

archive/issue_events_118750.json:
```json
{
    "actor": "https://github.com/sagetrac-arattan",
    "created_at": "2011-01-26T16:43:30Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/10696",
    "label": "https://github.com/sagemath/sage/labels/minor",
    "label_color": "ff0000",
    "label_name": "minor",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/10696#event-118750"
}
```



---

archive/issue_events_118751.json:
```json
{
    "actor": "https://github.com/sagetrac-arattan",
    "created_at": "2011-01-26T16:43:30Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/10696",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "008080",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/10696#event-118751"
}
```



---

archive/issue_events_118752.json:
```json
{
    "actor": "https://github.com/sagetrac-arattan",
    "created_at": "2011-01-26T16:43:30Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/10696",
    "label": "https://github.com/sagemath/sage/labels/invalid",
    "label_color": "008080",
    "label_name": "invalid",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/10696#event-118752"
}
```



---

archive/issue_comments_104728.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -1,23 +1,39 @@\n The following doesn't seem right to me.  I tried this on sage 4.5.3 and 4.6.  My impression is that the SymmetricGroup function can take a list of distinct integers X as an argument and give the symmetric group S_X.  However, we can try the following.\n \n-sage: f=SymmetricGroup([1,2,4])\n-sage: for i in f:\n+sage: f=SymmetricGroup([1,2,4]) \n+\n+sage: for i in f: \n+\n ....:     print i\n-....: \n \n-()\n-(2,3)\n-(1,2)\n-(1,2,3)\n-(1,3,2)\n-(1,3)\n-sage: f[3]\n-(1,2,3)\n-sage: f[3](4)\n-4\n-sage: f[3](3)\n-1\n-sage: f.set()\n+....:\n+\n+() \n+\n+(2,3) \n+\n+(1,2) \n+\n+(1,2,3) \n+\n+(1,3,2) \n+\n+(1,3) \n+\n+sage: f[3] \n+\n+(1,2,3) \n+\n+sage: f[3](4) \n+\n+4 \n+\n+sage: f[3](3) \n+\n+1 \n+\n+sage: f.set() \n+\n (1, 2, 4)\n \n-Thus, it seems that f.set() returns that right support, but in fact the support for the group is 1,2,3.  This suggests to me that S_X = S_{1,2,3}.\n+Thus, it seems that f.set() returns the right support, but in fact the support for the group is 1,2,3.  This suggests to me that S_X = S_{1,2,3}.\n``````\n",
    "created_at": "2011-01-26T16:45:36Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/10696",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/10696#issuecomment-104728",
    "user": "https://github.com/sagetrac-arattan"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -1,23 +1,39 @@
 The following doesn't seem right to me.  I tried this on sage 4.5.3 and 4.6.  My impression is that the SymmetricGroup function can take a list of distinct integers X as an argument and give the symmetric group S_X.  However, we can try the following.
 
-sage: f=SymmetricGroup([1,2,4])
-sage: for i in f:
+sage: f=SymmetricGroup([1,2,4]) 
+
+sage: for i in f: 
+
 ....:     print i
-....: 
 
-()
-(2,3)
-(1,2)
-(1,2,3)
-(1,3,2)
-(1,3)
-sage: f[3]
-(1,2,3)
-sage: f[3](4)
-4
-sage: f[3](3)
-1
-sage: f.set()
+....:
+
+() 
+
+(2,3) 
+
+(1,2) 
+
+(1,2,3) 
+
+(1,3,2) 
+
+(1,3) 
+
+sage: f[3] 
+
+(1,2,3) 
+
+sage: f[3](4) 
+
+4 
+
+sage: f[3](3) 
+
+1 
+
+sage: f.set() 
+
 (1, 2, 4)
 
-Thus, it seems that f.set() returns that right support, but in fact the support for the group is 1,2,3.  This suggests to me that S_X = S_{1,2,3}.
+Thus, it seems that f.set() returns the right support, but in fact the support for the group is 1,2,3.  This suggests to me that S_X = S_{1,2,3}.
``````




---

archive/issue_comments_104729.json:
```json
{
    "body": "<a id='comment:2'>**Comment 2:**</a>\nThis should be fixed by #10335",
    "created_at": "2011-01-26T16:52:12Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/10696",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/10696#issuecomment-104729",
    "user": "https://github.com/mwhansen"
}
```

<a id='comment:2'>**Comment 2:**</a>
This should be fixed by #10335



---

archive/issue_comments_104730.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -1,39 +1,24 @@\n The following doesn't seem right to me.  I tried this on sage 4.5.3 and 4.6.  My impression is that the SymmetricGroup function can take a list of distinct integers X as an argument and give the symmetric group S_X.  However, we can try the following.\n \n+```\n sage: f=SymmetricGroup([1,2,4]) \n-\n sage: for i in f: \n-\n ....:     print i\n-\n ....:\n-\n () \n-\n (2,3) \n-\n (1,2) \n-\n (1,2,3) \n-\n (1,3,2) \n-\n (1,3) \n-\n sage: f[3] \n-\n (1,2,3) \n-\n sage: f[3](4) \n-\n 4 \n-\n sage: f[3](3) \n-\n 1 \n-\n sage: f.set() \n-\n (1, 2, 4)\n+```\n \n Thus, it seems that f.set() returns the right support, but in fact the support for the group is 1,2,3.  This suggests to me that S_X = S_{1,2,3}.\n``````\n",
    "created_at": "2012-03-29T07:16:18Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/10696",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/10696#issuecomment-104730",
    "user": "https://github.com/mwhansen"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -1,39 +1,24 @@
 The following doesn't seem right to me.  I tried this on sage 4.5.3 and 4.6.  My impression is that the SymmetricGroup function can take a list of distinct integers X as an argument and give the symmetric group S_X.  However, we can try the following.
 
+```
 sage: f=SymmetricGroup([1,2,4]) 
-
 sage: for i in f: 
-
 ....:     print i
-
 ....:
-
 () 
-
 (2,3) 
-
 (1,2) 
-
 (1,2,3) 
-
 (1,3,2) 
-
 (1,3) 
-
 sage: f[3] 
-
 (1,2,3) 
-
 sage: f[3](4) 
-
 4 
-
 sage: f[3](3) 
-
 1 
-
 sage: f.set() 
-
 (1, 2, 4)
+```
 
 Thus, it seems that f.set() returns the right support, but in fact the support for the group is 1,2,3.  This suggests to me that S_X = S_{1,2,3}.
``````




---

archive/issue_comments_104731.json:
```json
{
    "body": "<a id='comment:4'>**Comment 4:**</a>\nThis can indeed be closed:\n\n```\n\nsage: f=SymmetricGroup([1,2,4])\nsage: for i in f:        \n....:     print i\n....:     \n()\n(2,4)\n(1,2)\n(1,2,4)\n(1,4,2)\n(1,4)\nsage: f[3] \n(1,2,4)\nsage: f[3](4)\n1\nsage: f[3](3)\n3\nsage: f.set()\n/opt/sage/local/bin/sage-ipython:1: DeprecationWarning: (Since Sage Version 4.7.1) set is deprecated. Please use domain instead.\n  #!/usr/bin/env python\n{1, 2, 4}\n```",
    "created_at": "2012-03-29T07:18:10Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/10696",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/10696#issuecomment-104731",
    "user": "https://github.com/mwhansen"
}
```

<a id='comment:4'>**Comment 4:**</a>
This can indeed be closed:

```

sage: f=SymmetricGroup([1,2,4])
sage: for i in f:        
....:     print i
....:     
()
(2,4)
(1,2)
(1,2,4)
(1,4,2)
(1,4)
sage: f[3] 
(1,2,4)
sage: f[3](4)
1
sage: f[3](3)
3
sage: f.set()
/opt/sage/local/bin/sage-ipython:1: DeprecationWarning: (Since Sage Version 4.7.1) set is deprecated. Please use domain instead.
  #!/usr/bin/env python
{1, 2, 4}
```



---

archive/issue_comments_104732.json:
```json
{
    "body": "<a id='comment:5'>**Comment 5:**</a>\nVerified results that this can be closed.",
    "created_at": "2012-05-11T22:40:15Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/10696",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/10696#issuecomment-104732",
    "user": "https://github.com/tscrim"
}
```

<a id='comment:5'>**Comment 5:**</a>
Verified results that this can be closed.



---

archive/issue_events_118753.json:
```json
{
    "actor": "https://github.com/tscrim",
    "created_at": "2012-05-11T22:40:15Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/10696",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "008080",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/10696#event-118753"
}
```



---

archive/issue_events_118754.json:
```json
{
    "actor": "https://github.com/tscrim",
    "created_at": "2012-05-11T22:40:37Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/10696",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "008080",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/10696#event-118754"
}
```



---

archive/issue_events_118755.json:
```json
{
    "actor": "https://github.com/tscrim",
    "created_at": "2012-05-11T22:40:37Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/10696",
    "label": "https://github.com/sagemath/sage/labels/positive%20review",
    "label_color": "008080",
    "label_name": "positive review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/10696#event-118755"
}
```



---

archive/issue_comments_104733.json:
```json
{
    "body": "<a id='comment:7'>**Comment 7:**</a>\nTo mark as ticket as needing to be closed, you should put the milestone to *sage-duplicate/invalid/wontfix*.",
    "created_at": "2012-05-13T20:19:59Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/10696",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/10696#issuecomment-104733",
    "user": "https://github.com/jdemeyer"
}
```

<a id='comment:7'>**Comment 7:**</a>
To mark as ticket as needing to be closed, you should put the milestone to *sage-duplicate/invalid/wontfix*.



---

archive/issue_comments_104734.json:
```json
{
    "body": "**Reviewer:** Mike Hansen",
    "created_at": "2012-05-13T20:19:59Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/10696",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/10696#issuecomment-104734",
    "user": "https://github.com/jdemeyer"
}
```

**Reviewer:** Mike Hansen



---

archive/issue_events_118756.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2012-05-21T08:01:41Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/10696",
    "label": "https://github.com/sagemath/sage/labels/duplicate",
    "label_color": "008080",
    "label_name": "duplicate",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/10696#event-118756"
}
```



---

archive/issue_events_118757.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2012-05-21T08:01:41Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/10696",
    "label": "https://github.com/sagemath/sage/labels/positive%20review",
    "label_color": "008080",
    "label_name": "positive review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/10696#event-118757"
}
```



---

archive/issue_events_118758.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2012-05-21T08:01:41Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/10696",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/10696#event-118758"
}
```
