# Issue 10696: SymmetricGroup function doesn't seem to do arbitrary sets

archive/issues_010640.json:
```json
{
    "assignees": [],
    "body": "The following doesn't seem right to me.  I tried this on sage 4.5.3 and 4.6.  My impression is that the SymmetricGroup function can take a list of distinct integers X as an argument and give the symmetric group S_X.  However, we can try the following.\n\n```\nsage: f=SymmetricGroup([1,2,4]) \nsage: for i in f: \n....:     print i\n....:\n() \n(2,3) \n(1,2) \n(1,2,3) \n(1,3,2) \n(1,3) \nsage: f[3] \n(1,2,3) \nsage: f[3](4) \n4 \nsage: f[3](3) \n1 \nsage: f.set() \n(1, 2, 4)\n```\n\nThus, it seems that f.set() returns the right support, but in fact the support for the group is 1,2,3.  This suggests to me that S_X = S_{1,2,3}.\n\nAssignee: **@sagetrac-sage-combinat**\n\nCC:  @jdemeyer\n\nKeywords: **SymmetricGroup**\n\nReviewer: **Mike Hansen**\n\n_Issue created by migration from https://trac.sagemath.org/ticket/10696_\n\n",
    "closed_at": "2012-05-21T08:01:41Z",
    "created_at": "2011-01-26T16:43:30Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/bug",
        "https://github.com/sagemath/sage/labels/component%3A%20combinatorics",
        "https://github.com/sagemath/sage/labels/duplicate"
    ],
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "SymmetricGroup function doesn't seem to do arbitrary sets",
    "type": "issue",
    "updated_at": "2012-05-21T08:01:41Z",
    "url": "https://github.com/sagemath/sage/issues/10696",
    "user": "https://github.com/sagetrac-arattan"
}
```
The following doesn't seem right to me.  I tried this on sage 4.5.3 and 4.6.  My impression is that the SymmetricGroup function can take a list of distinct integers X as an argument and give the symmetric group S_X.  However, we can try the following.

```
sage: f=SymmetricGroup([1,2,4]) 
sage: for i in f: 
....:     print i
....:
() 
(2,3) 
(1,2) 
(1,2,3) 
(1,3,2) 
(1,3) 
sage: f[3] 
(1,2,3) 
sage: f[3](4) 
4 
sage: f[3](3) 
1 
sage: f.set() 
(1, 2, 4)
```

Thus, it seems that f.set() returns the right support, but in fact the support for the group is 1,2,3.  This suggests to me that S_X = S_{1,2,3}.

Assignee: **@sagetrac-sage-combinat**

CC:  @jdemeyer

Keywords: **SymmetricGroup**

Reviewer: **Mike Hansen**

_Issue created by migration from https://trac.sagemath.org/ticket/10696_





---

archive/issue_events_128836.json:
```json
{
    "actor": "https://github.com/sagetrac-arattan",
    "created_at": "2011-01-26T16:43:30Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/10696",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20combinatorics",
    "label_color": "0000ff",
    "label_name": "component: combinatorics",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/10696#event-128836"
}
```



---

archive/issue_events_128837.json:
```json
{
    "actor": "https://github.com/sagetrac-arattan",
    "created_at": "2011-01-26T16:43:30Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/10696",
    "label": "https://github.com/sagemath/sage/labels/p4%20%E2%80%93%20minor",
    "label_color": "ffe799",
    "label_name": "p4 \u2013 minor",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/10696#event-128837"
}
```



---

archive/issue_events_128838.json:
```json
{
    "actor": "https://github.com/sagetrac-arattan",
    "created_at": "2011-01-26T16:43:30Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/10696",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "d73a4a",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/10696#event-128838"
}
```



---

archive/issue_comments_104751.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -1,23 +1,39 @@\n The following doesn't seem right to me.  I tried this on sage 4.5.3 and 4.6.  My impression is that the SymmetricGroup function can take a list of distinct integers X as an argument and give the symmetric group S_X.  However, we can try the following.\n \n-sage: f=SymmetricGroup([1,2,4])\n-sage: for i in f:\n+sage: f=SymmetricGroup([1,2,4]) \n+\n+sage: for i in f: \n+\n ....:     print i\n-....: \n \n-()\n-(2,3)\n-(1,2)\n-(1,2,3)\n-(1,3,2)\n-(1,3)\n-sage: f[3]\n-(1,2,3)\n-sage: f[3](4)\n-4\n-sage: f[3](3)\n-1\n-sage: f.set()\n+....:\n+\n+() \n+\n+(2,3) \n+\n+(1,2) \n+\n+(1,2,3) \n+\n+(1,3,2) \n+\n+(1,3) \n+\n+sage: f[3] \n+\n+(1,2,3) \n+\n+sage: f[3](4) \n+\n+4 \n+\n+sage: f[3](3) \n+\n+1 \n+\n+sage: f.set() \n+\n (1, 2, 4)\n \n-Thus, it seems that f.set() returns that right support, but in fact the support for the group is 1,2,3.  This suggests to me that S_X = S_{1,2,3}.\n+Thus, it seems that f.set() returns the right support, but in fact the support for the group is 1,2,3.  This suggests to me that S_X = S_{1,2,3}.\n``````\n",
    "created_at": "2011-01-26T16:45:36Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/10696",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/10696#issuecomment-104751",
    "user": "https://github.com/sagetrac-arattan"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -1,23 +1,39 @@
 The following doesn't seem right to me.  I tried this on sage 4.5.3 and 4.6.  My impression is that the SymmetricGroup function can take a list of distinct integers X as an argument and give the symmetric group S_X.  However, we can try the following.
 
-sage: f=SymmetricGroup([1,2,4])
-sage: for i in f:
+sage: f=SymmetricGroup([1,2,4]) 
+
+sage: for i in f: 
+
 ....:     print i
-....: 
 
-()
-(2,3)
-(1,2)
-(1,2,3)
-(1,3,2)
-(1,3)
-sage: f[3]
-(1,2,3)
-sage: f[3](4)
-4
-sage: f[3](3)
-1
-sage: f.set()
+....:
+
+() 
+
+(2,3) 
+
+(1,2) 
+
+(1,2,3) 
+
+(1,3,2) 
+
+(1,3) 
+
+sage: f[3] 
+
+(1,2,3) 
+
+sage: f[3](4) 
+
+4 
+
+sage: f[3](3) 
+
+1 
+
+sage: f.set() 
+
 (1, 2, 4)
 
-Thus, it seems that f.set() returns that right support, but in fact the support for the group is 1,2,3.  This suggests to me that S_X = S_{1,2,3}.
+Thus, it seems that f.set() returns the right support, but in fact the support for the group is 1,2,3.  This suggests to me that S_X = S_{1,2,3}.
``````




---

archive/issue_comments_104752.json:
```json
{
    "body": "<div id=\"comment:2\" align=\"right\">Comment 2</div>\n\nThis should be fixed by #10335",
    "created_at": "2011-01-26T16:52:12Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/10696",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/10696#issuecomment-104752",
    "user": "https://github.com/mwhansen"
}
```

<div id="comment:2" align="right">Comment 2</div>

This should be fixed by #10335



---

archive/issue_comments_104753.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -1,39 +1,24 @@\n The following doesn't seem right to me.  I tried this on sage 4.5.3 and 4.6.  My impression is that the SymmetricGroup function can take a list of distinct integers X as an argument and give the symmetric group S_X.  However, we can try the following.\n \n+```\n sage: f=SymmetricGroup([1,2,4]) \n-\n sage: for i in f: \n-\n ....:     print i\n-\n ....:\n-\n () \n-\n (2,3) \n-\n (1,2) \n-\n (1,2,3) \n-\n (1,3,2) \n-\n (1,3) \n-\n sage: f[3] \n-\n (1,2,3) \n-\n sage: f[3](4) \n-\n 4 \n-\n sage: f[3](3) \n-\n 1 \n-\n sage: f.set() \n-\n (1, 2, 4)\n+```\n \n Thus, it seems that f.set() returns the right support, but in fact the support for the group is 1,2,3.  This suggests to me that S_X = S_{1,2,3}.\n``````\n",
    "created_at": "2012-03-29T07:16:18Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/10696",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/10696#issuecomment-104753",
    "user": "https://github.com/mwhansen"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -1,39 +1,24 @@
 The following doesn't seem right to me.  I tried this on sage 4.5.3 and 4.6.  My impression is that the SymmetricGroup function can take a list of distinct integers X as an argument and give the symmetric group S_X.  However, we can try the following.
 
+```
 sage: f=SymmetricGroup([1,2,4]) 
-
 sage: for i in f: 
-
 ....:     print i
-
 ....:
-
 () 
-
 (2,3) 
-
 (1,2) 
-
 (1,2,3) 
-
 (1,3,2) 
-
 (1,3) 
-
 sage: f[3] 
-
 (1,2,3) 
-
 sage: f[3](4) 
-
 4 
-
 sage: f[3](3) 
-
 1 
-
 sage: f.set() 
-
 (1, 2, 4)
+```
 
 Thus, it seems that f.set() returns the right support, but in fact the support for the group is 1,2,3.  This suggests to me that S_X = S_{1,2,3}.
``````




---

archive/issue_comments_104754.json:
```json
{
    "body": "<div id=\"comment:4\" align=\"right\">Comment 4</div>\n\nThis can indeed be closed:\n\n```\n\nsage: f=SymmetricGroup([1,2,4])\nsage: for i in f:        \n....:     print i\n....:     \n()\n(2,4)\n(1,2)\n(1,2,4)\n(1,4,2)\n(1,4)\nsage: f[3] \n(1,2,4)\nsage: f[3](4)\n1\nsage: f[3](3)\n3\nsage: f.set()\n/opt/sage/local/bin/sage-ipython:1: DeprecationWarning: (Since Sage Version 4.7.1) set is deprecated. Please use domain instead.\n  #!/usr/bin/env python\n{1, 2, 4}\n```",
    "created_at": "2012-03-29T07:18:10Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/10696",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/10696#issuecomment-104754",
    "user": "https://github.com/mwhansen"
}
```

<div id="comment:4" align="right">Comment 4</div>

This can indeed be closed:

```

sage: f=SymmetricGroup([1,2,4])
sage: for i in f:        
....:     print i
....:     
()
(2,4)
(1,2)
(1,2,4)
(1,4,2)
(1,4)
sage: f[3] 
(1,2,4)
sage: f[3](4)
1
sage: f[3](3)
3
sage: f.set()
/opt/sage/local/bin/sage-ipython:1: DeprecationWarning: (Since Sage Version 4.7.1) set is deprecated. Please use domain instead.
  #!/usr/bin/env python
{1, 2, 4}
```



---

archive/issue_comments_104755.json:
```json
{
    "body": "<div id=\"comment:5\" align=\"right\">Comment 5</div>\n\nVerified results that this can be closed.",
    "created_at": "2012-05-11T22:40:15Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/10696",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/10696#issuecomment-104755",
    "user": "https://github.com/tscrim"
}
```

<div id="comment:5" align="right">Comment 5</div>

Verified results that this can be closed.



---

archive/issue_events_128839.json:
```json
{
    "actor": "https://github.com/tscrim",
    "created_at": "2012-05-11T22:40:15Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/10696",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "7fff00",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/10696#event-128839"
}
```



---

archive/issue_events_128840.json:
```json
{
    "actor": "https://github.com/tscrim",
    "created_at": "2012-05-11T22:40:37Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/10696",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "7fff00",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/10696#event-128840"
}
```



---

archive/issue_events_128841.json:
```json
{
    "actor": "https://github.com/tscrim",
    "created_at": "2012-05-11T22:40:37Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/10696",
    "label": "https://github.com/sagemath/sage/labels/positive%20review",
    "label_color": "dfffc0",
    "label_name": "positive review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/10696#event-128841"
}
```



---

archive/issue_comments_104756.json:
```json
{
    "body": "<div id=\"comment:7\" align=\"right\">Comment 7</div>\n\nTo mark as ticket as needing to be closed, you should put the milestone to *sage-duplicate/invalid/wontfix*.",
    "created_at": "2012-05-13T20:19:59Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/10696",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/10696#issuecomment-104756",
    "user": "https://github.com/jdemeyer"
}
```

<div id="comment:7" align="right">Comment 7</div>

To mark as ticket as needing to be closed, you should put the milestone to *sage-duplicate/invalid/wontfix*.



---

archive/issue_comments_104757.json:
```json
{
    "body": "Reviewer: **Mike Hansen**",
    "created_at": "2012-05-13T20:19:59Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/10696",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/10696#issuecomment-104757",
    "user": "https://github.com/jdemeyer"
}
```

Reviewer: **Mike Hansen**



---

archive/issue_events_128842.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2012-05-13T20:19:59Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/10696",
    "label": "https://github.com/sagemath/sage/labels/p4%20%E2%80%93%20minor",
    "label_color": "ffe799",
    "label_name": "p4 \u2013 minor",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/10696#event-128842"
}
```



---

archive/issue_events_128843.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2012-05-13T20:19:59Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/10696",
    "label": "https://github.com/sagemath/sage/labels/invalid",
    "label_color": "a6a6a6",
    "label_name": "invalid",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/10696#event-128843"
}
```



---

archive/issue_events_128844.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2012-05-21T08:01:41Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/10696",
    "label": "https://github.com/sagemath/sage/labels/duplicate",
    "label_color": "a6a6a6",
    "label_name": "duplicate",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/10696#event-128844"
}
```



---

archive/issue_events_128845.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2012-05-21T08:01:41Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/10696",
    "label": "https://github.com/sagemath/sage/labels/positive%20review",
    "label_color": "dfffc0",
    "label_name": "positive review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/10696#event-128845"
}
```



---

archive/issue_events_128846.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2012-05-21T08:01:41Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/10696",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/10696#event-128846"
}
```
