# Issue 10883: Degree() method of permutation group should (always) return a sage integer

archive/issues_010812.json:
```json
{
    "body": "There is some cases for which the degree method for PermutationGroup return a GapElement and not a sage integer.\n\n```\nsage: G = PermutationGroup([[(1,2,3,4)]])\nsage: type(G.degree())\n<type 'int'>\nsage: H = G._gap_()\nsage: H\nGroup( [ (1,2,3,4) ] )\nsage: I = PermutationGroup(gap_group=H)\nsage: type(I.degree())\n<class 'sage.interfaces.gap.GapElement'>\nsage: I == G\nTrue\nsage: G = TransitiveGroup(6,3)\nsage: type(I.degree())\n<class 'sage.interfaces.gap.GapElement'>\n```\n\n**Assignee:** nborie\n\n**CC:**  sage-combinat\n\n**Resolution:** invalid\n\nIssue created by migration from https://trac.sagemath.org/ticket/10883\n\n",
    "closed_at": "2011-03-06T20:28:50Z",
    "created_at": "2011-03-06T11:09:41Z",
    "labels": [
        "component: group theory",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-duplicate/invalid/wontfix",
    "title": "Degree() method of permutation group should (always) return a sage integer",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/10883",
    "user": "https://trac.sagemath.org/admin/accounts/users/nborie"
}
```
There is some cases for which the degree method for PermutationGroup return a GapElement and not a sage integer.

```
sage: G = PermutationGroup([[(1,2,3,4)]])
sage: type(G.degree())
<type 'int'>
sage: H = G._gap_()
sage: H
Group( [ (1,2,3,4) ] )
sage: I = PermutationGroup(gap_group=H)
sage: type(I.degree())
<class 'sage.interfaces.gap.GapElement'>
sage: I == G
True
sage: G = TransitiveGroup(6,3)
sage: type(I.degree())
<class 'sage.interfaces.gap.GapElement'>
```

**Assignee:** nborie

**CC:**  sage-combinat

**Resolution:** invalid

Issue created by migration from https://trac.sagemath.org/ticket/10883





---

archive/attachments_014265.json:
```json
{
    "asset_content_type": "application/octet-stream",
    "asset_name": "trac_10883_degree_type_permutationgroup-nb.patch",
    "asset_url": "tarball://root/attachments/some-uuid/ticket10883/trac_10883_degree_type_permutationgroup-nb.patch",
    "created_at": "2011-03-06T18:40:30Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10883",
    "type": "attachment",
    "url": "https://github.com/assets/some-id/some-uuid.patch",
    "user": "https://trac.sagemath.org/admin/accounts/users/nborie"
}
```



---

archive/issue_comments_144561.json:
```json
{
    "body": "",
    "created_at": "2011-03-06T18:40:30Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10883",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10883#issuecomment-144561",
    "user": "https://trac.sagemath.org/admin/accounts/users/nborie"
}
```





---

archive/issue_comments_144562.json:
```json
{
    "body": "<a id='comment:1'></a>\nThat is a very small bug... It came out when running another feature over Transitive Groups coming from the Gap database. I propose a very small patch to fix that (as Integer ring is already imported in the file permgroup.py). As I don't really know how this deserves to be done and documented, feel free to give advises and comments to fix it.",
    "created_at": "2011-03-06T18:45:16Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10883",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10883#issuecomment-144562",
    "user": "https://trac.sagemath.org/admin/accounts/users/nborie"
}
```

<a id='comment:1'></a>
That is a very small bug... It came out when running another feature over Transitive Groups coming from the Gap database. I propose a very small patch to fix that (as Integer ring is already imported in the file permgroup.py). As I don't really know how this deserves to be done and documented, feel free to give advises and comments to fix it.



---

archive/issue_comments_144563.json:
```json
{
    "body": "**Changing status** from new to needs_review.",
    "created_at": "2011-03-06T18:45:16Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10883",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10883#issuecomment-144563",
    "user": "https://trac.sagemath.org/admin/accounts/users/nborie"
}
```

**Changing status** from new to needs_review.



---

archive/issue_comments_144564.json:
```json
{
    "body": "**Resolution:** invalid",
    "created_at": "2011-03-06T20:28:50Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10883",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10883#issuecomment-144564",
    "user": "https://trac.sagemath.org/admin/accounts/users/nborie"
}
```

**Resolution:** invalid



---

archive/issue_events_033646.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/nborie",
    "created_at": "2011-03-06T20:28:50Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/10883",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/10883#event-33646"
}
```



---

archive/issue_comments_144565.json:
```json
{
    "body": "<a id='comment:2'></a>\nWhhaaaaa!\n\nI managed to report a bug which is not in Sage! \n\nThe quoting behavior was obtained with a very special state of Sage-Combinat. Effectively, with no patch applied, there is no problem. The method works fine.\n\n```\nsage: G = TransitiveGroup(6,3)\nsage: type(G.degree())\n<type 'sage.rings.integer.Integer'>\nsage: G = PermutationGroup([[(1,2,3,4)]])\nsage: H = G._gap_()\nsage: I = PermutationGroup(gap_group=H)\nsage: type(I.degree())\n<type 'sage.rings.integer.Integer'>\n```\n\nI just realize it when the buildbot said the apply failed... For this reason, I think this ticket should be closed.",
    "created_at": "2011-03-06T20:28:50Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10883",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10883#issuecomment-144565",
    "user": "https://trac.sagemath.org/admin/accounts/users/nborie"
}
```

<a id='comment:2'></a>
Whhaaaaa!

I managed to report a bug which is not in Sage! 

The quoting behavior was obtained with a very special state of Sage-Combinat. Effectively, with no patch applied, there is no problem. The method works fine.

```
sage: G = TransitiveGroup(6,3)
sage: type(G.degree())
<type 'sage.rings.integer.Integer'>
sage: G = PermutationGroup([[(1,2,3,4)]])
sage: H = G._gap_()
sage: I = PermutationGroup(gap_group=H)
sage: type(I.degree())
<type 'sage.rings.integer.Integer'>
```

I just realize it when the buildbot said the apply failed... For this reason, I think this ticket should be closed.



---

archive/issue_events_033647.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/mvngu",
    "created_at": "2011-03-07T06:46:45Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/10883",
    "milestone": "sage-duplicate/invalid/wontfix",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/10883#event-33647"
}
```
