# Issue 10948: GCD in Polynomial Rings over Extension Fields

archive/issues_010948.json:
```json
{
    "body": "Assignee: @aghitza\n\nKeywords: gcd, polynomialring, extension fields\n\nDuring an `ask.sagemath.org` response (see [symbolic polynomial euclidean algorithm](http://ask.sagemath.org/question/461/symbolic-polynomial-euclidean-algorithm?answer=818#818)) I came across a bug in computing the GCD of two elements of a polynomial ring over an extension field. For example:\n\n```\nsage: R.<x> = PolynomialRing(QQ,'x')\nsage: p = x^2-2\nsage: q = x^2-3\nsage: K.<a,b> = QQ.extension([p,q])\nsage: S.<x> = PolynomialRing(K,'x')\nsage: f = a*x^2 * (x-1); g = a*x^2 * (x-b)\nsage: f.gcd(g)\nx^2\n```\n\nHowever, the result should be `a*x^2`.\n\nIssue created by migration from https://trac.sagemath.org/ticket/11057\n\n",
    "closed_at": "2011-04-01T18:33:33Z",
    "created_at": "2011-03-27T00:26:44Z",
    "labels": [
        "component: algebra",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-duplicate/invalid/wontfix",
    "title": "GCD in Polynomial Rings over Extension Fields",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/10948",
    "user": "https://github.com/cswiercz"
}
```
Assignee: @aghitza

Keywords: gcd, polynomialring, extension fields

During an `ask.sagemath.org` response (see [symbolic polynomial euclidean algorithm](http://ask.sagemath.org/question/461/symbolic-polynomial-euclidean-algorithm?answer=818#818)) I came across a bug in computing the GCD of two elements of a polynomial ring over an extension field. For example:

```
sage: R.<x> = PolynomialRing(QQ,'x')
sage: p = x^2-2
sage: q = x^2-3
sage: K.<a,b> = QQ.extension([p,q])
sage: S.<x> = PolynomialRing(K,'x')
sage: f = a*x^2 * (x-1); g = a*x^2 * (x-b)
sage: f.gcd(g)
x^2
```

However, the result should be `a*x^2`.

Issue created by migration from https://trac.sagemath.org/ticket/11057





---

archive/issue_comments_117593.json:
```json
{
    "body": "Mathematical mistake. ``a`` is a unit in $QQ(a,b)$ so it's not part of the GCD. This ticket is not an issue / defect.",
    "created_at": "2011-04-01T18:33:33Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10948",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10948#issuecomment-117593",
    "user": "https://github.com/cswiercz"
}
```

Mathematical mistake. ``a`` is a unit in $QQ(a,b)$ so it's not part of the GCD. This ticket is not an issue / defect.



---

archive/issue_comments_117594.json:
```json
{
    "body": "Resolution: invalid",
    "created_at": "2011-04-01T18:33:33Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10948",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10948#issuecomment-117594",
    "user": "https://github.com/cswiercz"
}
```

Resolution: invalid



---

archive/issue_events_028702.json:
```json
{
    "actor": "https://github.com/cswiercz",
    "created_at": "2011-04-01T18:33:33Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/10948",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/10948#event-28702"
}
```



---

archive/issue_events_028703.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/mvngu",
    "created_at": "2011-04-02T05:43:49Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/10948",
    "milestone": "sage-duplicate/invalid/wontfix",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/10948#event-28703"
}
```
