# Issue 32820: numerical_integral and fast_float random

archive/issues_032583.json:
```json
{
    "body": "The numerical_integral and fast_float does not play along. There are a bunch of problems:\n\nConsider the following code\n\n```\nsage: var(\"t, a\", domain=\"real\")\nsage: f = a*t\nsage: ffast = fast_float(f, 't', 'a', old=False)\nsage: numerical_integral(ffast, 0, 1, params=[1])\nmust be real number, not list\nmust be real number, not list\n...\nmust be real number, not list\nmust be real number, not list\n(0.0, 0.0)\n```\n\nwhich is obviously wrong. It refuses to take the params.\n\nNow, you can try \n\n```\nsage: ffast = fast_float(f, 't', 'a', old=True)\nsage: numerical_integral(ffast, 0, 1, params=[1])\n...\nUnboundLocalError: local variable 'Infinity' referenced before assignment\n```\nNow it crashes! This seems to be easy to fix. It seems that Infinity is not imported in the correct place. Happily you can change the integrator algorithm to get something else: \n\n```\nsage: f = a*t\nsage: ffast = fast_float(f, 't', 'a', old=False)\nsage: numerical_integral(ffast, 0, 1, params=[1])\n(8.933853e-317, 0.0)\n```\n\nIt is not passing the parameter, it is using 0 as the value for a. You can check it if you use f = (a+1) * t\n\n\n\n\n\n\n\n\n\n**CC:**  @jdemeyer @robertwb @miguelmarco @orlitzky\n\nIssue created by migration from https://trac.sagemath.org/ticket/32820\n\n",
    "created_at": "2021-11-03T13:57:45Z",
    "labels": [
        "component: numerical",
        "bug"
    ],
    "title": "numerical_integral and fast_float random",
    "type": "issue",
    "url": "https://github.com/sagemath/sage/issues/32820",
    "user": "https://github.com/rojizo"
}
```
The numerical_integral and fast_float does not play along. There are a bunch of problems:

Consider the following code

```
sage: var("t, a", domain="real")
sage: f = a*t
sage: ffast = fast_float(f, 't', 'a', old=False)
sage: numerical_integral(ffast, 0, 1, params=[1])
must be real number, not list
must be real number, not list
...
must be real number, not list
must be real number, not list
(0.0, 0.0)
```

which is obviously wrong. It refuses to take the params.

Now, you can try 

```
sage: ffast = fast_float(f, 't', 'a', old=True)
sage: numerical_integral(ffast, 0, 1, params=[1])
...
UnboundLocalError: local variable 'Infinity' referenced before assignment
```
Now it crashes! This seems to be easy to fix. It seems that Infinity is not imported in the correct place. Happily you can change the integrator algorithm to get something else: 

```
sage: f = a*t
sage: ffast = fast_float(f, 't', 'a', old=False)
sage: numerical_integral(ffast, 0, 1, params=[1])
(8.933853e-317, 0.0)
```

It is not passing the parameter, it is using 0 as the value for a. You can check it if you use f = (a+1) * t









**CC:**  @jdemeyer @robertwb @miguelmarco @orlitzky

Issue created by migration from https://trac.sagemath.org/ticket/32820


