# Issue 1011: MagmaElement.__nonzero__

archive/issues_001011.json:
```json
{
    "body": "This used to not work: `bool(magma('true'))` with the attached tiny patch it does.    applied to 2.8.11.alpha0\n\n\n\n**Assignee:** @malb\n\nIssue created by migration from https://trac.sagemath.org/ticket/1011\n\n",
    "closed_at": "2007-11-01T09:41:09Z",
    "created_at": "2007-10-27T13:59:24Z",
    "labels": [
        "component: interfaces",
        "trivial",
        "enhancement"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-2.8.11",
    "title": "MagmaElement.__nonzero__",
    "type": "issue",
    "url": "https://github.com/sagemath/sage/issues/1011",
    "user": "https://github.com/malb"
}
```
This used to not work: `bool(magma('true'))` with the attached tiny patch it does.    applied to 2.8.11.alpha0



**Assignee:** @malb

Issue created by migration from https://trac.sagemath.org/ticket/1011





---

archive/issue_comments_004711.json:
```json
{
    "body": "<a id='comment:1'></a>\nMmmh, any chance this is related to/also  fixes #845?\n\nCheers,\n\nMichael",
    "created_at": "2007-10-27T16:39:54Z",
    "issue": "https://github.com/sagemath/sage/issues/1011",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/1011#issuecomment-4711",
    "user": "https://trac.sagemath.org/admin/accounts/users/mabshoff"
}
```

<a id='comment:1'></a>
Mmmh, any chance this is related to/also  fixes #845?

Cheers,

Michael



---

archive/issue_comments_004712.json:
```json
{
    "body": "<a id='comment:2'></a>\nWouldn't that break `magma(25).is_zero()`?\n\n```\nsage: magma(25).is_zero()\nFalse\nsage: magma(25).bool()\n---------------------------------------------------------------------------\n<type 'exceptions.RuntimeError'>          Traceback (most recent call last)\n[... elided ...]\n<type 'exceptions.RuntimeError'>: Error evaluation Magma code.\nIN:_sage_[18] eq true;\nOUT:\n>> _sage_[18] eq true;\n              ^\nRuntime error in 'eq': Bad argument types\nArgument types given: RngIntElt, BoolElt\n```",
    "created_at": "2007-10-27T19:58:07Z",
    "issue": "https://github.com/sagemath/sage/issues/1011",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/1011#issuecomment-4712",
    "user": "https://trac.sagemath.org/admin/accounts/users/cwitty"
}
```

<a id='comment:2'></a>
Wouldn't that break `magma(25).is_zero()`?

```
sage: magma(25).is_zero()
False
sage: magma(25).bool()
---------------------------------------------------------------------------
<type 'exceptions.RuntimeError'>          Traceback (most recent call last)
[... elided ...]
<type 'exceptions.RuntimeError'>: Error evaluation Magma code.
IN:_sage_[18] eq true;
OUT:
>> _sage_[18] eq true;
              ^
Runtime error in 'eq': Bad argument types
Argument types given: RngIntElt, BoolElt
```



---

archive/attachments_000680.json:
```json
{
    "asset_content_type": "application/octet-stream",
    "asset_name": "magma_nonzero.patch",
    "asset_url": "tarball://root/attachments/ticket1011/magma_nonzero.patch",
    "created_at": "2007-10-30T16:28:25Z",
    "issue": "https://github.com/sagemath/sage/issues/1011",
    "type": "attachment",
    "url": "https://github.com/sagemath/sage/files/ticket1011/magma_nonzero.patch",
    "user": "https://github.com/malb"
}
```



---

archive/issue_comments_004713.json:
```json
{
    "body": "<a id='comment:3'></a>\nAttachment [magma_nonzero.patch](https://github.com/sagemath/sage/files/ticket1011/magma_nonzero.patch) by @malb created at 2007-10-30 16:28:25\n\nReplying to [cwitty](#comment%3A2):\n> Wouldn't that break `magma(25).is_zero()`?\n\n\nYou are right and thus I updated the patch:\n\n```\nsage: magma(9).is_zero()\nFalse\nsage: magma(0).is_zero()\nTrue\nsage: magma('false').bool()\nFalse\nsage: bool(magma(9).IsPrime())\nFalse\nsage: bool(magma(7).IsPrime())\nTrue\n```",
    "created_at": "2007-10-30T16:28:25Z",
    "issue": "https://github.com/sagemath/sage/issues/1011",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/1011#issuecomment-4713",
    "user": "https://github.com/malb"
}
```

<a id='comment:3'></a>
Attachment [magma_nonzero.patch](https://github.com/sagemath/sage/files/ticket1011/magma_nonzero.patch) by @malb created at 2007-10-30 16:28:25

Replying to [cwitty](#comment%3A2):
> Wouldn't that break `magma(25).is_zero()`?


You are right and thus I updated the patch:

```
sage: magma(9).is_zero()
False
sage: magma(0).is_zero()
True
sage: magma('false').bool()
False
sage: bool(magma(9).IsPrime())
False
sage: bool(magma(7).IsPrime())
True
```



---

archive/issue_events_004697.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/mabshoff",
    "created_at": "2007-11-01T09:41:09Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/1011",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1011#event-4697"
}
```



---

archive/issue_comments_004714.json:
```json
{
    "body": "<a id='comment:4'></a>\napplied to 2.8.11.alpha0",
    "created_at": "2007-11-01T09:41:09Z",
    "issue": "https://github.com/sagemath/sage/issues/1011",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/1011#issuecomment-4714",
    "user": "https://trac.sagemath.org/admin/accounts/users/mabshoff"
}
```

<a id='comment:4'></a>
applied to 2.8.11.alpha0



---

archive/issue_comments_004715.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -1 +1,3 @@\n-This used to not work: `bool(magma('true'))` with the attached tiny patch it does.\n+This used to not work: `bool(magma('true'))` with the attached tiny patch it does.    applied to 2.8.11.alpha0\n+\n+\n``````\n",
    "created_at": "2007-11-01T09:41:09Z",
    "issue": "https://github.com/sagemath/sage/issues/1011",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/1011#issuecomment-4715",
    "user": "https://trac.sagemath.org/admin/accounts/users/mabshoff"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -1 +1,3 @@
-This used to not work: `bool(magma('true'))` with the attached tiny patch it does.
+This used to not work: `bool(magma('true'))` with the attached tiny patch it does.    applied to 2.8.11.alpha0
+
+
``````

