# Issue 1142: oddity with regular expressions and ipython

archive/issues_001142.json:
```json
{
    "assignees": [],
    "body": "Reported by wjp: The following is an example from the python regular expression howto. It seems that ipython's preprocessing somehow gets in the way. This works perfectly fine with regular python:\n\n```\n[wjp@issa sage-2.8.12]$ ./sage\n----------------------------------------------------------------------\n| SAGE Version 2.8.12, Release Date: 2007-11-06                      |\n| Type notebook() for the GUI, and license() for information.        |\n----------------------------------------------------------------------\n\nsage: import re\nsage: >>> p = re.compile('(a(b)c)d')\nsage: >>> m = p.match('abcd')\nsage: >>> m.group(0)\n---------------------------------------------------------------------------\n<type 'exceptions.IndexError'>            Traceback (most recent call last)\n\n/data/sage/sage-2.8.12/<ipython console> in <module>()\n\n<type 'exceptions.IndexError'>: no such group\nsage: type(m)\n<type '_sre.SRE_Match'>\nsage: m.groups()\n('abc', 'b')\nsage: \n```\n\nCheers,\n\nMichael\n\n**Assignee:** @williamstein\n\nIssue created by migration from https://trac.sagemath.org/ticket/1142\n\n",
    "closed_at": "2007-11-25T18:11:24Z",
    "created_at": "2007-11-10T23:28:15Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20packages%3A%20standard",
        "https://github.com/sagemath/sage/labels/bug",
        "https://github.com/sagemath/sage/labels/invalid"
    ],
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "oddity with regular expressions and ipython",
    "type": "issue",
    "updated_at": "2007-11-25T18:11:24Z",
    "url": "https://github.com/sagemath/sage/issues/1142",
    "user": "https://github.com/sagetrac-mabshoff"
}
```
Reported by wjp: The following is an example from the python regular expression howto. It seems that ipython's preprocessing somehow gets in the way. This works perfectly fine with regular python:

```
[wjp@issa sage-2.8.12]$ ./sage
----------------------------------------------------------------------
| SAGE Version 2.8.12, Release Date: 2007-11-06                      |
| Type notebook() for the GUI, and license() for information.        |
----------------------------------------------------------------------

sage: import re
sage: >>> p = re.compile('(a(b)c)d')
sage: >>> m = p.match('abcd')
sage: >>> m.group(0)
---------------------------------------------------------------------------
<type 'exceptions.IndexError'>            Traceback (most recent call last)

/data/sage/sage-2.8.12/<ipython console> in <module>()

<type 'exceptions.IndexError'>: no such group
sage: type(m)
<type '_sre.SRE_Match'>
sage: m.groups()
('abc', 'b')
sage: 
```

Cheers,

Michael

**Assignee:** @williamstein

Issue created by migration from https://trac.sagemath.org/ticket/1142





---

archive/issue_events_008858.json:
```json
{
    "actor": "https://github.com/sagetrac-mabshoff",
    "created_at": "2007-11-10T23:28:15Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/1142",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20packages%3A%20standard",
    "label_color": "08517b",
    "label_name": "component: packages: standard",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1142#event-8858"
}
```



---

archive/issue_events_008859.json:
```json
{
    "actor": "https://github.com/sagetrac-mabshoff",
    "created_at": "2007-11-10T23:28:15Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/1142",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "008080",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1142#event-8859"
}
```



---

archive/issue_events_008860.json:
```json
{
    "actor": "https://github.com/sagetrac-mabshoff",
    "created_at": "2007-11-10T23:28:15Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/1142",
    "label": "https://github.com/sagemath/sage/labels/invalid",
    "label_color": "008080",
    "label_name": "invalid",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1142#event-8860"
}
```



---

archive/issue_comments_005272.json:
```json
{
    "body": "<a id='comment:1'>**Comment 1:**</a>\nre cannot handle Sage Integers, but it should because they implement `__index__`\n\n```\nsage: import re\nsage: p = re.compile('(a(b)c)d')\nsage: m = p.match('abcd')\nsage: m.group(0)\n---------------------------------------------------------------------------\n<type 'exceptions.IndexError'>            Traceback (most recent call last)\n\n/home/malb/<ipython console> in <module>()\n\n<type 'exceptions.IndexError'>: no such group\nsage: m.group(int(0))\n'abcd'\n```",
    "created_at": "2007-11-11T13:12:28Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/1142",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/1142#issuecomment-5272",
    "user": "https://github.com/malb"
}
```

<a id='comment:1'>**Comment 1:**</a>
re cannot handle Sage Integers, but it should because they implement `__index__`

```
sage: import re
sage: p = re.compile('(a(b)c)d')
sage: m = p.match('abcd')
sage: m.group(0)
---------------------------------------------------------------------------
<type 'exceptions.IndexError'>            Traceback (most recent call last)

/home/malb/<ipython console> in <module>()

<type 'exceptions.IndexError'>: no such group
sage: m.group(int(0))
'abcd'
```



---

archive/issue_events_008861.json:
```json
{
    "actor": "https://github.com/sagetrac-mabshoff",
    "created_at": "2007-11-25T18:11:24Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/1142",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1142#event-8861"
}
```



---

archive/issue_comments_005273.json:
```json
{
    "body": "<a id='comment:2'>**Comment 2:**</a>\nThe problem is that the preparser turn 0 into an Integer. So using a python int fixes the problem.\n\nErgo: Invalid.\n\nCheers,\n\nMichael",
    "created_at": "2007-11-25T18:11:24Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/1142",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/1142#issuecomment-5273",
    "user": "https://github.com/sagetrac-mabshoff"
}
```

<a id='comment:2'>**Comment 2:**</a>
The problem is that the preparser turn 0 into an Integer. So using a python int fixes the problem.

Ergo: Invalid.

Cheers,

Michael



---

archive/issue_events_008862.json:
```json
{
    "actor": "https://github.com/sagetrac-mabshoff",
    "created_at": "2007-11-25T18:11:24Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/1142",
    "milestone_number": null,
    "milestone_title": "sage-2.8.15",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1142#event-8862"
}
```
