# Issue 1166: 2D terminal output is inconsistent and corrupted

archive/issues_001166.json:
```json
{
    "assignees": [],
    "body": "\n```\nsage: f = (exp(x)-1)/(exp(x/2)+1)\nsage: g = exp(x/2)-1\nsage: print f(10.0), g(10.0)\n                               147.4131591025766                               \\\n 147.4131591025766\nsage: print 1, 2\n1 2\nsage: print f(10), g(10)\n                                     10\n                                    e   - 1\n                                   --------\n                                     5\n                                    e  + 1                                     \\\n  5\n                                     e  - 1\n```\n\nThe output of f(10.0), g(10.0) [with many spaces] seems inconsistent with that of 1, 2 [no spaces]. With f(10), g(10) the exponent 5 of g(10) wraps around the terminal line, and is thus\nnot properly aligned with e - 1. (all this in a 80-column xterm)\n\n**Assignee:** @williamstein\n\nIssue created by migration from https://trac.sagemath.org/ticket/1166\n\n",
    "closed_at": "2008-01-21T22:58:49Z",
    "created_at": "2007-11-13T22:44:08Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20user%20interface",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-2.10.1",
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "2D terminal output is inconsistent and corrupted",
    "type": "issue",
    "updated_at": "2008-01-21T22:58:49Z",
    "url": "https://github.com/sagemath/sage/issues/1166",
    "user": "https://github.com/zimmermann6"
}
```

```
sage: f = (exp(x)-1)/(exp(x/2)+1)
sage: g = exp(x/2)-1
sage: print f(10.0), g(10.0)
                               147.4131591025766                               \
 147.4131591025766
sage: print 1, 2
1 2
sage: print f(10), g(10)
                                     10
                                    e   - 1
                                   --------
                                     5
                                    e  + 1                                     \
  5
                                     e  - 1
```

The output of f(10.0), g(10.0) [with many spaces] seems inconsistent with that of 1, 2 [no spaces]. With f(10), g(10) the exponent 5 of g(10) wraps around the terminal line, and is thus
not properly aligned with e - 1. (all this in a 80-column xterm)

**Assignee:** @williamstein

Issue created by migration from https://trac.sagemath.org/ticket/1166





---

archive/issue_events_009076.json:
```json
{
    "actor": "https://github.com/zimmermann6",
    "created_at": "2007-11-13T22:44:08Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/1166",
    "milestone_number": null,
    "milestone_title": "sage-2.10.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1166#event-9076"
}
```



---

archive/issue_events_009077.json:
```json
{
    "actor": "https://github.com/zimmermann6",
    "created_at": "2007-11-13T22:44:08Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/1166",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20user%20interface",
    "label_color": "08517b",
    "label_name": "component: user interface",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1166#event-9077"
}
```



---

archive/issue_events_009078.json:
```json
{
    "actor": "https://github.com/zimmermann6",
    "created_at": "2007-11-13T22:44:08Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/1166",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "008080",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1166#event-9078"
}
```



---

archive/issue_events_009079.json:
```json
{
    "actor": "https://github.com/sagetrac-mabshoff",
    "created_at": "2007-12-18T23:17:37Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/1166",
    "milestone_number": null,
    "milestone_title": "sage-2.10",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1166#event-9079"
}
```



---

archive/issue_events_009080.json:
```json
{
    "actor": "https://github.com/sagetrac-mabshoff",
    "created_at": "2007-12-18T23:17:37Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/1166",
    "milestone_number": null,
    "milestone_title": "sage-2.9.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1166#event-9080"
}
```



---

archive/issue_comments_005440.json:
```json
{
    "body": "<a id='comment:1'>**Comment 1:**</a>\nIt looks like a newline at the end of the multi line expression of f(10) would fix the issue:\n\n```\n----------------------------------------------------------------------\n| SAGE Version 2.9, Release Date: 2007-12-16                         |\n| Type notebook() for the GUI, and license() for information.        |\n----------------------------------------------------------------------\n\nsage: f = (exp(x)-1)/(exp(x/2)+1)\nsage: g = exp(x/2)-1\nsage: print f(10.0), g(10.0)\n                               147.4131591025766                                147.4131591025766\nsage: print 1, 2\n1 2\nsage: print f(10), g(10)\n                                     10\n                                    e   - 1\n                                   --------\n                                     5\n                                    e  + 1                                       5\n                                     e  - 1\nsage: print f(10)\n                                     10\n                                    e   - 1\n                                   --------\n                                     5\n                                    e  + 1\nsage: print g(10)\n                                      5\n                                     e  - 1\nsage:\n```\n\nCheers,\n\nMichael",
    "created_at": "2007-12-18T23:17:37Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/1166",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/1166#issuecomment-5440",
    "user": "https://github.com/sagetrac-mabshoff"
}
```

<a id='comment:1'>**Comment 1:**</a>
It looks like a newline at the end of the multi line expression of f(10) would fix the issue:

```
----------------------------------------------------------------------
| SAGE Version 2.9, Release Date: 2007-12-16                         |
| Type notebook() for the GUI, and license() for information.        |
----------------------------------------------------------------------

sage: f = (exp(x)-1)/(exp(x/2)+1)
sage: g = exp(x/2)-1
sage: print f(10.0), g(10.0)
                               147.4131591025766                                147.4131591025766
sage: print 1, 2
1 2
sage: print f(10), g(10)
                                     10
                                    e   - 1
                                   --------
                                     5
                                    e  + 1                                       5
                                     e  - 1
sage: print f(10)
                                     10
                                    e   - 1
                                   --------
                                     5
                                    e  + 1
sage: print g(10)
                                      5
                                     e  - 1
sage:
```

Cheers,

Michael



---

archive/issue_events_009081.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2008-01-21T11:38:37Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/1166",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "008080",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1166#event-9081"
}
```



---

archive/issue_comments_005441.json:
```json
{
    "body": "<a id='comment:2'>**Comment 2:**</a>\n**Attachment:** [trac-1166.patch.gz](https://github.com/sagemath/sage/files/ticket1166/trac-1166.patch.gz)",
    "created_at": "2008-01-21T11:38:37Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/1166",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/1166#issuecomment-5441",
    "user": "https://github.com/williamstein"
}
```

<a id='comment:2'>**Comment 2:**</a>
**Attachment:** [trac-1166.patch.gz](https://github.com/sagemath/sage/files/ticket1166/trac-1166.patch.gz)



---

archive/issue_comments_005442.json:
```json
{
    "body": "<a id='comment:3'>**Comment 3:**</a>\n[this is my first review, thus please take with care]\n\nI get with this patch applied in 2.10:\n\n```\nsage: f=(exp(x)-1)/(exp(x/2)+1)\nsage: g=exp(x/2)-1\nsage: print f(10.0), g(10.0)\n\n                               147.4131591025766 \n                               147.4131591025766\nsage: print 1, 2\n1 2\nsage: print f(10), g(10)\n\n                                     10\n                                    e   - 1\n                                   --------\n                                     5\n                                    e  + 1 \n                                      5\n                                     e  - 1\n```\nThe output is much better, but I would expect:\n\n```\nsage: print f(10.0), g(10.0)\n\n                   147.4131591025766, 147.4131591025766\n```\nor\n\n```\nsage: print f(10.0), g(10.0)\n147.4131591025766 147.4131591025766\n```\nHowever, since this is an improvement, I give a positive review.",
    "created_at": "2008-01-21T15:11:58Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/1166",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/1166#issuecomment-5442",
    "user": "https://github.com/zimmermann6"
}
```

<a id='comment:3'>**Comment 3:**</a>
[this is my first review, thus please take with care]

I get with this patch applied in 2.10:

```
sage: f=(exp(x)-1)/(exp(x/2)+1)
sage: g=exp(x/2)-1
sage: print f(10.0), g(10.0)

                               147.4131591025766 
                               147.4131591025766
sage: print 1, 2
1 2
sage: print f(10), g(10)

                                     10
                                    e   - 1
                                   --------
                                     5
                                    e  + 1 
                                      5
                                     e  - 1
```
The output is much better, but I would expect:

```
sage: print f(10.0), g(10.0)

                   147.4131591025766, 147.4131591025766
```
or

```
sage: print f(10.0), g(10.0)
147.4131591025766 147.4131591025766
```
However, since this is an improvement, I give a positive review.



---

archive/issue_events_009082.json:
```json
{
    "actor": "https://github.com/zimmermann6",
    "created_at": "2008-01-21T15:11:58Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/1166",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "008080",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1166#event-9082"
}
```



---

archive/issue_events_009083.json:
```json
{
    "actor": "https://github.com/zimmermann6",
    "created_at": "2008-01-21T15:11:58Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/1166",
    "label": "https://github.com/sagemath/sage/labels/positive%20review",
    "label_color": "008080",
    "label_name": "positive review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1166#event-9083"
}
```



---

archive/issue_comments_005443.json:
```json
{
    "body": "<a id='comment:4'>**Comment 4:**</a>\nThe potential solution to the adding an extra newlines in situations like\n\n```\nsage: print f(10.0), g(10.0)\n147.4131591025766 147.4131591025766\n```\nmight be that we need to check if the string returned from `f(10.0` contains a newline in which case we need to add the extra newline to separate the the two multiline outputs. If that is doable please open another ticket.\n\nCheers,\n\nMichael",
    "created_at": "2008-01-21T22:57:13Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/1166",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/1166#issuecomment-5443",
    "user": "https://github.com/sagetrac-mabshoff"
}
```

<a id='comment:4'>**Comment 4:**</a>
The potential solution to the adding an extra newlines in situations like

```
sage: print f(10.0), g(10.0)
147.4131591025766 147.4131591025766
```
might be that we need to check if the string returned from `f(10.0` contains a newline in which case we need to add the extra newline to separate the the two multiline outputs. If that is doable please open another ticket.

Cheers,

Michael



---

archive/issue_events_009084.json:
```json
{
    "actor": "https://github.com/sagetrac-mabshoff",
    "created_at": "2008-01-21T22:58:49Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/1166",
    "label": "https://github.com/sagemath/sage/labels/positive%20review",
    "label_color": "008080",
    "label_name": "positive review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1166#event-9084"
}
```



---

archive/issue_events_009085.json:
```json
{
    "actor": "https://github.com/sagetrac-mabshoff",
    "created_at": "2008-01-21T22:58:49Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/1166",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1166#event-9085"
}
```



---

archive/issue_comments_005444.json:
```json
{
    "body": "<a id='comment:5'>**Comment 5:**</a>\nMerged in Sage 2.10.1.alpha1",
    "created_at": "2008-01-21T22:58:49Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/1166",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/1166#issuecomment-5444",
    "user": "https://github.com/sagetrac-mabshoff"
}
```

<a id='comment:5'>**Comment 5:**</a>
Merged in Sage 2.10.1.alpha1
