# Issue 1166: 2D terminal output is inconsistent and corrupted

archive/issues_001166.json:
```json
{
    "assignees": [],
    "body": "\n```\nsage: f = (exp(x)-1)/(exp(x/2)+1)\nsage: g = exp(x/2)-1\nsage: print f(10.0), g(10.0)\n                               147.4131591025766                               \\\n 147.4131591025766\nsage: print 1, 2\n1 2\nsage: print f(10), g(10)\n                                     10\n                                    e   - 1\n                                   --------\n                                     5\n                                    e  + 1                                     \\\n  5\n                                     e  - 1\n```\n\nThe output of f(10.0), g(10.0) [with many spaces] seems inconsistent with that of 1, 2 [no spaces]. With f(10), g(10) the exponent 5 of g(10) wraps around the terminal line, and is thus\nnot properly aligned with e - 1. (all this in a 80-column xterm)\n\nAssignee: **@williamstein**\n\n_Issue created by migration from https://trac.sagemath.org/ticket/1166_\n\n",
    "closed_at": "2008-01-21T22:58:49Z",
    "created_at": "2007-11-13T22:44:08Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20user%20interface",
        "https://github.com/sagemath/sage/labels/p3%20%E2%80%93%20major",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-2.10.1",
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "2D terminal output is inconsistent and corrupted",
    "type": "issue",
    "updated_at": "2008-01-21T22:58:49Z",
    "url": "https://github.com/sagemath/sage/issues/1166",
    "user": "https://github.com/zimmermann6"
}
```

```
sage: f = (exp(x)-1)/(exp(x/2)+1)
sage: g = exp(x/2)-1
sage: print f(10.0), g(10.0)
                               147.4131591025766                               \
 147.4131591025766
sage: print 1, 2
1 2
sage: print f(10), g(10)
                                     10
                                    e   - 1
                                   --------
                                     5
                                    e  + 1                                     \
  5
                                     e  - 1
```

The output of f(10.0), g(10.0) [with many spaces] seems inconsistent with that of 1, 2 [no spaces]. With f(10), g(10) the exponent 5 of g(10) wraps around the terminal line, and is thus
not properly aligned with e - 1. (all this in a 80-column xterm)

Assignee: **@williamstein**

_Issue created by migration from https://trac.sagemath.org/ticket/1166_





---

archive/issue_events_009901.json:
```json
{
    "actor": "https://github.com/zimmermann6",
    "created_at": "2007-11-13T22:44:08Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/1166",
    "milestone_number": null,
    "milestone_title": "sage-2.10",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1166#event-9901"
}
```



---

archive/issue_events_009902.json:
```json
{
    "actor": "https://github.com/zimmermann6",
    "created_at": "2007-11-13T22:44:08Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/1166",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20user%20interface",
    "label_color": "000080",
    "label_name": "component: user interface",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1166#event-9902"
}
```



---

archive/issue_events_009903.json:
```json
{
    "actor": "https://github.com/zimmermann6",
    "created_at": "2007-11-13T22:44:08Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/1166",
    "label": "https://github.com/sagemath/sage/labels/p3%20%E2%80%93%20major",
    "label_color": "ffbb00",
    "label_name": "p3 \u2013 major",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1166#event-9903"
}
```



---

archive/issue_events_009904.json:
```json
{
    "actor": "https://github.com/zimmermann6",
    "created_at": "2007-11-13T22:44:08Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/1166",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "d73a4a",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1166#event-9904"
}
```



---

archive/issue_events_009905.json:
```json
{
    "actor": "https://github.com/sagetrac-mabshoff",
    "created_at": "2007-12-18T23:17:37Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/1166",
    "milestone_number": null,
    "milestone_title": "sage-2.10",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1166#event-9905"
}
```



---

archive/issue_events_009906.json:
```json
{
    "actor": "https://github.com/sagetrac-mabshoff",
    "created_at": "2007-12-18T23:17:37Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/1166",
    "milestone_number": null,
    "milestone_title": "sage-2.9.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1166#event-9906"
}
```



---

archive/issue_comments_005441.json:
```json
{
    "body": "<div id=\"comment:1\" align=\"right\">Comment 1</div>\n\nIt looks like a newline at the end of the multi line expression of f(10) would fix the issue:\n\n```\n----------------------------------------------------------------------\n| SAGE Version 2.9, Release Date: 2007-12-16                         |\n| Type notebook() for the GUI, and license() for information.        |\n----------------------------------------------------------------------\n\nsage: f = (exp(x)-1)/(exp(x/2)+1)\nsage: g = exp(x/2)-1\nsage: print f(10.0), g(10.0)\n                               147.4131591025766                                147.4131591025766\nsage: print 1, 2\n1 2\nsage: print f(10), g(10)\n                                     10\n                                    e   - 1\n                                   --------\n                                     5\n                                    e  + 1                                       5\n                                     e  - 1\nsage: print f(10)\n                                     10\n                                    e   - 1\n                                   --------\n                                     5\n                                    e  + 1\nsage: print g(10)\n                                      5\n                                     e  - 1\nsage:\n```\n\nCheers,\n\nMichael",
    "created_at": "2007-12-18T23:17:37Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/1166",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/1166#issuecomment-5441",
    "user": "https://github.com/sagetrac-mabshoff"
}
```

<div id="comment:1" align="right">Comment 1</div>

It looks like a newline at the end of the multi line expression of f(10) would fix the issue:

```
----------------------------------------------------------------------
| SAGE Version 2.9, Release Date: 2007-12-16                         |
| Type notebook() for the GUI, and license() for information.        |
----------------------------------------------------------------------

sage: f = (exp(x)-1)/(exp(x/2)+1)
sage: g = exp(x/2)-1
sage: print f(10.0), g(10.0)
                               147.4131591025766                                147.4131591025766
sage: print 1, 2
1 2
sage: print f(10), g(10)
                                     10
                                    e   - 1
                                   --------
                                     5
                                    e  + 1                                       5
                                     e  - 1
sage: print f(10)
                                     10
                                    e   - 1
                                   --------
                                     5
                                    e  + 1
sage: print g(10)
                                      5
                                     e  - 1
sage:
```

Cheers,

Michael



---

archive/issue_events_009907.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2008-01-21T11:38:37Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/1166",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "7fff00",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1166#event-9907"
}
```



---

archive/issue_comments_005442.json:
```json
{
    "body": "<div id=\"comment:2\" align=\"right\">Comment 2</div>\n\nAttachment: **[trac-1166.patch.gz](https://github.com/sagemath/sage/files/ticket1166/trac-1166.patch.gz)**",
    "created_at": "2008-01-21T11:38:37Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/1166",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/1166#issuecomment-5442",
    "user": "https://github.com/williamstein"
}
```

<div id="comment:2" align="right">Comment 2</div>

Attachment: **[trac-1166.patch.gz](https://github.com/sagemath/sage/files/ticket1166/trac-1166.patch.gz)**



---

archive/issue_comments_005443.json:
```json
{
    "body": "<div id=\"comment:3\" align=\"right\">Comment 3</div>\n\n[this is my first review, thus please take with care]\n\nI get with this patch applied in 2.10:\n\n```\nsage: f=(exp(x)-1)/(exp(x/2)+1)\nsage: g=exp(x/2)-1\nsage: print f(10.0), g(10.0)\n\n                               147.4131591025766 \n                               147.4131591025766\nsage: print 1, 2\n1 2\nsage: print f(10), g(10)\n\n                                     10\n                                    e   - 1\n                                   --------\n                                     5\n                                    e  + 1 \n                                      5\n                                     e  - 1\n```\nThe output is much better, but I would expect:\n\n```\nsage: print f(10.0), g(10.0)\n\n                   147.4131591025766, 147.4131591025766\n```\nor\n\n```\nsage: print f(10.0), g(10.0)\n147.4131591025766 147.4131591025766\n```\nHowever, since this is an improvement, I give a positive review.",
    "created_at": "2008-01-21T15:11:58Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/1166",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/1166#issuecomment-5443",
    "user": "https://github.com/zimmermann6"
}
```

<div id="comment:3" align="right">Comment 3</div>

[this is my first review, thus please take with care]

I get with this patch applied in 2.10:

```
sage: f=(exp(x)-1)/(exp(x/2)+1)
sage: g=exp(x/2)-1
sage: print f(10.0), g(10.0)

                               147.4131591025766 
                               147.4131591025766
sage: print 1, 2
1 2
sage: print f(10), g(10)

                                     10
                                    e   - 1
                                   --------
                                     5
                                    e  + 1 
                                      5
                                     e  - 1
```
The output is much better, but I would expect:

```
sage: print f(10.0), g(10.0)

                   147.4131591025766, 147.4131591025766
```
or

```
sage: print f(10.0), g(10.0)
147.4131591025766 147.4131591025766
```
However, since this is an improvement, I give a positive review.



---

archive/issue_events_009908.json:
```json
{
    "actor": "https://github.com/zimmermann6",
    "created_at": "2008-01-21T15:11:58Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/1166",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "7fff00",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1166#event-9908"
}
```



---

archive/issue_events_009909.json:
```json
{
    "actor": "https://github.com/zimmermann6",
    "created_at": "2008-01-21T15:11:58Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/1166",
    "label": "https://github.com/sagemath/sage/labels/positive%20review",
    "label_color": "dfffc0",
    "label_name": "positive review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1166#event-9909"
}
```



---

archive/issue_comments_005444.json:
```json
{
    "body": "<div id=\"comment:4\" align=\"right\">Comment 4</div>\n\nThe potential solution to the adding an extra newlines in situations like\n\n```\nsage: print f(10.0), g(10.0)\n147.4131591025766 147.4131591025766\n```\nmight be that we need to check if the string returned from `f(10.0` contains a newline in which case we need to add the extra newline to separate the the two multiline outputs. If that is doable please open another ticket.\n\nCheers,\n\nMichael",
    "created_at": "2008-01-21T22:57:13Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/1166",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/1166#issuecomment-5444",
    "user": "https://github.com/sagetrac-mabshoff"
}
```

<div id="comment:4" align="right">Comment 4</div>

The potential solution to the adding an extra newlines in situations like

```
sage: print f(10.0), g(10.0)
147.4131591025766 147.4131591025766
```
might be that we need to check if the string returned from `f(10.0` contains a newline in which case we need to add the extra newline to separate the the two multiline outputs. If that is doable please open another ticket.

Cheers,

Michael



---

archive/issue_events_009910.json:
```json
{
    "actor": "https://github.com/sagetrac-mabshoff",
    "created_at": "2008-01-21T22:58:49Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/1166",
    "label": "https://github.com/sagemath/sage/labels/positive%20review",
    "label_color": "dfffc0",
    "label_name": "positive review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1166#event-9910"
}
```



---

archive/issue_events_009911.json:
```json
{
    "actor": "https://github.com/sagetrac-mabshoff",
    "created_at": "2008-01-21T22:58:49Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/1166",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1166#event-9911"
}
```



---

archive/issue_comments_005445.json:
```json
{
    "body": "<div id=\"comment:5\" align=\"right\">Comment 5</div>\n\nMerged in Sage 2.10.1.alpha1",
    "created_at": "2008-01-21T22:58:49Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/1166",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/1166#issuecomment-5445",
    "user": "https://github.com/sagetrac-mabshoff"
}
```

<div id="comment:5" align="right">Comment 5</div>

Merged in Sage 2.10.1.alpha1
