# Issue 1443: [is invalid?] cannot define function variables?

archive/issues_001443.json:
```json
{
    "assignees": [],
    "body": "It seems not possible to create a functional variable in SAGE. This gives strange things:\n\n```\nsage: var('f');\nsage: f(x)\nx\n```\nIdeally one should be able to do the following, to compute the formal derivative of f(g(x)):\n\n```\nsage: var('f,g');\nsage: diff(f(g(x)), x)\n```\n(Currently this gives 1 due to the above strange simplification f(x) -> x.)\n\n**Assignee:** @mwhansen\n\nIssue created by migration from https://trac.sagemath.org/ticket/1443\n\n",
    "closed_at": "2007-12-15T23:40:36Z",
    "created_at": "2007-12-09T21:49:26Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20calculus",
        "https://github.com/sagemath/sage/labels/bug",
        "https://github.com/sagemath/sage/labels/invalid"
    ],
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "[is invalid?] cannot define function variables?",
    "type": "issue",
    "updated_at": "2007-12-16T00:03:26Z",
    "url": "https://github.com/sagemath/sage/issues/1443",
    "user": "https://github.com/zimmermann6"
}
```
It seems not possible to create a functional variable in SAGE. This gives strange things:

```
sage: var('f');
sage: f(x)
x
```
Ideally one should be able to do the following, to compute the formal derivative of f(g(x)):

```
sage: var('f,g');
sage: diff(f(g(x)), x)
```
(Currently this gives 1 due to the above strange simplification f(x) -> x.)

**Assignee:** @mwhansen

Issue created by migration from https://trac.sagemath.org/ticket/1443





---

archive/issue_events_011333.json:
```json
{
    "actor": "https://github.com/zimmermann6",
    "created_at": "2007-12-09T21:49:26Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/1443",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20calculus",
    "label_color": "08517b",
    "label_name": "component: calculus",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1443#event-11333"
}
```



---

archive/issue_events_011334.json:
```json
{
    "actor": "https://github.com/zimmermann6",
    "created_at": "2007-12-09T21:49:26Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/1443",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "008080",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1443#event-11334"
}
```



---

archive/issue_events_011335.json:
```json
{
    "actor": "https://github.com/zimmermann6",
    "created_at": "2007-12-09T21:49:26Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/1443",
    "label": "https://github.com/sagemath/sage/labels/invalid",
    "label_color": "008080",
    "label_name": "invalid",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1443#event-11335"
}
```



---

archive/issue_comments_007208.json:
```json
{
    "body": "<a id='comment:1'></a>\n\n```\nsage: f = function('f')\nsage: f(x)\nf(x)\nsage: g = function('g')\nsage: f(g(x))\nf(g(x))\nsage: diff(f(g(x)),x)\ndiff(f(g(x)), x, 1)\n```",
    "created_at": "2007-12-10T07:45:03Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/1443",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/1443#issuecomment-7208",
    "user": "https://github.com/mwhansen"
}
```

<a id='comment:1'></a>

```
sage: f = function('f')
sage: f(x)
f(x)
sage: g = function('g')
sage: f(g(x))
f(g(x))
sage: diff(f(g(x)),x)
diff(f(g(x)), x, 1)
```



---

archive/issue_events_011336.json:
```json
{
    "actor": "https://github.com/mwhansen",
    "created_at": "2007-12-10T07:45:03Z",
    "event": "renamed",
    "issue": "https://github.com/sagemath/sage/issues/1443",
    "rename": {
        "from": "cannot define function variables?",
        "to": "[is invalid?] cannot define function variables?"
    },
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1443#event-11336"
}
```



---

archive/issue_comments_007209.json:
```json
{
    "body": "**Changing assignee** from @williamstein to @mwhansen.",
    "created_at": "2007-12-10T07:45:03Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/1443",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/1443#issuecomment-7209",
    "user": "https://github.com/mwhansen"
}
```

**Changing assignee** from @williamstein to @mwhansen.



---

archive/issue_comments_007210.json:
```json
{
    "body": "<a id='comment:2'></a>\nUse function, as mentioned above:\n\n```\nsage: function('f, g')\n(f, g)\nsage: diff(f(g(x)), x)\ndiff(f(g(x)), x, 1)\n```",
    "created_at": "2007-12-15T23:39:33Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/1443",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/1443#issuecomment-7210",
    "user": "https://github.com/williamstein"
}
```

<a id='comment:2'></a>
Use function, as mentioned above:

```
sage: function('f, g')
(f, g)
sage: diff(f(g(x)), x)
diff(f(g(x)), x, 1)
```



---

archive/issue_events_011337.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2007-12-15T23:40:36Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/1443",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1443#event-11337"
}
```



---

archive/issue_events_011338.json:
```json
{
    "actor": "https://github.com/sagetrac-mabshoff",
    "created_at": "2007-12-16T00:03:26Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/1443",
    "milestone_number": null,
    "milestone_title": "sage-2.9",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1443#event-11338"
}
```
