# Issue 1443: [is invalid?] cannot define function variables?

archive/issues_001443.json:
```json
{
    "body": "It seems not possible to create a functional variable in SAGE. This gives strange things:\n\n```\nsage: var('f');\nsage: f(x)\nx\n```\nIdeally one should be able to do the following, to compute the formal derivative of f(g(x)):\n\n```\nsage: var('f,g');\nsage: diff(f(g(x)), x)\n```\n(Currently this gives 1 due to the above strange simplification f(x) -> x.)\n\n**Assignee:** @mwhansen\n\nIssue created by migration from https://trac.sagemath.org/ticket/1443\n\n",
    "closed_at": "2007-12-15T23:40:36Z",
    "created_at": "2007-12-09T21:49:26Z",
    "labels": [
        "component: calculus",
        "bug",
        "invalid"
    ],
    "title": "[is invalid?] cannot define function variables?",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/1443",
    "user": "https://github.com/zimmermann6"
}
```
It seems not possible to create a functional variable in SAGE. This gives strange things:

```
sage: var('f');
sage: f(x)
x
```
Ideally one should be able to do the following, to compute the formal derivative of f(g(x)):

```
sage: var('f,g');
sage: diff(f(g(x)), x)
```
(Currently this gives 1 due to the above strange simplification f(x) -> x.)

**Assignee:** @mwhansen

Issue created by migration from https://trac.sagemath.org/ticket/1443





---

archive/issue_comments_007349.json:
```json
{
    "body": "<a id='comment:1'></a>\n\n```\nsage: f = function('f')\nsage: f(x)\nf(x)\nsage: g = function('g')\nsage: f(g(x))\nf(g(x))\nsage: diff(f(g(x)),x)\ndiff(f(g(x)), x, 1)\n```",
    "created_at": "2007-12-10T07:45:03Z",
    "issue": "https://github.com/sagemath/sagetest/issues/1443",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/1443#issuecomment-7349",
    "user": "https://github.com/mwhansen"
}
```

<a id='comment:1'></a>

```
sage: f = function('f')
sage: f(x)
f(x)
sage: g = function('g')
sage: f(g(x))
f(g(x))
sage: diff(f(g(x)),x)
diff(f(g(x)), x, 1)
```



---

archive/issue_events_006919.json:
```json
{
    "actor": "https://github.com/mwhansen",
    "created_at": "2007-12-10T07:45:03Z",
    "event": "renamed",
    "issue": "https://github.com/sagemath/sagetest/issues/1443",
    "rename": {
        "from": "cannot define function variables?",
        "to": "[is invalid?] cannot define function variables?"
    },
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/1443#event-6919"
}
```



---

archive/issue_comments_007350.json:
```json
{
    "body": "**Changing assignee** from @williamstein to @mwhansen.",
    "created_at": "2007-12-10T07:45:03Z",
    "issue": "https://github.com/sagemath/sagetest/issues/1443",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/1443#issuecomment-7350",
    "user": "https://github.com/mwhansen"
}
```

**Changing assignee** from @williamstein to @mwhansen.



---

archive/issue_comments_007351.json:
```json
{
    "body": "<a id='comment:2'></a>\nUse function, as mentioned above:\n\n```\nsage: function('f, g')\n(f, g)\nsage: diff(f(g(x)), x)\ndiff(f(g(x)), x, 1)\n```",
    "created_at": "2007-12-15T23:39:33Z",
    "issue": "https://github.com/sagemath/sagetest/issues/1443",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/1443#issuecomment-7351",
    "user": "https://github.com/williamstein"
}
```

<a id='comment:2'></a>
Use function, as mentioned above:

```
sage: function('f, g')
(f, g)
sage: diff(f(g(x)), x)
diff(f(g(x)), x, 1)
```



---

archive/issue_events_006920.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2007-12-15T23:40:36Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/1443",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/1443#event-6920"
}
```



---

archive/issue_events_006921.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/mabshoff",
    "created_at": "2007-12-16T00:03:26Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/1443",
    "milestone": "sage-2.9",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/1443#event-6921"
}
```



---

archive/issue_events_006922.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/mabshoff",
    "created_at": "2007-12-16T00:03:26Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sagetest/issues/1443",
    "label": "duplicate/invalid/wontfix",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/1443#event-6922"
}
```
