# Issue 1706: [with patch attached to #2050, postive review] Eigenspaces bug?

archive/issues_001706.json:
```json
{
    "body": "Shouldn't the sum of the dimensions be 2?\n\n```\nsage: M = Matrix(CC, [[1,0],[0,1]])\nsage: M\n\n[1.00000000000000                0]\n[               0 1.00000000000000]\nsage: M.eigenspaces()\n\n[\n(1.00000000000000, [\n(1.00000000000000, 0),\n(0, 1.00000000000000)\n]),\n(1.00000000000000, [\n(1.00000000000000, 0),\n(0, 1.00000000000000)\n])\n]\n```\n\n**Assignee:** @williamstein\n\n**CC:**  ncalexander@gmail.com\n\nIssue created by migration from https://trac.sagemath.org/ticket/1706\n\n",
    "closed_at": "2008-02-28T01:13:16Z",
    "created_at": "2008-01-07T05:11:17Z",
    "labels": [
        "component: linear algebra",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-2.10.3",
    "title": "[with patch attached to #2050, postive review] Eigenspaces bug?",
    "type": "issue",
    "url": "https://github.com/sagemath/sage/issues/1706",
    "user": "https://github.com/rlmill"
}
```
Shouldn't the sum of the dimensions be 2?

```
sage: M = Matrix(CC, [[1,0],[0,1]])
sage: M

[1.00000000000000                0]
[               0 1.00000000000000]
sage: M.eigenspaces()

[
(1.00000000000000, [
(1.00000000000000, 0),
(0, 1.00000000000000)
]),
(1.00000000000000, [
(1.00000000000000, 0),
(0, 1.00000000000000)
])
]
```

**Assignee:** @williamstein

**CC:**  ncalexander@gmail.com

Issue created by migration from https://trac.sagemath.org/ticket/1706





---

archive/issue_comments_008315.json:
```json
{
    "body": "<a id='comment:1'></a>\nThe problem is that fcp (factored char poly) returns (x-1)*(x-1), as opposed to (x-1)^2. (That is, it says that there are two distinct factors, each of which happens to be the same.) However, the eigenspaces algorithm implicitly assumes that the terms in self.fcp() are distinct.",
    "created_at": "2008-01-07T05:15:31Z",
    "issue": "https://github.com/sagemath/sage/issues/1706",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/1706#issuecomment-8315",
    "user": "https://github.com/craigcitro"
}
```

<a id='comment:1'></a>
The problem is that fcp (factored char poly) returns (x-1)*(x-1), as opposed to (x-1)^2. (That is, it says that there are two distinct factors, each of which happens to be the same.) However, the eigenspaces algorithm implicitly assumes that the terms in self.fcp() are distinct.



---

archive/issue_events_007854.json:
```json
{
    "actor": "https://github.com/malb",
    "created_at": "2008-01-18T16:20:27Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/1706",
    "milestone": "sage-2.10.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1706#event-7854"
}
```



---

archive/issue_comments_008316.json:
```json
{
    "body": "<a id='comment:3'></a>\nMore data from Sage 2.9.3 which might shed some light on the problem:\n\n```\nsage: M=Matrix(ZZ,[[1,0],[0,1]])\nsage: M.fcp()\n(x - 1)^2\nsage: M=Matrix(QQ,[[1,0],[0,1]])\nsage: M.fcp()\n(x - 1)^2\nsage: M=Matrix(RR,[[1,0],[0,1]])\nsage: M.fcp()\n(1.00000000000000*x - 1.00000000000000) * (1.00000000000000*x - 1.00000000000000)\nsage: M=Matrix(CC,[[1,0],[0,1]])\nsage: M.fcp()\n(1.00000000000000*x - 1.00000000000000) * (1.00000000000000*x - 1.00000000000000)\n\n```\n\nand \n\n```\nsage: R.<x>=RR[x]\nsage: ((x-1)^2).factor()\n(1.00000000000000*x - 1.00000000000000) * (1.00000000000000*x - 1.00000000000000)\nsage: a=((x-1)^2).factor()\nsage: a\n(1.00000000000000*x - 1.00000000000000) * (1.00000000000000*x - 1.00000000000000)\nsage: a[0]\n(1.00000000000000*x - 1.00000000000000, 1)\nsage: a[0]==a[1]\nTrue\nsage: var('x')\nx\nsage: Q.<x>=QQ[x]\nsage: ((x-1)^2).factor()\n(x - 1)^2\n```",
    "created_at": "2008-01-19T06:58:22Z",
    "issue": "https://github.com/sagemath/sage/issues/1706",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/1706#issuecomment-8316",
    "user": "https://github.com/jasongrout"
}
```

<a id='comment:3'></a>
More data from Sage 2.9.3 which might shed some light on the problem:

```
sage: M=Matrix(ZZ,[[1,0],[0,1]])
sage: M.fcp()
(x - 1)^2
sage: M=Matrix(QQ,[[1,0],[0,1]])
sage: M.fcp()
(x - 1)^2
sage: M=Matrix(RR,[[1,0],[0,1]])
sage: M.fcp()
(1.00000000000000*x - 1.00000000000000) * (1.00000000000000*x - 1.00000000000000)
sage: M=Matrix(CC,[[1,0],[0,1]])
sage: M.fcp()
(1.00000000000000*x - 1.00000000000000) * (1.00000000000000*x - 1.00000000000000)

```

and 

```
sage: R.<x>=RR[x]
sage: ((x-1)^2).factor()
(1.00000000000000*x - 1.00000000000000) * (1.00000000000000*x - 1.00000000000000)
sage: a=((x-1)^2).factor()
sage: a
(1.00000000000000*x - 1.00000000000000) * (1.00000000000000*x - 1.00000000000000)
sage: a[0]
(1.00000000000000*x - 1.00000000000000, 1)
sage: a[0]==a[1]
True
sage: var('x')
x
sage: Q.<x>=QQ[x]
sage: ((x-1)^2).factor()
(x - 1)^2
```



---

archive/issue_comments_008317.json:
```json
{
    "body": "<a id='comment:4'></a>\nSee #2050 for a related ticket, which would likely remove the functionality that is broken above.",
    "created_at": "2008-02-05T05:01:14Z",
    "issue": "https://github.com/sagemath/sage/issues/1706",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/1706#issuecomment-8317",
    "user": "https://github.com/williamstein"
}
```

<a id='comment:4'></a>
See #2050 for a related ticket, which would likely remove the functionality that is broken above.



---

archive/issue_comments_008318.json:
```json
{
    "body": "<a id='comment:5'></a>\nIf #2050 is applied, this will be fixed (the functionality will by default raise NotImplemented).  Patch is attached to #2050.",
    "created_at": "2008-02-17T00:47:33Z",
    "issue": "https://github.com/sagemath/sage/issues/1706",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/1706#issuecomment-8318",
    "user": "https://github.com/ncalexan"
}
```

<a id='comment:5'></a>
If #2050 is applied, this will be fixed (the functionality will by default raise NotImplemented).  Patch is attached to #2050.



---

archive/issue_events_007855.json:
```json
{
    "actor": "https://github.com/ncalexan",
    "created_at": "2008-02-17T00:47:33Z",
    "event": "renamed",
    "issue": "https://github.com/sagemath/sage/issues/1706",
    "rename": {
        "from": "Eigenspaces bug?",
        "to": "[with patch attached to #2050, needs review] Eigenspaces bug?"
    },
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1706#event-7855"
}
```



---

archive/issue_comments_008319.json:
```json
{
    "body": "<a id='comment:7'></a>\nI can confirm that this is taken care of after #2050 is applied.",
    "created_at": "2008-02-27T23:00:35Z",
    "issue": "https://github.com/sagemath/sage/issues/1706",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/1706#issuecomment-8319",
    "user": "https://github.com/mwhansen"
}
```

<a id='comment:7'></a>
I can confirm that this is taken care of after #2050 is applied.



---

archive/issue_events_007856.json:
```json
{
    "actor": "https://github.com/mwhansen",
    "created_at": "2008-02-27T23:00:35Z",
    "event": "renamed",
    "issue": "https://github.com/sagemath/sage/issues/1706",
    "rename": {
        "from": "[with patch attached to #2050, needs review] Eigenspaces bug?",
        "to": "[with patch attached to #2050, postive review] Eigenspaces bug?"
    },
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1706#event-7856"
}
```



---

archive/issue_comments_008320.json:
```json
{
    "body": "<a id='comment:8'></a>\nThe patch for #2050 was merged in 2.10.3.rc0 .",
    "created_at": "2008-02-28T01:13:16Z",
    "issue": "https://github.com/sagemath/sage/issues/1706",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/1706#issuecomment-8320",
    "user": "https://github.com/mwhansen"
}
```

<a id='comment:8'></a>
The patch for #2050 was merged in 2.10.3.rc0 .



---

archive/issue_events_007857.json:
```json
{
    "actor": "https://github.com/mwhansen",
    "created_at": "2008-02-28T01:13:16Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/1706",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1706#event-7857"
}
```
