# Issue 1706: [with patch attached to #2050, postive review] Eigenspaces bug?

archive/issues_001706.json:
```json
{
    "assignees": [
        "https://github.com/williamstein"
    ],
    "body": "<div id=\"comment:0\"></div>\n\nShouldn't the sum of the dimensions be 2?\n\n```\nsage: M = Matrix(CC, [[1,0],[0,1]])\nsage: M\n\n[1.00000000000000                0]\n[               0 1.00000000000000]\nsage: M.eigenspaces()\n\n[\n(1.00000000000000, [\n(1.00000000000000, 0),\n(0, 1.00000000000000)\n]),\n(1.00000000000000, [\n(1.00000000000000, 0),\n(0, 1.00000000000000)\n])\n]\n```\n\nCC:  @ncalexan\n\nComponent: **linear algebra**\n\n_Issue created by migration from https://trac.sagemath.org/ticket/1706_\n\n",
    "closed_at": "2008-02-28T01:13:16Z",
    "created_at": "2008-01-07T05:11:17Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/c%3A%20linear%20algebra",
        "https://github.com/sagemath/sage/labels/p%3A%20major%20/%203",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-2.10.3",
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "[with patch attached to #2050, postive review] Eigenspaces bug?",
    "type": "issue",
    "updated_at": "2023-01-14T13:41:18Z",
    "url": "https://github.com/sagemath/sage/issues/1706",
    "user": "https://github.com/rlmill"
}
```
<div id="comment:0"></div>

Shouldn't the sum of the dimensions be 2?

```
sage: M = Matrix(CC, [[1,0],[0,1]])
sage: M

[1.00000000000000                0]
[               0 1.00000000000000]
sage: M.eigenspaces()

[
(1.00000000000000, [
(1.00000000000000, 0),
(0, 1.00000000000000)
]),
(1.00000000000000, [
(1.00000000000000, 0),
(0, 1.00000000000000)
])
]
```

CC:  @ncalexan

Component: **linear algebra**

_Issue created by migration from https://trac.sagemath.org/ticket/1706_





---

archive/issue_events_016694.json:
```json
{
    "actor": "https://github.com/rlmill",
    "created_at": "2008-01-07T05:11:17Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/1706",
    "label": "https://github.com/sagemath/sage/labels/c%3A%20linear%20algebra",
    "label_color": "0000ff",
    "label_name": "c: linear algebra",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1706#event-16694"
}
```



---

archive/issue_events_016695.json:
```json
{
    "actor": "https://github.com/rlmill",
    "created_at": "2008-01-07T05:11:17Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/1706",
    "label": "https://github.com/sagemath/sage/labels/p%3A%20major%20/%203",
    "label_color": "ffbb00",
    "label_name": "p: major / 3",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1706#event-16695"
}
```



---

archive/issue_events_016696.json:
```json
{
    "actor": "https://github.com/rlmill",
    "created_at": "2008-01-07T05:11:17Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/1706",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "d73a4a",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1706#event-16696"
}
```



---

archive/issue_events_016697.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2008-01-07T05:11:17Z",
    "event": "assigned",
    "issue": "https://github.com/sagemath/sage/issues/1706",
    "subject": "https://github.com/rlmill",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1706#event-16697"
}
```



---

archive/issue_comments_007808.json:
```json
{
    "body": "<div id=\"comment:1\" align=\"right\">comment:1</div>\n\nThe problem is that fcp (factored char poly) returns (x-1)*(x-1), as opposed to (x-1)^2. (That is, it says that there are two distinct factors, each of which happens to be the same.) However, the eigenspaces algorithm implicitly assumes that the terms in self.fcp() are distinct.",
    "created_at": "2008-01-07T05:15:31Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/1706",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/1706#issuecomment-7808",
    "user": "https://github.com/craigcitro"
}
```

<div id="comment:1" align="right">comment:1</div>

The problem is that fcp (factored char poly) returns (x-1)*(x-1), as opposed to (x-1)^2. (That is, it says that there are two distinct factors, each of which happens to be the same.) However, the eigenspaces algorithm implicitly assumes that the terms in self.fcp() are distinct.



---

archive/issue_events_016698.json:
```json
{
    "actor": "https://github.com/malb",
    "created_at": "2008-01-18T16:20:27Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/1706",
    "milestone_number": null,
    "milestone_title": "sage-2.10.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1706#event-16698"
}
```



---

archive/issue_comments_007809.json:
```json
{
    "body": "<div id=\"comment:3\" align=\"right\">comment:3</div>\n\nMore data from Sage 2.9.3 which might shed some light on the problem:\n\n```\nsage: M=Matrix(ZZ,[[1,0],[0,1]])\nsage: M.fcp()\n(x - 1)^2\nsage: M=Matrix(QQ,[[1,0],[0,1]])\nsage: M.fcp()\n(x - 1)^2\nsage: M=Matrix(RR,[[1,0],[0,1]])\nsage: M.fcp()\n(1.00000000000000*x - 1.00000000000000) * (1.00000000000000*x - 1.00000000000000)\nsage: M=Matrix(CC,[[1,0],[0,1]])\nsage: M.fcp()\n(1.00000000000000*x - 1.00000000000000) * (1.00000000000000*x - 1.00000000000000)\n\n```\n\nand \n\n```\nsage: R.<x>=RR[x]\nsage: ((x-1)^2).factor()\n(1.00000000000000*x - 1.00000000000000) * (1.00000000000000*x - 1.00000000000000)\nsage: a=((x-1)^2).factor()\nsage: a\n(1.00000000000000*x - 1.00000000000000) * (1.00000000000000*x - 1.00000000000000)\nsage: a[0]\n(1.00000000000000*x - 1.00000000000000, 1)\nsage: a[0]==a[1]\nTrue\nsage: var('x')\nx\nsage: Q.<x>=QQ[x]\nsage: ((x-1)^2).factor()\n(x - 1)^2\n```",
    "created_at": "2008-01-19T06:58:22Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/1706",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/1706#issuecomment-7809",
    "user": "https://github.com/jasongrout"
}
```

<div id="comment:3" align="right">comment:3</div>

More data from Sage 2.9.3 which might shed some light on the problem:

```
sage: M=Matrix(ZZ,[[1,0],[0,1]])
sage: M.fcp()
(x - 1)^2
sage: M=Matrix(QQ,[[1,0],[0,1]])
sage: M.fcp()
(x - 1)^2
sage: M=Matrix(RR,[[1,0],[0,1]])
sage: M.fcp()
(1.00000000000000*x - 1.00000000000000) * (1.00000000000000*x - 1.00000000000000)
sage: M=Matrix(CC,[[1,0],[0,1]])
sage: M.fcp()
(1.00000000000000*x - 1.00000000000000) * (1.00000000000000*x - 1.00000000000000)

```

and 

```
sage: R.<x>=RR[x]
sage: ((x-1)^2).factor()
(1.00000000000000*x - 1.00000000000000) * (1.00000000000000*x - 1.00000000000000)
sage: a=((x-1)^2).factor()
sage: a
(1.00000000000000*x - 1.00000000000000) * (1.00000000000000*x - 1.00000000000000)
sage: a[0]
(1.00000000000000*x - 1.00000000000000, 1)
sage: a[0]==a[1]
True
sage: var('x')
x
sage: Q.<x>=QQ[x]
sage: ((x-1)^2).factor()
(x - 1)^2
```



---

archive/issue_comments_007810.json:
```json
{
    "body": "<div id=\"comment:4\" align=\"right\">comment:4</div>\n\nSee #2050 for a related ticket, which would likely remove the functionality that is broken above.",
    "created_at": "2008-02-05T05:01:14Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/1706",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/1706#issuecomment-7810",
    "user": "https://github.com/williamstein"
}
```

<div id="comment:4" align="right">comment:4</div>

See #2050 for a related ticket, which would likely remove the functionality that is broken above.



---

archive/issue_comments_007811.json:
```json
{
    "body": "<div id=\"comment:5\" align=\"right\">comment:5</div>\n\nIf #2050 is applied, this will be fixed (the functionality will by default raise NotImplemented).  Patch is attached to #2050.",
    "created_at": "2008-02-17T00:47:33Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/1706",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/1706#issuecomment-7811",
    "user": "https://github.com/ncalexan"
}
```

<div id="comment:5" align="right">comment:5</div>

If #2050 is applied, this will be fixed (the functionality will by default raise NotImplemented).  Patch is attached to #2050.



---

archive/issue_events_016699.json:
```json
{
    "actor": "https://github.com/ncalexan",
    "created_at": "2008-02-17T00:47:33Z",
    "event": "renamed",
    "issue": "https://github.com/sagemath/sage/issues/1706",
    "title_is": "[with patch attached to #2050, needs review] Eigenspaces bug?",
    "title_was": "Eigenspaces bug?",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1706#event-16699"
}
```



---

archive/issue_events_016700.json:
```json
{
    "actor": "https://github.com/mwhansen",
    "created_at": "2008-02-27T23:00:35Z",
    "event": "renamed",
    "issue": "https://github.com/sagemath/sage/issues/1706",
    "title_is": "[with patch attached to #2050, postive review] Eigenspaces bug?",
    "title_was": "[with patch attached to #2050, needs review] Eigenspaces bug?",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1706#event-16700"
}
```



---

archive/issue_comments_007812.json:
```json
{
    "body": "<div id=\"comment:7\" align=\"right\">comment:7</div>\n\nI can confirm that this is taken care of after #2050 is applied.",
    "created_at": "2008-02-27T23:00:35Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/1706",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/1706#issuecomment-7812",
    "user": "https://github.com/mwhansen"
}
```

<div id="comment:7" align="right">comment:7</div>

I can confirm that this is taken care of after #2050 is applied.



---

archive/issue_events_016701.json:
```json
{
    "actor": "https://github.com/mwhansen",
    "created_at": "2008-02-28T01:13:16Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/1706",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1706#event-16701"
}
```



---

archive/issue_comments_007813.json:
```json
{
    "body": "<div id=\"comment:8\" align=\"right\">comment:8</div>\n\nThe patch for #2050 was merged in 2.10.3.rc0 .",
    "created_at": "2008-02-28T01:13:16Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/1706",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/1706#issuecomment-7813",
    "user": "https://github.com/mwhansen"
}
```

<div id="comment:8" align="right">comment:8</div>

The patch for #2050 was merged in 2.10.3.rc0 .
