# Issue 1738: [with patch] fraction field __pow__ doesn't handle negative exp. elegantly

archive/issues_001738.json:
```json
{
    "body": "Negative exponents put fraction field elements in the denominator of a fraction field element.\n\n```\nsage: R.<x>=ZZ[]\nsage: (1/x)^-3\n1/(1/x^3)\n```\n\nWith the patch:\n\n```\nsage: R.<x>=ZZ[]\nsage: (1/x)^-3\nx^3\n```\n \n\nAssignee: @williamstein\n\nResolution: duplicate\n\nIssue created by migration from https://trac.sagemath.org/ticket/1738\n\n",
    "closed_at": "2008-01-16T22:05:40Z",
    "created_at": "2008-01-10T01:49:26Z",
    "labels": [
        "component: algebraic geometry",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-2.10",
    "title": "[with patch] fraction field __pow__ doesn't handle negative exp. elegantly",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/1738",
    "user": "https://trac.sagemath.org/admin/accounts/users/jbmohler"
}
```
Negative exponents put fraction field elements in the denominator of a fraction field element.

```
sage: R.<x>=ZZ[]
sage: (1/x)^-3
1/(1/x^3)
```

With the patch:

```
sage: R.<x>=ZZ[]
sage: (1/x)^-3
x^3
```
 

Assignee: @williamstein

Resolution: duplicate

Issue created by migration from https://trac.sagemath.org/ticket/1738





---

archive/issue_comments_011822.json:
```json
{
    "body": "<a id='comment:1'></a>Attachment [fraction_field_pow.patch](tarball://root/attachments/some-uuid/ticket1738/fraction_field_pow.patch) by @williamstein created at 2008-01-10 03:43:39\n\nIt looks good to me except change the somewhat too verbose\n\n```\n  sage: x = PolynomialRing(RationalField(),'x').gen() \n```\nto one of the following (take your pick):\n\n```\n  sage: x = polygen(QQ, 'x')\n```\nor \n\n```\n  sage: R.<x> = QQ[]\n```\nor \n\n```\n  sage: x = PolynomialRing(QQ,'x').gen()\n```\n\nI think it is important that the docstrings give illustrations of good usage of Sage.",
    "created_at": "2008-01-10T03:43:39Z",
    "issue": "https://github.com/sagemath/sagetest/issues/1738",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/1738#issuecomment-11822",
    "user": "https://github.com/williamstein"
}
```

<a id='comment:1'></a>Attachment [fraction_field_pow.patch](tarball://root/attachments/some-uuid/ticket1738/fraction_field_pow.patch) by @williamstein created at 2008-01-10 03:43:39

It looks good to me except change the somewhat too verbose

```
  sage: x = PolynomialRing(RationalField(),'x').gen() 
```
to one of the following (take your pick):

```
  sage: x = polygen(QQ, 'x')
```
or 

```
  sage: R.<x> = QQ[]
```
or 

```
  sage: x = PolynomialRing(QQ,'x').gen()
```

I think it is important that the docstrings give illustrations of good usage of Sage.



---

archive/issue_comments_011823.json:
```json
{
    "body": "Resolution: duplicate",
    "created_at": "2008-01-16T22:05:40Z",
    "issue": "https://github.com/sagemath/sagetest/issues/1738",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/1738#issuecomment-11823",
    "user": "https://github.com/mwhansen"
}
```

Resolution: duplicate



---

archive/issue_events_004216.json:
```json
{
    "actor": "https://github.com/mwhansen",
    "created_at": "2008-01-16T22:05:40Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/1738",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/1738#event-4216"
}
```



---

archive/issue_comments_011824.json:
```json
{
    "body": "<a id='comment:3'></a>This is a duplicate of #1786.  I didn't realize that this was indeed the issue when opening #1786.",
    "created_at": "2008-01-16T22:06:19Z",
    "issue": "https://github.com/sagemath/sagetest/issues/1738",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/1738#issuecomment-11824",
    "user": "https://github.com/mwhansen"
}
```

<a id='comment:3'></a>This is a duplicate of #1786.  I didn't realize that this was indeed the issue when opening #1786.
