# Issue 1738: fraction field __pow__ doesn't handle negative exp. elegantly

archive/issues_001738.json:
```json
{
    "body": "Negative exponents put fraction field elements in the denominator of a fraction field element.\n\n```\nsage: R.<x>=ZZ[]\nsage: (1/x)^-3\n1/(1/x^3)\n```\n\nWith the patch:\n\n```\nsage: R.<x>=ZZ[]\nsage: (1/x)^-3\nx^3\n```\n \n\n**Assignee:** @williamstein\n\nIssue created by migration from https://trac.sagemath.org/ticket/1738\n\n",
    "closed_at": "2008-01-16T22:05:40Z",
    "created_at": "2008-01-10T01:49:26Z",
    "labels": [
        "component: algebraic geometry",
        "bug",
        "duplicate"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-2.10",
    "title": "fraction field __pow__ doesn't handle negative exp. elegantly",
    "type": "issue",
    "url": "https://github.com/sagemath/sage/issues/1738",
    "user": "https://trac.sagemath.org/admin/accounts/users/jbmohler"
}
```
Negative exponents put fraction field elements in the denominator of a fraction field element.

```
sage: R.<x>=ZZ[]
sage: (1/x)^-3
1/(1/x^3)
```

With the patch:

```
sage: R.<x>=ZZ[]
sage: (1/x)^-3
x^3
```
 

**Assignee:** @williamstein

Issue created by migration from https://trac.sagemath.org/ticket/1738





---

archive/attachments_001354.json:
```json
{
    "asset_content_type": "application/octet-stream",
    "asset_name": "fraction_field_pow.patch",
    "asset_url": "tarball://root/attachments/ticket1738/fraction_field_pow.patch",
    "created_at": "2008-01-10T03:43:39Z",
    "issue": "https://github.com/sagemath/sage/issues/1738",
    "type": "attachment",
    "url": "https://github.com/sagemath/sage/files/ticket1738/fraction_field_pow.patch",
    "user": "https://github.com/williamstein"
}
```



---

archive/issue_comments_008457.json:
```json
{
    "body": "<a id='comment:1'></a>\nAttachment [fraction_field_pow.patch](https://github.com/sagemath/sage/files/ticket1738/fraction_field_pow.patch) by @williamstein created at 2008-01-10 03:43:39\n\nIt looks good to me except change the somewhat too verbose\n\n```\n  sage: x = PolynomialRing(RationalField(),'x').gen() \n```\nto one of the following (take your pick):\n\n```\n  sage: x = polygen(QQ, 'x')\n```\nor \n\n```\n  sage: R.<x> = QQ[]\n```\nor \n\n```\n  sage: x = PolynomialRing(QQ,'x').gen()\n```\n\nI think it is important that the docstrings give illustrations of good usage of Sage.",
    "created_at": "2008-01-10T03:43:39Z",
    "issue": "https://github.com/sagemath/sage/issues/1738",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/1738#issuecomment-8457",
    "user": "https://github.com/williamstein"
}
```

<a id='comment:1'></a>
Attachment [fraction_field_pow.patch](https://github.com/sagemath/sage/files/ticket1738/fraction_field_pow.patch) by @williamstein created at 2008-01-10 03:43:39

It looks good to me except change the somewhat too verbose

```
  sage: x = PolynomialRing(RationalField(),'x').gen() 
```
to one of the following (take your pick):

```
  sage: x = polygen(QQ, 'x')
```
or 

```
  sage: R.<x> = QQ[]
```
or 

```
  sage: x = PolynomialRing(QQ,'x').gen()
```

I think it is important that the docstrings give illustrations of good usage of Sage.



---

archive/issue_events_008002.json:
```json
{
    "actor": "https://github.com/mwhansen",
    "created_at": "2008-01-16T22:05:40Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/1738",
    "label": "duplicate",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1738#event-8002"
}
```



---

archive/issue_events_008003.json:
```json
{
    "actor": "https://github.com/mwhansen",
    "created_at": "2008-01-16T22:05:40Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/1738",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1738#event-8003"
}
```



---

archive/issue_comments_008458.json:
```json
{
    "body": "<a id='comment:3'></a>\nThis is a duplicate of #1786.  I didn't realize that this was indeed the issue when opening #1786.",
    "created_at": "2008-01-16T22:06:19Z",
    "issue": "https://github.com/sagemath/sage/issues/1738",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/1738#issuecomment-8458",
    "user": "https://github.com/mwhansen"
}
```

<a id='comment:3'></a>
This is a duplicate of #1786.  I didn't realize that this was indeed the issue when opening #1786.
