# Issue 1738: fraction field __pow__ doesn't handle negative exp. elegantly

archive/issues_001738.json:
```json
{
    "assignees": [],
    "body": "Negative exponents put fraction field elements in the denominator of a fraction field element.\n\n```\nsage: R.<x>=ZZ[]\nsage: (1/x)^-3\n1/(1/x^3)\n```\n\nWith the patch:\n\n```\nsage: R.<x>=ZZ[]\nsage: (1/x)^-3\nx^3\n```\n \n\n**Assignee:** @williamstein\n\nIssue created by migration from https://trac.sagemath.org/ticket/1738\n\n",
    "closed_at": "2008-01-16T22:05:40Z",
    "created_at": "2008-01-10T01:49:26Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20algebraic%20geometry",
        "https://github.com/sagemath/sage/labels/bug",
        "https://github.com/sagemath/sage/labels/duplicate"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-2.10",
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "fraction field __pow__ doesn't handle negative exp. elegantly",
    "type": "issue",
    "updated_at": "2008-01-16T22:06:19Z",
    "url": "https://github.com/sagemath/sage/issues/1738",
    "user": "https://github.com/sagetrac-jbmohler"
}
```
Negative exponents put fraction field elements in the denominator of a fraction field element.

```
sage: R.<x>=ZZ[]
sage: (1/x)^-3
1/(1/x^3)
```

With the patch:

```
sage: R.<x>=ZZ[]
sage: (1/x)^-3
x^3
```
 

**Assignee:** @williamstein

Issue created by migration from https://trac.sagemath.org/ticket/1738





---

archive/issue_comments_008461.json:
```json
{
    "body": "<a id='comment:1'></a>\n**Attachment:** [fraction_field_pow.patch.gz](https://github.com/sagemath/sage/files/ticket1738/fraction_field_pow.patch.gz)\n\nIt looks good to me except change the somewhat too verbose\n\n```\n  sage: x = PolynomialRing(RationalField(),'x').gen() \n```\nto one of the following (take your pick):\n\n```\n  sage: x = polygen(QQ, 'x')\n```\nor \n\n```\n  sage: R.<x> = QQ[]\n```\nor \n\n```\n  sage: x = PolynomialRing(QQ,'x').gen()\n```\n\nI think it is important that the docstrings give illustrations of good usage of Sage.",
    "created_at": "2008-01-10T03:43:39Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/1738",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/1738#issuecomment-8461",
    "user": "https://github.com/williamstein"
}
```

<a id='comment:1'></a>
**Attachment:** [fraction_field_pow.patch.gz](https://github.com/sagemath/sage/files/ticket1738/fraction_field_pow.patch.gz)

It looks good to me except change the somewhat too verbose

```
  sage: x = PolynomialRing(RationalField(),'x').gen() 
```
to one of the following (take your pick):

```
  sage: x = polygen(QQ, 'x')
```
or 

```
  sage: R.<x> = QQ[]
```
or 

```
  sage: x = PolynomialRing(QQ,'x').gen()
```

I think it is important that the docstrings give illustrations of good usage of Sage.



---

archive/issue_events_008002.json:
```json
{
    "actor": "https://github.com/mwhansen",
    "created_at": "2008-01-16T22:05:40Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/1738",
    "label": "https://github.com/sagemath/sage/labels/duplicate",
    "label_color": "008080",
    "label_name": "duplicate",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1738#event-8002"
}
```



---

archive/issue_events_008003.json:
```json
{
    "actor": "https://github.com/mwhansen",
    "created_at": "2008-01-16T22:05:40Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/1738",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1738#event-8003"
}
```



---

archive/issue_comments_008462.json:
```json
{
    "body": "<a id='comment:3'></a>\nThis is a duplicate of #1786.  I didn't realize that this was indeed the issue when opening #1786.",
    "created_at": "2008-01-16T22:06:19Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/1738",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/1738#issuecomment-8462",
    "user": "https://github.com/mwhansen"
}
```

<a id='comment:3'></a>
This is a duplicate of #1786.  I didn't realize that this was indeed the issue when opening #1786.
