# Issue 1903: elliptic curve period lattice Omega computation is always wrong the first time

archive/issues_001903.json:
```json
{
    "assignees": [
        "https://github.com/williamstein"
    ],
    "body": "<div id=\"comment:0\"></div>\n\nCheck this out. The first time I define an elliptic curve and compute\nthe period lattice, it always gives exactly the same precision, irregardless\nof the prec input.  Subsequent times give possibly correct precision.\n\n```\nsage: E = EllipticCurve('37a1')\nsage: Lambda = E.period_lattice()\nsage: Lambda.omega(200)\n5.986917292463919259664019958905016355595167582740265970681046757126500713973\nsage: Lambda.omega(100)\n5.986917292463919259664019958905016355595167582740265970681046757126500713973365808240788134794102946871681054209894576388288774474744050508750753342186522750608666501193049250432894613814538902149811561273122089156345163427036485586852626497796017388487604174086333863088928480309531169016955719094015913439555469220814610215254636002519172466378969093006402072130793705592258575075486444380127839934596631023678346217719271793891480048154202569023527149733047069754453169881844338046858668017675435309133044249015102196051155809873806168636730720956496483885055762761489226969877518223414185587257206155078668194515311004693366757955307567080310433588840427191375819004300607360635859398481204844344393095079959927352487057219058204337964232422372592187511419483538297310727527566062827503999277428879770774843525427663851230372200222109074686953242505297927911230425946419543016023564723516967617433213851189659056134170443836653494765813269\nsage: E = EllipticCurve('37a1')\nsage: Lambda = E.period_lattice()\nsage: Lambda.omega(500)\n5.986917292463919259664019958905016355595167582740265970681046757126500713973\ns}}}\n\nAlso, It would be good for Lambda to have a real_period() method that is the\nsame as omega. \n```\n\nComponent: **number theory**\n\n_Issue created by migration from https://trac.sagemath.org/ticket/1903_\n\n",
    "closed_at": "2008-09-09T14:09:35Z",
    "created_at": "2008-01-24T02:36:13Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/c%3A%20number%20theory",
        "https://github.com/sagemath/sage/labels/p%3A%20major%20/%203",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-3.1.2",
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "elliptic curve period lattice Omega computation is always wrong the first time",
    "type": "issue",
    "updated_at": "2008-09-09T14:09:35Z",
    "url": "https://github.com/sagemath/sage/issues/1903",
    "user": "https://github.com/williamstein"
}
```
<div id="comment:0"></div>

Check this out. The first time I define an elliptic curve and compute
the period lattice, it always gives exactly the same precision, irregardless
of the prec input.  Subsequent times give possibly correct precision.

```
sage: E = EllipticCurve('37a1')
sage: Lambda = E.period_lattice()
sage: Lambda.omega(200)
5.986917292463919259664019958905016355595167582740265970681046757126500713973
sage: Lambda.omega(100)
5.986917292463919259664019958905016355595167582740265970681046757126500713973365808240788134794102946871681054209894576388288774474744050508750753342186522750608666501193049250432894613814538902149811561273122089156345163427036485586852626497796017388487604174086333863088928480309531169016955719094015913439555469220814610215254636002519172466378969093006402072130793705592258575075486444380127839934596631023678346217719271793891480048154202569023527149733047069754453169881844338046858668017675435309133044249015102196051155809873806168636730720956496483885055762761489226969877518223414185587257206155078668194515311004693366757955307567080310433588840427191375819004300607360635859398481204844344393095079959927352487057219058204337964232422372592187511419483538297310727527566062827503999277428879770774843525427663851230372200222109074686953242505297927911230425946419543016023564723516967617433213851189659056134170443836653494765813269
sage: E = EllipticCurve('37a1')
sage: Lambda = E.period_lattice()
sage: Lambda.omega(500)
5.986917292463919259664019958905016355595167582740265970681046757126500713973
s}}}

Also, It would be good for Lambda to have a real_period() method that is the
same as omega. 
```

Component: **number theory**

_Issue created by migration from https://trac.sagemath.org/ticket/1903_





---

archive/issue_events_018827.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2008-01-24T02:36:13Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/1903",
    "milestone_number": null,
    "milestone_title": "sage-3.1.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1903#event-18827"
}
```



---

archive/issue_events_018828.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2008-01-24T02:36:13Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/1903",
    "label": "https://github.com/sagemath/sage/labels/c%3A%20number%20theory",
    "label_color": "0000ff",
    "label_name": "c: number theory",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1903#event-18828"
}
```



---

archive/issue_events_018829.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2008-01-24T02:36:13Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/1903",
    "label": "https://github.com/sagemath/sage/labels/p%3A%20major%20/%203",
    "label_color": "ffbb00",
    "label_name": "p: major / 3",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1903#event-18829"
}
```



---

archive/issue_events_018830.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2008-01-24T02:36:13Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/1903",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "d73a4a",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1903#event-18830"
}
```



---

archive/issue_events_018831.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2008-01-24T02:36:13Z",
    "event": "assigned",
    "issue": "https://github.com/sagemath/sage/issues/1903",
    "subject": "https://github.com/williamstein",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1903#event-18831"
}
```



---

archive/issue_comments_008739.json:
```json
{
    "body": "<div id=\"comment:1\" align=\"right\">comment:1</div>\n\nThis was duplicated in #3954 which is closed, so this can be, unless you want to hold out for real_period being a synonym for omega...",
    "created_at": "2008-09-04T16:32:20Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/1903",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/1903#issuecomment-8739",
    "user": "https://github.com/JohnCremona"
}
```

<div id="comment:1" align="right">comment:1</div>

This was duplicated in #3954 which is closed, so this can be, unless you want to hold out for real_period being a synonym for omega...



---

archive/issue_comments_008740.json:
```json
{
    "body": "<div id=\"comment:2\" align=\"right\">comment:2</div>\n\nThis really can be closed now since I added the real_period function recently:\n\n```\n----------------------------------------------------------------------\n| SAGE Version 3.1.2.rc1, Release Date: 2008-09-09                   |\n| Type notebook() for the GUI, and license() for information.        |\n----------------------------------------------------------------------\n\nsage: E = EllipticCurve('37a1')\nsage: L = E.period_lattice()\nsage: L.real_period()\n2.99345864623195963\nsage: L.omega(100)\n5.9869172924639192596640199589050163556\nsage: L.omega(100)\n5.9869172924639192596640199589050163556\nsage: L.omega(200)\n5.986917292463919259664019958905016355595167582740265970681046757127\nsage: L.omega(200)\n5.986917292463919259664019958905016355595167582740265970681046757127\nsage: L.omega(500)\n5.98691729246391925966401995890501635559516758274026597068104675712650071397336580824078813479410294687168105420989457638828877447474405050875075334218652\nsage: L.omega(500)\n5.98691729246391925966401995890501635559516758274026597068104675712650071397336580824078813479410294687168105420989457638828877447474405050875075334218652\n```\n\nI am changing it to \"resolved as fixed\";  hope that's ok.",
    "created_at": "2008-09-09T14:09:35Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/1903",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/1903#issuecomment-8740",
    "user": "https://github.com/JohnCremona"
}
```

<div id="comment:2" align="right">comment:2</div>

This really can be closed now since I added the real_period function recently:

```
----------------------------------------------------------------------
| SAGE Version 3.1.2.rc1, Release Date: 2008-09-09                   |
| Type notebook() for the GUI, and license() for information.        |
----------------------------------------------------------------------

sage: E = EllipticCurve('37a1')
sage: L = E.period_lattice()
sage: L.real_period()
2.99345864623195963
sage: L.omega(100)
5.9869172924639192596640199589050163556
sage: L.omega(100)
5.9869172924639192596640199589050163556
sage: L.omega(200)
5.986917292463919259664019958905016355595167582740265970681046757127
sage: L.omega(200)
5.986917292463919259664019958905016355595167582740265970681046757127
sage: L.omega(500)
5.98691729246391925966401995890501635559516758274026597068104675712650071397336580824078813479410294687168105420989457638828877447474405050875075334218652
sage: L.omega(500)
5.98691729246391925966401995890501635559516758274026597068104675712650071397336580824078813479410294687168105420989457638828877447474405050875075334218652
```

I am changing it to "resolved as fixed";  hope that's ok.



---

archive/issue_events_018832.json:
```json
{
    "actor": "https://github.com/JohnCremona",
    "created_at": "2008-09-09T14:09:35Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/1903",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/1903#event-18832"
}
```
