# Issue 1983: [with patch; positive review] change 0^0, for 0 a Sage integer, to evaluate to 1 for consistency with Python, PARI, Magma, Maple, MPFR, GMP, etc.

archive/issues_001983.json:
```json
{
    "body": "As justification that this is for *consistency*, everybody defines 0<sup>0</sup> to be 1, except Mathematica:\n\n```\n\nsage: gp('0^0')\n1\nsage: magma('0^0')\n1\nsage: mathematica('0^0')\n...\nMathematica ERROR:\nPower::indet: Indeterminate expression 0  encountered.\nsage: maple('0^0')\n1\nsage: int(0)^int(0)\n1\nsage: float(0)^float(0)\n1.0\nsage: 0.0^0.0\n1.00000000000000\n```\n\n\n\nAssignee: somebody\n\nResolution: fixed\n\nIssue created by migration from https://trac.sagemath.org/ticket/1983\n\n",
    "closed_at": "2008-02-01T05:02:43Z",
    "created_at": "2008-01-30T13:35:24Z",
    "labels": [
        "component: basic arithmetic",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-2.10.1",
    "title": "[with patch; positive review] change 0^0, for 0 a Sage integer, to evaluate to 1 for consistency with Python, PARI, Magma, Maple, MPFR, GMP, etc.",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/1983",
    "user": "https://github.com/williamstein"
}
```
As justification that this is for *consistency*, everybody defines 0<sup>0</sup> to be 1, except Mathematica:

```

sage: gp('0^0')
1
sage: magma('0^0')
1
sage: mathematica('0^0')
...
Mathematica ERROR:
Power::indet: Indeterminate expression 0  encountered.
sage: maple('0^0')
1
sage: int(0)^int(0)
1
sage: float(0)^float(0)
1.0
sage: 0.0^0.0
1.00000000000000
```



Assignee: somebody

Resolution: fixed

Issue created by migration from https://trac.sagemath.org/ticket/1983





---

archive/issue_comments_013833.json:
```json
{
    "body": "Attachment [trac-1983-0to0.patch](tarball://root/attachments/some-uuid/ticket1983/trac-1983-0to0.patch) by @williamstein created at 2008-01-30 13:36:17",
    "created_at": "2008-01-30T13:36:17Z",
    "issue": "https://github.com/sagemath/sagetest/issues/1983",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/1983#issuecomment-13833",
    "user": "https://github.com/williamstein"
}
```

Attachment [trac-1983-0to0.patch](tarball://root/attachments/some-uuid/ticket1983/trac-1983-0to0.patch) by @williamstein created at 2008-01-30 13:36:17



---

archive/issue_comments_013834.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -1,4 +1,4 @@\n-As justification that this is for *consistency*, everybody defines 0^0 to be 1, except Mathematica:\n+As justification that this is for *consistency*, everybody defines 0<sup>0</sup> to be 1, except Mathematica:\n \n ```\n \n``````\n",
    "created_at": "2008-01-30T14:19:24Z",
    "issue": "https://github.com/sagemath/sagetest/issues/1983",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/1983#issuecomment-13834",
    "user": "https://github.com/malb"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -1,4 +1,4 @@
-As justification that this is for *consistency*, everybody defines 0^0 to be 1, except Mathematica:
+As justification that this is for *consistency*, everybody defines 0<sup>0</sup> to be 1, except Mathematica:
 
 ```
 
``````




---

archive/issue_comments_013835.json:
```json
{
    "body": "<a id='comment:2'></a>\nThis works as described.",
    "created_at": "2008-02-01T05:00:14Z",
    "issue": "https://github.com/sagemath/sagetest/issues/1983",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/1983#issuecomment-13835",
    "user": "https://trac.sagemath.org/admin/accounts/users/jkantor"
}
```

<a id='comment:2'></a>
This works as described.



---

archive/issue_comments_013836.json:
```json
{
    "body": "Resolution: fixed",
    "created_at": "2008-02-01T05:02:43Z",
    "issue": "https://github.com/sagemath/sagetest/issues/1983",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/1983#issuecomment-13836",
    "user": "https://trac.sagemath.org/admin/accounts/users/mabshoff"
}
```

Resolution: fixed



---

archive/issue_comments_013837.json:
```json
{
    "body": "<a id='comment:3'></a>\nMerged in Sage 2.10.1.rc4",
    "created_at": "2008-02-01T05:02:43Z",
    "issue": "https://github.com/sagemath/sagetest/issues/1983",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/1983#issuecomment-13837",
    "user": "https://trac.sagemath.org/admin/accounts/users/mabshoff"
}
```

<a id='comment:3'></a>
Merged in Sage 2.10.1.rc4



---

archive/issue_events_004787.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/mabshoff",
    "created_at": "2008-02-01T05:02:43Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/1983",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/1983#event-4787"
}
```



---

archive/issue_events_004788.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/mabshoff",
    "created_at": "2008-02-02T02:06:38Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/1983",
    "milestone": "sage-2.10.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/1983#event-4788"
}
```



---

archive/issue_comments_013838.json:
```json
{
    "body": "Changing upstream from \"\" to \"N/A\"",
    "created_at": "2015-09-06T15:39:55Z",
    "issue": "https://github.com/sagemath/sagetest/issues/1983",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/1983#issuecomment-13838",
    "user": "https://github.com/fchapoton"
}
```

Changing upstream from "" to "N/A"



---

archive/issue_comments_013839.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -9,7 +9,6 @@\n sage: mathematica('0^0')\n ...\n Mathematica ERROR:\n-\t                                        0\n Power::indet: Indeterminate expression 0  encountered.\n sage: maple('0^0')\n 1\n``````\n",
    "created_at": "2015-09-06T15:39:55Z",
    "issue": "https://github.com/sagemath/sagetest/issues/1983",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/1983#issuecomment-13839",
    "user": "https://github.com/fchapoton"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -9,7 +9,6 @@
 sage: mathematica('0^0')
 ...
 Mathematica ERROR:
-	                                        0
 Power::indet: Indeterminate expression 0  encountered.
 sage: maple('0^0')
 1
``````

