# Issue 1983: change 0^0, for 0 a Sage integer, to evaluate to 1 for consistency with Python, PARI, Magma, Maple, MPFR, GMP, etc.

archive/issues_001983.json:
```json
{
    "body": "As justification that this is for *consistency*, everybody defines 0<sup>0</sup> to be 1, except Mathematica:\n\n```\n\nsage: gp('0^0')\n1\nsage: magma('0^0')\n1\nsage: mathematica('0^0')\n...\nMathematica ERROR:\nPower::indet: Indeterminate expression 0  encountered.\nsage: maple('0^0')\n1\nsage: int(0)^int(0)\n1\nsage: float(0)^float(0)\n1.0\nsage: 0.0^0.0\n1.00000000000000\n```\n\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/1983\n\n",
    "closed_at": "2008-02-01T05:02:43Z",
    "created_at": "2008-01-30T13:35:24Z",
    "labels": [
        "component: basic arithmetic",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-2.10.1",
    "title": "change 0^0, for 0 a Sage integer, to evaluate to 1 for consistency with Python, PARI, Magma, Maple, MPFR, GMP, etc.",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/1983",
    "user": "https://github.com/williamstein"
}
```
As justification that this is for *consistency*, everybody defines 0<sup>0</sup> to be 1, except Mathematica:

```

sage: gp('0^0')
1
sage: magma('0^0')
1
sage: mathematica('0^0')
...
Mathematica ERROR:
Power::indet: Indeterminate expression 0  encountered.
sage: maple('0^0')
1
sage: int(0)^int(0)
1
sage: float(0)^float(0)
1.0
sage: 0.0^0.0
1.00000000000000
```



Issue created by migration from https://trac.sagemath.org/ticket/1983





---

archive/attachments_001641.json:
```json
{
    "asset_content_type": "application/octet-stream",
    "asset_name": "trac-1983-0to0.patch",
    "asset_url": "tarball://root/attachments/some-uuid/ticket1983/trac-1983-0to0.patch",
    "created_at": "2008-01-30T13:36:17Z",
    "issue": "https://github.com/sagemath/sagetest/issues/1983",
    "type": "attachment",
    "url": "https://github.com/assets/some-id/some-uuid.patch",
    "user": "https://github.com/williamstein"
}
```



---

archive/issue_comments_011860.json:
```json
{
    "body": "",
    "created_at": "2008-01-30T13:36:17Z",
    "issue": "https://github.com/sagemath/sagetest/issues/1983",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/1983#issuecomment-11860",
    "user": "https://github.com/williamstein"
}
```





---

archive/issue_comments_011861.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -1,4 +1,4 @@\n-As justification that this is for *consistency*, everybody defines 0^0 to be 1, except Mathematica:\n+As justification that this is for *consistency*, everybody defines 0<sup>0</sup> to be 1, except Mathematica:\n \n ```\n \n``````\n",
    "created_at": "2008-01-30T14:19:24Z",
    "issue": "https://github.com/sagemath/sagetest/issues/1983",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/1983#issuecomment-11861",
    "user": "https://github.com/malb"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -1,4 +1,4 @@
-As justification that this is for *consistency*, everybody defines 0^0 to be 1, except Mathematica:
+As justification that this is for *consistency*, everybody defines 0<sup>0</sup> to be 1, except Mathematica:
 
 ```
 
``````




---

archive/issue_comments_011862.json:
```json
{
    "body": "<a id='comment:2'></a>\nThis works as described.",
    "created_at": "2008-02-01T05:00:14Z",
    "issue": "https://github.com/sagemath/sagetest/issues/1983",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/1983#issuecomment-11862",
    "user": "https://trac.sagemath.org/admin/accounts/users/jkantor"
}
```

<a id='comment:2'></a>
This works as described.



---

archive/issue_comments_011863.json:
```json
{
    "body": "**Changing status** from needs_review to positive_review.",
    "created_at": "2008-02-01T05:00:14Z",
    "issue": "https://github.com/sagemath/sagetest/issues/1983",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/1983#issuecomment-11863",
    "user": "https://trac.sagemath.org/admin/accounts/users/jkantor"
}
```

**Changing status** from needs_review to positive_review.



---

archive/issue_comments_011864.json:
```json
{
    "body": "<a id='comment:3'></a>\nMerged in Sage 2.10.1.rc4",
    "created_at": "2008-02-01T05:02:43Z",
    "issue": "https://github.com/sagemath/sagetest/issues/1983",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/1983#issuecomment-11864",
    "user": "https://trac.sagemath.org/admin/accounts/users/mabshoff"
}
```

<a id='comment:3'></a>
Merged in Sage 2.10.1.rc4



---

archive/issue_events_005893.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/mabshoff",
    "created_at": "2008-02-01T05:02:43Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/1983",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/1983#event-5893"
}
```



---

archive/issue_events_005894.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/mabshoff",
    "created_at": "2008-02-02T02:06:38Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/1983",
    "milestone": "sage-2.10.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/1983#event-5894"
}
```



---

archive/issue_comments_011865.json:
```json
{
    "body": "**Upstream:** N/A",
    "created_at": "2015-09-06T15:39:55Z",
    "issue": "https://github.com/sagemath/sagetest/issues/1983",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/1983#issuecomment-11865",
    "user": "https://github.com/fchapoton"
}
```

**Upstream:** N/A



---

archive/issue_comments_011866.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -9,7 +9,6 @@\n sage: mathematica('0^0')\n ...\n Mathematica ERROR:\n-\t                                        0\n Power::indet: Indeterminate expression 0  encountered.\n sage: maple('0^0')\n 1\n``````\n",
    "created_at": "2015-09-06T15:39:55Z",
    "issue": "https://github.com/sagemath/sagetest/issues/1983",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/1983#issuecomment-11866",
    "user": "https://github.com/fchapoton"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -9,7 +9,6 @@
 sage: mathematica('0^0')
 ...
 Mathematica ERROR:
-	                                        0
 Power::indet: Indeterminate expression 0  encountered.
 sage: maple('0^0')
 1
``````

