# Issue 22376: Rewrite kruskal() to use yield

Issue created by migration from https://trac.sagemath.org/ticket/22613

Original creator: epilys

Original creation time: 2017-03-15 22:01:03

Convert kruskal() into a generator, eg:


```
sage: from sage.graphs.spanning_tree import kruskal
sage: G = Graph([[0,1,1],[1,2,1],[2,0,10]], weighted=True)
sage: k = kruskal(G, check=True)
sage: k
<generator object at 0x7f5ba76dfe60>
sage: k.next()
(0, 1, 1)
sage: k.next()
(1, 2, 1)
sage: k.next()
---------------------------------------------------------------------------
StopIteration                             Traceback (most recent call last)
<ipython-input-16-3790cf7939d1> in <module>()
----> 1 k.next()

StopIteration: 
sage: list(kruskal(G, check=True))
[(0, 1, 1), (1, 2, 1)]

```




---

Comment by epilys created at 2017-03-15 22:06:00

Changing status from new to needs_review.


---

Comment by epilys created at 2017-03-15 22:06:00

New commits:


---

Comment by dcoudert created at 2017-03-16 13:42:15

Changing status from needs_review to needs_work.


---

Comment by dcoudert created at 2017-03-16 13:42:15

// I have changed my comments since I was not on the correct version.

Something goes wrong. This should not be the expected behavior since 

```
sage: from sage.graphs.spanning_tree import kruskal
sage: G = graphs.PetersenGraph()
sage: kruskal(G)
<generator object at 0x1d2ff2950>
sage: list(kruskal(G))

[(0, 1, None),
 (0, 4, None),
 (0, 5, None),
 (1, 2, None),
 (1, 6, None),
 (2, 3, None),
 (2, 7, None),
 (3, 8, None),
 (4, 9, None)]
sage: G = 2*G
sage: list(kruskal(G))

[(0, 1, None),
 (0, 4, None),
 (0, 5, None),
 (1, 2, None),
 (1, 6, None),
 (2, 3, None),
 (2, 7, None),
 (3, 8, None),
 (4, 9, None),
 (10, 11, None),
 (10, 14, None),
 (10, 15, None),
 (11, 12, None),
 (11, 16, None),
 (12, 13, None),
 (12, 17, None),
 (13, 18, None),
 (14, 19, None)]
sage: G.is_connected()
False
sage: G.spanning_trees()
[]
sage: list(kruskal(Graph()))
[]
```


Also, the text `A generator of the edges of a minimum spanning tree of ``G``, if one exists,
otherwise returns the empty list.` is not appropriate since a generator might return StopIteration but not an empty list.

Don't forget to put your name as author.


---

Comment by dcoudert created at 2019-03-22 15:21:28

This has been done in #26614, so I change the milestone to `sage-duplicate/invalid/wontfix`.


---

Comment by dcoudert created at 2020-08-10 12:32:06

Changing status from needs_work to positive_review.


---

Comment by dcoudert created at 2020-08-10 12:32:06

This ticket can be closed.


---

Comment by chapoton created at 2020-08-15 06:48:57

Resolution: duplicate
