# Issue 19947: Comparison of number field elements embedded into RIF fails

Issue created by migration from Trac.

Original creator: mkoeppe

Original creation time: 2016-03-10 07:04:33

CC:  tmonteil jj sstarosta gagern mkoeppe vdelecroix

This is a follow-up on #17830, which made this possible:

```
sage: x = polygen(ZZ)
sage: K.<cbrt2> = NumberField(x^3 - 2, embedding=AA.polynomial_root(x^3-2, RIF(0,3)))
sage: 6064/4813 < cbrt2 < 90325/71691
True
```


However, if I embed into a RIF instead, the same test fails.

```
sage: x = polygen(ZZ)
sage: K.<cbrt2> = NumberField(x^3 - 2, embedding=RIF(AA.polynomial_root(x^3-2, RIF(0,3))))
sage: 6064/4813 < cbrt2 < 90325/71691
False
```






---

Comment by vdelecroix created at 2016-03-11 20:45:36

I do not think this is a bug.

The (respective to the embedding) comparison code is used only if there is a coercion embedding for which the codomain allows to have arbitrary precision real intervals (right now, only `AA`/`QQbar` but could be extend to `RLF`/`CLF`). I do not mean that it is not feasible to find the corresponding exact embedding from a one into `RIF` one. But I would be against using it.

What is the problem with the behavior in the ticket description?


---

Comment by mmezzarobba created at 2016-03-25 10:43:50

Changing status from new to needs_review.


---

Comment by mmezzarobba created at 2016-03-25 10:43:50

I tend to agree with Vincent.


---

Comment by mkoeppe created at 2016-03-26 02:21:05

Thanks for the discussion; I agree that it's a plausible restriction.

I have added a patch that adds this detail to the documentation of `NumberField`.
----
New commits:


---

Comment by dimpase created at 2016-04-07 15:25:42

a bit of extra doc never hurts.


---

Comment by dimpase created at 2016-04-07 15:25:42

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2016-04-08 00:25:49

Resolution: fixed
