# Issue 15593: extracting coefficient x-1 out of symbolic series wrong

Issue created by migration from Trac.

Original creator: dkrenn

Original creation time: 2014-02-18 10:27:20

Keywords: symbolic, series, coefficient, wrong


```
sage: x.series(x==1,10).coefficient(x-1,0)
x
```

which is wrong. It should be `1`, which can be seen by 

```
sage: x.series(x==1,10)
1 + 1*(x - 1)
```


We also have wrong results here:

```
sage: x.series(x==1,10).coefficient(x-1,1)
0
sage: x.series(x==1,10).coefficient(x-1)
0
```



---

Comment by rws created at 2014-12-25 08:54:13

Also `coefficient` can only deal with monomials: 

```
sage: (x-1).coefficient(x-1)
0
```

Different ticket?
