# Issue 23478: rational matrices ignore transformation=true in echelon form

archive/issues_023478.json:
```json
{
    "body": "CC:  jipilab slelievre\n\nKeywords: days88\n\n\n```\nsage: matrix(ZZ,2,range(4)).echelon_form(transformation=True)\n(\n[2 0]  [-3  1]\n[0 1], [ 1  0]\n)\nsage: matrix(QQ,2,range(4)).echelon_form(transformation=True)\n[1 0]\n[0 1]\n```\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/23715\n\n",
    "created_at": "2017-08-25T16:32:34Z",
    "labels": [
        "linear algebra",
        "major",
        "bug"
    ],
    "title": "rational matrices ignore transformation=true in echelon form",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/23478",
    "user": "vdelecroix"
}
```
CC:  jipilab slelievre

Keywords: days88


```
sage: matrix(ZZ,2,range(4)).echelon_form(transformation=True)
(
[2 0]  [-3  1]
[0 1], [ 1  0]
)
sage: matrix(QQ,2,range(4)).echelon_form(transformation=True)
[1 0]
[0 1]
```


Issue created by migration from https://trac.sagemath.org/ticket/23715





---

archive/issue_comments_329039.json:
```json
{
    "body": "Changing keywords from \"days88\" to \"days88, echelon_form, matrix\".",
    "created_at": "2018-09-11T11:57:14Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23478",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23478#issuecomment-329039",
    "user": "slelievre"
}
```

Changing keywords from "days88" to "days88, echelon_form, matrix".



---

archive/issue_comments_329040.json:
```json
{
    "body": "Related: the documentation for `rref` (reduced row-echelon form) claims that\n\n> All arguments are passed on to :meth:`echelon_form`.\n\nbut it is not the case; in particular `transformation=True` is not passed on!\n\n\n```\nsage: a = matrix(ZZ, [[1, 2, 3], [3, 2, 1], [0, 1, 0]])\nsage: a.rref(transformation=True)\n[1 0 0]\n[0 1 0]\n[0 0 1]\nsage: a.echelon_form(transformation=True)\n(\n[1 0 3]  [ 1  0 -2]\n[0 1 0]  [ 0  0  1]\n[0 0 8], [ 3 -1 -4]\n)\n```\n",
    "created_at": "2018-09-11T11:57:14Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23478",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23478#issuecomment-329040",
    "user": "slelievre"
}
```

Related: the documentation for `rref` (reduced row-echelon form) claims that

> All arguments are passed on to :meth:`echelon_form`.

but it is not the case; in particular `transformation=True` is not passed on!


```
sage: a = matrix(ZZ, [[1, 2, 3], [3, 2, 1], [0, 1, 0]])
sage: a.rref(transformation=True)
[1 0 0]
[0 1 0]
[0 0 1]
sage: a.echelon_form(transformation=True)
(
[1 0 3]  [ 1  0 -2]
[0 1 0]  [ 0  0  1]
[0 0 8], [ 3 -1 -4]
)
```




---

archive/issue_comments_329041.json:
```json
{
    "body": "Is it maybe the case that `transformation=True` is honored by `echelon_form` only if the base ring is not a field?",
    "created_at": "2018-09-11T22:39:10Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23478",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23478#issuecomment-329041",
    "user": "slelievre"
}
```

Is it maybe the case that `transformation=True` is honored by `echelon_form` only if the base ring is not a field?
