# Issue 15267: Possible integration error

Issue created by migration from Trac.

Original creator: ppurka

Original creation time: 2013-12-09 12:41:52

CC:  jakobkroeker kcrisman rws

From google spreadsheet which no one reads `X-(`

A simple integration error.

```
sage: integrate(log(1+x)/x,x)
 log(x + 1)*log(-x) + polylog(2, x + 1)
sage: integrate(log(1+x)/x,x,0,1) 
 -1/6*pi^2 + I*pi*log(2) + polylog(2, 2)
```


Both of which are wrong according to 2.728 of Gradshteyn & Ryzhik. Actually the second example is obviously wrong since the integration is a real function over a real interval.

Should I report the error to Maxima? That seems to be the source.


---

Comment by kcrisman created at 2013-12-09 18:12:59


```

(%i6) integrate(log(1+x)/x,x,0,1);
                                                      2
                                                   %pi
(%o6)                   log(- 1) log(2) + li (2) - ----
                                            2       6
(%i7) integrate(log(1+x)/x,x);
(%o7)                  log(- x) log(x + 1) + li (x + 1)
                                               2
```

Apparently in Maxima.


---

Comment by rws created at 2015-02-01 15:06:11

For completeness, sympy has

```
In [1]: integrate(log(1+x)/x)
Out[1]: 
        ⎛      ⅈ⋅π⎞
-polylog⎝2, x⋅ℯ   ⎠

In [2]: integrate(log(1+x)/x,(x,0,1))
Out[2]: 
        ⎛    ⅈ⋅π⎞
-polylog⎝2, ℯ   ⎠
```

while Wolfram says `integral (log(1+x))/x dx = -Li_2(-x)+constant`.
The sympy solution will also only be available with sympy-0.7.8 because of a missing `polylog._sage_` method in earlier versions.


---

Comment by rws created at 2016-06-12 13:35:35


```
sage: integrate(log(1+x)/x,x,algorithm='sympy')
-polylog(2, -x)
```



---

Comment by jakobkroeker created at 2017-03-03 22:48:44

If this answer is wrong, mark it for a stopgap or even create one


---

Comment by mforets created at 2017-04-27 20:02:08

as of v8.0.beta3, Maxima is correct:


```
sage: integrate(log(1+x)/x, x, 0, 1, algorithm='maxima')
-1/6*pi^2 + I*pi*log(2) + dilog(2)
sage: _.n()
0.822467033424113
sage: N(pi^2/12)
0.822467033424113
```


see [W|A](http://www.wolframalpha.com/input/?i=integrate(ln(1%2Bx)%2Fx,+x,+0,+1))

the imaginary part vanishes because of the identity `dilog(2) = -pi<sup>2/4+log(2)</sup>2/2-1/2*(log(2)+I*pi)^2`, which doesn't seem to be recognised.


---

Comment by rws created at 2017-04-28 06:04:21

So I think we can at least relabel this. As the answer is correct it becomes a mere enhancement ticket.


---

Comment by rws created at 2017-04-28 06:04:21

Changing type from defect to enhancement.


---

Comment by kcrisman created at 2017-04-28 13:03:06

What does `giac` do, out of curiosity?


---

Comment by mforets created at 2017-04-28 14:28:04

Replying to [comment:11 kcrisman]:
> What does `giac` do, out of curiosity?

- giac returns unevaluated 
- sympy returns the correct + reduced answer 

.. it's quite fun. in [that list in github](https://gist.github.com/mforets/e82a3de96a17bc80a4a22ad787bdd104) i started to evaluate the integral tickets with different algorithms.
