# Issue 14840: Inconsistency in polynomial .reverse(n)

Issue created by migration from Trac.

Original creator: defeo

Original creation time: 2013-08-22 11:29:39

CC:  mmezzarobba jhpalmieri

Keywords: polynomial univariate reverse

The optional argument of the `.reverse()` method of univariate polynomials is interpreted inconsistently through different classes.

Rationals interpret is as "length":


```python
sage: _.<x> = QQ[]
sage: (x+1).reverse(1)
1
sage: (x).reverse(1)
0
```



The docstring for generic polynomials (inherited by `CC`, number fields, `Polynomial_GF2X`,  `Polynomial_ZZ_pEX`, ...) says:

> If an optional degree argument is given the coefficient list will
> be truncated or zero padded as necessary and the reverse polynomial
> will have the specified degree.

but the behaviour is inconsistent with it


```python
sage: _.<x> = GF(2)[]
sage: (x+1).reverse(1)
x + 1
sage: (x).reverse(1)
1
sage: ['reverse' in cl.__dict__ for cl in  inspect.getmro(x.__class__)]
[False, False, True, False, False, False, False, False, False, False]
sage: inspect.getmro(x.__class__)[2]
<type 'sage.rings.polynomial.polynomial_element.Polynomial'>
```


`Polynomial_zmod_flint` and `Polynomial_integer_dense_flint` have the exact same docstring and behaviour, though they do not inherit `.reverse()` from the generic class:


```python
sage: _.<x> = ZZ[]
sage: (x+1).reverse(1)
x + 1
sage: (x).reverse(1)
1
sage: ['reverse' in cl.__dict__ for cl in  inspect.getmro(x.__class__)]
[True, True, False, False, False, False, False, False, False]
<type 'sage.rings.polynomial.polynomial_integer_dense_flint.Polynomial_integer_dense_flint'>
```



Reals take no optional argument. The docstring says

> Returns x!^d f(1/x) where d is the degree of f.

and the behaviour is consistent with it


```python
sage: (x+1).reverse()
x + 1.00000000000000
sage: x.reverse()
1.00000000000000
```


In my opinion the best behaviour is the one of the generic class, but the docstring should be amended to something similar to the last one, which is the proper mathematical definition. The behaviour of rationals should be corrected to conform to the other classes.


---

Comment by chapoton created at 2019-05-17 17:37:21

This is obsolete. `QQ['x']` now works as the other cases.


---

Comment by chapoton created at 2019-05-17 17:37:21

Changing status from new to needs_review.


---

Comment by jhpalmieri created at 2019-05-17 17:55:14

There remain two issues: unifying the documentation, and also the version for `RR` does not allow for an optional argument. Low priority, but I say we keep this open.


---

Comment by bruno created at 2019-08-22 14:09:46

There remained actually more issues. The issue for `QQ['x']` was indeed fixed by ticket #21194 but that ticket only fixed some of the inconsistencies. Those that I have noticed and fix are:

- No `degree` parameter for polynomials over `RR` (as already mentioned);
- No `degree` parameter for polynomials over `Zmod(...)` using NTL;
- Several inconsistencies in the documentation (polynomials over `ZZ` and `Zmod(...)` using Flint, polynomials over p-adics).

I hope I didn't forgot anything!


---

Comment by git created at 2019-08-22 14:09:59

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by chapoton created at 2019-11-13 16:34:16

ok, let it be


---

Comment by chapoton created at 2019-11-13 16:34:16

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2019-11-16 20:15:30

Resolution: fixed
