# Issue 19756: Arb: parse symbolic expressions

Issue created by migration from https://trac.sagemath.org/ticket/19993

Original creator: cheuberg

Original creation time: 2016-02-01 10:34:59

CC:  behackl dakrenn mmezzarobba â€‹fredrik.johansson

Keywords: arb

Current behaviour:

```
sage: RBF(zeta(3))
[1.202056903159590 +/- 5.38e-16]
sage: RBF(2*zeta(3))
Traceback (most recent call last):
...
TypeError: unable to convert 2*zeta(3) to a RealBall
```


That is unfortunate (imagine that this is part of a large symbolic expression, involving various constants, logarithms etc.)

I assume that the first call succeeds because `RIF` can handle it.


---

Comment by cheuberg created at 2016-02-01 10:44:36

New commits:


---

Comment by cheuberg created at 2016-02-01 10:44:36

Changing status from new to needs_review.


---

Comment by cheuberg created at 2016-02-02 10:53:48

Changing status from needs_review to needs_work.


---

Comment by cheuberg created at 2016-02-02 10:53:48

I am now dealing with the failing doctests on the patchbot.


---

Comment by git created at 2016-02-02 11:01:58

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by cheuberg created at 2016-02-02 11:04:34

Changing status from needs_work to needs_review.


---

Comment by cheuberg created at 2016-02-02 11:04:34

The failing doctests were probably introduced by #19082; thus I had to merge 7.1.beta1 to fix them (only errors were affected, mostly they improved; in one occurrence, we now have a slightly worse error). All this is due to not involving RIFs less frequently.


---

Comment by fredrik.johansson created at 2016-02-02 11:54:09

It might be worth handling rational arguments in some cases, if it's not too complicated?

x<sup>(2/3)</sup> -> arb_pow_fmpq

exp(I*pi/3) -> arb_sin_cos_pi_fmpq

gamma(1/3) -> arb_gamma_fmpq


---

Comment by cheuberg created at 2016-02-02 13:31:23

Replying to [comment:8 fredrik.johansson]:
> It might be worth handling rational arguments in some cases, if it's not too complicated?

For each operand in a symbolic expression, we could check whether it is an element of `QQ` and, in that case, just take the `.pyobject` of the operand instead of converting it into the Real Ball Field. Then it would be the responsibility of the respective functions to deal with those elements appropriately (either by the coercion model or by hand).


> x<sup>(2/3)</sup> -> arb_pow_fmpq

in that case, we should also modify `__pow__` which currently does not consider rational exponents.

> 
> exp(I*pi/3) -> arb_sin_cos_pi_fmpq

I am not sure that we want to do that much parsing of a symbolic expression.

> gamma(1/3) -> arb_gamma_fmpq

tricky: we would have to hardwire this function because we'd have to call `RealBallField.gamma`.

I think I'd prefer to postpone such optimizations to a follow-up ticket.


---

Comment by dkrenn created at 2016-02-12 18:43:18

LGTM, and as suggested, everything else should be on a follow up ticket.

BTW, is

```
sage: zeta(RIF(3)).parent()
Complex Field with 53 bits of precision
```

known? (It works with balls, so no need to worry about this ticket...)


---

Comment by dkrenn created at 2016-02-12 18:43:18

Changing status from needs_review to positive_review.


---

Comment by cheuberg created at 2016-02-13 09:55:14

Replying to [comment:10 dkrenn]:
> BTW, is
> {{{
> sage: zeta(RIF(3)).parent()
> Complex Field with 53 bits of precision
> }}}
> known? (It works with balls, so no need to worry about this ticket...)

reused the existing ticket #16782 for this report.


---

Comment by vbraun created at 2016-02-13 23:56:11

Resolution: fixed


---

Comment by mmezzarobba created at 2019-09-10 12:17:04

A bug proably introduced by this ticket:

```
sage: RBF(exp(1), 1)
[2.718281828459045 +/- 5.41e-16]
```

See #28469.
