# Issue 26904: Fix for conversion of Gamma function in Mathematica interface

Issue created by migration from https://trac.sagemath.org/ticket/27141

Original creator: @mwageringel

Original creation time: 2019-01-27 11:08:02

CC:  dimpase etn40ff

Keywords: Mathematica

Converting expressions involving Gamma functions from Mathematica to Sage currently fails:

```python
sage: mathematica('Gamma[4/3]').sage()
...
NotImplementedError: Unable to parse Mathematica                 output: Gamma(4/3)

sage: mathematica('Gamma[4/3, 1]').sage()  # This should be the upper incomplete Gamma function `gamma(4/3, 1)` in Sage.
gamma_inc_lower(4/3, 1)

sage: mathematica('Gamma[4/3, 0, 1]').sage()
...
NotImplementedError: Unable to parse Mathematica                 output: Gamma(4/3, 0, 1)
```


Moreover, this should convert to `Gamma[4/3, 0, 1]` in Mathematica:

```python
sage: gamma_inc_lower(4/3, 1)._mathematica_()
Gamma[4/3, 1]
```


The reason for this is that all three kinds of Gamma functions (the (complete) Gamma, the upper incomplete Gamma `gamma_inc` and the lower incomplete `gamma_inc_lower`) all convert to `Gamma` in Mathematica, but the conversion does not properly take into account that the arguments to those functions are different. Conversely, `Gamma` is currently registered to convert to `gamma_inc_lower`, which is always wrong and fails as shown above.

More precisely, there are the following correspondences:
- `gamma(x)` and `Gamma[x]`,
- `gamma(x, y)` and `Gamma[x, y]`,
- `gamma_inc_lower(x, z)` and `Gamma[x, 0, z]`,
- `gamma(x, y) - gamma(x, z)` and `Gamma[x, y, z]`.

The Mathematica documentation for this can be found here: https://reference.wolfram.com/language/ref/Gamma.html.

This was tested with Sage 8.6 and Mathematica 11.3.


---

Comment by @mwageringel created at 2019-01-27 11:15:28

New commits:


---

Comment by @mwageringel created at 2019-01-27 11:15:28

Changing status from new to needs_review.


---

Comment by tscrim created at 2019-01-27 15:33:32

Dima, Salvatore, could one of you test this? Otherwise I can test it when I get back to Australia next month.


---

Comment by etn40ff created at 2019-01-28 11:43:02

It works as advertised and all the tests pass on my machine. My knowledge of the
Gamma function is too limited to spot any mathematical issue. 

Feel free to set this to positive review if you are confident on the math side.


---

Comment by dimpase created at 2019-01-28 11:47:04

It'd help to know what Mathematica version you tested it with, thanks.


---

Comment by etn40ff created at 2019-01-28 11:48:49

Mathematica 11.3.0 Kernel for Linux x86 (64-bit)


---

Comment by dimpase created at 2019-01-28 13:58:23

Changing status from needs_review to positive_review.


---

Comment by dimpase created at 2019-01-28 13:58:23

Looks good to me. Tested with Mathematica 11.2 on Linux


---

Comment by @mwageringel created at 2019-01-28 18:19:29

Thank you.


---

Comment by vbraun created at 2019-02-04 23:02:14

Resolution: fixed
