# Issue 10876: Get Maxima to easily accept flag values

Issue created by migration from https://trac.sagemath.org/ticket/10955

Original creator: kcrisman

Original creation time: 2011-03-17 15:48:39

Assignee: burcin

CC:  robert.marik burcin nbruin jason wdj

Keywords: maxima, calculus, flag, radexpand

Maxima relatively recently decided that 1/sqrt(x) is not sqrt(1/x), for good reasons (1/sqrt(-1)=-i but sqrt(1/-1)=i in usual discussion).  So for the following integral, they note that it depends on how you input it:

```
sage: integrate(sqrt(1/x^2+x),x)
integrate(sqrt(x + 1/x^2), x)
sage: integrate(1/sqrt(x^2+x),x)
log(2*x + 2*sqrt(x^2 + x) + 1)
```

Fine.  Then they suggest using the flag `radexpand:all` to make the first one behave.  But I can't figure out how to get it to evaluate.

```
sage: sage.calculus.calculus.maxima('radexpand:all')
all
sage: integrate(sqrt(1/x^2+x),x)
integrate(sqrt(x + 1/x^2), x)
```

Trying maxima.eval only changes that I get 'all' instead of all.  We should make this work, since this is the *calculus* instance of Sage!


---

Comment by nbruin created at 2013-11-01 16:28:58

Works for me on some flavour of 5.13.beta0

```
sage: integrate(sqrt(1/x^2+x),x)
integrate(sqrt(x + 1/x^2), x)
sage: sage.calculus.calculus.maxima('radexpand:all')
all
sage: integrate(sqrt(1/x^2+x),x)
2/3*sqrt(x^3 + 1) - 1/3*log(sqrt(x^3 + 1) + 1) + 1/3*log(sqrt(x^3 + 1) - 1)
```

I didn't check if the answer makes sense, but at least setting the flag has effect.


---

Comment by pbruin created at 2014-05-21 21:41:59

Works for me too; here is a doctest.


---

Comment by pbruin created at 2014-05-21 21:41:59

Changing priority from minor to trivial.


---

Comment by pbruin created at 2014-05-21 21:41:59

Changing status from new to needs_review.


---

Comment by pbruin created at 2014-05-21 21:41:59

Changing type from defect to task.


---

Comment by kcrisman created at 2014-05-28 20:59:16

Changing status from needs_review to positive_review.


---

Comment by kcrisman created at 2014-05-28 20:59:16

As far as I can tell this is fine.  I have no idea why this didn't work before.  Passes tests, does right thing.  
----
Wow, I am just now noticing that the suggestion made earlier was pretty bogus.

```
sage: integrate(1/sqrt(x^2+x),x)
log(2*x + 2*sqrt(x^2 + x) + 1)
```

Totally not the same thing as `sqrt(1/x^2+x)`!  Should have been

```
sage: integrate(1/sqrt(x^2+x),x)
log(2*x + 2*sqrt(x^2 + x) + 1)
sage: integrate(sqrt(1/(x^2+x)),x)
log(sqrt(x + 1)/sqrt(x) + 1) - log(sqrt(x + 1)/sqrt(x) - 1)
```

which also happens to be affected by `radexpand:all`.


---

Comment by vbraun created at 2014-05-29 14:51:26

Resolution: fixed
