# Issue 19240: Graph(filename)

Issue created by migration from https://trac.sagemath.org/ticket/19477

Original creator: ncohen

Original creation time: 2015-10-25 14:45:07

CC:  borassi dcoudert

This branch adds this new constructor, so far with 2 supported file format.

Nathann


---

Comment by ncohen created at 2015-10-25 14:45:39

Changing status from new to needs_review.


---

Comment by ncohen created at 2015-10-25 14:45:39

New commits:


---

Comment by dcoudert created at 2015-10-25 15:18:18

Hello Nathann,

I know you will cry, but your method to read edgelist graphs is not generic enough and I  suggest to use the method of networkx instead. Why:

```
sage: G = Graph()
sage: G.add_edge(4,5, {'color':3, 'weight':2.5})
sage: f = tmp_filename(ext='.edgelist')
sage: G.export_to_file(f,format='edgelist')
sage: import networkx
sage: gx = networkx.read_edgelist(f)
sage: h = Graph(gx)
sage: h.edges()
[(u'4', u'5', {'color': 3, 'weight': 2.5})]
sage: G.edges()
[(4, 5, {'color': 3, 'weight': 2.50000000000000})]
sage: line = "4 5 {'color':3, 'weight':2.5}"
sage: line.strip().split()
['4', '5', "{'color':3,", "'weight':2.5}"]
```

I agree this is ugly, but it's possible.
In fact, if you assume that a graph is either unweighted (with data on edges) or weighted (with a unique number on the edges) then the method is similar to `networkx.read_weighted_edgelist`.

The cases with loops and/or multiple edges are of course even more complicated, and I don't know how to handle them in a easy manner.

```
sage: G.allow_multiple_edges(True)
sage: G.allow_loops(True)
sage: G.add_edge(4,5, {'color':42, 'weight':99})
sage: G.add_edge(3,3,12345)
sage: G.edges()
[(3, 3, 12345),
 (4, 5, {'color': 3, 'weight': 2.50000000000000}),
 (4, 5, {'color': 42, 'weight': 99})]
sage: G.export_to_file(f,format='edgelist')
sage: gx = networkx.read_edgelist(f)
sage: h = Graph(gx)
sage: h.edges()
[(u'4', u'5', {'weight': {'color': 42, 'weight': 99}})]
sage: gx.edges()
[(u'3', u'3'), (u'5', u'4')]
sage: gx.get_edge_data(4,5)
sage: gx.get_edge_data(u'5', u'4')
{'weight': {'color': 42, 'weight': 99}}
```


David.


---

Comment by ncohen created at 2015-10-25 16:47:45

I do not need this feature. What I am doing here is try to prepare the way to load easily in Sage graphs that barely store in memory. Later, this parsing will occur in C++ on a backend that supports edge addition in O(1) (amortized), with minimal memory cost.

If that goes through NetworkX first, I just can't do it anymore.

My problem here is that 'NetworkX' named 'edgelist' a file format that uses the python syntax and crazy labels, when other libraries prefered to keep matters simple:

http://gephi.github.io/users/supported-graph-formats/csv-format/
http://igraph.org/c/doc/igraph-Foreign.html#idm470920995840

Honestly, it is probably their fault for 'extending' a file format with things that are not supported anywhere else.

Would you prefer to see a different name for this file format?

Nathann


---

Comment by dcoudert created at 2015-10-25 17:08:45

ok, let's follow the majority: edgelist is either a list of pairs (one pair source-destination per line) or a list a triples source-dest-label.
However, I don't understand why you treat labels as strings. I assume that most of the time the label will be a cost or a weight or a capacity, so int or float. You could use e.g. `eval(w)`?


---

Comment by ncohen created at 2015-10-25 17:11:35

Yo,

> ok, let's follow the majority: edgelist is either a list of pairs (one pair source-destination per line) or a list a triples source-dest-label.

Thanks.

> However, I don't understand why you treat labels as strings. I assume that most of the time the label will be a cost or a weight or a capacity, so int or float. You could use e.g. `eval(w)`?

I assume the same, but can I make this assumption in the code? I wanted to have a 'float' there, but then I do not know. The problem with 'eval' is that you "just can't" eval anything that you are given. I could take control of your computer by sending you an "edgelist" file. Of course this will probably never happen, but I don't like much knowing that I made this possible `:-/`

Nathann


---

Comment by dcoudert created at 2015-10-25 17:21:39

So then we could have an optional parameter like `label_type=str` (default) and allow `float`, `int`, or even a function `str->whatever is acceptable as edgelabel`.
The user should not have to manually change the label of all edges of the graph from string to what is relevant after it has been read from file.
You will have the same issue in C++.

Another remark is that with the method you use to extract u,v,w, the label w can not contain spaces.


---

Comment by ncohen created at 2015-10-25 17:38:28

Hello David,

I do not know how to solve these problems smartly.

> Another remark is that with the method you use to extract u,v,w, the label w can not contain spaces. 

True. Honestly I would be better by just removing labels fro the file format. I really don't care at all about labels.

Nathann


---

Comment by ncohen created at 2015-10-25 17:52:17

I will update this branch to remove the edgelist constructor. All I need for the moment is this 'nde' reader anyway. And at least this format is properly specified.

Nathann


---

Comment by ncohen created at 2015-10-25 18:33:19

Here it is.

Nathann
----
New commits:


---

Comment by cheuberg created at 2017-01-12 06:46:26

merge conflict.


---

Comment by cheuberg created at 2017-01-12 06:46:26

Changing status from needs_review to needs_work.
