# Issue 20436: revert #4967

Issue created by migration from Trac.

Original creator: was

Original creation time: 2016-05-24 18:13:43

#4967 -- to completely disallow users to install Gap packages or configure anything in order to make the Sage build more isolated -- was short sited and should be reverted.

Just revert it.  Sage can't and shouldn't protect its build against all possible user-level configuration on their system -- VM's or containers are better for doing that.

Also #4967 makes it completely impossible for a user to install their own package and use a system-wide install of sage.


---

Comment by dimpase created at 2016-09-02 09:38:00

Not sure if installing out of GAP tree works for GAP packages building "GAP kernel extensions", some sort of dynamic libraries runtime linked by GAP.
One such package is called io, see http://gap-system.org/Packages/io.html

----
New commits:


---

Comment by kalmar created at 2016-09-02 10:11:09

I actually use the IO package compiled this way. Everything seems to work fine, though my usage is not really extensive (pickling, writing, reading, un-pickling).

Of course there might be problems when sage-used version of GAP changes -- but this becomes users responsibility to keep their locally installed packages up-to-date.


---

Comment by dimpase created at 2016-09-02 10:21:53

and what happens if you do

```
   sage: libgap.LoadPackage("io")
```

(I expect an ugly error).

And, by the way, does this (i.e. `libgap.LoadPackage()`) work with userspace GAP packages that do not need GAP kernel extensions?


---

Comment by kalmar created at 2016-09-02 10:50:10

I get 

```
true
```


(I do it in SCM)

Which other package should I test?


---

Comment by dimpase created at 2016-09-02 11:03:10

Replying to [comment:5 kalmar]:
> I get 
> {{{
> true
> }}}
> 
> (I do it in SCM)
> 
This is with io, right? So it loads, right? Could you test that it _works_ in libgap, too? In fact I am about to start creating Sage package with io, json, and perhaps few other packages, too.


---

Comment by kalmar created at 2016-09-02 12:06:55

Ok, I don't know if it works with libgap (haven't even tried to make it work)

However (just checked in the branch):

Downloading io-4.4.6.tar.bz2\\
./configure (with the appropriate --with-gaproot=)\\
copying folder to ./.gap/pkg as io\\
and then


```
sage> gap.load_package("io")
sage> gap.IO_Pickle(gap.AlternatingGroup(5))
PRMGILIS2PERMB(1,2,3,4,5)PERM7(3,4,5)INTG23CFAIL
```

does what it's supposed to


---

Comment by dimpase created at 2016-09-02 12:50:44

how about trying

```
sage> libgap.LoadPackage("io")
sage> libgap.IO_Pickle(libgap.AlternatingGroup(5))
```



---

Comment by kalmar created at 2016-09-02 12:56:58


```
AttributeError: No such attribute: IO_Pickle.
```



---

Comment by dimpase created at 2016-09-02 13:57:00

Replying to [comment:9 kalmar]:
> 
> {{{
> AttributeError: No such attribute: IO_Pickle.
> }}}
OK, and how about

```
sage: libgap.eval('IO_Pickle(AlternatingGroup(5));')
```

(not sure whether ';' is needed here, or not.)


---

Comment by kalmar created at 2016-09-02 14:12:22

I tried this previously as well:


```
libGAP: Error, Variable: 'IO_Pickle' must have a value
```


(in fact I don't quite know how to use loaded package functionality through libgap)


---

Comment by dimpase created at 2016-09-02 14:24:11

for instance, this works:

```
sage: libgap.LoadPackage("grape")
true
sage: libgap.eval('JohnsonGraph(5,2)')
rec( adjacencies := [ [ 2, 3, 4, 5, 6, 7 ] ], group := Group([ (1,5,8,10,4)(2,6,9,3,7), (2,5)(3,6)(4,7) ]), isGraph := true, isSimple := true, names := [ [ 1, 2 ], [ 1, 3 ], [ 1, 4 ], [ 1, 5 ], [ 2, 3 ], [ 2, 4 ], [ 2, 5 ], [ 3, 4 ], [ 3, 5 ], [ 4, 5 ] ], order := 10, representatives := [ 1 ], schreierVector := [ -1, 2, 2, 1, 1, 1, 2, 1, 1, 1 ] )
sage: 
```



---

Comment by dimpase created at 2016-09-02 15:40:39

oops, libGAP does not support dynamic loading ATM, and infact autoloaded IO package breaks it. See this [github comment](https://github.com/OpenDreamKit/OpenDreamKit/issues/93#issuecomment-244400907) on how to fix it, sort of.


---

Comment by dimpase created at 2016-09-03 07:57:11

Anyhow, if you added a warning saying that GAP packages using loadable modules (such as IO and json, but possibly other too) will break libGAP and should not be used with GAP at the moment, I could give this a positive review.


---

Comment by git created at 2016-10-09 09:51:27

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by kalmar created at 2016-10-09 09:52:30

Sorry it took me so long;


---

Comment by dimpase created at 2016-10-09 14:13:49

Shouldn't this

`will break libGAP and should not be used with GAP at the moment!`

say

`will break libGAP and should not be used with Sage at the moment!`


---

Comment by git created at 2016-10-09 14:29:04

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by dimpase created at 2017-03-17 10:08:15

According to Volker, a way to allow dynamic modules (i.e. GAP kernel extensions) in libGAP is through #19915.


---

Comment by nthiery created at 2017-03-17 10:40:43

See alo #22626 (upgrade to GAP 4.9 and it's own libgap): at this stage, it seems likely that the provided libgap will be unprefixed, as in #19915.
