# Issue 10783: behaviour of gamma strangely sensitive

Issue created by migration from https://trac.sagemath.org/ticket/10849

Original creator: dsm

Original creation time: 2011-02-25 08:21:32

Assignee: burcin

CC:  kcrisman

Whether you get the correct result or a spurious ValueError in evaluating some gamma expressions depends upon things it shouldn't.

This comes from [a sage-support thread](http://groups.google.com/group/sage-support/browse_thread/thread/3b7126c1a29db091#); I looked and couldn't find it here, but possibly it's a duplicate.  (I have bad luck with trac.)
See also [this worksheet](http://demo.sagenb.org/home/pub/66/).

Here's a relatively simple test case, in 4.6.1 and 4.6.2.rc0:


```
sage: x = var("x")
sage: f = exp(gamma(I*x-1/2).subs(x=I*x))
sage: g=f.operands()[0]
sage: g, type(g)
(gamma(-x - 1/2), <type 'sage.symbolic.expression.Expression'>)
sage: g(x=0)
---------------------------------------------------------------------------
ValueError                                Traceback (most recent call last)

/Applications/sage_devel/<ipython console> in <module>()

/Applications/sage/local/lib/python2.6/site-packages/sage/symbolic/expression.so in sage.symbolic.expression.Expression.__call__ (sage/symbolic/expression.cpp:15657)()

/Applications/sage/local/lib/python2.6/site-packages/sage/symbolic/ring.so in sage.symbolic.ring.SymbolicRing._call_element_ (sage/symbolic/ring.cpp:6537)()

/Applications/sage/local/lib/python2.6/site-packages/sage/symbolic/expression.so in sage.symbolic.expression.Expression.substitute (sage/symbolic/expression.cpp:15036)()

/Applications/sage/local/lib/python2.6/site-packages/sage/symbolic/pynac.so in sage.symbolic.pynac.py_doublefactorial (sage/symbolic/pynac.cpp:9463)()

ValueError: argument must be >= -1
sage: g(x=0)
---------------------------------------------------------------------------
ValueError                                Traceback (most recent call last)
[ ... duplicate removed; this is merely to show it's not only the first call which has problems ]
ValueError: argument must be >= -1
sage: gamma(-x-1/2)*g
gamma(-x - 1/2)^2
sage: g(x=0)
-2*sqrt(pi)
```


That is, merely performing the should-be-irrelevant "gamma(-x-1/2)*g" op makes g(x=0) start working.  Instrumenting it shows that that py_doublefactorial gets a -3 the first time instead of the 1 it does the second time, but I couldn't quite follow the calling order to isolate the error.


---

Comment by mhansen created at 2011-02-25 10:15:37

I'm pretty sure this issue stems from comparison of number field elements.  See #6132, #7160, #10064, and http://groups.google.com/group/sage-support/browse_thread/thread/28bbd04a78dadb57/01168722573ff736


---

Comment by dsm created at 2011-02-25 11:13:59

What weirds me out is the side-effect aspect: I could understand getting the same wrong answer, or different answers for equivalent but non-identical inputs, or even random behaviour.  I don't see why the gamma(-x-1/2)*g call should change the state so that any element comparison would behave differently, but I understand exactly nothing about Sage internals at this level.


---

Comment by burcin created at 2011-05-26 09:12:23

Mike is right and the patch at #10064 resolves this issue.

The side effect is a result of GiNaC's reference counted pointers. Whenever two expressions compare equal, GiNaC frees the memory of one, and makes it a pointer to the other. In this example, it replaces `-x - 1/2` where the coefficient of `x` is in QQ(i), with `-x - 1/2` where the coefficient is just an `int`.


```
sage: t = -x -1/2
sage: t
-x - 1/2
sage: t.operands()
[-x, -1/2]
sage: t.operands()[0]
-x
sage: t.operands()[0].operands()
[x, -1]
sage: t.operands()[0].operands()[1]
-1
sage: t.operands()[0].operands()[1].pyobject()
-1
sage: type(t.operands()[0].operands()[1].pyobject())
<type 'int'>
```


Of course there is a chance that this observation changed the result. :)

For `g`, this looks like a different bug:


```
sage: g
gamma(-x - 1/2)
sage: g.operands()[0]
-x - 1/2
sage: g.operands()[0].operands()
[x, -1/2]
sage: g.operands()[0].operands()[0]
x
sage: g.operands()[0].operands()[0].operands()
[]
```



---

Comment by burcin created at 2012-01-10 05:56:50

Changing status from new to needs_review.


---

Comment by burcin created at 2012-01-10 05:56:50

This is fixed with the patch attached to #7160. Doctests are in attachment:trac_10849-doctests.patch.


---

Comment by tkluck created at 2013-01-03 19:41:26

Changing status from needs_review to needs_work.


---

Comment by tkluck created at 2013-01-03 19:41:26

I'll set this one to needs work because it depends on a ticket (#7160) that needs work, and it can't be reviewed before that one.


---

Comment by kcrisman created at 2013-01-03 21:18:37

One can also give it positive review and set it to sage-pending like at #10064.  That's a little more informative, anyway.


---

Comment by tkluck created at 2013-01-03 21:28:00

We'll still have to check whether the patch still applies cleanly when the other ticket has been merged (at which point a lot of unrelated changes may have made their way into Sage too). That would keep me from giving it the sort of preliminary positive review you suggest.

But if what you're saying is the standard way of handling these things, then I'll raise no objection.


---

Comment by kcrisman created at 2013-01-03 21:30:12

Replying to [comment:8 tkluck]:
> We'll still have to check whether the patch still applies cleanly when the other ticket has been merged (at which point a lot of unrelated changes may have made their way into Sage too). That would keep me from giving it the sort of preliminary positive review you suggest.

Of course you're right!  But at least this would mean that modulo those other changes, the patch does what it says.  Otherwise we might lose the info of a positive review.

How about I set it to sage-pending, and you set it to positive review if you feel that way?  :-)


---

Attachment


---

Comment by burcin created at 2013-06-03 14:17:39

Changing status from needs_work to needs_review.


---

Comment by burcin created at 2013-06-03 14:17:39

Now that #7160 is fixed, this can be reviewed. Patchbot says that the old patch applies without problems on Sage 5.10.beta4 and passes tests. I am attaching a new patch that is rebased on #9880, since both tickets add doctests to the same function and I hope #9880 will go in before this one. :)


---

Comment by rws created at 2014-02-18 09:17:49

This is just a doctest which passes.
----
New commits:


---

Comment by rws created at 2014-02-18 09:17:49

Changing keywords from "" to "doctest".


---

Comment by rws created at 2014-02-18 09:17:49

Changing status from needs_review to positive_review.


---

Comment by git created at 2014-02-20 17:31:18

Branch pushed to git repo; I updated commit sha1 and set ticket back to needs_review. New commits:


---

Comment by git created at 2014-02-20 17:31:18

Changing status from positive_review to needs_review.


---

Comment by rws created at 2014-02-20 17:47:14

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2014-02-20 23:16:59

Resolution: fixed
