# Issue 20509: Pushout for real embedded number fields

Issue created by migration from Trac.

Original creator: vdelecroix

Original creation time: 2016-06-01 10:28:19

CC:  jdemeyer tscrim

Keywords: days74

Implement the following pushout

```
sage: K.<a> = NumberField(x^2 - 3, embedding=AA(3)**(1/2))
sage: L.<b> = NumberField(x^2 - 2, embedding=AA(2)**(1/2))
sage: a+b
3.146264369941973?
sage: parent(_)
Algebraic Real Field
```



---

Comment by vdelecroix created at 2016-06-01 10:29:10

Changing status from new to needs_review.


---

Comment by vdelecroix created at 2016-06-01 10:29:10

New commits:


---

Comment by pbruin created at 2016-06-01 11:23:15

Changing status from needs_review to needs_work.


---

Comment by pbruin created at 2016-06-01 11:23:15

Isn't it a bit drastic to declare `AA` to be the pushout rather than to create a suitable number field?  I think a better solution would be to use the existing `composite_fields()` method, which respects embeddings:

```diff
--- a/src/sage/rings/number_field/number_field_base.pyx
+++ b/src/sage/rings/number_field/number_field_base.pyx
`@``@` -350,3 +350,7 `@``@` cdef class NumberField(Field):
         else:
             raise ValueError("No embedding set. You need to specify a a real embedding.")
 
+    def _pushout_(self, other):
+        if (isinstance(other, NumberField) and self._embedded_real and
+            (<NumberField>other)._embedded_real):
+            return self.composite_fields(other)[0]
```

This makes the examples in the current branch work just as well (you can see the numerical values after coercing into `AA`).


---

Comment by vdelecroix created at 2016-06-01 12:00:57

Fair enough. Though it is more expensive.


---

Comment by vdelecroix created at 2016-06-01 12:08:05

And this is order dependent

```
sage: K.<a> = NumberField(x^2 - 3, embedding=AA(3)**(1/2))
sage: L.<b> = NumberField(x^2 - 2, embedding=AA(2)**(1/2))
sage: a+b
ab^3 - 10*ab
```

versus

```
sage: K.<a> = NumberField(x^2 - 3, embedding=AA(3)**(1/2))
sage: L.<b> = NumberField(x^2 - 2, embedding=AA(2)**(1/2))
sage: b+a
-ba^3 + 10*ba
```



---

Comment by vdelecroix created at 2016-06-02 04:20:05

Changing status from needs_work to needs_review.


---

Comment by jipilab created at 2017-03-05 23:33:56

This coercion has its advantages:

 - makes it possible to do arithmetic operations with elements with two different `NumberFields` as parents. Right now returns a TypeError:


```
    sage: J = NumberField(x^2 - 2,'s')
    sage: s = J.gens()[0]
    sage: K = NumberField(x^3 - 2,'t')
    sage: t = K.gens()[0]
    sage: s * t
    Traceback (most recent call last):
    ...
    TypeError: unsupported operand parent(s) for *: ...
```

 - It is lazy, it does have to compute the join.

Depending on the usage, one may want to get the join of the fields using `composite_field`, this introduces another variable and is order dependant. I guess that if one wants to do computations on the long run with that field, one would already use the right field from start.

IMHO, this ticket already fixes an operation that one would naturally want to have at hand. So, I would make this a positive review.


---

Comment by jipilab created at 2017-03-05 23:34:10

Changing status from needs_review to positive_review.


---

Comment by jipilab created at 2017-03-05 23:35:01

Changing keywords from "days74" to "days74, days84".


---

Comment by vbraun created at 2017-03-08 18:45:56

Resolution: fixed
