# Issue 24059: min() is wrong with interval as 2nd argument

Issue created by migration from Trac.

Original creator: zimmerma

Original creation time: 2017-11-28 19:37:30


```
sage: min(1,RIF(0,2))
1
sage: min(RIF(0,2),1)
[0.00000000000000000 .. 2.0000000000000000]
```

The first result is wrong, the second is correct (and since `min(x,y)=min(y,x)`, both should give the same result).


---

Comment by vklein created at 2017-12-05 11:16:28

Just for the record this question is documented in [RealIntervalFieldElement.min](https://doc.sagemath.org/html/en/reference/rings_numerical/sage/rings/real_mpfi.html#sage.rings.real_mpfi.RealIntervalFieldElement.min).



```
The generic min does not always do the right thing:

sage: min(0, RIF(-1, 1))
0
sage: min(RIF(-1, 1), RIF(-100, 100)).endpoints()
(-1.00000000000000, 1.00000000000000)
Note that calls involving NaNs try to return a number when possible.
This is consistent with IEEE-754-2008 but may be surprising.
```

