# Issue 12070: Divisibility of number field order elements needs work

archive/issues_012070.json:
```json
{
    "body": "Assignee: davidloeffler\n\nThis is a followup to #11673. Elements of orders in number fields inherit from FieldElement, despite not being elements of a field, and hence some arithmetic operations give nonsense:\n\n```\nsage: K.<a> = NumberField(x^2 - x - 1); OK = K.ring_of_integers()\nsage: OK(12).divides(OK(13))\nTrue\nsage: OK(12) // OK(13)\n12/13\n```\n\nThe first should clearly be `False`, and I'm not sure what the second should be (perhaps a TypeError) but it certainly shouldn't be 12/13.\n\nIssue created by migration from https://trac.sagemath.org/ticket/12242\n\n",
    "created_at": "2011-12-31T15:03:56Z",
    "labels": [
        "number fields",
        "minor",
        "bug"
    ],
    "title": "Divisibility of number field order elements needs work",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/12070",
    "user": "davidloeffler"
}
```
Assignee: davidloeffler

This is a followup to #11673. Elements of orders in number fields inherit from FieldElement, despite not being elements of a field, and hence some arithmetic operations give nonsense:

```
sage: K.<a> = NumberField(x^2 - x - 1); OK = K.ring_of_integers()
sage: OK(12).divides(OK(13))
True
sage: OK(12) // OK(13)
12/13
```

The first should clearly be `False`, and I'm not sure what the second should be (perhaps a TypeError) but it certainly shouldn't be 12/13.

Issue created by migration from https://trac.sagemath.org/ticket/12242





---

archive/issue_comments_139967.json:
```json
{
    "body": "\n```\nsage: OK(12) % OK(13)\nTypeError: unsupported operand type(s) for %: 'sage.rings.number_field.number_field_element_quadratic.OrderElement_quadratic' and 'sage.rings.number_field.number_field_element_quadratic.OrderElement_quadratic'\n```\n\nSo \"TypeError\" would be consistent. It would also be a quick and easy fix of this bug\n\nWhere is \"`//`\" implemented? Note\n\n```\nsage: OK(12).quo_rem(OK(13))\n(12/13, 0)\n```\n\nwhich may be the same bug.",
    "created_at": "2012-08-13T08:37:54Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12070",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12070#issuecomment-139967",
    "user": "mstreng"
}
```


```
sage: OK(12) % OK(13)
TypeError: unsupported operand type(s) for %: 'sage.rings.number_field.number_field_element_quadratic.OrderElement_quadratic' and 'sage.rings.number_field.number_field_element_quadratic.OrderElement_quadratic'
```

So "TypeError" would be consistent. It would also be a quick and easy fix of this bug

Where is "`//`" implemented? Note

```
sage: OK(12).quo_rem(OK(13))
(12/13, 0)
```

which may be the same bug.
