# Issue 17483: failing primary decomposition with extension field coefficients

Issue created by migration from Trac.

Original creator: jakobkroeker

Original creation time: 2015-02-03 14:59:55

CC:  simonking malb

Keywords: Singular

The following bugs are likely Singular interface bugs (have to investigate):
since the same examples run using shipped Singular behave differently

It may also relate to Singular's variable shadowing issue, see next ticket

0. working example:

```
sage: R.<b>=QQ[]
sage: K.<b>=QQ.extension(b^2-b-1)
sage: r.<x,z>=K[]
sage: I=r.ideal(z)
sage: L = I.primary_decomposition("gtz")
sage: [ J.gens() for J in L]
#[This is the Trac macro *z* that was inherited from the migration](https://trac.sagemath.org/wiki/WikiMacros#z-macro)
```

1. example with wrong result:

```
sage: R.<p>=QQ[]
sage: K.<p>=QQ.extension(p^2-p-1)
sage: r.<x,z>=K[]
sage: I=r.ideal(z)
sage: L = I.primary_decomposition("gtz") # wrong!
sage: [ J.gens() for J in L] 
#[This is the Trac macro *0, 0* that was inherited from the migration](https://trac.sagemath.org/wiki/WikiMacros#0, 0-macro)
```

2. crashing example:

```
sage: R.<p>=QQ[]
sage: K.<p>=QQ.extension(p^2-p-1)
sage: r.<x,z>=K[]
sage:  
sage: I=r.ideal(z)
sage: I.primary_decomposition()
#RuntimeError: Error in Singular function call 'primdecSY':
# identifier pr not found in RH
# error occurred in or before primdec.lib::algeDeco line 2732: `      list pr=imap(RH,pr);`
# leaving primdec.lib::algeDeco
# leaving primdec.lib::primdecSY
```


corresponding Singular code:

```
LIB("primdec.lib");
ring rng = (0,p),(x,z), dp;
minpoly = p^2-p-1;
ideal I  = z;
primdecGTZ(I);


LIB("primdec.lib");
ring rng = (0,b),(x,z), dp;
minpoly = b^2-b-1;
ideal I  = z;
primdecGTZ(I);

```



---

Comment by jakobkroeker created at 2015-02-21 08:44:42

Tracked down to the shadowing bug ( see [Singular forum discussion](http://www.singular.uni-kl.de/forum/viewtopic.php?f=10&t=2482&sid=64e9f0044ed3cf5020d494a45172f3dc)):
in cases we use `p` as parameter name minpoly gets lost in primdec.lib::algedeco() 
in `(execute(mp) := execute("poly p = p^2-p-1"))` statement.
The strange thing about this is that while calling Singular from sage 
its losing `'p^2-p'` part , but when using standalone Singular, it is keeping `'p^2'` and losing `'-p'`.
Strange.


---

Comment by @DaveWitteMorris created at 2021-01-29 03:07:19

Changing status from new to needs_review.


---

Comment by @DaveWitteMorris created at 2021-01-29 03:07:19

Changing priority from major to minor.


---

Comment by @DaveWitteMorris created at 2021-01-29 03:07:19

The two previously failing examples work now, so the PR adds them as doctests.
----
New commits:


---

Comment by @mwageringel created at 2021-02-17 20:34:53

Changing status from needs_review to positive_review.


---

Comment by @mwageringel created at 2021-02-17 20:34:53

This looks good to me.


---

Comment by vbraun created at 2021-03-09 00:00:56

Resolution: fixed
