# Issue 14236: bug in max?

Issue created by migration from Trac.

Original creator: zimmerma

Original creation time: 2013-04-11 10:25:13

Assignee: burcin

I'm not sure this is a bug or a feature:

```
sage: max(x^2, 2*x^2)
x^2
sage: max(2*x^2, x^2)
2*x^2
```

Paul


---

Comment by kcrisman created at 2013-04-11 14:51:25

Changing status from new to needs_review.


---

Comment by kcrisman created at 2013-04-11 14:51:25

Feature.

```
sage: max(x,x^2)
x
sage: max(x^2,x)
x^2
sage: max_symbolic(x,x^2)
max(x, x^2)
sage: max_symbolic(x^2,x)
max(x^2, x)
sage: max_symbolic(x^2,x).subs(x=.5)
0.500000000000000
sage: max_symbolic(x,x^2).subs(x=.5)
0.500000000000000
sage: max_symbolic(x^2,x).subs(x=2)
4
sage: max_symbolic(x,x^2).subs(x=2)
4
```

This comes up pretty frequently, but since `max` is a Python built-in, we can't really override it easily in the "right" way for this to work differently, and it would probably be bad to add a little message about "if you really want..." since often max is just the right thing.


---

Comment by kcrisman created at 2013-04-11 14:51:33

Changing status from needs_review to positive_review.


---

Comment by jdemeyer created at 2013-04-11 16:21:38

Resolution: wontfix


---

Comment by zimmerma created at 2013-04-11 17:42:25

thank you Karl-Dieter. We'll add an example of `max_symbolic` in our book.

Paul


---

Comment by kcrisman created at 2013-04-11 18:06:39

> thank you Karl-Dieter. We'll add an example of `max_symbolic` in our book.

Oh, that would be awesome.  Quality references for these kinds of things are worth so much for Sage.
