# Issue 21511: change the mod method of rationals

Issue created by migration from https://trac.sagemath.org/ticket/21748

Original creator: vdelecroix

Original creation time: 2016-10-23 16:12:19

The current behavior of `mod` on Sage rationals is currently useless

```
sage: (2/3).mod(5)
0
sage: (2/3).mod(6)
0
```

And very different from `mod_ui` does

```
sage: (2/3).mod_ui(5)
4
sage: (2/3).mod_ui(6)
Traceback (most recent call last):
...
ArithmeticError: The inverse of 3 modulo 6 is not defined.
```


This ticket stands for changing the behavior of `mod` on rationals to be consistent to `mod_ui`. That would also make it compatible with PARI/GP `Mod` and maple `mod`.
