# Issue 10812: Degree() method of permutation group should (always) return a sage integer

Issue created by migration from Trac.

Original creator: nborie

Original creation time: 2011-03-06 11:09:41

Assignee: nborie

CC:  sage-combinat

There is some cases for which the degree method for PermutationGroup return a GapElement and not a sage integer.


```
sage: G = PermutationGroup([This is the Trac macro ** that was inherited from the migration called with arguments (1,2,3,4))](https://trac.sagemath.org/wiki/WikiMacros#-macro))
sage: type(G.degree())
<type 'int'>
sage: H = G._gap_()
sage: H
Group( [ (1,2,3,4) ] )
sage: I = PermutationGroup(gap_group=H)
sage: type(I.degree())
<class 'sage.interfaces.gap.GapElement'>
sage: I == G
True
sage: G = TransitiveGroup(6,3)
sage: type(I.degree())
<class 'sage.interfaces.gap.GapElement'>
```



---

Attachment


---

Comment by nborie created at 2011-03-06 18:45:16

That is a very small bug... It came out when running another feature over Transitive Groups coming from the Gap database. I propose a very small patch to fix that (as Integer ring is already imported in the file permgroup.py). As I don't really know how this deserves to be done and documented, feel free to give advises and comments to fix it.


---

Comment by nborie created at 2011-03-06 18:45:16

Changing status from new to needs_review.


---

Comment by nborie created at 2011-03-06 20:28:50

Resolution: invalid


---

Comment by nborie created at 2011-03-06 20:28:50

Whhaaaaa!

I managed to report a bug which is not in Sage! 

The quoting behavior was obtained with a very special state of Sage-Combinat. Effectively, with no patch applied, there is no problem. The method works fine.

```
sage: G = TransitiveGroup(6,3)
sage: type(G.degree())
<type 'sage.rings.integer.Integer'>
sage: G = PermutationGroup([This is the Trac macro ** that was inherited from the migration called with arguments (1,2,3,4))](https://trac.sagemath.org/wiki/WikiMacros#-macro))
sage: H = G._gap_()
sage: I = PermutationGroup(gap_group=H)
sage: type(I.degree())
<type 'sage.rings.integer.Integer'>
```


I just realize it when the buildbot said the apply failed... For this reason, I think this ticket should be closed.
