# Issue 15704: Incorrect matrix vector multiplication with real interval field RIF elements

archive/issues_015704.json:
```json
{
    "body": "CC:  jakobkroeker\n\nKeywords: RIF matrix vector\n\nOccurs when elements are RealIntervalField intervals containing zero.\n\n\n```\nsage: matrix(((1,0),(0,1)))*vector((RIF(-1,1),RIF(-1,1)))\n(0, 0)\nsage: _ == vector((RIF(0), RIF(0)))\nTrue\n```\n\n\nSeems likely this is due to applying a zero test that is not valid for interval terms.\n\nIt is not a coercion issue: the above behaves identically when the matrix elements are made explicitly RIF.\n\nIssue created by migration from https://trac.sagemath.org/ticket/15941\n\n",
    "created_at": "2014-03-14T16:22:24Z",
    "labels": [
        "component: linear algebra",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-duplicate/invalid/wontfix",
    "title": "Incorrect matrix vector multiplication with real interval field RIF elements",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/15704",
    "user": "https://trac.sagemath.org/admin/accounts/users/tcoffee"
}
```
CC:  jakobkroeker

Keywords: RIF matrix vector

Occurs when elements are RealIntervalField intervals containing zero.


```
sage: matrix(((1,0),(0,1)))*vector((RIF(-1,1),RIF(-1,1)))
(0, 0)
sage: _ == vector((RIF(0), RIF(0)))
True
```


Seems likely this is due to applying a zero test that is not valid for interval terms.

It is not a coercion issue: the above behaves identically when the matrix elements are made explicitly RIF.

Issue created by migration from https://trac.sagemath.org/ticket/15941





---

archive/issue_comments_203044.json:
```json
{
    "body": "works for me in 9.8beta1\n\n```\nsage: matrix(((1,0),(0,1)))*vector((RIF(-1,1),RIF(-1,1)))\n(0.?, 0.?)\nsage: _ == vector((RIF(0), RIF(0)))\nFalse\n```\n",
    "created_at": "2022-10-13T12:46:07Z",
    "issue": "https://github.com/sagemath/sagetest/issues/15704",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/15704#issuecomment-203044",
    "user": "https://github.com/dimpase"
}
```

works for me in 9.8beta1

```
sage: matrix(((1,0),(0,1)))*vector((RIF(-1,1),RIF(-1,1)))
(0.?, 0.?)
sage: _ == vector((RIF(0), RIF(0)))
False
```




---

archive/issue_comments_203045.json:
```json
{
    "body": "Changing status from new to needs_review.",
    "created_at": "2022-10-13T12:46:07Z",
    "issue": "https://github.com/sagemath/sagetest/issues/15704",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/15704#issuecomment-203045",
    "user": "https://github.com/dimpase"
}
```

Changing status from new to needs_review.



---

archive/issue_comments_203046.json:
```json
{
    "body": "Changing status from needs_review to positive_review.",
    "created_at": "2022-10-13T12:46:15Z",
    "issue": "https://github.com/sagemath/sagetest/issues/15704",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/15704#issuecomment-203046",
    "user": "https://github.com/dimpase"
}
```

Changing status from needs_review to positive_review.



---

archive/issue_comments_203047.json:
```json
{
    "body": "Resolution: invalid",
    "created_at": "2022-11-14T19:36:43Z",
    "issue": "https://github.com/sagemath/sagetest/issues/15704",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/15704#issuecomment-203047",
    "user": "https://github.com/mkoeppe"
}
```

Resolution: invalid



---

archive/issue_events_015316.json:
```json
{
    "actor": "@mkoeppe",
    "created_at": "2022-11-14T19:36:43Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/15704",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/15704#event-15316"
}
```
