# Issue 27722: bug in exp_polar

Issue created by migration from https://trac.sagemath.org/ticket/27959

Original creator: chapoton

Original creation time: 2019-06-09 11:22:05

CC:  rws


```
sage: N(exp_polar(1))
2.71828182845905
sage: N(exp_polar(pi))
23.1406926327793
sage: N(exp_polar(I))
0.540302305868140 + 0.841470984807897*I
sage: N(exp_polar(I*pi))
-1.00000000000000
sage: N(exp_polar(-I*pi))
---------------------------------------------------------------------------
ValueError                                Traceback (most recent call last)
<ipython-input-18-98c6a0bd1ff9> in <module>()
----> 1 N(exp_polar(-I*pi))

/home/chapoton/sage3/local/lib/python3.7/site-packages/sage/misc/functional.py in numerical_approx(x, prec, digits, algorithm)
   1417         return numerical_approx_generic(x, prec)
   1418     else:
-> 1419         return n(prec, algorithm=algorithm)
   1420 
   1421 n = numerical_approx

/home/chapoton/sage3/local/lib/python3.7/site-packages/sage/symbolic/expression.pyx in sage.symbolic.expression.Expression.numerical_approx (build/cythonized/sage/symbolic/expression.cpp:34041)()
   5964         kwds = {'parent': R, 'algorithm': algorithm}
   5965         try:
-> 5966             x = x._convert(kwds)
   5967         except TypeError: # numerical approximation for real number failed
   5968             pass          # try again with complex

/home/chapoton/sage3/local/lib/python3.7/site-packages/sage/symbolic/expression.pyx in sage.symbolic.expression.Expression._convert (build/cythonized/sage/symbolic/expression.cpp:10127)()
   1272             0
   1273         """
-> 1274         cdef GEx res = self._gobj.evalf(0, kwds)
   1275         return new_Expression_from_GEx(self._parent, res)
   1276 

/home/chapoton/sage3/local/lib/python3.7/site-packages/sage/functions/log.py in _evalf_(self, z, parent, algorithm)
   1079             return exp(z)
   1080         else:
-> 1081             raise ValueError("invalid attempt to numerically evaluate exp_polar()")
   1082 
   1083     def _eval_(self, z):

ValueError: invalid attempt to numerically evaluate exp_polar()
```



---

Comment by chapoton created at 2019-06-09 11:29:58

ok, the doc says why:

```
        The function is left unevaluated when the imaginary part of the
        input `z` does not satisfy `-\pi < \Im(z) \leq \pi`::
```

But this is a very strange thing to do. At least for -I*pi..


---

Comment by embray created at 2019-06-14 14:55:02

As the Sage-8.8 release milestone is pending, we should delete the sage-8.8 milestone for tickets that are not actively being worked on or that still require significant work to move forward.  If you feel that this ticket should be included in the next Sage release at the soonest please set its milestone to the next release milestone (sage-8.9).
