# Issue 11251: Make atan2(0,0) consistent

Issue created by migration from Trac.

Original creator: kcrisman

Original creation time: 2011-06-03 12:47:21

Assignee: burcin

CC:  titusn

This is bad:


```
    sage: atan2(0,0)
    0
    sage: atan2(0,0,hold=True)
    arctan2(0, 0)
    sage: atan2(0,0,hold=True).n()
    ValueError: arctan2(0,0) undefined
    sage: atan2(0,0,hold=True).simplify()
    -----------------------------------------------------
    TypeError: Error executing code in Maxima
    CODE:
    	sage1 : atan2(0,0)$
    Maxima ERROR:
    	
    atan2: atan2(0,0) is undefined.
     -- an error. To debug this try: debugmode(true);
```


Probably we should make sure that atan2(0,0) always raises an error.  Wolfram Alpha/Mathematica gives the interval from -pi to pi, which seems as good as any answer, and who knows what others do.

Originally reported at [ask.sagemath.org](http://ask.sagemath.org/question/578/atan2-bug).


---

Comment by vbraun created at 2011-06-18 05:44:23

I made a patch to pynac yield the following. I'll try to push the patch into the new pynac release at #9880.

```
sage: atan2(0,0)
---------------------------------------------------------------------------
RuntimeError                              Traceback (most recent call last)

/home/vbraun/opt/sage-4.7.1.alpha2/devel/sage-main/<ipython console> in <module>()

/home/vbraun/Sage/sage/local/lib/python2.6/site-packages/sage/symbolic/function.so in sage.symbolic.function.GinacFunction.__call__ (sage/symbolic/function.cpp:6712)()

/home/vbraun/Sage/sage/local/lib/python2.6/site-packages/sage/symbolic/function.so in sage.symbolic.function.Function.__call__ (sage/symbolic/function.cpp:4650)()

RuntimeError: arctan2_eval(): arctan2(0,0) encountered
```



---

Comment by vbraun created at 2011-06-18 05:44:23

Changing keywords from "" to "sd31".


---

Comment by kcrisman created at 2011-06-19 01:24:45

Should that be reported upstream?  Just curious.


---

Comment by burcin created at 2012-05-12 16:43:18

GiNaC probably got `atan2(0,0) -> 0` from Maple:

```
    |\^/|     Maple 12 (X86 64 LINUX)
._|\|   |/|_. Copyright (c) Maplesoft, a division of Waterloo Maple Inc. 2008
 \  MAPLE  /  All rights reserved. Maple is a trademark of
 <____ ____>  Waterloo Maple Inc.
      |       Type ? for help.
> arctan(0,0);
                                       0
```


MMA prints an error like Maxima:

```
In[5]:= ArcTan[0,0]

ArcTan::indet: Indeterminate expression ArcTan[0, 0] encountered.

Out[5]= Interval[{-Pi, Pi}]
```


Titus points out that with Volker's patch, `arg(0)` in Sage also gives an error. All of MMA, Maple and Maxima evaluate that to 0 though.


---

Comment by burcin created at 2012-05-15 22:32:37

Pynac 0.2.4 (#12950), includes the patch Volker mentioned in comment:2. Attached to that ticket there is also a patch by Titus fixing failing doctests in symbolics related files and modifying the `arg()` function so that `arg(0)` still returns 0.

Apparently this change breaks some tests in 3d plotting. We should open a ticket with that and make this one depend on it. Titus, can you handle that?


---

Comment by kcrisman created at 2012-05-16 02:16:37

> Apparently this change breaks some tests in 3d plotting. We should open a ticket with that and make this one depend on it. Titus, can you handle that?

And please cc me on that ticket, thanks.


---

Comment by burcin created at 2012-06-29 10:46:25

This was fixed with #12950.


---

Comment by burcin created at 2012-06-29 10:46:25

Changing status from new to needs_review.


---

Comment by burcin created at 2012-06-29 10:46:41

Changing status from needs_review to positive_review.


---

Comment by jdemeyer created at 2012-07-04 07:22:58

Resolution: duplicate
