# Issue 15617: series of x^s, when s is symbolic

archive/issues_015617.json:
```json
{
    "body": "CC:  mforets\n\nKeywords: symbolic, series, exponent\n\nWe have the following behaviour:\n\n```\nsage: var('s')\ns\nsage: (x^s).series(x, 0)\nOrder(1)\nsage: (x^s).series(x, 1)\n(0^s) + Order(x)\nsage: (x^s).series(x, 2)\n---------------------------------------------------------------------------\nValueError                                Traceback (most recent call last)\n<ipython-input-4-5abc79662303> in <module>()\n----> 1 (x**s).series(x, Integer(2))\n\n/usr/opt/sage-6.1.1/local/lib/python2.7/site-packages/sage/symbolic/expression.so in sage.symbolic.expression.Expression.series (sage/symbolic/expression.cpp:17596)()\n\nValueError: power::eval(): division by zero\n```\n\nThis output is weird and definitely wrong (since the correct output depends strongly on `s`.). \n\n\nIssue created by migration from https://trac.sagemath.org/ticket/15854\n\n",
    "created_at": "2014-02-24T09:25:55Z",
    "labels": [
        "symbolics",
        "major",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-6.4",
    "title": "series of x^s, when s is symbolic",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/15617",
    "user": "dkrenn"
}
```
CC:  mforets

Keywords: symbolic, series, exponent

We have the following behaviour:

```
sage: var('s')
s
sage: (x^s).series(x, 0)
Order(1)
sage: (x^s).series(x, 1)
(0^s) + Order(x)
sage: (x^s).series(x, 2)
---------------------------------------------------------------------------
ValueError                                Traceback (most recent call last)
<ipython-input-4-5abc79662303> in <module>()
----> 1 (x**s).series(x, Integer(2))

/usr/opt/sage-6.1.1/local/lib/python2.7/site-packages/sage/symbolic/expression.so in sage.symbolic.expression.Expression.series (sage/symbolic/expression.cpp:17596)()

ValueError: power::eval(): division by zero
```

This output is weird and definitely wrong (since the correct output depends strongly on `s`.). 


Issue created by migration from https://trac.sagemath.org/ticket/15854





---

archive/issue_comments_202153.json:
```json
{
    "body": "Still there in 6.6",
    "created_at": "2015-04-16T20:13:34Z",
    "issue": "https://github.com/sagemath/sagetest/issues/15617",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/15617#issuecomment-202153",
    "user": "dkrenn"
}
```

Still there in 6.6



---

archive/issue_comments_202154.json:
```json
{
    "body": "Could you please specify what output exactly to expect?",
    "created_at": "2015-06-14T06:38:49Z",
    "issue": "https://github.com/sagemath/sagetest/issues/15617",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/15617#issuecomment-202154",
    "user": "rws"
}
```

Could you please specify what output exactly to expect?



---

archive/issue_comments_202155.json:
```json
{
    "body": "Changing status from new to needs_info.",
    "created_at": "2015-06-14T06:38:49Z",
    "issue": "https://github.com/sagemath/sagetest/issues/15617",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/15617#issuecomment-202155",
    "user": "rws"
}
```

Changing status from new to needs_info.



---

archive/issue_comments_202156.json:
```json
{
    "body": "Changing status from needs_info to needs_work.",
    "created_at": "2017-05-03T18:38:43Z",
    "issue": "https://github.com/sagemath/sagetest/issues/15617",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/15617#issuecomment-202156",
    "user": "mforets"
}
```

Changing status from needs_info to needs_work.



---

archive/issue_comments_202157.json:
```json
{
    "body": "there is no error if you declare `s` as integer:\n\n\n```\nsage: s = SR.var('s', domain='integer')\nsage: (x^s).series(x, 2) # ok (?) or we expect x^s\n(0^s) + (0^(s - 1)*s)*x + Order(x^2)\n```\n\n\nto compare, [W|A](http://www.wolframalpha.com/input/?i=series+x%5En+to+order+2) gives various series representations. in this case maybe it could answer just `x^s`?\n\nhowever, there is this closely related issue:\n\n\n```\nsage: n = SR.var('n', domain='integer')\nsage: ((x+1/x)**n).series(x)  # wrong (what happened with n?)\n1 + Order(x^20)\n```\n\none expects something like `1/x^n*(1 + n*x^2 + O(x^3))`.\n\nthis behaviour has side effects for example if you want to compute the residue of this function:\n\n\n```\nsage: f = 1/x*((x^2+1)/(2*x))**(2*k)\nsage: f.residue(x==0)   # wrong\n(1/2)^(2*k)\n```\n\n\nin fact:\n\n\n```\nsage: f(k=4)\n1/256*(x^2 + 1)^8/x^9\nsage: f(k=4).residue(x==0)\n35/128\nsage: f.residue(x==0).subs(k==4)\n1/256\nsage: res(k) = 1/2**(2*k)*binomial(2*k, k)   # correct answer\nsage: res(k=4)\n35/128\n```\n\n\na bit unrelated, but let me mention that SymPy's `residue` gives wrong result for this one (0), and giac gives unevaluated expression.",
    "created_at": "2017-05-03T18:38:43Z",
    "issue": "https://github.com/sagemath/sagetest/issues/15617",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/15617#issuecomment-202157",
    "user": "mforets"
}
```

there is no error if you declare `s` as integer:


```
sage: s = SR.var('s', domain='integer')
sage: (x^s).series(x, 2) # ok (?) or we expect x^s
(0^s) + (0^(s - 1)*s)*x + Order(x^2)
```


to compare, [W|A](http://www.wolframalpha.com/input/?i=series+x%5En+to+order+2) gives various series representations. in this case maybe it could answer just `x^s`?

however, there is this closely related issue:


```
sage: n = SR.var('n', domain='integer')
sage: ((x+1/x)**n).series(x)  # wrong (what happened with n?)
1 + Order(x^20)
```

one expects something like `1/x^n*(1 + n*x^2 + O(x^3))`.

this behaviour has side effects for example if you want to compute the residue of this function:


```
sage: f = 1/x*((x^2+1)/(2*x))**(2*k)
sage: f.residue(x==0)   # wrong
(1/2)^(2*k)
```


in fact:


```
sage: f(k=4)
1/256*(x^2 + 1)^8/x^9
sage: f(k=4).residue(x==0)
35/128
sage: f.residue(x==0).subs(k==4)
1/256
sage: res(k) = 1/2**(2*k)*binomial(2*k, k)   # correct answer
sage: res(k=4)
35/128
```


a bit unrelated, but let me mention that SymPy's `residue` gives wrong result for this one (0), and giac gives unevaluated expression.
