# Issue 31518: NumberFieldEmbedding does not work with relative number fields

Issue created by migration from https://trac.sagemath.org/ticket/31755

Original creator: @Ilia-Smilga

Original creation time: 2021-04-29 12:19:56

CC:  slelievre

Keywords: NumberFieldEmbedding relative

Example (in version 9.1, running on Ubuntu 18.04.3 LTS (64-bit)):



```
sage: K.<sqrt2> = QuadraticField(2, embedding=1.414)
sage: L.<s> = K.extension(x^3 + (sqrt2/2 + 1/3)*x^2 + (2*sqrt2/5+3/7)*x - 1)
sage: from sage.rings.number_field.number_field_morphisms import
NumberFieldEmbedding
sage: my_embedding = NumberFieldEmbedding(L, QQbar, L.relative_polynomial().roots(QQbar)[0][0])
sage: my_embedding
Generic morphism:
  From: Number Field in s with defining polynomial x^3 + (1/2*sqrt2 + 1/3)*x^2 + (2/5*sqrt2 + 3/7)*x - 1 over its base field
  To:   Algebraic Field
  Defn: s -> 0.5407496381556470?
sage: my_embedding.gen_image()
0.5407496381556470?
sage: my_embedding(L.gen())
0.01354690080260168?
sage: my_embedding(sqrt2)
-0.9806353488506175?
```


Of course, gen_image() should equal the image of L.gen(), and the image of sqrt2 should be the (positive) square root of 2. The issue seems to stem from Sage somehow confusing the relative generator of L (over K) with the absolute generator of L (over QQ).

Relevant discussion on sage-support: [https://groups.google.com/g/sage-support/c/tRRJ-yEPLu4](https://groups.google.com/g/sage-support/c/tRRJ-yEPLu4)


---

Comment by slelievre created at 2021-04-29 13:14:11

Put your name in the "Authors" field if you contribute code to fix the issue.
