# Issue 20073: change_precision for p-adic rings

Issue created by migration from https://trac.sagemath.org/ticket/20310

Original creator: caruso

Original creation time: 2016-03-27 21:42:44

CC:  saraedum roed

Keywords: precision

I propose to implement a method change_precision for p-adic rings/fields (which is supposed the same ring/field with a different precision).


---

Comment by caruso created at 2016-03-27 21:45:36

As discussed in Sage Days 71, I tried to implement this method using the construction functor but it seems that the latter is only defined for Zp or Qp but not for extensions.
So, what should I do? Implement the methods `construction` as well? Something else?


---

Comment by roed created at 2016-03-27 22:31:05

Implementing `construction` is a good idea anyway, since they're used in coercion.  And until we change extensions to be defined by exact polynomials, you'll need to raise the precision of the base ring as well, so it's probably necessary.
----
New commits:


---

Comment by git created at 2017-06-14 08:58:16

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by git created at 2017-06-15 07:39:03

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by git created at 2017-06-15 21:16:54

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by git created at 2017-06-15 22:22:44

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by git created at 2017-06-15 22:44:34

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by roed created at 2017-06-15 22:45:37

Changing status from new to needs_review.


---

Comment by caruso created at 2017-06-16 05:25:20

I'm a bit sceptical about the possibility of changing `p` (and even `q`). Can you show me a situation where this can be needed?

Adding `show_prec` is nice but is it really the subject of this ticket?

Doctests implying the keyword `base` are missing. The same is true for `show_prec`. More generally, I suggest to add many more doctests ensuring that your code works in a wide range of situations (for ramified, unramified extensions, for extensions constructing via `CompletionFunction` and `AlgebraicExtensionFunctor`, etc.)


---

Comment by saraedum created at 2017-06-16 06:25:07

Xavier: Thanks for having a look at this as well. We discussed the changing of `p` and `q` briefly and actually I find it very useful. Often I am only really interested in the ramified part of a tower of extensions (on my fork that already does more general towers.) But for some computation to work out, I need a certain unramified element at the bottom, so I don't want to manually reconstruct the whole tower, so raising and lowering `q` is quite useful. Changing `p` is mostly interesting in general extensions where you want to see how a certain polynomial behaves wrt to different primes. For the Eisenstein extensions that we support atm it is not too useful.

I think it's Ok to put the `show_prec` in here, I'm fine with reviewing it at least :)

I agree that doctests for `base` and `show_prec` should be added. However, I think that in general not all possible cases should be covered by explicit doctests. It usually makes the documentation overwhelming. If we want to have coverage, we should write unit tests for that instead. That's btw one of the topics that we want to push in Burlington! Imho, the testing for `change` is Ok except for the untested keywords.


---

Comment by saraedum created at 2017-06-16 06:26:40

David: should `get_key_base` set `show_prec`? Otherwise, `show_prec=None` and `show_prec=True/False` produces two non-identical parents for the same ring I think.


---

Comment by saraedum created at 2017-06-16 06:28:27

Changing status from needs_review to needs_work.


---

Comment by git created at 2017-06-16 08:19:53

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by roed created at 2017-06-16 08:22:40

Changing status from needs_work to needs_review.


---

Comment by roed created at 2017-06-16 08:22:40

I fixed the show_prec issue.


---

Comment by saraedum created at 2017-06-16 11:46:52

Looks good to me. Feel free to set this to positive review if the tests pass.


---

Comment by caruso created at 2017-06-16 20:28:22


```
sage: R = Zp(5)
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)
<ipython-input-1-1247c7c70bf9> in <module>()
----> 1 R = Zp(Integer(5))

/home/xavier/sage/src/sage/structure/factory.pyx in sage.structure.factory.UniqueFactory.__call__ (/home/xavier/sage/src/build/cythonized/sage/structure/factory.c:1728)()
    360             False
    361         """
--> 362         key, kwds = self.create_key_and_extra_args(*args, **kwds)
    363         version = self.get_version(sage_version)
    364         return self.get_object(version, key, kwds)

/home/xavier/sage/src/sage/structure/factory.pyx in sage.structure.factory.UniqueFactory.create_key_and_extra_args (/home/xavier/sage/src/build/cythonized/sage/structure/factory.c:2921)()
    458             ((3, ('x',), None, 'modn', "{'foo': 'value'}", 3, 1, True), {'foo': 'value'})
    459         """
--> 460         return self.create_key(*args, **kwds), {}
    461 
    462     def create_key(self, *args, **kwds):

/home/xavier/sage/local/lib/python2.7/site-packages/sage/rings/padics/factory.pyc in create_key(self, p, prec, type, print_mode, halt, names, ram_name, print_pos, print_sep, print_alphabet, print_max_terms, show_prec, check)
   1608         """
   1609         return get_key_base(p, prec, type, print_mode, halt, names, ram_name, print_pos, print_sep, print_alphabet,
-> 1610                             print_max_terms, show_prec, check, ['capped-rel', 'fixed-mod', 'capped-abs', 'floating-point'])
   1611 
   1612     def create_object(self, version, key):

/home/xavier/sage/local/lib/python2.7/site-packages/sage/rings/padics/factory.pyc in get_key_base(p, prec, type, print_mode, halt, names, ram_name, print_pos, print_sep, print_alphabet, print_max_terms, show_prec, check, valid_non_lazy_types)
    161         if type == 'floating-point':
    162             show_prec = False
--> 163         elif print_mode ('series', 'terse', 'val-unit'):
    164             show_prec = True
    165         else:

TypeError: 'str' object is not callable
```



---

Comment by caruso created at 2017-06-16 20:28:22

Changing status from needs_review to needs_work.


---

Comment by caruso created at 2017-06-16 20:38:39

By the way, I guess that your changes is not compatible with ticket #22103. 

It's of course not that annoying (and, as I've already said, I'm fine with adding the keyword `show_prec`) but maybe we could have a discussion about the "right way" to print p-adic numbers.


---

Comment by git created at 2017-06-16 21:49:11

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by roed created at 2017-06-16 21:51:49

I just fixed various doctest issues and added some code for the case of changing print_mode (show_prec was not changed).  I ran all tests on the result, and they all pass, but I think I need someone to take a look rather than just setting it to positive review.


---

Comment by roed created at 2017-06-16 21:51:49

Changing status from needs_work to needs_review.


---

Comment by caruso created at 2017-06-17 02:50:41

Well, I'm still not that convinced by changing `p`. You say that "it is mostly interesting in general extensions where you want to see how a certain polynomial behaves wrt to different primes" but I guess that the modulus is just stored modulo `p^prec`, so converting it in others `Z_p`'s may lead to very unexpected behaviours, no?
I nevertheless agree that changing `q` (keeping the same `p`) makes more sense.

Anyway, changing `p` actually does not work in many cases:


```
sage: R.<a> = Zq(5^3)
sage: R.change(p=7)
...
NotImplementedError: conversion between padic extensions not implemented
```


For ramified extensions, something very stange happens:


```
sage: R.<a> = Zp(5).extension(x^3 + 5)
sage: R
Eisenstein Extension of 5-adic Ring with capped relative precision 20 in a defined by  (1 + O(5^20))*x^3 + (O(5^21))*x^2 + (O(5^21))*x + (5 + O(5^21))

sage: S = R.change(p=7)
sage: S
Unramified Extension of 7-adic Ring with capped relative precision 20 in a defined by (1 + O(5^20))*x^3 + (O(5^20))*x^2 + (O(5^20))*x + (5 + O(5^20))
```


Look at the modulus, it is still written with some `O(5^20)`'s (whereas we are supposed to be on a 7-adic ring). Even more stranger:


```
sage: c = S.modulus()[0]; c
5 + O(5^20)
sage: c.parent()
7-adic Ring with capped relative precision 20

sage: c.parent() is Zp(7)
False
```


As a conclusion, I would be in favour to remove this feature.


---

Comment by caruso created at 2017-06-17 02:50:41

Changing status from needs_review to needs_work.


---

Comment by caruso created at 2017-06-17 02:54:54

Other issues with the change of precision:


```
sage: R.<a> = Zq(5^3)
sage: S = R.change(prec=50)
sage: S
Unramified Extension of 5-adic Ring with capped relative precision 50 in a defined by (1 + O(5^20))*x^3 + (O(5^20))*x^2 + (3 + O(5^20))*x + (3 + O(5^20))
```


The defining polynomial has not been lifted to precision 50.

In fact, it seems that we cannot compute at all at precision 50 is `S`:


```
sage: S.gen()
a + O(5^20)
sage: S.precision_cap()
20
```


For ramified extensions, the precision on the modulus decreases:


```
sage: R.<a> = Zp(5).extension(x^3 + 5)
sage: R
Eisenstein Extension of 5-adic Ring with capped relative precision 20 in a defined by (1 + O(5^20))*x^3 + (O(5^21))*x^2 + (O(5^21))*x + (5 + O(5^21))
sage: S = R.change(prec=50)
sage: S
Eisenstein Extension of 5-adic Ring with capped relative precision 20 in a defined by (1 + O(5^18))*x^3 + (O(5^18))*x^2 + (O(5^18))*x + (5 + O(5^18))
```


but (unexpectedly) computations in `S` seem to be fine.


---

Comment by roed created at 2017-06-17 07:08:35

Good points.  We've also been thinking about switching defining polynomials to being exact, in which case some of the precision issues go away.

I'll take a look at this when I'm back, in a week and a half or so.


---

Comment by git created at 2017-06-28 01:15:19

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by git created at 2017-06-28 01:40:15

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by git created at 2017-06-28 02:05:16

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by roed created at 2017-06-28 02:06:08

I fixed the printing problem that was causing the weird behavior you observed when changing p.  If the defining polynomial is defined over the integers, then changing p works; if not it doesn't.

I also added an error if you try to increase the precision above the limit imposed by the defining polynomial.


---

Comment by roed created at 2017-06-28 02:06:08

Changing status from needs_work to needs_review.


---

Comment by git created at 2017-06-28 02:20:35

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by roed created at 2017-06-28 02:31:40

All tests pass for me.


---

Comment by caruso created at 2017-06-28 20:59:22

Not a complete review, but I noticed the following:

In the doctest of the method `change`, some items are introduced by `--` instead of `-`.

When creating an unramified extension, we cannot specify the variable name using the keyword `unram_name`:


```
sage: R = Zp(5)
sage: R.change(q=25, unram_name='a')
...
TypeError: You must specify the name of the generator

sage: R2.<a> = Zq(5^2)
sage: R2.change(q=125,unram_name='b')
Unramified Extension of 5-adic Ring with capped relative precision 20 in a defined by (1 + O(5^20))*x^3 + (O(5^20))*x^2 + (3 + O(5^20))*x + (3 + O(5^20))
```


(Note nevertheless than using `names` instead of `unram_name` works fine.)

I am a bit lost with exact VS inexact defining polynomials. For instance:


```
sage: var('x')
x
sage: R.<a> = Zq(5^2, modulus=x^2+2*x+4)
sage: R.change(p=11)
Unramified Extension of 11-adic Ring with capped relative precision 20 in a defined by (1 + O(11^20))*x^2 + (2 + O(11^20))*x + (4 + O(11^20))

sage: ZX.<x> = ZZ[]
sage: R.<a> = Zq(5^2, modulus=x^2+2*x+4)
sage: R.change(p=11)
...
NotImplementedError: conversion between padic extensions not implemented
```


By the way, even when the defining polynomial is exact, the methods `modulus` and `defining_polynomial` return an inexact polynomial. Is there a method that returns the exact defining polynomial (i.e. the content of the attribute `_pre_poly` as far as I understand)?


---

Comment by caruso created at 2017-06-28 20:59:22

Changing status from needs_review to needs_work.


---

Comment by git created at 2017-06-28 22:59:08

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by roed created at 2017-06-28 23:01:46

Replying to [comment:32 caruso]:
> Not a complete review, but I noticed the following:
> 
> In the doctest of the method `change`, some items are introduced by `--` instead of `-`.

Fixed, thanks.

> When creating an unramified extension, we cannot specify the variable name using the keyword `unram_name`:
> 
> {{{
> sage: R = Zp(5)
> sage: R.change(q=25, unram_name='a')
> ...
> TypeError: You must specify the name of the generator
> 
> sage: R2.<a> = Zq(5^2)
> sage: R2.change(q=125,unram_name='b')
> Unramified Extension of 5-adic Ring with capped relative precision 20 in a defined by (1 + O(5<sup>20))*x</sup>3 + (O(5<sup>20))*x</sup>2 + (3 + O(5^20))*x + (3 + O(5^20))
> }}}
> 
> (Note nevertheless than using `names` instead of `unram_name` works fine.)

Fixed.

> I am a bit lost with exact VS inexact defining polynomials. For instance:
> 
> {{{
> sage: var('x')
> x
> sage: R.<a> = Zq(5^2, modulus=x^2+2*x+4)
> sage: R.change(p=11)
> Unramified Extension of 11-adic Ring with capped relative precision 20 in a defined by (1 + O(11<sup>20))*x</sup>2 + (2 + O(11^20))*x + (4 + O(11^20))
> 
> sage: ZX.<x> = ZZ[]
> sage: R.<a> = Zq(5^2, modulus=x^2+2*x+4)
> sage: R.change(p=11)
> ...
> NotImplementedError: conversion between padic extensions not implemented
> }}}

I get that both of these work.  It's possible that your cache has been poisoned by trying to first create R using a p-adic modulus, and then later with a modulus over Z?  This is the kind of thing that might be alleviated by #23331.

> By the way, even when the defining polynomial is exact, the methods `modulus` and `defining_polynomial` return an inexact polynomial. Is there a method that returns the exact defining polynomial (i.e. the content of the attribute `_pre_poly` as far as I understand)?

I don't think there's currently a method to get `_pre_poly`. I would suggest holding off on that change until #23331.


---

Comment by caruso created at 2017-06-29 05:26:20

> I get that both of these work. It's possible that your cache has been poisoned by trying to first create R using a p-adic modulus, and then later with a modulus over Z? This is the kind of thing that might be alleviated by #23331. 

Good point. With a fresh session of sage, I have:


```
sage: R.<a> = Zq(5^2, modulus=x^2+2*x+4)
sage: R.change(p=11)
Unramified Extension of 11-adic Ring with capped relative precision 20 in a defined by (1 + O(11^20))*x^2 + (2 + O(11^20))*x + (4 + O(11^20))
sage: 
sage: ZX.<x> = ZZ[]
sage: R.<a> = Zq(5^2, modulus=x^2+2*x+4)
sage: R.change(p=11)
Unramified Extension of 11-adic Ring with capped relative precision 20 in a defined by (1 + O(11^20))*x^2 + (2 + O(11^20))*x + (4 + O(11^20))
```


but:


```
sage: ZpX.<x> = Zp(5)[]
sage: R1.<a> = Zq(5^2, modulus=x^2+2*x+4)
sage: R1.change(p=11)
...
NotImplementedError: conversion between padic extensions not implemented

sage: ZX.<x> = ZZ[]
sage: R2.<a> = Zq(5^2, modulus=x^2+2*x+4)
sage: R2.change(p=11)
...
NotImplementedError: conversion between padic extensions not implemented
```


and conversely:


```
sage: ZX.<x> = ZZ[]
sage: R2.<a> = Zq(5^2, modulus=x^2+2*x+4)
sage: R2.change(p=11)
Unramified Extension of 11-adic Ring with capped relative precision 20 in a defined by (1 + O(11^20))*x^2 + (2 + O(11^20))*x + (4 + O(11^20))

sage: ZpX.<x> = Zp(5)[]
sage: R1.<a> = Zq(5^2, modulus=x^2+2*x+4)
sage: R1.change(p=11)
Unramified Extension of 11-adic Ring with capped relative precision 20 in a defined by (1 + O(11^20))*x^2 + (2 + O(11^20))*x + (4 + O(11^20))
```


I guess that the problem comes from the factory because, in the above examples, `R1` is the same as `R2` (i.e. `R1 is R2` answers `True`).


---

Comment by roed created at 2017-06-30 04:00:08

Changing status from needs_work to needs_review.


---

Comment by saraedum created at 2017-07-02 02:56:35

Changing status from needs_review to positive_review.


---

Comment by saraedum created at 2017-07-02 02:56:35

Unless Xavier has any objections of course.


---

Comment by caruso created at 2017-07-02 04:44:46

Changing status from positive_review to needs_work.


---

Comment by caruso created at 2017-07-02 04:44:46

Well, I am a bit worried to give a positive review after comment 35 (which is clearly a bug for me).

I am fine with fixing this in ticket #23331 but, in that case, I would wait for #23331 to be written and positively reviewed before giving a positive review to the current ticket (#20310)


---

Comment by saraedum created at 2017-07-03 05:16:08

I don't see how this is related to this ticket really. This is just a bug in the factory that has always been there. The same problem at least happens on a stable sage

```
sage: ZpX.<x> = Zp(5)[]
sage: R1.<a> = Zq(5^2, modulus=x^2+2*x+4)
sage: ZX.<x> = ZZ[]
sage: R2.<a> = Zq(5^2, modulus=x^2+2*x+4)
sage: R1 is R2
True
```


I guess my point is that you could use this to construct problems with many methods in Sage. I do not see why we should have `change()` be blocked by this now. (We should of course fix this, neverthelessâ€¦)


---

Comment by saraedum created at 2017-07-03 05:16:17

Changing status from needs_work to needs_review.


---

Comment by caruso created at 2017-07-03 06:23:09

I do not agree. This was not a bug until this ticket implemented a method, namely `change`, that decides to treat differently extensions defined by exact and inexact polynomials.


---

Comment by saraedum created at 2017-07-03 06:43:14

Changing status from needs_review to positive_review.


---

Comment by saraedum created at 2017-07-03 06:43:14

Ok. I guess you're right that this was much more unlikely to cause trouble before.

I still don't think that this should block this ticket, but I guess we have to wait for #23331 then.


---

Comment by git created at 2017-07-19 07:28:56

Changing status from positive_review to needs_review.


---

Comment by git created at 2017-07-19 07:28:56

Branch pushed to git repo; I updated commit sha1 and set ticket back to needs_review. New commits:


---

Comment by roed created at 2017-07-19 07:34:29

I merged in the dependency #23331; all tests pass.


---

Comment by git created at 2017-07-19 21:59:41

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by git created at 2017-07-19 23:14:42

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by saraedum created at 2017-07-20 02:22:43

positive review once the patchbot is happy.
----
New commits:


---

Comment by git created at 2017-07-20 17:57:33

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by roed created at 2017-07-20 19:56:58

Changing status from needs_review to positive_review.


---

Comment by git created at 2017-08-02 18:00:04

Changing status from positive_review to needs_review.


---

Comment by git created at 2017-08-02 18:00:04

Branch pushed to git repo; I updated commit sha1 and set ticket back to needs_review. New commits:


---

Comment by roed created at 2017-08-02 20:35:43

Changing status from needs_review to positive_review.


---

Comment by roed created at 2017-08-02 20:35:43

I just merged in the updated #23331.


---

Comment by git created at 2017-08-02 20:38:10

Branch pushed to git repo; I updated commit sha1 and set ticket back to needs_review. New commits:


---

Comment by git created at 2017-08-02 20:38:10

Changing status from positive_review to needs_review.


---

Comment by roed created at 2017-08-02 20:38:30

Changing status from needs_review to positive_review.


---

Comment by roed created at 2017-08-03 02:01:54

Diff against 23331


---

Attachment

For ease of reviewing, I've attached a diff against #23331.


---

Comment by vbraun created at 2017-08-05 15:11:21

PDF docs don't build


---

Comment by vbraun created at 2017-08-05 15:11:21

Changing status from positive_review to needs_work.


---

Comment by git created at 2017-08-05 18:15:25

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by git created at 2017-08-06 05:55:53

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by roed created at 2017-08-08 17:00:23

Alright, `make` succeeds at building the docs now.


---

Comment by roed created at 2017-08-08 17:00:23

Changing status from needs_work to needs_review.


---

Comment by saraedum created at 2017-08-08 17:17:35

daucher still reports a failing docbuild. I guess that's because I told it not to clean the docs when rebuilding.


---

Comment by saraedum created at 2017-08-08 17:17:35

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2017-08-11 18:18:12

Resolution: fixed
