# Issue 17002: lcalc returning incorrect values

archive/issues_017002.json:
```json
{
    "body": "CC:  jakobkroeker\n\nKeywords: lcalc\n\n```\nsage: from sage.libs.lcalc.lcalc_Lfunction import *\nsage: Z = Lfunction_Zeta() #Riemann zeta function\nsage: Z.value(100*I)\nNaN - NaN*I\nsage: CDF(100*I).zeta() #the correct value\n6.51721042625 + 0.181288425338*I\nsage: Z.value(99*I) #very large\n-1.05677035996952e16 - 1.77185752069124e15*I\nsage: Z.value(102*I) #very large\n8.96446660698985e16 - 7.32159572862776e16*I\nsage: \nsage: chi = DirichletGroup(7).gens()[0]\nsage: L = Lfunction_from_character(chi) #this one seems to work\nsage: L.value(100*I)\n5.91365407523633 - 3.18382625901338*I\nsage: L = Lfunction_from_character(chi**2) #this one does not\nsage: L.value(100*I)\n1.21202136552168e15 - 7.03760325879769e16*I\n```\n\nNote: this was done with sage 6.2. My apologies if this has been fixed since.\n\nIssue created by migration from https://trac.sagemath.org/ticket/17239\n\n",
    "created_at": "2014-10-28T08:26:23Z",
    "labels": [
        "component: number theory",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-6.4",
    "title": "lcalc returning incorrect values",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/17002",
    "user": "https://trac.sagemath.org/admin/accounts/users/alexc"
}
```
CC:  jakobkroeker

Keywords: lcalc

```
sage: from sage.libs.lcalc.lcalc_Lfunction import *
sage: Z = Lfunction_Zeta() #Riemann zeta function
sage: Z.value(100*I)
NaN - NaN*I
sage: CDF(100*I).zeta() #the correct value
6.51721042625 + 0.181288425338*I
sage: Z.value(99*I) #very large
-1.05677035996952e16 - 1.77185752069124e15*I
sage: Z.value(102*I) #very large
8.96446660698985e16 - 7.32159572862776e16*I
sage: 
sage: chi = DirichletGroup(7).gens()[0]
sage: L = Lfunction_from_character(chi) #this one seems to work
sage: L.value(100*I)
5.91365407523633 - 3.18382625901338*I
sage: L = Lfunction_from_character(chi**2) #this one does not
sage: L.value(100*I)
1.21202136552168e15 - 7.03760325879769e16*I
```

Note: this was done with sage 6.2. My apologies if this has been fixed since.

Issue created by migration from https://trac.sagemath.org/ticket/17239





---

archive/issue_comments_225262.json:
```json
{
    "body": "This is a pure upstream issue with lcalc, nothing to do with Sage. This ticket should be reported upstream.",
    "created_at": "2014-10-28T09:22:12Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17002",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17002#issuecomment-225262",
    "user": "https://github.com/jdemeyer"
}
```

This is a pure upstream issue with lcalc, nothing to do with Sage. This ticket should be reported upstream.



---

archive/issue_comments_225263.json:
```json
{
    "body": "Changing component from number theory to packages: standard.",
    "created_at": "2014-10-28T09:22:21Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17002",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17002#issuecomment-225263",
    "user": "https://github.com/jdemeyer"
}
```

Changing component from number theory to packages: standard.



---

archive/issue_comments_225264.json:
```json
{
    "body": "What's more, in Sage 6.4 I get *different* values.\n\n```\nsage: sage: L = Lfunction_from_character(chi**2) #this one does not\nsage: sage: L.value(100*I)\n-3.39759949284668e16 - 7.09820432707377e16*I\nsage: sage: Z.value(99*I) #very large\n-1.02176956945931e16 - 3.52220370693934e15*I\n```",
    "created_at": "2014-11-20T21:42:13Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17002",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17002#issuecomment-225264",
    "user": "https://github.com/kcrisman"
}
```

What's more, in Sage 6.4 I get *different* values.

```
sage: sage: L = Lfunction_from_character(chi**2) #this one does not
sage: sage: L.value(100*I)
-3.39759949284668e16 - 7.09820432707377e16*I
sage: sage: Z.value(99*I) #very large
-1.02176956945931e16 - 3.52220370693934e15*I
```
