# Issue 23962: Simplifications in calculus on manifolds with derivatives of symbolic functions

archive/issues_023962.json:
```json
{
    "body": "CC:  @man74cio @rll2021 @tscrim\n\nKeywords: manifold calculus\n\nThe function `sage.manifolds.utilities.simplify_sqrt_real`, which is involved in calculus on manifolds (see [here](http://doc.sagemath.org/html/en/reference/manifolds/sage/manifolds/utilities.html#sage.manifolds.utilities.simplify_chain_real)), does not simplify sqrt's as soon as the expression contains some derivative of a symbolic function:\n\n```\nsage: from sage.manifolds.utilities import simplify_sqrt_real\nsage: f = function('f')\nsage: assume(x<1)\nsage: simplify_sqrt_real(sqrt(x^2-2*x+1))  # OK\n-x + 1\nsage: simplify_sqrt_real(sqrt(x^2-2*x+1) * diff(f(x), x))  # nothing done\nsqrt(x^2 - 2*x + 1)*diff(f(x), x)\n```\n\nThe same limitation holds for derivatives denoted by `D[...]` instead of `diff`:\n\n```\nsage: y = var('y'); s = sqrt(x^2-2*x+1) * diff(f(x), x).subs(x=y^2); s\nsqrt(x^2 - 2*x + 1)*D[0](f)(y^2)\nsage: simplify_sqrt_real(s)  # nothing done\nsqrt(x^2 - 2*x + 1)*D[0](f)(y^2)\n```\n\nSimilarly, the function `sage.manifolds.utilities.simplify_abs_trig` does not perform any simplification when a derivative is present:\n\n```\nsage: from sage.manifolds.utilities import simplify_abs_trig\nsage: assume(x>0); assumptions()\n[x < 1, x > 0]\nsage: simplify_abs_trig(abs(sin(x)))  # OK\nsin(x)\nsage: simplify_abs_trig(abs(sin(x)) * diff(f(x), x))  # nothing done\nabs(sin(x))*diff(f(x), x)\n```\n\n\nThe code introduced in this ticket repairs this. We have now, with the same assumptions as above:\n\n```\nsage: simplify_sqrt_real(sqrt(x^2-2*x+1) * diff(f(x), x))\n-(x - 1)*diff(f(x), x)\nsage: simplify_sqrt_real(s)\n-(x - 1)*D[0](f)(y^2)\nsage: simplify_abs_trig(abs(sin(x)) * diff(f(x), x))\nsin(x)*diff(f(x), x)\n```\n\nIn addition, `simplify_abs_trig` is now capable to treat `abs(cos(...))`:\n\n```\nsage: simplify_abs_trig(abs(cos(x))) # recall that 0 < x < 1 < pi/2\ncos(x)\nsage: simplify_abs_trig(abs(cos(x+2)))\n-cos(x + 2)\nsage: simplify_abs_trig(abs(cos(x+2)) * diff(f(x), x))\n-cos(x + 2)*diff(f(x), x)\n```\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/24199\n\n",
    "created_at": "2017-11-11T17:05:06Z",
    "labels": [
        "component: geometry"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-duplicate/invalid/wontfix",
    "title": "Simplifications in calculus on manifolds with derivatives of symbolic functions",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/23962",
    "user": "https://github.com/egourgoulhon"
}
```
CC:  @man74cio @rll2021 @tscrim

Keywords: manifold calculus

The function `sage.manifolds.utilities.simplify_sqrt_real`, which is involved in calculus on manifolds (see [here](http://doc.sagemath.org/html/en/reference/manifolds/sage/manifolds/utilities.html#sage.manifolds.utilities.simplify_chain_real)), does not simplify sqrt's as soon as the expression contains some derivative of a symbolic function:

```
sage: from sage.manifolds.utilities import simplify_sqrt_real
sage: f = function('f')
sage: assume(x<1)
sage: simplify_sqrt_real(sqrt(x^2-2*x+1))  # OK
-x + 1
sage: simplify_sqrt_real(sqrt(x^2-2*x+1) * diff(f(x), x))  # nothing done
sqrt(x^2 - 2*x + 1)*diff(f(x), x)
```

The same limitation holds for derivatives denoted by `D[...]` instead of `diff`:

```
sage: y = var('y'); s = sqrt(x^2-2*x+1) * diff(f(x), x).subs(x=y^2); s
sqrt(x^2 - 2*x + 1)*D[0](f)(y^2)
sage: simplify_sqrt_real(s)  # nothing done
sqrt(x^2 - 2*x + 1)*D[0](f)(y^2)
```

Similarly, the function `sage.manifolds.utilities.simplify_abs_trig` does not perform any simplification when a derivative is present:

```
sage: from sage.manifolds.utilities import simplify_abs_trig
sage: assume(x>0); assumptions()
[x < 1, x > 0]
sage: simplify_abs_trig(abs(sin(x)))  # OK
sin(x)
sage: simplify_abs_trig(abs(sin(x)) * diff(f(x), x))  # nothing done
abs(sin(x))*diff(f(x), x)
```


The code introduced in this ticket repairs this. We have now, with the same assumptions as above:

```
sage: simplify_sqrt_real(sqrt(x^2-2*x+1) * diff(f(x), x))
-(x - 1)*diff(f(x), x)
sage: simplify_sqrt_real(s)
-(x - 1)*D[0](f)(y^2)
sage: simplify_abs_trig(abs(sin(x)) * diff(f(x), x))
sin(x)*diff(f(x), x)
```

In addition, `simplify_abs_trig` is now capable to treat `abs(cos(...))`:

```
sage: simplify_abs_trig(abs(cos(x))) # recall that 0 < x < 1 < pi/2
cos(x)
sage: simplify_abs_trig(abs(cos(x+2)))
-cos(x + 2)
sage: simplify_abs_trig(abs(cos(x+2)) * diff(f(x), x))
-cos(x + 2)*diff(f(x), x)
```


Issue created by migration from https://trac.sagemath.org/ticket/24199





---

archive/issue_comments_335322.json:
```json
{
    "body": "New commits:",
    "created_at": "2017-11-11T17:10:54Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23962",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23962#issuecomment-335322",
    "user": "https://github.com/egourgoulhon"
}
```

New commits:



---

archive/issue_comments_335323.json:
```json
{
    "body": "Changing status from new to needs_review.",
    "created_at": "2017-11-11T17:10:54Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23962",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23962#issuecomment-335323",
    "user": "https://github.com/egourgoulhon"
}
```

Changing status from new to needs_review.



---

archive/issue_comments_335324.json:
```json
{
    "body": "LGTM.\n\nAs a possible improvement for another ticket, instead of string manipulations, you might want to consider contacting, e.g., Ralf (rws) to see if there is a better way by directly manipulating the expression tree. Or if there is an easy way to fix some of these problems upstream.",
    "created_at": "2017-11-11T22:46:11Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23962",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23962#issuecomment-335324",
    "user": "https://github.com/tscrim"
}
```

LGTM.

As a possible improvement for another ticket, instead of string manipulations, you might want to consider contacting, e.g., Ralf (rws) to see if there is a better way by directly manipulating the expression tree. Or if there is an easy way to fix some of these problems upstream.



---

archive/issue_comments_335325.json:
```json
{
    "body": "Changing status from needs_review to positive_review.",
    "created_at": "2017-11-11T22:46:21Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23962",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23962#issuecomment-335325",
    "user": "https://github.com/tscrim"
}
```

Changing status from needs_review to positive_review.



---

archive/issue_comments_335326.json:
```json
{
    "body": "Replying to [comment:2 tscrim]:\n> \n> As a possible improvement for another ticket, instead of string manipulations, you might want to consider contacting, e.g., Ralf (rws) to see if there is a better way by directly manipulating the expression tree. Or if there is an easy way to fix some of these problems upstream.\n\nThanks for the suggestion. I agree that using the expression tree would be an improvement.\n\nAnd thank you for the review!",
    "created_at": "2017-11-11T23:47:32Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23962",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23962#issuecomment-335326",
    "user": "https://github.com/egourgoulhon"
}
```

Replying to [comment:2 tscrim]:
> 
> As a possible improvement for another ticket, instead of string manipulations, you might want to consider contacting, e.g., Ralf (rws) to see if there is a better way by directly manipulating the expression tree. Or if there is an easy way to fix some of these problems upstream.

Thanks for the suggestion. I agree that using the expression tree would be an improvement.

And thank you for the review!



---

archive/issue_comments_335327.json:
```json
{
    "body": "Replying to [comment:4 egourgoulhon]:\n> Replying to [comment:2 tscrim]:\n> > \n> > As a possible improvement for another ticket, instead of string manipulations, you might want to consider contacting, e.g., Ralf (rws) to see if there is a better way by directly manipulating the expression tree. Or if there is an easy way to fix some of these problems upstream.\n> \n> Thanks for the suggestion. I agree that using the expression tree would be an improvement.\n> \n\nDone in #24232",
    "created_at": "2017-11-17T11:16:29Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23962",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23962#issuecomment-335327",
    "user": "https://github.com/egourgoulhon"
}
```

Replying to [comment:4 egourgoulhon]:
> Replying to [comment:2 tscrim]:
> > 
> > As a possible improvement for another ticket, instead of string manipulations, you might want to consider contacting, e.g., Ralf (rws) to see if there is a better way by directly manipulating the expression tree. Or if there is an easy way to fix some of these problems upstream.
> 
> Thanks for the suggestion. I agree that using the expression tree would be an improvement.
> 

Done in #24232



---

archive/issue_comments_335328.json:
```json
{
    "body": "This is superseded by #24232.",
    "created_at": "2017-11-19T10:31:44Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23962",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23962#issuecomment-335328",
    "user": "https://github.com/egourgoulhon"
}
```

This is superseded by #24232.



---

archive/issue_comments_335329.json:
```json
{
    "body": "Resolution: wontfix",
    "created_at": "2017-12-12T08:23:33Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23962",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23962#issuecomment-335329",
    "user": "https://github.com/embray"
}
```

Resolution: wontfix
