# Issue 12232: is_squarefree() incorrect over imperfect fields

Issue created by migration from Trac.

Original creator: saraedum

Original creation time: 2012-01-31 17:58:03

Assignee: malb

CC:  sydahmad

The method `is_squarefree()` is incorrect for polynomials over function fields over finite fields:


```
sage: K.<x> = FunctionField(GF(3))
sage: R.<T> = K[]
sage: f=T^3-x
sage: f.factor(proof=False)
T^3 + 2*x
sage: f.is_squarefree()
False
```



---

Comment by saraedum created at 2012-01-31 18:02:55

The method `is_squarefree()` returns `self.derivative().gcd(self).degree() <= 0`. In the example the derivative vanishes which leads to the incorrect behaviour.

As a quick workaround one can do:

```
True in [d>=2 for (f,d) in f.factor(proof=False)]
```



---

Comment by saraedum created at 2012-01-31 18:06:09

Replying to [comment:1 saraedum]:
> {{{
> True in [d>=2 for (f,d) in f.factor(proof=False)]
> }}}
This would be "is_not_squarefree()" of course.


---

Comment by zimmerma created at 2012-05-11 07:18:27

see also #12198.

Paul


---

Comment by zimmerma created at 2012-05-11 07:21:02

see also #12129.

Paul


---

Comment by saraedum created at 2012-05-23 13:31:26

Thanks for pointing these out. Since both are in the multivariate case, I don't think they're related.


---

Comment by saraedum created at 2012-05-24 22:30:07

The attached patch should fix the problem.


---

Comment by saraedum created at 2012-05-24 22:30:07

Changing status from new to needs_review.


---

Comment by saraedum created at 2012-05-24 23:11:25

Changing keywords from "" to "sd40.5".


---

Comment by zimmerma created at 2012-05-25 08:27:27

Changing status from needs_review to needs_work.


---

Comment by zimmerma created at 2012-05-25 08:27:27

the documentation of `is_squarefree` says that `f` is not square-free if `g^2`
divides `f` where `g` is a non-unit. In particular `4*x` is not considered
square free by `is_squarefree`, but it is by `squarefree_decomposition`:

```
sage: R.<x> = ZZ[]
sage: f = 4*x
sage: f.is_squarefree()
False
sage: f.squarefree_decomposition()
(4) * x
```


Sage should be coherent in that matter. Personally I prefer not to decompose the coefficient content.

Moreover the following produces an error:

```
sage: R.<x> = ZZ[]
sage: f = 2*x^2
sage: f.is_squarefree()
...
AttributeError: 'int' object has no attribute 'is_zero'
```


Paul


---

Comment by saraedum created at 2012-05-25 09:53:07

Replying to [comment:9 zimmerma]:
> the documentation of `is_squarefree` says that `f` is not square-free if `g^2`
> divides `f` where `g` is a non-unit. In particular `4*x` is not considered
> square free by `is_squarefree`, but it is by `squarefree_decomposition`:
> {{{
> sage: R.<x> = ZZ[]
> sage: f = 4*x
> sage: f.is_squarefree()
> False
> sage: f.squarefree_decomposition()
> (4) * x
> }}}
> 
> Sage should be coherent in that matter. Personally I prefer not to decompose the coefficient content.

That is true. I also noted this inconsistency. To not break existing code, I'd rather add a warning section in the docstring. Generally I agree that having `squarefree_decomposition()` factor the content is not what one wants for most purposes.

Would you be ok with just adding a warning and an example showing this problem?

> Moreover the following produces an error:
> {{{
> sage: R.<x> = ZZ[]
> sage: f = 2*x^2
> sage: f.is_squarefree()
> ...
> AttributeError: 'int' object has no attribute 'is_zero'
> }}}

This should not happen when applying the dependency #12988.


---

Comment by saraedum created at 2012-05-25 09:53:25

Changing status from needs_work to needs_info.


---

Comment by saraedum created at 2012-05-25 10:20:57

I added a patch with such a warning. I still have to check how it renders in the docs.


---

Comment by saraedum created at 2012-05-25 11:01:25

I made a few docstring changes in the latest patch.


---

Comment by saraedum created at 2012-05-25 11:01:25

Changing status from needs_info to needs_review.


---

Attachment

distinguish characteristic zero and nonzero


---

Comment by saraedum created at 2012-05-25 12:10:55

Btw. I will add the respective warning for `squarefree_decomposition()` in #13008.


---

Comment by zimmerma created at 2012-05-25 12:25:52

Julian, there is a typo in ` trac_12404_warning.patch`: `not to consider to content`
should read `not to consider the content`.

Would it break a lot of code if `is_squarefree` returns False for `4*x`?
Did you try?

Paul


---

Attachment

warning about inconsistency with squarefree_decomposition


---

Comment by saraedum created at 2012-05-25 12:51:41

Thanks, the typo should be fixed now.

No I haven't tried. I was actually thinking about external code using that method. If you insist we can change it. I don't have a very strong opinion about this. I just believe that inconsistency isn't bad as long as it's documented. IMHO breaking the interface is worse than documented inconsistency.


---

Comment by jdemeyer created at 2012-05-26 05:41:56

Replying to [comment:15 zimmerma]:
> Would it break a lot of code if `is_squarefree` returns False for `4*x`?
Did you mean "if `is_squarefree` returns True for `4*x`"?


---

Attachment


---

Comment by jdemeyer created at 2012-05-26 06:45:49

Positive review to the first two patches.  Anybody else can review my patch?


---

Comment by was created at 2012-05-27 18:11:46

Changing status from needs_review to positive_review.


---

Comment by was created at 2012-05-27 18:11:46

jdmeyer -- I positively review your patch.


---

Comment by jdemeyer created at 2012-06-06 19:11:36

Resolution: fixed
