# Issue 24780: bug in substitution of free group element

Issue created by migration from https://trac.sagemath.org/ticket/25017

Original creator: vdelecroix

Original creation time: 2018-03-20 21:24:59


```
sage: F = FreeGroup(2)
sage: x0, x1 F.gens()
sage: u = F(1)
sage: parent(u.subs({x0:x1}))
Integer Ring
```



---

Comment by chapoton created at 2018-04-04 11:57:11

Changing status from new to needs_review.


---

Comment by chapoton created at 2018-04-04 11:57:11

New commits:


---

Comment by vdelecroix created at 2018-04-08 14:23:50

I think that substitutions should be stricter (e.g. by computing a universe *before* the substitution)

```
sage: F.<x,y> = FreeGroup()
sage: F.one().subs(x=x, y=1)     # nonsense... but we get an answer
1
sage: parent(_)
Free Group on generators {x, y}
sage: F.one().subs(x=1, y=y)     # nonsense... but we get a different answer
1
sage: parent(_)
Integer Ring
```



---

Comment by vdelecroix created at 2018-04-08 14:23:50

Changing status from needs_review to needs_work.


---

Comment by git created at 2018-10-08 15:56:02

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by chapoton created at 2018-10-08 15:56:18

better like that ?


---

Comment by chapoton created at 2018-10-08 15:56:18

Changing status from needs_work to needs_review.


---

Comment by vdelecroix created at 2018-10-08 20:04:02

Better! Though you should not expect any object to have a `parent` method. You should here use the `parent` function (from `sage.structure.element`).

```
sage: u.subs({x0:1r, x1:2r})
Traceback (most recent call last):
...
AttributeError: 'int' object has no attribute 'parent'
```


It would also be good to check that substituting *all* variables by some elements of a given multiplicative monoid does work

```
sage: F = FreeGroup(2)
sage: x0, x1 = F.gens()
sage: u = x0*x1
sage: u.subs({x0:3, x1:2})
6
sage: u.subs({x0: matrix(ZZ, 2, [1,1,0,1]), x1: matrix(ZZ, 2, [1,0,1,1])})
[2 1]
[1 1]
```


And note that if the universe is not a monoid you might get very strange behavior... but I don't think that we should worry about this.


---

Comment by vdelecroix created at 2018-10-08 20:04:02

Changing status from needs_review to needs_work.


---

Comment by tscrim created at 2018-10-10 00:23:32

Do we want to support the following:

```sage
sage: (x*y).subs(x=matrix([[1,2],[3,4]]),
....:            y=vector([-1,-2])
```

In other words, the multiplication makes sense, but only as an action rather than within a common parent. Your current version seems to be inline with what polynomials do (i.e., find a common parent for the elements passed in). However, the commutativity does mean left-versus-right actions become lost, whereas we do have that here.


---

Comment by vdelecroix created at 2018-10-10 05:41:07

Replying to [comment:7 tscrim]:
> Do we want to support the following:

Not me. The only words that support matrix vector substitution are the ones where the letter corresponding to the vector appears only once with a positive sign at the end. Better do matrix substitution and then multiply.


---

Comment by git created at 2018-10-10 06:43:21

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by chapoton created at 2018-10-10 06:43:44

now using "parent" function + more doctests


---

Comment by vdelecroix created at 2018-10-10 06:56:42

Please add the first example from [comment:6 comment:6] (with the Python ints). This is something we definitely want to support.


---

Comment by chapoton created at 2018-10-10 10:00:40

This doctest does not pass, as the common parent is the type "int":

```
Failed example:
    u.subs({x0:1r, x1:2r})
Exception raised:
    Traceback (most recent call last):
      File "/home/chapoton/sage/local/lib/python2.7/site-packages/sage/doctest/forker.py", line 659, in _run
        self.compile_and_execute(example, compiler, test.globs)
      File "/home/chapoton/sage/local/lib/python2.7/site-packages/sage/doctest/forker.py", line 1070, in compile_and_execute
        exec(compiled, globs)
      File "<doctest sage.groups.free_group.FreeGroupElement.__call__[16]>", line 1, in <module>
        u.subs({x0:1, x1:2})
      File "sage/structure/element.pyx", line 813, in sage.structure.element.Element.subs (build/cythonized/sage/structure/element.c:7786)
        return self(*variables)
      File "/home/chapoton/sage/local/lib/python2.7/site-packages/sage/groups/free_group.py", line 593, in __call__
        return new_parent.prod(replace[gen] ** power
    AttributeError: type object 'int' has no attribute 'prod'
```



---

Comment by git created at 2018-10-10 10:03:29

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by chapoton created at 2018-10-10 10:03:44

Changing status from needs_work to needs_review.


---

Comment by chapoton created at 2018-10-10 10:03:44

here is a tentative fix
----
New commits:
----
New commits:


---

Comment by vdelecroix created at 2018-10-10 10:36:57

The fix looks ok.


---

Comment by vdelecroix created at 2018-10-10 16:09:45

Thank you


---

Comment by vdelecroix created at 2018-10-10 16:09:45

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2018-10-20 11:59:09

Resolution: fixed


---

Comment by embray created at 2018-10-28 14:52:23

This should be re-targeted for 8.5.
