# Issue 32263: Conversion of asymptotic expansion loses imaginary parts of exponents

Issue created by migration from https://trac.sagemath.org/ticket/32500

Original creator: mmezzarobba

Original creation time: 2021-09-10 15:37:31

CC:  dkrenn behackl


```
sage: from sage.rings.asymptotic.growth_group import *
sage: Asy.<n> = AsymptoticRing('n^QQbar', ZZ)
sage: BGG = MonomialGrowthGroup.factory(RBF, 'n', extend_by_non_growth_group=True)
sage: BAsy = AsymptoticRing(BGG, ZZ)
sage: BAsy
Asymptotic Ring <n^RBF * n^(RBF*I)> over Integer Ring
sage: BAsy(n^(QQbar(-1)^(1/3)))
n^([0.500000000000000 +/- 1.95e-16])
```



---

Comment by mmezzarobba created at 2021-09-10 16:10:34

Changing status from new to needs_review.


---

Comment by mmezzarobba created at 2021-09-10 16:10:34

â†’ #32452


---

Comment by mjo created at 2021-12-01 01:34:37

Changing status from needs_review to positive_review.


---

Comment by mkoeppe created at 2021-12-01 02:46:14

Resolution: invalid
