# Issue 15334: Incorrect zero test of complex symbolic expressions

archive/issues_015334.json:
```json
{
    "body": "Yet another example where symbolic expressions are abusively considered equivalent, even though `simplify()` has become a bit more careful.\n\n\n```\nsage: var('a,x')\n(a, x)\nsage: assume(a, 'complex')\nsage: assume(x, 'complex')\nsage: expr = a^(4*x) - (a^4)^x\nsage: expr.is_zero()\nTrue\nsage: expr(a=I, x=1/2)\n-2\n```\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/15571\n\n",
    "created_at": "2013-12-23T11:16:04Z",
    "labels": [
        "component: symbolics",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-6.5",
    "title": "Incorrect zero test of complex symbolic expressions",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/15334",
    "user": "https://github.com/mezzarobba"
}
```
Yet another example where symbolic expressions are abusively considered equivalent, even though `simplify()` has become a bit more careful.


```
sage: var('a,x')
(a, x)
sage: assume(a, 'complex')
sage: assume(x, 'complex')
sage: expr = a^(4*x) - (a^4)^x
sage: expr.is_zero()
True
sage: expr(a=I, x=1/2)
-2
```


Issue created by migration from https://trac.sagemath.org/ticket/15571





---

archive/issue_comments_197153.json:
```json
{
    "body": "Changing status from new to needs_review.",
    "created_at": "2015-01-31T16:46:08Z",
    "issue": "https://github.com/sagemath/sagetest/issues/15334",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/15334#issuecomment-197153",
    "user": "https://github.com/rwst"
}
```

Changing status from new to needs_review.



---

archive/issue_comments_197154.json:
```json
{
    "body": "Appears to having been fixed and also already included in Sage.",
    "created_at": "2015-01-31T16:46:08Z",
    "issue": "https://github.com/sagemath/sagetest/issues/15334",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/15334#issuecomment-197154",
    "user": "https://github.com/rwst"
}
```

Appears to having been fixed and also already included in Sage.



---

archive/issue_comments_197155.json:
```json
{
    "body": "Changing status from needs_review to needs_work.",
    "created_at": "2015-01-31T17:42:48Z",
    "issue": "https://github.com/sagemath/sagetest/issues/15334",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/15334#issuecomment-197155",
    "user": "https://github.com/rwst"
}
```

Changing status from needs_review to needs_work.



---

archive/issue_comments_197156.json:
```json
{
    "body": "Changing status from needs_work to needs_review.",
    "created_at": "2015-02-02T09:32:39Z",
    "issue": "https://github.com/sagemath/sagetest/issues/15334",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/15334#issuecomment-197156",
    "user": "https://github.com/rwst"
}
```

Changing status from needs_work to needs_review.



---

archive/issue_comments_197157.json:
```json
{
    "body": "New commits:",
    "created_at": "2015-02-02T09:32:39Z",
    "issue": "https://github.com/sagemath/sagetest/issues/15334",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/15334#issuecomment-197157",
    "user": "https://github.com/rwst"
}
```

New commits:



---

archive/issue_comments_197158.json:
```json
{
    "body": "Changing status from needs_review to positive_review.",
    "created_at": "2015-02-03T03:05:21Z",
    "issue": "https://github.com/sagemath/sagetest/issues/15334",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/15334#issuecomment-197158",
    "user": "https://github.com/kcrisman"
}
```

Changing status from needs_review to positive_review.



---

archive/issue_comments_197159.json:
```json
{
    "body": "Indeed, one doesn't have to do any assumption at all to get the 'false' now.\n\n```\nsage: sage: var('a,x')\n(a, x)\nsage: (a, x)\n(a, x)\nsage: sage: expr = a^(4*x) - (a^4)^x\nsage: sage: expr.is_zero()\nFalse\n```\n\n\nIf you want to remove the second\n\n```\n+            sage: assume(a, 'complex')\n+            sage: assume(x, 'complex')\n```\n\nand then the `forget()` which I think is all superfluous, that would be great, but it's fine this way too.",
    "created_at": "2015-02-03T03:05:21Z",
    "issue": "https://github.com/sagemath/sagetest/issues/15334",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/15334#issuecomment-197159",
    "user": "https://github.com/kcrisman"
}
```

Indeed, one doesn't have to do any assumption at all to get the 'false' now.

```
sage: sage: var('a,x')
(a, x)
sage: (a, x)
(a, x)
sage: sage: expr = a^(4*x) - (a^4)^x
sage: sage: expr.is_zero()
False
```


If you want to remove the second

```
+            sage: assume(a, 'complex')
+            sage: assume(x, 'complex')
```

and then the `forget()` which I think is all superfluous, that would be great, but it's fine this way too.



---

archive/issue_events_014986.json:
```json
{
    "actor": "@vbraun",
    "created_at": "2015-02-17T20:50:35Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/15334",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/15334#event-14986"
}
```



---

archive/issue_comments_197160.json:
```json
{
    "body": "Resolution: fixed",
    "created_at": "2015-02-17T20:50:35Z",
    "issue": "https://github.com/sagemath/sagetest/issues/15334",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/15334#issuecomment-197160",
    "user": "https://github.com/vbraun"
}
```

Resolution: fixed
