# Issue 31646: Refine category of ScalarField

archive/issues_031646.json:
```json
{
    "body": "CC:  egourgoulhon tscrim @mjungmath\n\nA `ScalarField` on a topological manifold is supposed to be a continuous map -- but this is not reflected by the category of its parent.\n\n```\nsage: M = Manifold(2, 'R^2', structure='topological')\nsage: c_cart.<x,y> = M.chart()\nsage: r_squared = M.scalar_field(x^2+y^2)\nsage: r_squared.parent().category()\nCategory of commutative algebras over Symbolic Ring\nsage: r_squared.codomain()\nAttributeError: 'ScalarFieldAlgebra_with_category.element_class' object has no attribute 'codomain'\n```\n\n\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/31883\n\n",
    "created_at": "2021-05-31T01:21:38Z",
    "labels": [
        "manifolds",
        "major",
        "bug"
    ],
    "title": "Refine category of ScalarField",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/31646",
    "user": "mkoeppe"
}
```
CC:  egourgoulhon tscrim @mjungmath

A `ScalarField` on a topological manifold is supposed to be a continuous map -- but this is not reflected by the category of its parent.

```
sage: M = Manifold(2, 'R^2', structure='topological')
sage: c_cart.<x,y> = M.chart()
sage: r_squared = M.scalar_field(x^2+y^2)
sage: r_squared.parent().category()
Category of commutative algebras over Symbolic Ring
sage: r_squared.codomain()
AttributeError: 'ScalarFieldAlgebra_with_category.element_class' object has no attribute 'codomain'
```




Issue created by migration from https://trac.sagemath.org/ticket/31883





---

archive/issue_comments_451965.json:
```json
{
    "body": "Unfortunately, trying to make `ScalarField` a subclass of `Map` leads to:\n\n```\n---> 50 class ScalarField(CommutativeAlgebraElement, ModuleElementWithMutability, Map):\n     51     r\"\"\"\n     52     Scalar field on a topological manifold.\n\nTypeError: multiple bases have instance lay-out conflict\n```\n",
    "created_at": "2021-05-31T01:53:21Z",
    "issue": "https://github.com/sagemath/sagetest/issues/31646",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/31646#issuecomment-451965",
    "user": "mkoeppe"
}
```

Unfortunately, trying to make `ScalarField` a subclass of `Map` leads to:

```
---> 50 class ScalarField(CommutativeAlgebraElement, ModuleElementWithMutability, Map):
     51     r"""
     52     Scalar field on a topological manifold.

TypeError: multiple bases have instance lay-out conflict
```




---

archive/issue_comments_451966.json:
```json
{
    "body": "Changing status from new to needs_review.",
    "created_at": "2021-05-31T02:24:59Z",
    "issue": "https://github.com/sagemath/sagetest/issues/31646",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/31646#issuecomment-451966",
    "user": "mkoeppe"
}
```

Changing status from new to needs_review.



---

archive/issue_comments_451967.json:
```json
{
    "body": "Anyway, here is a simple solution\n----\nNew commits:",
    "created_at": "2021-05-31T02:24:59Z",
    "issue": "https://github.com/sagemath/sagetest/issues/31646",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/31646#issuecomment-451967",
    "user": "mkoeppe"
}
```

Anyway, here is a simple solution
----
New commits:



---

archive/issue_comments_451968.json:
```json
{
    "body": "Green bot => positive review.",
    "created_at": "2021-05-31T04:09:01Z",
    "issue": "https://github.com/sagemath/sagetest/issues/31646",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/31646#issuecomment-451968",
    "user": "tscrim"
}
```

Green bot => positive review.



---

archive/issue_comments_451969.json:
```json
{
    "body": "\n```\nsage -t --long --random-seed=0 src/sage/graphs/graph.py  # 1 doctest failed\nsage -t --long --random-seed=0 src/sage/manifolds/differentiable/scalarfield_algebra.py  # 2 doctests failed\nsage -t --long --random-seed=0 src/doc/en/thematic_tutorials/vector_calculus/vector_calc_advanced.rst  # 1 doctest failed\nsage -t --long --random-seed=0 src/doc/en/thematic_tutorials/vector_calculus/vector_calc_plane.rst  # 1 doctest failed\n```\n\nThe one in `graph.py` doesn't seem like an error related to this ticket, but the others are trivial. Please make the changes and check that `graph.py` is indeed unrelated. Once done, you can set a positive review.",
    "created_at": "2021-06-01T00:51:56Z",
    "issue": "https://github.com/sagemath/sagetest/issues/31646",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/31646#issuecomment-451969",
    "user": "tscrim"
}
```


```
sage -t --long --random-seed=0 src/sage/graphs/graph.py  # 1 doctest failed
sage -t --long --random-seed=0 src/sage/manifolds/differentiable/scalarfield_algebra.py  # 2 doctests failed
sage -t --long --random-seed=0 src/doc/en/thematic_tutorials/vector_calculus/vector_calc_advanced.rst  # 1 doctest failed
sage -t --long --random-seed=0 src/doc/en/thematic_tutorials/vector_calculus/vector_calc_plane.rst  # 1 doctest failed
```

The one in `graph.py` doesn't seem like an error related to this ticket, but the others are trivial. Please make the changes and check that `graph.py` is indeed unrelated. Once done, you can set a positive review.



---

archive/issue_comments_451970.json:
```json
{
    "body": "Branch pushed to git repo; I updated commit sha1. New commits:",
    "created_at": "2021-06-01T06:58:35Z",
    "issue": "https://github.com/sagemath/sagetest/issues/31646",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/31646#issuecomment-451970",
    "user": "git"
}
```

Branch pushed to git repo; I updated commit sha1. New commits:



---

archive/issue_comments_451971.json:
```json
{
    "body": "The failing doctest in `graph.py` is unrelated and is fixed by #31848",
    "created_at": "2021-06-01T06:59:30Z",
    "issue": "https://github.com/sagemath/sagetest/issues/31646",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/31646#issuecomment-451971",
    "user": "mkoeppe"
}
```

The failing doctest in `graph.py` is unrelated and is fixed by #31848



---

archive/issue_comments_451972.json:
```json
{
    "body": "Changing status from needs_review to positive_review.",
    "created_at": "2021-06-01T06:59:57Z",
    "issue": "https://github.com/sagemath/sagetest/issues/31646",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/31646#issuecomment-451972",
    "user": "tscrim"
}
```

Changing status from needs_review to positive_review.



---

archive/issue_comments_451973.json:
```json
{
    "body": "Thanks.",
    "created_at": "2021-06-01T06:59:57Z",
    "issue": "https://github.com/sagemath/sagetest/issues/31646",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/31646#issuecomment-451973",
    "user": "tscrim"
}
```

Thanks.



---

archive/issue_comments_451974.json:
```json
{
    "body": "Thank you!",
    "created_at": "2021-06-01T07:14:50Z",
    "issue": "https://github.com/sagemath/sagetest/issues/31646",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/31646#issuecomment-451974",
    "user": "mkoeppe"
}
```

Thank you!



---

archive/issue_comments_451975.json:
```json
{
    "body": "I agree with the code added in this ticket, but let me seize the opportunity to point out some current inconsistency in the manifold set up, which is due to the lack of a proper real field in Sage (cf. #24456):\n1. the base field of a real manifold is `RR`\n2. the base ring of the algebra of scalar fields on a manifold is `SR` \n\nOf course, from a pure mathematical side, 1 and 2 should be identical. \n\nThe basic reason for 1 is `RR` being the simplest proxy for the genuine real field, albeit all (symbolic) computations on manifolds have nothing to do with 53 bits of precision...\n\nThe basic reason for 2 is to naturally allow for algebra operations like `a*f`, where `a` is a symbolic variable and `f` a scalar field.\n\nIf #24456 converges some day, both 1 and 2 should be set to the real field object that will emerge from it. Meanwhile, we have\n\n```\nsage: M = Manifold(2, 'M')\nsage: CM = M.scalar_field_algebra()\nsage: M.base_field()\nReal Field with 53 bits of precision\nsage: CM.base_ring()\nSymbolic Ring\n```\n\nWith the `codomain()` method introduced in this ticket, we have in addition\n\n```\nsage: X.<x,y> = M.chart() \nsage: f = M.scalar_field(x^2)\nsage: f.codomain() is f.domain().base_field()\nTrue\n```\n\nwhich is nice, but\n\n```\nsage: f.codomain() is f.parent().base_ring()\nFalse\n```\n\nMoreover, for images of scalar fields, we have\n\n```\nsage: p = M((pi, 0))\nsage: f(p)\npi^2\nsage: f(p) in f.codomain()\nTrue\n```\n\nbut this holds only because `pi^2` can be converted to an element of `RR`. Otherwise, the test fails:\n\n```\nsage: a = var('a', domain='real')\nsage: p = M((a, 0))\nsage: f(p) in f.codomain()\nFalse\n```\n\n`f(p)` not lying in `f.codomain()` is certainly something we do not want, but this is currently a consequence of the inconsistency 1 <-> 2 mentioned above. The latter could be removed by making `SR` the base field of manifolds. But then a real manifold and a complex one would appear as having the same base field (according to `base_field()`). \n\nFinally, it's worth to stress that in practice, the inconsistency 1 <-> 2 is a rather mild one: to my knowledge, it has never triggered any error nor yield any false result in actual computations on manifolds (apart from the trivial `CM.base_ring() is M.base_field()` being false).",
    "created_at": "2021-06-02T12:03:47Z",
    "issue": "https://github.com/sagemath/sagetest/issues/31646",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/31646#issuecomment-451975",
    "user": "egourgoulhon"
}
```

I agree with the code added in this ticket, but let me seize the opportunity to point out some current inconsistency in the manifold set up, which is due to the lack of a proper real field in Sage (cf. #24456):
1. the base field of a real manifold is `RR`
2. the base ring of the algebra of scalar fields on a manifold is `SR` 

Of course, from a pure mathematical side, 1 and 2 should be identical. 

The basic reason for 1 is `RR` being the simplest proxy for the genuine real field, albeit all (symbolic) computations on manifolds have nothing to do with 53 bits of precision...

The basic reason for 2 is to naturally allow for algebra operations like `a*f`, where `a` is a symbolic variable and `f` a scalar field.

If #24456 converges some day, both 1 and 2 should be set to the real field object that will emerge from it. Meanwhile, we have

```
sage: M = Manifold(2, 'M')
sage: CM = M.scalar_field_algebra()
sage: M.base_field()
Real Field with 53 bits of precision
sage: CM.base_ring()
Symbolic Ring
```

With the `codomain()` method introduced in this ticket, we have in addition

```
sage: X.<x,y> = M.chart() 
sage: f = M.scalar_field(x^2)
sage: f.codomain() is f.domain().base_field()
True
```

which is nice, but

```
sage: f.codomain() is f.parent().base_ring()
False
```

Moreover, for images of scalar fields, we have

```
sage: p = M((pi, 0))
sage: f(p)
pi^2
sage: f(p) in f.codomain()
True
```

but this holds only because `pi^2` can be converted to an element of `RR`. Otherwise, the test fails:

```
sage: a = var('a', domain='real')
sage: p = M((a, 0))
sage: f(p) in f.codomain()
False
```

`f(p)` not lying in `f.codomain()` is certainly something we do not want, but this is currently a consequence of the inconsistency 1 <-> 2 mentioned above. The latter could be removed by making `SR` the base field of manifolds. But then a real manifold and a complex one would appear as having the same base field (according to `base_field()`). 

Finally, it's worth to stress that in practice, the inconsistency 1 <-> 2 is a rather mild one: to my knowledge, it has never triggered any error nor yield any false result in actual computations on manifolds (apart from the trivial `CM.base_ring() is M.base_field()` being false).



---

archive/issue_comments_451976.json:
```json
{
    "body": "Thanks a lot for sharing these insights!",
    "created_at": "2021-06-02T16:23:59Z",
    "issue": "https://github.com/sagemath/sagetest/issues/31646",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/31646#issuecomment-451976",
    "user": "mkoeppe"
}
```

Thanks a lot for sharing these insights!



---

archive/issue_comments_451977.json:
```json
{
    "body": "Resolution: fixed",
    "created_at": "2021-06-29T17:40:47Z",
    "issue": "https://github.com/sagemath/sagetest/issues/31646",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/31646#issuecomment-451977",
    "user": "vbraun"
}
```

Resolution: fixed
