# Issue 30556: Sage may ignore the imaginary part of variables not explicitly declared complex

Issue created by migration from https://trac.sagemath.org/ticket/30793

Original creator: charpent

Original creation time: 2020-10-19 06:44:22

CC:  pbruin

Seen in this ask.sagemapt [question](https://ask.sagemath.org/question/53947/problem-with-factor-and-imag/), discussed in [sage-devel](https://groups.google.com/forum/#!topic/sage-devel/WSZ55IRWeiI) :

Sage seems to assume that a not otherwise specified symbolic variable is real :

```
sage: var("z")
z
sage: real(z).simplify()
z
sage: imag(z).simplify()
0
sage: with assuming(z,"complex"): real(z).simplify()
realpart(z)
sage: with assuming(z,"complex"): imag(z).simplify()
imagpart(z)
```


As corollaries :

```
sage: var("a, b")
(a, b)
sage: (a*imag(z) + b*imag(z)).factor()
0
sage: (a*z + b*z).factor().imag_part()
imag_part(z)*real_part(a) + imag_part(z)*real_part(b) + imag_part(a)*real_part(z) + imag_part(b)*real_part(z)
sage: (a*z + b*z).factor().imag_part().factor()
0
sage: (a*z + b*z).factor().imag_part().simplify()
0
```


but :

```
sage: with assuming(z,"complex"): (a*z + b*z).factor().imag_part().factor()
(a + b)*imagpart(z)
sage: with assuming(z,"complex"): (a*z + b*z).factor().imag_part().simplify()
a*imagpart(z) + b*imagpart(z)
```


`Maxima` has the same problem : in Sage's `maxima` :

```
sage: %%maxima
....: domain;
....: imagpart(z);
....: imagpart(ratsimp(z));
....: imagpart(factor(z));
....: 
....: 
complex
0
0
0
```


but :

```
sage: %%maxima
....: declare(z,complex);
....: imagpart(z);
....: imagpart(ratsimp(z));
....: imagpart(factor(z));
....: 
....: 
done
'imagpart(z)
'imagpart(z)
'imagpart(z)
```


Filing this as `blocker`, because this problem may lead to Sage //silently// returning mathematical nonsense...


---

Comment by chapoton created at 2020-10-19 06:54:40

either blocker for the 9.3 milestone, or critical only, please


---

Comment by charpent created at 2020-10-19 07:15:11

Replying to [comment:1 chapoton]:
> either blocker for the 9.3 milestone, or critical only, please

Okay. Will do that also for #30688.


---

Comment by vbraun created at 2021-03-28 08:42:44

De facto this can't be a blocker if noone is enough invested to work on it. Probably should be fixed on the maxima side first, too.


---

Comment by vbraun created at 2021-03-28 08:42:44

Changing priority from blocker to major.


---

Comment by mkoeppe created at 2021-03-28 22:13:47

Well, has anyone filed it as an upstream bug?


---

Comment by @DaveWitteMorris created at 2021-03-28 22:41:43

This was reported upstream on #6862. The maxima developers deny that it is a bug, and I agree with them, because the maxima documentation makes it clear that merely setting `domain:complex` will not make individual variables default to being complex. If sage wants variables to be complex, then it should declare them that way. 

However, I tried this a couple of months ago (just by making a minor modification to `SR.symbol`) and got lots of doctest failures. The two main problems were: 

1. Maxima seems to give different (much more complicated) answers for some definite integrals when the integration variable is declared to be complex. 
2. There were also a lot of failures in `manifolds`, so perhaps that code is assuming that the variables are real.

The problem has been around a long time, and I don't think this can be fixed in time for 9.3.  We should try to do something for 9.4, but I think it will require serious work.

Maybe this ticket should be closed as a duplicate of #6862.


---

Comment by mkoeppe created at 2021-03-28 23:15:49

Thanks for the analysis! +1 for consolidating the two tickets, closing one of them, and moving the remaining one to milestone 9.4.


---

Comment by nbruin created at 2021-03-29 00:42:21

Replying to [comment:5 gh-DaveWitteMorris]:

> 1. Maxima seems to give different (much more complicated) answers for some definite integrals when the integration variable is declared to be complex. 

That's to be expected. Complex path integrals are generally path-dependent, so just specifying the end points of the path doesn't tell the whole story. Much of the integration machinery will normally be assuming real variables. This is one reason to *not* assume complex variables by default.

The main problem found on #6862 is the present incompatibility between pynac's and maxima's default. With this information, perhaps it would be worth seeing how bad inserting a default `assume(<var>,"real")` so that pynac at least agrees with maxima. If that leads to significantly less doctests, perhaps that's a preferable direction to resolve the mismatch.


---

Comment by mkoeppe created at 2021-04-07 19:29:15

Sage development has entered the release candidate phase for 9.3. Setting a new milestone for this ticket based on a cursory review.
