# Issue 27941: implement __iter__ for ETupleIter

Issue created by migration from https://trac.sagemath.org/ticket/28178

Original creator: vdelecroix

Original creation time: 2019-07-12 05:21:48

`ETuple` used in exponents of generic multivariate polynomials implement their own iterator `ETupleIter` which is broken with respect to

```
sage: from array import array
sage: R.<x,y,z> = QQ[]
sage: e = (x*y*z).exponents()[0]
sage: array('l', e)
Traceback (most recent call last):
...
TypeError: 'sage.rings.polynomial.polydict.ETupleIter' object is not iterable
```

The reason is that `ETupleIter` does not implement `__iter__` while it is customary to return `self`. Here is the example of lists

```
sage: it = iter([1,2,3])
sage: iter(it) is it
True
```

And the broken version with `ETuple`

```
sage: it = iter(e)
sage: iter(e)
Traceback (most recent call last):
...
TypeError: 'sage.rings.polynomial.polydict.ETupleIter' object is not iterable
```



---

Comment by vdelecroix created at 2019-07-12 05:37:20

Changing status from new to needs_review.


---

Comment by git created at 2019-07-12 05:38:54

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by chapoton created at 2019-07-12 11:45:18

Changing status from needs_review to needs_work.


---

Comment by chapoton created at 2019-07-12 11:45:18

2 failing doctests, see patchbot report


---

Comment by git created at 2019-07-12 11:52:18

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by vdelecroix created at 2019-07-12 11:52:46

Indeed.


---

Comment by vdelecroix created at 2019-07-12 11:52:46

Changing status from needs_work to needs_review.


---

Comment by chapoton created at 2019-07-12 18:17:27

ok, lgtm


---

Comment by chapoton created at 2019-07-12 18:17:27

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2019-07-14 23:14:02

Resolution: fixed
