# Issue 16882: Disallow pari(None)

Issue created by migration from https://trac.sagemath.org/ticket/17119

Original creator: jdemeyer

Original creation time: 2014-10-09 08:17:52

CC:  pbruin

Currently, `pari(None)` behaves like `pari("None")`, which is normally not what is intented.


---

Comment by jdemeyer created at 2014-10-09 12:36:13

New commits:


---

Comment by jdemeyer created at 2014-10-09 12:36:13

Changing status from new to needs_review.


---

Comment by pbruin created at 2014-10-10 08:53:49

PARI has its own equivalent of `None`, namely `gnil`.  This is internally a `t_INT` with value 0, but is treated specially by virtue of its memory address.  It is returned by things like evaluating the empty string, constructions like `if(0,1)`, etc.  In Sage we currently convert `gnil` to None:

```
sage: pari('') is None
True
sage: pari('if(0,1)') is None
True
```

I think we should decide on a uniform behaviour for the relationship between `gnil` and `None`.  It seems that we have the following options:
- Always convert `gnil` to Python `None`, and make `pari(None)` return `None`.
- Allow wrapping `gnil` (and possibly other PARI objects that are not on the stack) in a Sage `gen` without copying it, so PARI recognises it as `gnil`.  In particular, `pari(None)` (like `pari('')`), will be such a `gen` wrapping `gnil`.  This probably prints as 0 by default, but this could be changed by the `__repr__()` method.
- Stop treating `gnil` specially, identifying it with `gen_0`.  Make this consistent by defining `pari(None) = pari(0)`.  This is what GP does when assigning to a variable:

```
gp > if(0,1)         \\ returns gnil
gp > x = if(0,1); x  \\ the result of gcopy(gnil) is identical to gen_0
%2 = 0
```



---

Comment by jdemeyer created at 2014-10-10 09:09:21

> - Always convert `gnil` to Python `None`, and make `pari(None)` return `None`.
That wouldn't work with composite objects: what should `pari([None, 1])` be then?

> - Allow wrapping `gnil` (and possibly other PARI objects that are not on the stack) in a Sage `gen` without copying it, so PARI recognises it as `gnil`.
Theoretically perhaps the best, but hard to do.

> - Stop treating `gnil` specially, identifying it with `gen_0`.
I don't like this. It would lead to things like

```
sage: pari("print(12345)")
12345
0
```


So... I still think it's best to disallow `pari(None)`. I see no use case for it and the times where it did come up where all mistakes.


---

Comment by pbruin created at 2014-10-10 11:58:30

Replying to [comment:6 jdemeyer]:
> > - Always convert `gnil` to Python `None`, and make `pari(None)` return `None`.
> That wouldn't work with composite objects: what should `pari([None, 1])` be then?
Good point...
> > - Allow wrapping `gnil` (and possibly other PARI objects that are not on the stack) in a Sage `gen` without copying it, so PARI recognises it as `gnil`.
> Theoretically perhaps the best, but hard to do.
I agree.  It may be tricky to implement the decision to copy or not in all the necessary places.  On the other hand, PARI just changes `gnil` to `gen_0` in non-trivial situations:

```
gp > [if(0,1),1]
%1 = [0, 1]
```

> > - Stop treating `gnil` specially, identifying it with `gen_0`.
> I don't like this. It would lead to things like
> {{{
> sage: pari("print(12345)")
> 12345
> 0
> }}}
I agree that this is a bad solution.
> So... I still think it's best to disallow `pari(None)`. I see no use case for it and the times where it did come up where all mistakes.
In other words, this comes down to a one-way conversion from PARI to Python: whenever `gnil` arises we convert it to `None`, and we never convert `None` back to `gnil`.  Sounds reasonable.


---

Comment by pbruin created at 2014-10-10 14:12:40

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2014-10-12 13:08:45

THe UW buildbot slaves set `$HOME` so that they don't share the cython cache:

```
sage -t --long src/sage/libs/pari/gen.pyx
**********************************************************************
File "src/sage/libs/pari/gen.pyx", line 2479, in sage.libs.pari.gen.gen.Strexpand
Failed example:
    pari('"$HOME"').Strexpand() == pari('["~"]').Strexpand()
Expected:
    True
Got:
    False
**********************************************************************
```

You can test that `~` expands to something else than `~`, but it doesn't really need to match `$HOME`.


---

Comment by vbraun created at 2014-10-12 13:08:51

Changing status from positive_review to needs_work.


---

Comment by jdemeyer created at 2014-10-12 18:29:25

I thought that `$HOME` was synonymous for `~`, but I guess I'm wrong...


---

Comment by jdemeyer created at 2014-10-14 09:45:05

I think the best solution is probably a `# random` test.


---

Comment by vbraun created at 2014-10-14 10:20:31

I would check that `pari('"$HOME"').Strexpand() != "$HOME"`, that verifies that expansion took place. But `$HOME` is, at the end of the day, just an environment variable. Whereas `~` is your home directory that only the system administrator can change.


---

Comment by git created at 2014-10-14 12:18:39

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by jdemeyer created at 2014-10-14 12:25:04

Changing status from needs_work to positive_review.


---

Comment by vbraun created at 2014-10-15 18:12:37

Resolution: fixed
