# Issue 19184: let asymptotic terms accept multivariate polynomials

archive/issues_019184.json:
```json
{
    "body": "CC:  @cheuberg @behackl\n\nAt the moment we have\n\n```\nsage: from sage.rings.asymptotic.term_monoid import TermMonoid\nsage: from sage.rings.asymptotic.growth_group import GrowthGroup\nsage: G_ZZ = GrowthGroup('y^ZZ*z^ZZ')\nsage: T_ZZ = TermMonoid('exact', G_ZZ, QQ)\nsage: R.<y, z> = ZZ[]\nsage: T_ZZ._get_factors_(5*y*z)\n(5*y*z,)\nsage: G_ZZ(y)*G_ZZ(z)\ny*z\nsage: G_ZZ(y*z)\nTraceback (most recent call last):\n...\nValueError: y*z is not in Growth Group y^ZZ * z^ZZ.\n> *previous* ValueError: y*z is not in any of the factors of Growth Group y^ZZ * z^ZZ\n```\n\nMake this work...\n\nSee also #19083, comment 64, 26.\n\nIssue created by migration from https://trac.sagemath.org/ticket/19421\n\n",
    "created_at": "2015-10-16T12:08:01Z",
    "labels": [
        "asymptotic expansions",
        "major",
        "enhancement"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-6.10",
    "title": "let asymptotic terms accept multivariate polynomials",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/19184",
    "user": "@dkrenn"
}
```
CC:  @cheuberg @behackl

At the moment we have

```
sage: from sage.rings.asymptotic.term_monoid import TermMonoid
sage: from sage.rings.asymptotic.growth_group import GrowthGroup
sage: G_ZZ = GrowthGroup('y^ZZ*z^ZZ')
sage: T_ZZ = TermMonoid('exact', G_ZZ, QQ)
sage: R.<y, z> = ZZ[]
sage: T_ZZ._get_factors_(5*y*z)
(5*y*z,)
sage: G_ZZ(y)*G_ZZ(z)
y*z
sage: G_ZZ(y*z)
Traceback (most recent call last):
...
ValueError: y*z is not in Growth Group y^ZZ * z^ZZ.
> *previous* ValueError: y*z is not in any of the factors of Growth Group y^ZZ * z^ZZ
```

Make this work...

See also #19083, comment 64, 26.

Issue created by migration from https://trac.sagemath.org/ticket/19421


