# Issue 15509: Polynomials over finite fields gives overflow error with large numbers

Issue created by migration from https://trac.sagemath.org/ticket/15746

Original creator: tscrim

Original creation time: 2014-01-27 15:57:45

Assignee: tscrim

CC:  fwclarke pbruin jpfori

Keywords: polynomials, finite fields


```
sage: R.<x,y> = GF(7)[]
sage: R(2^31)
---------------------------------------------------------------------------
OverflowError                             Traceback (most recent call last)
<ipython-input-46-6fd7adc32b9b> in <module>()
----> 1 R(Integer(2)**Integer(31))

/home/travis/sage/local/lib/python2.7/site-packages/sage/rings/polynomial/multi_polynomial_libsingular.so in sage.rings.polynomial.multi_polynomial_libsingular.MPolynomialRing_libsingular.__call__ (sage/rings/polynomial/multi_polynomial_libsingular.cpp:6134)()

/home/travis/sage/local/lib/python2.7/site-packages/sage/rings/polynomial/multi_polynomial_libsingular.so in sage.rings.polynomial.multi_polynomial_libsingular.MPolynomialRing_libsingular._coerce_c_impl (sage/rings/polynomial/multi_polynomial_libsingular.cpp:5633)()

OverflowError: Python int too large to convert to C long
```


Compare with:

```
sage: GF(7)(2^31)
2
```

This might be related to other problems posted in #8857 or fixed by #11239.


---

Comment by pbruin created at 2014-01-27 16:55:12

Part of what is going on here is that Singular works with 32-bit integers; compare

```
$ ./sage -singular
                     SINGULAR                                 /  Development
 A Computer Algebra System for Polynomial Computations       /   version 3-1-5
                                                           0<
 by: W. Decker, G.-M. Greuel, G. Pfister, H. Schoenemann     \   Jul 2012
FB Mathematik der Universitaet, D-67653 Kaiserslautern        \
> 2^31;
// ** int overflow(^), result may be wrong
-2147483648
```

The particular error in the ticket description would be fixed by letting the coercion (of the integer into the polynomial ring) go via the base field.  Actually, the coercion map itself suggests that this should already happen:

```
sage: f = R.coerce_map_from(ZZ); f
Composite map:
  From: Integer Ring
  To:   Multivariate Polynomial Ring in x, y over Finite Field of size 7
  Defn:   Natural morphism:
          From: Integer Ring
          To:   Finite Field of size 7
        then
          Polynomial base injection morphism:
          From: Finite Field of size 7
          To:   Multivariate Polynomial Ring in x, y over Finite Field of size 7
sage: f(2^31)
2
```

So the real problem here is that `R(2^31)` does not call `f` as it ought to (I think).


---

Comment by pbruin created at 2014-01-27 16:55:12

Changing component from basic arithmetic to coercion.


---

Comment by pbruin created at 2014-01-27 17:07:49

The bug appears to be fixed by making `MPolynomialRing_libsingular` a better-behaved parent: add an attribute `Element = MPolynomial_libsingular` and rename `__call__()` to `_element_constructor_()`.  Some more things need to be done (implementing `_coerce_map_from_()`, probably), because running doctests after this change leads to Sage complaining that this class uses the old coercion framework.


---

Comment by pbruin created at 2014-01-29 19:48:47

Converted `MPolynomialRing_libsingular` to the not-so-new-anymore coercion system; no substantial changes.


---

Comment by pbruin created at 2014-01-29 19:48:47

Changing status from new to needs_review.


---

Comment by tscrim created at 2014-01-30 15:41:37

LGTM, thanks Peter.


---

Comment by tscrim created at 2014-01-30 15:42:21

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2014-02-07 00:49:57

Resolution: fixed
