# Issue 13430: Fix to output of scientific notation for real interval field

Issue created by migration from https://trac.sagemath.org/ticket/13634

Original creator: tscrim

Original creation time: 2012-10-21 05:41:22

Assignee: tscrim

Keywords: real interval field

Currently if you set scientific notation for the real interval field, it does not print in scientific notation.

```
sage: RIF.scientific_notation(True)
sage: RIF(0.025)
0.025000000000000002?
sage: RIF.scientific_notation()
True
sage: RIF(0.025).str(no_sci=False)
'2.5000000000000002?e-2'
```

This is caused by not checking when `no_sci` option is `None` (and then checking the parent). After patch:

```
sage: RIF(0.025)
0.025000000000000002?
sage: RIF.scientific_notation(True)
sage: RIF(0.025)
2.5000000000000002?e-2
```



---

Comment by tscrim created at 2012-10-21 06:02:49

Changing status from new to needs_review.


---

Comment by tscrim created at 2012-10-21 06:02:49

Please review.


---

Comment by robertwb created at 2012-10-25 21:47:36

Minor nit: I'd prefere "not no_sci" to  "no_sci == False" in case the user passes a value like `0`. But other than that, looks good (including the nice docstring cleanups).


---

Attachment

Changed. Thank you.


---

Comment by robertwb created at 2012-10-27 06:20:10

Changing status from needs_review to positive_review.


---

Comment by jdemeyer created at 2012-11-06 22:22:35

Resolution: fixed
