# Issue 24275: fix plotting of WheelGraph(n) for n<4

Issue created by migration from https://trac.sagemath.org/ticket/24512

Original creator: dimpase

Original creation time: 2018-01-11 09:39:48

CC:  stefan rudi zgershkoff

the layout for n<4 needs to be different.

Reported [here](https://groups.google.com/d/msg/sage-support/XMaZIaTJdBI/TUvEkelfAAAJ)


---

Comment by dimpase created at 2018-01-11 09:56:26

Changing priority from major to minor.


---

Comment by dcoudert created at 2018-01-12 09:43:10

On the way to propose a patch, I realized that we have the same issue with 
`G = graphs.CycleGraph(2)`. However, when I set node positions, the edge is visible.

```
sage: G = graphs.CycleGraph(2)
sage: G.get_pos()
{0: (6.123233995736766e-17, 1.0), 1: (-1.8369701987210297e-16, -1.0)}
sage: G.show()
sage: G.set_pos({0:(0, 0), 1:(0, 1)})
sage: G.show()
```


An easy solution is to set these positions for cycle graphs and use cycle graphs in wheel graphs when `n < 3`.

Do you have a better suggestion ?


---

Comment by dimpase created at 2018-01-12 12:38:57

This makes perfect sense, I was planning to propose something like this, only using complete graphs.


---

Comment by dcoudert created at 2018-01-12 14:52:08

Fix plotting issues in `CycleGraph` and `WheelGraph`. I have also added a control on the input parameter.
----
New commits:


---

Comment by dcoudert created at 2018-01-12 14:52:08

Changing status from new to needs_review.


---

Comment by dimpase created at 2018-01-12 22:06:37

looks good to me, thanks!


---

Comment by dimpase created at 2018-01-12 22:06:37

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2018-01-18 20:11:34

Changing status from positive_review to needs_work.


---

Comment by vbraun created at 2018-01-18 20:11:34

Test failures, see patchbot


---

Comment by dcoudert created at 2018-01-18 23:58:17

The problem is in `src/sage/matroids/graphic_matroid.py`.
Some tests are easy to fix, but I don't know how to fix the issue in `graphic_coextension` and `split_vertex`. I don't know these modules, so some help might be helpful here.


---

Comment by dimpase created at 2018-01-19 01:09:13

I agree that it is not at all clear why after changing the implementation of `WheelGraph`
this fails (and note that these two implementations produce the same edge sets!)

```
            sage: M = Matroid(range(8), graphs.WheelGraph(5))
            sage: M1 = M.graphic_coextension(0, X=[1,2], element='a')
---------------------------------------------------------------------------
ValueError                                Traceback (most recent call last)
<ipython-input-37-4445dc60790d> in <module>()
      1 M = Matroid(range(Integer(8)), graphs.WheelGraph(Integer(5)))
----> 2 M1 = M.graphic_coextension(Integer(0), X=[Integer(1),Integer(2)], element='a')

/home/dima/Sage/sage-dev/local/lib/python2.7/site-packages/sage/matroids/graphic_matroid.pyc in graphic_coextension(self, u, v, X, element)
   1593         edgelist = self.groundset_to_edges(X)
   1594 
-> 1595         split_vertex(G, u, v, edgelist)
   1596         G.add_edge(u, v, element)
   1597 

/home/dima/Sage/sage-dev/local/lib/python2.7/site-packages/sage/matroids/utilities.pyc in split_vertex(G, u, v, edges)
    773                 G.delete_edge(e)
    774             else:
--> 775                 raise ValueError("the edges are not all incident with u")
    776 
    777         elif e[0] == u:

ValueError: the edges are not all incident with u

sage: graphs.WheelGraph(5).edges()
[(0, 1, None),
 (0, 2, None),
 (0, 3, None),
 (0, 4, None),
 (1, 2, None),
 (1, 4, None),
 (2, 3, None),
 (3, 4, None)]
```


and in the old implementation

```
sage: graphs.WheelGraph(5).edges()
[(0, 1, None),
 (0, 2, None),
 (0, 3, None),
 (0, 4, None),
 (1, 2, None),
 (1, 4, None),
 (2, 3, None),
 (3, 4, None)]
```

Stefan, Rudi, Zachary, any idea?


---

Comment by dimpase created at 2018-01-19 10:31:51

The problem might be that in the old implementation `graphs.WheelGraph(5).edges()`
and `graphs.WheelGraph(5).edges_iterator()` gave the same order, but in the new implementation these are different (which is not a bug AFAIK); namely, one gets

```
sage: list(wg.edge_iterator())
[(1, 2, None),
 (1, 4, None),
 (0, 1, None),
 (2, 3, None),
 (0, 2, None),
 (3, 4, None),
 (0, 3, None),
 (0, 4, None)]
```


I'd say it's a bug in the graphic matroids code, and it is beyond the scope of this ticket. 

On a practical note, could we have a less intrusive branch here, which only touches the plotting positions, but not the underlying graph?
And we'd open another ticket to deal with graphic matroids code, so please keep this branch alive as an illustration of the bug.


---

Comment by dcoudert created at 2018-01-19 10:41:14

> I'd say it's a bug in the graphic matroids code, and it is beyond the scope of this ticket. 

exactly.

> On a practical note, could we have a less intrusive branch here, which only touches the plotting positions, but not the underlying graph?

The solution is to continue to use `networkx.wheel_graph(n)` and then convert the networkx graph to a sage graph.

> And we'd open another ticket to deal with graphic matroids code, so please keep this branch alive as an illustration of the bug.

So we let this ticket as is for as long as the graphic matroid code has not been fixed. Right?


---

Comment by dimpase created at 2018-01-19 12:25:39

I would rather dealt with the layout here, and opened another ticket for the matroid bug.
Otherwise we have one ticket for two unrelated things, not good...


---

Comment by Stefan created at 2018-01-19 17:20:53

The GraphicMatroid issue arises because this line will automatically assign integer labels to the edges:

`sage: M = Matroid(range(8), graphs.WheelGraph(5))`

If the order of edge_iterator changes, the labeling of the edges will change (sage.matroids.constructor.py line 797).

It's not a bug in the matroid code, but the test was constructed kind of lazily, where it didn't explicitly specify an edge labeling. I recommend changing the tests to fix this. Easiest is to create the labeled graph explicitly, like so:


```
sage: G = Graph([(0, 1, 0), (0, 2, 1), (0, 3, 2), (0, 4, 3), (1, 2, 4), (1, 4, 5), (2, 3, 6), (3, 4, 7)])
sage: M = Matroid(G)
sage: M1 = M.graphic_coextension(0, X=[1,2], element='a')
sage: M1.graph().edges()
[(0, 1, 0),
 (0, 4, 3),
 (0, 5, 'a'),
 (1, 2, 4),
 (1, 4, 5),
 (2, 3, 6),
 (2, 5, 1),
 (3, 4, 7),
 (3, 5, 2)]
```



Edited to add:

I got that edge list in the first line directly from the old doctest code, like this:

```
M = Matroid(range(8), graphs.WheelGraph(5))
M.graph().edges()
```

so translating the doctests shouldn't be too onerous.


---

Comment by dimpase created at 2018-01-19 18:39:32

I don't see how this is not a bug in matroid code.

I think what happens is that if Matroid is called with 2 arguments, i.e. labels and the graph, this is not always working correctly (i.e. you create a matroid which is subtly broken so that `graphic_coextension` breaks. Indeed, with the new WheelGraph code, the following works:

```
sage: G=graphs.WheelGraph(5)
sage: M = Matroid(G)
sage: M.graphic_coextension(0,X=[(0,2),(0,3)])
Graphic matroid of rank 5 on 9 elements
```

but the following does not:

```
sage: G=graphs.WheelGraph(5)
sage: M = Matroid(range(8),G)
sage: M.graphic_coextension(0,X=[1,2])
---------------------------------------------------------------------------
ValueError                                Traceback (most recent call last)
<ipython-input-34-f3164ab7cc54> in <module>()
----> 1 M.graphic_coextension(Integer(0),X=[Integer(1),Integer(2)])

/home/dima/Sage/sage-dev/local/lib/python2.7/site-packages/sage/matroids/graphic_matroid.pyc in graphic_coextension(self, u, v, X, element)
   1593         edgelist = self.groundset_to_edges(X)
   1594 
-> 1595         split_vertex(G, u, v, edgelist)
   1596         G.add_edge(u, v, element)
   1597 

/home/dima/Sage/sage-dev/local/lib/python2.7/site-packages/sage/matroids/utilities.pyc in split_vertex(G, u, v, edges)
    773                 G.delete_edge(e)
    774             else:
--> 775                 raise ValueError("the edges are not all incident with u")
    776 
    777         elif e[0] == u:

ValueError: the edges are not all incident with u
```


So I think here we can simply change the test to

```
sage: M = Matroid(graphs.WheelGraph(5))
sage: M.graphic_coextension(0,X=[(0,2),(0,3)])
Graphic matroid of rank 5 on 9 elements
```

and deal with matroids in #24573.


---

Comment by Stefan created at 2018-01-19 20:38:03

Replying to [comment:13 dimpase]:
> I don't see how this is not a bug in matroid code.
> 
> I think what happens is that if Matroid is called with 2 arguments, i.e. labels and the graph, this is not always working correctly (i.e. you create a matroid which is subtly broken so that `graphic_coextension` breaks. 

Ah. Yes, if the ground set gets specified both through edge labels and an explicit list, the constructor does not try to match them up. That is a small bug. I disagree that it creates a broken matroid; it simply creates a matroid with an edge labeling different from the one you expect.

> Indeed, with the new WheelGraph code, the following works:
> {{{
> sage: G=graphs.WheelGraph(5)
> sage: M = Matroid(G)
> sage: M.graphic_coextension(0,X=[(0,2),(0,3)])
> Graphic matroid of rank 5 on 9 elements
> }}}
> but the following does not:
> {{{
> sage: G=graphs.WheelGraph(5)
> sage: M = Matroid(range(8),G)
> sage: M.graphic_coextension(0,X=[1,2])}}}

This is not an example of the bug you described, though. `G` has no edge labels internally, so the assignment of the labels `range(8)` to the edges should be considered random.


---

Comment by dimpase created at 2018-01-19 23:44:39

OK, I was totally confused by your `G` above. Now I see that indeed, it suffices to adjust X (perhaps this is what you meant to say), by looking at `M.graph().edges()`:

```
sage: G=graphs.WheelGraph(5)
sage: M = Matroid(range(8),G)
sage: M.graph().edges()
[(0, 1, 2),
 (0, 2, 4),
 (0, 3, 6),
 (0, 4, 7),
 (1, 2, 0),
 (1, 4, 1),
 (2, 3, 3),
 (3, 4, 5)]
sage: M.graphic_coextension(0,X=[4,6]) # 4,6 are labels of 02 and 03
Graphic matroid of rank 5 on 9 elements
```

So this is how to fix the doctest - just 1-line change:

```
sage: M.graphic_coextension(0,X=[4,6])
```



---

Comment by git created at 2018-01-20 10:23:00

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by dcoudert created at 2018-01-20 10:25:56

I have restored the use of networkx for the creation of the graph to pass the tests in `graphic_matroid`.


---

Comment by dcoudert created at 2018-01-20 10:25:56

Changing status from needs_work to needs_review.


---

Comment by dimpase created at 2018-01-20 11:29:00

Replying to [comment:17 dcoudert]:
> I have restored the use of networkx for the creation of the graph to pass the tests in `graphic_matroid`.

but why? We don't need networkx, we just have to adjust that tests...


---

Comment by dcoudert created at 2018-01-20 12:18:04

I thought you wanted to fix what concern matroids in #24573. You confirm that we adjust the test here ?


---

Comment by dimpase created at 2018-01-20 12:50:28

Replying to [comment:19 dcoudert]:
> I thought you wanted to fix what concern matroids in #24573. You confirm that we adjust the test here ?

The only thing to fix in matroids is documentation of the function in question, which made it impossible to understand what the input should be. As you see in comment 15, it's the change of edge labelling generated by the matroid code (so edges 1 and 2 are no longer incident to vertex 0).
One fix suggested by Stefan in comment 12 is to use graph with edge labelling already generated:

```
sage: G = Graph([(0, 1, 0), (0, 2, 1), (0, 3, 2), (0, 4, 3), (1, 2, 4), (1, 4, 5), (2, 3, 6), (3, 4, 7)])
sage: M = Matroid(G)
sage: M1 = M.graphic_coextension(0, X=[1,2], element='a')
```

This should be the most robust way.

Another way might be to use the updated labels, just 1-line change:

```
sage: M.graphic_coextension(0,X=[4,6])
```

which is potentially flaky, as it relies on the labelling one does not have control over.


---

Comment by git created at 2018-01-20 14:40:33

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by dcoudert created at 2018-01-20 14:41:14

Hope it will be ok now.


---

Comment by dimpase created at 2018-01-20 16:31:51

OK, looks good, thanks!


---

Comment by dimpase created at 2018-01-20 16:31:51

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2018-01-22 07:58:16

Resolution: fixed
