# Issue 12631: quotient of ideals throws up Singular bug

Issue created by migration from Trac.

Original creator: mariah

Original creation time: 2012-04-03 20:15:01

Assignee: AlexGhitza

CC:  malb


```
sage: var('x,y,z')
(x, y, z)
sage: R = ZZ[x,y,z]
sage: A = R.ideal([x^2, x*y, x*z])
sage: B = R.ideal([x])
sage: A.quotient(B)
---------------------------------------------------------------------------
RuntimeError                              Traceback (most recent call last)

/home/mariah/sage/sage-4.8-x86_64-Linux-core2-fc/<ipython console> in <module>()

/home/mariah/sage/sage-4.8-x86_64-Linux-core2-fc/local/lib/python2.6/site-packages/sage/rings/polynomial/multi_polynomial_ideal.pyc in wrapper(*args, **kwds)
    500         """
    501         with LibSingularDefaultContext():
--> 502             return func(*args, **kwds)
    503     return wrapper
    504 

/home/mariah/sage/sage-4.8-x86_64-Linux-core2-fc/local/lib/python2.6/site-packages/sage/rings/polynomial/multi_polynomial_ideal.pyc in quotient(self, J)
   2224         import sage.libs.singular
   2225         quotient = sage.libs.singular.ff.quotient
-> 2226         return R.ideal(quotient(self, J))
   2227 
   2228     `@`require_field

/home/mariah/sage/sage-4.8-x86_64-Linux-core2-fc/local/lib/python2.6/site-packages/sage/libs/singular/function.so in sage.libs.singular.function.SingularFunction.__call__ (sage/libs/singular/function.cpp:10130)()

/home/mariah/sage/sage-4.8-x86_64-Linux-core2-fc/local/lib/python2.6/site-packages/sage/libs/singular/function.so in sage.libs.singular.function.call_function (sage/libs/singular/function.cpp:11392)()

/home/mariah/sage/sage-4.8-x86_64-Linux-core2-fc/local/lib/python2.6/site-packages/sage/libs/singular/function.so in sage.libs.singular.function.call_function (sage/libs/singular/function.cpp:11306)()

RuntimeError: Segmentation fault
sage: 
```



---

Comment by SimonKing created at 2012-05-28 07:04:25

Changing assignee from AlexGhitza to malb.


---

Comment by SimonKing created at 2012-05-28 07:04:25

Changing component from algebra to commutative algebra.


---

Comment by jakobkroeker created at 2014-04-04 18:59:14

This bug (and some others) are fixed in recent [Singular](https://github.com/Singular/Sources):


```
ring rng = integer,(x,y,z),dp;
ideal A = x^2, x*y, x*z;
ideal B = x;
quotient(A,B);
//_[1]=z
//_[2]=y
//_[3]=x
```

(offtopic: are all known Singular-bugs reported [upstream](http://www.singular.uni-kl.de:8002/trac/newticket)? )

However, I recall that there are some issues when considering updating Singular :
- there is no stable/official release yet 
- in sage-devel (?, cannot currently find the post I had in mind) it was mentioned that the libSingular interface changed significantly in comparison to v 3.1.6


---

Comment by jakobkroeker created at 2015-01-26 23:40:43

the bug above is fixed by upgrade to Singular 3.1.7

but there is at least another one (fixed in 4.0.1, see ticket #17254):


```
R.<xe,xv> = ZZ[]

J = Ideal(4*xv^3+3*xv^2, 3*xe*xv^2+xe-2*xv);

I  = Ideal(-3, -3*xv-1, -3);
I2 = Ideal(-3, -3*xv-1);
assert( I  == I2 )

Q1 = J.quotient(I) # wrong
Q2 = J.quotient(I2)


assert( Q1 == Q2 ) # fails
```



---

Comment by @mwageringel created at 2020-01-04 22:07:21

Changing status from new to needs_review.


---

Comment by @mwageringel created at 2020-01-04 22:07:21

Changing priority from major to minor.


---

Comment by @mwageringel created at 2020-01-04 22:07:21

Since the bug is fixed, here is a branch removing the stopgap warning and adding the example from the description as a doctest.

(Ignore the pyflakes warning for now. I will deal with it on another ticket, as the unused macaulay2 variable should actually be used.)
----
New commits:


---

Comment by klee created at 2020-01-29 00:24:47

LGTM


---

Comment by klee created at 2020-01-29 00:24:47

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2020-01-31 23:49:19

Resolution: fixed
