# Issue 11496: abs(a+b)^2 == (a+b)^2

Issue created by migration from Trac.

Original creator: jan

Original creation time: 2011-08-08 18:51:28

Assignee: ncalexan

CC:  kcrisman mjo

Keywords: maxima abs


```
sage: version()
'Sage Version 4.7, Release Date: 2011-05-23'
sage: var('a b', domain='real');
sage: A = abs((a+i*b))^2
sage: A
abs(a + I*b)^2
sage: imag(A)
0
sage: A.simplify_full()
a^2 + 2*I*a*b - b^2
sage: imag(A.simplify_full())
2*a*b
```


The last result is clearly wrong. abs() is real by definition. simplify_full() doesn't handle abs() correctly.

Demo Notebook: http://demo.sagenb.org/home/pub/181/


---

Comment by jan created at 2011-08-08 18:52:02

Changing assignee from ncalexan to burcin.


---

Comment by jan created at 2011-08-08 18:52:02

Changing component from sage-mode to symbolics.


---

Comment by kcrisman created at 2011-08-09 00:33:16

The exact place is 

```
sage: A.simplify_radical()
a^2 + 2*I*a*b - b^2
```

This is how `radcan` in Maxima does this over the real domain, which `simplify_radical` temporarily makes us in.  

I'm not sure what the best thing to do here is.  Two ideas:
 * Change so that we stay in `domain:complex` in Maxima, sort of missing the point of `simplify_radical`
 * Give lots of warnings not to trust simplification because (like most simplification) it is not always true, but useful.  (Sort of like how `\sqrt{x^2}\neq x` but sometimes it's useful to simplify it that way.)

I do not think we pass the domain information from the (Pynac) variables in any case, or if that would be very easy to do.


---

Comment by kcrisman created at 2013-06-12 19:33:30

This has been fixed by #12780.

```
sage: var('a b')
(a, b)
sage: A = abs((a+i*b))^2
sage: A.simplify_radical()
abs(a + I*b)^2
sage: imag(A)
0
sage: imag(A.simplify_full())
0
```

Patch probably coming up.  This would also be dealt with by #12737, but that is orthogonal to having fixed the domain issues.


---

Comment by kcrisman created at 2013-06-12 20:41:29

Changing status from new to needs_review.


---

Comment by mjo created at 2013-06-14 15:51:09

Two minor things, can you use `a,b = SR.var('a,b')` to create the variables? That will eliminate one line of unrelated output. And just a style preference, since sage outputs the complex unit as `I`, I think it's a tiny bit more consistent to use that for input as well, but I'll take it either way.


---

Attachment

Based on 5.10.rc1


---

Comment by kcrisman created at 2013-06-14 16:01:49

> Two minor things
Sure, no problem.  I put the `i` instead of `I` just because I copied from the original example in the ticket, but that is unimportant.  Thanks!


---

Comment by mjo created at 2013-06-14 20:33:17

Changing status from needs_review to positive_review.


---

Comment by jdemeyer created at 2013-06-20 21:33:58

Resolution: fixed
