# Issue 13084: abs floor ceil for quadratic number field

Issue created by migration from https://trac.sagemath.org/ticket/13256

Original creator: vdelecroix

Original creation time: 2012-07-14 17:48:12

Assignee: vdelecroix

CC:  mhansen berocal

Keywords: absolute value, floor, ceiling, number field, quadratic

Implementation of absolute value (abs), floor (floor) and ceiling (ceil) function for elements in quadratic number field. This depends (not very much) on comparisons in quadratic number fields implemented in tickects #7160 and #13213.

Strangely enough, floor and ceil functions are much faster than abs function! The reason is because the comparison in #13213 which is called in abs is actually very slow.

```
sage: sage: K.<sqrt2> = QuadraticField(2, name='sqrt2')
sage: %timeit abs(sqrt2)
125 loops, best of 3: 2.22 ms per loop
sage: %timeit floor(sqrt2)
625 loops, best of 3: 3.37 µs per loop
```



---

Comment by vdelecroix created at 2012-07-14 18:54:19

Changing status from new to needs_review.


---

Comment by kcrisman created at 2013-05-10 17:32:18

Does the removal of

```
K.<a> = NumberField(x^2+1, embedding=CDF.gen()) 
```

as an example mean that one couldn't use this syntax at all any more?  Would number fields from quadratics not automatically be quadratic fields (when mathematically appropriate, I'm excluding `x^2-1` and the like) and inherit these methods, or would that simply not work now?


---

Comment by vdelecroix created at 2013-05-10 18:02:47

Replying to [comment:2 kcrisman]:
> Does the removal of
> {{{
> K.<a> = NumberField(x^2+1, embedding=CDF.gen()) 
> }}}
> as an example mean that one couldn't use this syntax at all any more?

This syntax is still available. The patch only aims to implement methods abs, floor and ceil for quadratic elements. As an example

```
sage: K.<sqrt2> = QuadraticField(2)
sage: sqrt2.floor()
1
```

It is yet possible (without the patch) to do

```
sage: K.<sqrt2> = QuadraticField(2)
sage: floor(sqrt2)
1
```

But there is a simpler and faster way to do it compared to what floor does (using the real interval field with finer and finer approximations). Note that if the method .floor is present, the the function floor will use it!


> Would number fields from quadratics not automatically be quadratic fields (when mathematically appropriate, I'm excluding `x^2-1` and the like) and inherit these methods, or would that simply not work now?

Yes, it is the way it is

```
sage: type(NumberField(x^2 + 1, 'a'))
<class 'sage.rings.number_field.number_field.NumberField_quadratic_with_category'>
```



---

Attachment


---

Comment by vdelecroix created at 2013-05-18 13:16:25

The patch now takes care of the new doctest framework (ie replace "..." by "....:" for multiline tests).


---

Comment by chapoton created at 2013-05-28 20:21:17

I have made a short review patch, with correct links to trac and raise statements.


---

Attachment


---

Comment by chapoton created at 2013-05-31 18:26:05

ok, looks good to me. Positive review.


---

Comment by chapoton created at 2013-05-31 18:26:05

Changing status from needs_review to positive_review.


---

Comment by vdelecroix created at 2013-05-31 22:16:49

Replying to [comment:7 chapoton]:
> ok, looks good to me. Positive review.

Cool. Thanks Frédéric.


---

Comment by jdemeyer created at 2013-06-06 12:32:08

Resolution: fixed
