# Issue 15928: segfault in Expression.roots(rings=CC)

Issue created by migration from https://trac.sagemath.org/ticket/16165

Original creator: rws

Original creation time: 2014-04-15 07:39:03

Keywords: pari, roots


```
sage: f=(1+x+x^2)^3
sage: f.roots(ring=CC)
---------------------------------------------------------------------------
SignalError                               Traceback (most recent call last)
<ipython-input-2-e28890a572d2> in <module>()
----> 1 f.roots(ring=CC)

/home/ralf/sage/local/lib/python2.7/site-packages/sage/symbolic/expression.so in sage.symbolic.expression.Expression.roots (sage/symbolic/expression.cpp:38111)()

/home/ralf/sage/local/lib/python2.7/site-packages/sage/rings/polynomial/polynomial_element.so in sage.rings.polynomial.polynomial_element.Polynomial.roots (sage/rings/polynomial/polynomial_element.c:36164)()

/home/ralf/sage/local/lib/python2.7/site-packages/sage/libs/pari/gen.so in sage.libs.pari.gen.gen.polroots (sage/libs/pari/gen.c:42565)()

/home/ralf/sage/local/lib/python2.7/site-packages/sage/ext/c_lib.so in sage.ext.c_lib.sig_raise_exception (sage/ext/c_lib.c:1208)()

SignalError: Segmentation fault
sage: gp_version()
((2, 5, 5), 'GP/PARI CALCULATOR Version 2.5.5 (released)')
```




---

Comment by rws created at 2014-04-17 16:18:38

This goes away with pari-2.7.0 (#15767), so dependency set.

```
sage: f=(1+x+x^2)^3
sage: f.roots(ring=CC)
[(-0.500000000000000 - 0.866025403784439*I, 3),
 (-0.500000000000000 + 0.866025403784439*I, 3)]
```



---

Comment by rws created at 2014-04-17 16:47:45

New commits:


---

Comment by rws created at 2014-04-17 16:47:45

Changing status from new to needs_review.


---

Comment by pbruin created at 2014-04-17 17:37:24

That is interesting; I can reproduce this in Sage, but it doesn't happen when trying it directly in GP:

```
sage -gp
...
(18:33) gp > f=(1+x+x^2)^3
%1 = x^6 + 3*x^5 + 6*x^4 + 7*x^3 + 6*x^2 + 3*x + 1
(18:33) gp > polroots(f)
%2 = [-0.50000000000000000000000000000000000000 - 0.86602540378443864676372317075293618348*I, -0.50000000000000000000000000000000000000 + 0.86602540378443864676372317075293618348*I, -0.50000000000000000000000000000000000000 - 0.86602540378443864676372317075293618348*I, -0.50000000000000000000000000000000000000 + 0.86602540378443864676372317075293618348*I, -0.50000000000000000000000000000000000000 - 0.86602540378443864676372317075293618348*I, -0.50000000000000000000000000000000000000 + 0.86602540378443864676372317075293618348*I]~
```

First multiplying `f` by `1.0 + 0.0*I` makes no difference.  The Sage -> PARI conversion isn't the problem either:

```
sage: f=(1+x+x^2)^3
sage: pari(f).polroots()
[-0.500000000000000 - 0.866025403784439*I, -0.500000000000000 + 0.866025403784439*I, -0.500000000000000 - 0.866025403784439*I, -0.500000000000000 + 0.866025403784439*I, -0.500000000000000 - 0.866025403784439*I, -0.500000000000000 + 0.866025403784439*I]~
```



---

Comment by pbruin created at 2014-04-17 19:47:34

It is reproducible in GP if one first changes the precision from 128 bits (38 digits, PARI's default) to 64 bits (19 digits), which is the precision used to handle Sage's 53-bit precision reals:

```
(20:43) gp > \p19
(20:43) gp > polroots(1.0*(1+x+x^2)^3)
  ***   at top-level: polroots(1.0*(1+x+x^
  ***                 ^--------------------
  *** polroots: bug in PARI/GP (Segmentation Fault), please report
```

This is indeed fixed in PARI/GP 2.7.0.


---

Comment by rws created at 2014-05-05 07:21:00

Changing priority from critical to major.


---

Comment by pbruin created at 2014-08-18 23:14:04

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2014-08-20 20:21:51

Resolution: fixed
