# Issue 15084: Function changes behaviour, related to polynomial rings

archive/issues_015084.json:
```json
{
    "body": "I've just observed the following strange behaviour:\n\n\n```\nsage: PR1 = PolynomialRing(QQ, [\"t\" + str(i) for i in range(10)])\nsage: t = PR1.gens()\nsage: def L(r, j):\n...       return (t[r] - t[r + j])/t[r + j]\n...\nsage: PR2 = PolynomialRing(PR1.fraction_field(), [\"p\" + str(i) for i in range(5)])\nsage: p = PR2.gens()\nsage: def D(r):\n...       return sum(L(r, j)*p[r-4+j] for j in range(3))\n...\nsage: D(4)\n((t4 - t5)/t5)*p1 + ((t4 - t6)/t6)*p2\nsage: myc = list(D(4))    # here the command works all right\nsage: D(4)                # reproducing the call still works fine here\n((t4 - t5)/t5)*p1 + ((t4 - t6)/t6)*p2\nsage: [c for c, p in myc] # THIS LINE APPEARS TO BREAK THINGS!\n[(t4 - t5)/t5, (t4 - t6)/t6]\nsage: D(4)                # now the result is wrong, no error reported\n0\nsage: myc = list(D(4))    # and this throws, probably due to the zero result\nTraceback (most recent call last):\n...\nTypeError: 'sage.rings.fraction_field_element.FractionFieldElement' object is not iterable\n```\n\n\nSo it seems that repeated execution of the same function can yield different (and sometimes wrong!) results if some result was iterated over in a certain way. No clue why.\n\nIssue created by migration from https://trac.sagemath.org/ticket/15321\n\n",
    "created_at": "2013-10-24T15:01:48Z",
    "labels": [
        "component: algebra",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-duplicate/invalid/wontfix",
    "title": "Function changes behaviour, related to polynomial rings",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/15084",
    "user": "https://github.com/gagern"
}
```
I've just observed the following strange behaviour:


```
sage: PR1 = PolynomialRing(QQ, ["t" + str(i) for i in range(10)])
sage: t = PR1.gens()
sage: def L(r, j):
...       return (t[r] - t[r + j])/t[r + j]
...
sage: PR2 = PolynomialRing(PR1.fraction_field(), ["p" + str(i) for i in range(5)])
sage: p = PR2.gens()
sage: def D(r):
...       return sum(L(r, j)*p[r-4+j] for j in range(3))
...
sage: D(4)
((t4 - t5)/t5)*p1 + ((t4 - t6)/t6)*p2
sage: myc = list(D(4))    # here the command works all right
sage: D(4)                # reproducing the call still works fine here
((t4 - t5)/t5)*p1 + ((t4 - t6)/t6)*p2
sage: [c for c, p in myc] # THIS LINE APPEARS TO BREAK THINGS!
[(t4 - t5)/t5, (t4 - t6)/t6]
sage: D(4)                # now the result is wrong, no error reported
0
sage: myc = list(D(4))    # and this throws, probably due to the zero result
Traceback (most recent call last):
...
TypeError: 'sage.rings.fraction_field_element.FractionFieldElement' object is not iterable
```


So it seems that repeated execution of the same function can yield different (and sometimes wrong!) results if some result was iterated over in a certain way. No clue why.

Issue created by migration from https://trac.sagemath.org/ticket/15321





---

archive/issue_comments_193101.json:
```json
{
    "body": "This is not a problem in Sage, but a documented \"feature\" of Python2. It was realized to be a wart and fixed in Python3. The problem is indeed the line you mark:\n\n```\nsage: p\n(p0, p1, p2, p3, p4)\nsage: [c for c, p in myc] # THIS LINE APPEARS TO BREAK THINGS!\n[(t4 - t5)/t5, (t4 - t6)/t6]\nsage: p\np2\n```\n\nList comprehensions leak their variables, so the value of your global variable p (which gets used in your function `D`) gets overwritten. This problem does not with happen if you write\n\n```\nsage: list(c for c, p in myc)\n```\n\nbecause iterators do not leak their variables. In Python3, list comprehensions share the same semantics as iterators.\n\nIt's a wart, but as long as we stick with Python2 we'll have to live with it. Ways to mitigate the problem:\n- Don't rely on a global variable such as p inside a function. Derive parents and their generators from your input variables (meaning: D should probably have `PR2` as one of its parameters).\n- Use `list(...)` rather than `[...]` if you don't want to leak variables into scope.\n\nPolynomials are indexable and iterable (for better or for worse), but fraction field elements are not. Thus, you have:\n\n```\nsage: parent(D(4))\nMultivariate Polynomial Ring in p0, p1, p2, p3, p4 over Fraction Field of Multivariate Polynomial Ring in t0, t1, t2, t3, t4, t5, t6, t7, t8, t9 over Rational Field\nsage: p=PR2.2 #THIS LINE BREAKS THINGS\nsage: parent(D(4))\nFraction Field of Multivariate Polynomial Ring in t0, t1, t2, t3, t4, t5, t6, t7, t8, t9 over Rational Field\n```\n",
    "created_at": "2013-10-24T15:46:14Z",
    "issue": "https://github.com/sagemath/sagetest/issues/15084",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/15084#issuecomment-193101",
    "user": "https://github.com/nbruin"
}
```

This is not a problem in Sage, but a documented "feature" of Python2. It was realized to be a wart and fixed in Python3. The problem is indeed the line you mark:

```
sage: p
(p0, p1, p2, p3, p4)
sage: [c for c, p in myc] # THIS LINE APPEARS TO BREAK THINGS!
[(t4 - t5)/t5, (t4 - t6)/t6]
sage: p
p2
```

List comprehensions leak their variables, so the value of your global variable p (which gets used in your function `D`) gets overwritten. This problem does not with happen if you write

```
sage: list(c for c, p in myc)
```

because iterators do not leak their variables. In Python3, list comprehensions share the same semantics as iterators.

It's a wart, but as long as we stick with Python2 we'll have to live with it. Ways to mitigate the problem:
- Don't rely on a global variable such as p inside a function. Derive parents and their generators from your input variables (meaning: D should probably have `PR2` as one of its parameters).
- Use `list(...)` rather than `[...]` if you don't want to leak variables into scope.

Polynomials are indexable and iterable (for better or for worse), but fraction field elements are not. Thus, you have:

```
sage: parent(D(4))
Multivariate Polynomial Ring in p0, p1, p2, p3, p4 over Fraction Field of Multivariate Polynomial Ring in t0, t1, t2, t3, t4, t5, t6, t7, t8, t9 over Rational Field
sage: p=PR2.2 #THIS LINE BREAKS THINGS
sage: parent(D(4))
Fraction Field of Multivariate Polynomial Ring in t0, t1, t2, t3, t4, t5, t6, t7, t8, t9 over Rational Field
```




---

archive/issue_comments_193102.json:
```json
{
    "body": "Changing status from new to needs_review.",
    "created_at": "2013-10-24T15:46:14Z",
    "issue": "https://github.com/sagemath/sagetest/issues/15084",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/15084#issuecomment-193102",
    "user": "https://github.com/nbruin"
}
```

Changing status from new to needs_review.



---

archive/issue_comments_193103.json:
```json
{
    "body": "Replying to [comment:2 nbruin]:\n> This is not a problem in Sage, but a documented \"feature\" of Python2. [\u2026]\n> List comprehensions leak their variables, so the value of your global\n> variable p [\u2026] gets overwritten.\n\nThanks for clarifying this.\n\nI seem to have a knack for reporting things in the wrong place: I tend to ask questions on Ask Sage which turn out to be bugs, and now I asked here about what felt like a sure bug, and it turns out to be \u201ca feature\u201d or at least not Sage's bug, so it might have been more appropriate to use that Q&A forum instead.",
    "created_at": "2013-10-24T18:44:38Z",
    "issue": "https://github.com/sagemath/sagetest/issues/15084",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/15084#issuecomment-193103",
    "user": "https://github.com/gagern"
}
```

Replying to [comment:2 nbruin]:
> This is not a problem in Sage, but a documented "feature" of Python2. […]
> List comprehensions leak their variables, so the value of your global
> variable p […] gets overwritten.

Thanks for clarifying this.

I seem to have a knack for reporting things in the wrong place: I tend to ask questions on Ask Sage which turn out to be bugs, and now I asked here about what felt like a sure bug, and it turns out to be “a feature” or at least not Sage's bug, so it might have been more appropriate to use that Q&A forum instead.



---

archive/issue_comments_193104.json:
```json
{
    "body": "Changing status from needs_review to positive_review.",
    "created_at": "2013-10-29T07:47:10Z",
    "issue": "https://github.com/sagemath/sagetest/issues/15084",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/15084#issuecomment-193104",
    "user": "https://github.com/jdemeyer"
}
```

Changing status from needs_review to positive_review.



---

archive/issue_comments_193105.json:
```json
{
    "body": "Resolution: invalid",
    "created_at": "2013-10-30T14:24:22Z",
    "issue": "https://github.com/sagemath/sagetest/issues/15084",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/15084#issuecomment-193105",
    "user": "https://github.com/jdemeyer"
}
```

Resolution: invalid



---

archive/issue_events_014767.json:
```json
{
    "actor": "@jdemeyer",
    "created_at": "2013-10-30T14:24:22Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/15084",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/15084#event-14767"
}
```
