# Issue 27644: allow creation of PermutationGroupElement with 0 in domain

Issue created by migration from https://trac.sagemath.org/ticket/27881

Original creator: dimpase

Original creation time: 2019-05-28 08:59:32

CC:  dcoudert stumpc5

one can create `PermutationGroup_generic_with_category` acting on a domain with 0, but creating its individual elements (moving 0) is broken.

```
sage: p=graphs.PetersenGraph()
sage: a=p.automorphism_group(); a
Permutation Group with generators [(3,7)(4,5)(8,9), (2,6)(3,8)(4,5)(7,9), (1,4,5)(2,3,8,6,9,7), (0,1)(2,4,6,5)(3,9,8,7)]
sage: a.domain()
{0, 1, 2, 3, 4, 5, 6, 7, 8, 9}
sage: map(type, a.gens())
[<type 'sage.groups.perm_gps.permgroup_element.PermutationGroupElement'>,
 <type 'sage.groups.perm_gps.permgroup_element.PermutationGroupElement'>,
 <type 'sage.groups.perm_gps.permgroup_element.PermutationGroupElement'>,
 <type 'sage.groups.perm_gps.permgroup_element.PermutationGroupElement'>]
sage: PermutationGroupElement("(0,2)")
---------------------------------------------------------------------------
ValueError                                Traceback (most recent call last)
<ipython-input-15-fa3d3058e13a> in <module>()
----> 1 PermutationGroupElement("(0,2)")

/home/dimpase/Sage/sagetrac-mirror/local/lib/python2.7/site-packages/sage/groups/perm_gps/permgroup_element.pyx in sage.groups.perm_gps.permgroup_element.PermutationGroupElement.__init__ (build/cythonized/sage/groups/perm_gps/permgroup_element.c:5852)()
    502 
    503         degree = max([1] + [max(cycle+(1,)) for cycle in v])
--> 504         v = from_cycles(degree, v)
    505 
    506         self.__gap = 'PermList({})'.format(list(v)) # Make sure it is a list

/home/dimpase/Sage/sagetrac-mirror/local/lib/python2.7/site-packages/sage/combinat/permutation.pyc in from_cycles(n, cycles, parent)
   7041     # Only positive elements
   7042     if int(flattened_and_sorted[0]) < 1:
-> 7043         raise ValueError("All elements should be strictly positive "
   7044                          "integers, and I just found a non-positive one.")
   7045 

ValueError: All elements should be strictly positive integers, and I just found a non-positive one.
```



---

Comment by embray created at 2019-06-14 14:55:02

As the Sage-8.8 release milestone is pending, we should delete the sage-8.8 milestone for tickets that are not actively being worked on or that still require significant work to move forward.  If you feel that this ticket should be included in the next Sage release at the soonest please set its milestone to the next release milestone (sage-8.9).


---

Comment by vdelecroix created at 2019-10-28 03:49:55

Changing status from new to needs_review.


---

Comment by vdelecroix created at 2019-10-28 03:49:55

The message is


---

Comment by dimpase created at 2019-10-28 06:23:34

one should not edit away the error reports!


---

Comment by vdelecroix created at 2019-10-28 12:23:10

It was not a meaningful error report. The command `PermutationGroupElement("(0,2)")` is not working (as expected). And it has nothing to do with the computation of automorphism group of graphs.


---

Comment by dimpase created at 2019-10-28 12:28:09

there was some code, meaningful or not, that used to produce errors.

are these errors fixed?


---

Comment by vdelecroix created at 2019-10-28 12:32:07

Indeed `PermutationGroupElement("(0,2)")` produced and still produce an error. What do you mean by fixed? The error is intended.


---

Comment by dimpase created at 2019-10-28 17:01:28

Changing status from needs_review to positive_review.


---

Comment by dimpase created at 2019-10-28 17:01:28

OK, thanks. Sorry for noise - indeed it was not a bug.


---

Comment by chapoton created at 2019-10-29 10:45:08

Resolution: invalid
