# Issue 12266: Definite integral should not depend on the dummy variable

Issue created by migration from https://trac.sagemath.org/ticket/12438

Original creator: novoselt

Original creation time: 2012-02-04 19:02:34

Assignee: burcin

CC:  kcrisman jason

Consider the following:

```
sage: f(x) = x; f
x |--> x
sage: integral(f, x)
x |--> 1/2*x^2
sage: integral(f, x, 0, 1)
x |--> 1/2
```

The last integral has not "happened" to be constant - it does not depend on x mathematically, so it should not depend on x in Sage.

Multivariate case:

```
sage: f(x, y) = x + y
sage: f
(x, y) |--> x + y
sage: integral(f, x, 0, 1)
(x, y) |--> y + 1/2
sage: _(3)
y + 1/2 
```

`integral(...)` here should return a symbolic function that depends on y only, so that the last evaluation gives `7/2` (and there are no warning about unnamed evaluation - the order of variables is the same as for the original function with one variable dropped).

See discussion here: http://groups.google.com/group/sage-devel/browse_thread/thread/1309eeae0714be79


---

Comment by novoselt created at 2012-05-25 02:07:27

Working on it.


---

Comment by novoselt created at 2012-05-25 02:07:27

Changing keywords from "" to "sd40.5".


---

Comment by kcrisman created at 2012-05-25 02:25:40

After rereading the original thread, as discussed in person, I think that extracting all the (callable) variables from the original expression and then returning a callable function with all but one of them in the same order (is this easy to do?) should be doable and ok.


---

Comment by novoselt created at 2012-05-25 02:35:42

The offending lines are

```
    if is_CallableSymbolicExpressionRing(self._parent):
        return self._parent(integral(ring.SR(self), *args, **kwds))
```

So if we start with at function depending on x and y, the result will also be a function depending on x and y. 

The question is now in distinguishing definite and indefinite integrals, as they have to be treated differently.


---

Comment by novoselt created at 2012-05-25 04:44:08

Changing status from new to needs_review.


---

Comment by novoselt created at 2012-05-25 04:44:08

Done!


---

Comment by novoselt created at 2012-05-25 04:46:00

First three hunks replace TABs with spaces - I thought they were gone from the library?..


---

Comment by kcrisman created at 2012-05-25 05:00:45

This looks pretty good.  Running tests.


---

Comment by dsm created at 2012-05-25 05:17:14

Just so it's recorded:


```
sage: f(x) = x
sage: var("y")
y
sage: integral(f, y, 0, 3)
ERROR: An unexpected error occurred while tokenizing input
The following traceback may be corrupted or invalid
The error message is: ('EOF in multi-line statement', (580, 0))

---------------------------------------------------------------------------
ValueError                                Traceback (most recent call last)

/home/mcneil/sagedev/sage-5.1.beta0/devel/sage-hack/sage/<ipython console> in <module>()

/home/mcneil/sagedev/sage-5.1.beta0/local/lib/python2.7/site-packages/sage/misc/functional.pyc in integral(x, *args, **kwds)
    726     """
    727     if hasattr(x, 'integral'):
--> 728         return x.integral(*args, **kwds)
    729     else:
    730         from sage.symbolic.ring import SR

/home/mcneil/sagedev/sage-5.1.beta0/local/lib/python2.7/site-packages/sage/symbolic/expression.so in sage.symbolic.expression.Expression.integral (sage/symbolic/expression.cpp:33895)()

ValueError: list.remove(x): x not in list

```



---

Comment by kcrisman created at 2012-05-25 05:22:29

Reviewer patch fixes one doctest - should be able to apply even after fixing this.


---

Comment by kcrisman created at 2012-05-25 05:23:36

Replying to [comment:8 dsm]:
> Just so it's recorded:
> 

```
> sage: f(x) = x
> sage: var("y")
```


But

```
sage: var('y')   
y
sage: integral(x,y,0,3)
3*x
```

so it's only that branch which causes problems.


---

Comment by novoselt created at 2012-05-25 05:25:44

No more problems and extra doctests are added!

Apply only trac_12438_drop_variable_of_definite_integration.patch


---

Comment by novoselt created at 2012-05-25 16:26:28

Fixed "OUPUT" typo.


---

Comment by benjaminfjones created at 2012-05-26 03:20:33

The most recent patch applies with fuzz to sage-5.0:

```
Hunk #3 succeeded at 653 with fuzz 1 (offset -11 lines).
```

but maybe it applies cleanly to 5.1.beta0. Relevant tests pass in `sage/calculus`, `sage/symbolic`, and `sage/functions`. I'm running a patchbot instance on it for the complete test suite.


---

Comment by novoselt created at 2012-05-26 03:29:07

Bloody patchbot, I repeat:

Apply only trac_12438_drop_variable_of_definite_integration.patch 

(And I am working on 5.1.beta0, so hopefully there will be no fuzz during merging.)


---

Comment by kcrisman created at 2012-05-26 03:50:33

Replying to [comment:13 benjaminfjones]:
> The most recent patch applies with fuzz to sage-5.0:
> {{{
> Hunk #3 succeeded at 653 with fuzz 1 (offset -11 lines).
> }}}
> but maybe it applies cleanly to 5.1.beta0. 
Correct, it does.

So we're set to go?


---

Comment by benjaminfjones created at 2012-05-26 04:12:38

Changing status from needs_review to positive_review.


---

Comment by benjaminfjones created at 2012-05-26 04:12:38

The 5.1.beta0 patchbot says tests pass, so I think we're good here. Positive review.


---

Attachment

Apply this patch only


---

Comment by novoselt created at 2012-05-28 21:24:44

#2607 was fixing the same TABs as this ticket, I've rebased this one on top of that one. No code was changed, so I'll leave it at positive review.


---

Comment by novoselt created at 2012-06-01 23:13:55

I've realized that since I've just removed conflicting hunks this patch has become independent of #2607.


---

Comment by jdemeyer created at 2012-06-05 11:51:28

Resolution: fixed


---

Comment by kcrisman created at 2012-07-10 15:24:24

On a related note, Sage has gone the _other_ way on limits.


```
$ Downloads/sage-4.8/sage
----------------------------------------------------------------------
----------------------------------------------------------------------
sage: f(x) = x^2
sage: limit(f,x=1)
x |--> 1
sage: limit(f(x),x=1)
1
sage: 
Exiting Sage (CPU time 0m1.15s, Wall time 0m10.57s).
$ Desktop/sage-4.4.4-mcbc/sage
----------------------------------------------------------------------
----------------------------------------------------------------------
Loading Sage library. Current Mercurial branch is: hackbranch
sage: f(x) = x^2
sage: limit(f,x=1)
1
sage: limit(f(x),x=1)
1
```

This seems bad, so I've opened #13221 for that.
