# Issue 30184: Failure in Coercing Elements of Padic 2-step Extensions

Issue created by migration from https://trac.sagemath.org/ticket/30421

Original creator: @n-vi

Original creation time: 2020-08-23 15:39:21

Keywords: coercion, precision

Below are attempts to coerce elements from a field T, which is a padic 2-step extension field, into a field D, where D is similar to T, except that its precision is higher.

Trying to coerce different powers of the uniformizer w, it seemed that non-negative powers are coerced successfuly into D, and so do negative powers which are 0 modulu 4, whereas other negative powers of w fail to be coerced into D.


```
sage: F.<a> = Qp(5).extension(x^2-3)
sage: H.<y> = F[]
sage: T.<w> = F.extension((4*a*5^-1 + (2*a + 2) + (2*a + 4)*5 + (a + 2)*5^3 + (2*a + 3)*5^4 + 5^5 + 5^6 + 5^7 + 2*a*5^8 + a*5^9 + (4*a + 1)*5^10 + (3*a + 3)*5^11 + (2*a + 2)*5^12 + 3*5^14 + (4*a + 1)*5^15 + (a + 1)*5^16 + (3*a + 1)*5^17 + (3*a + 2)*5^18 + O(5^19))*y^4 + (3*5 + 2*5^2 + 2*5^3 + 3*5^5 + 2*5^6 + 4*5^7 + 2*5^8 + 2*5^9 + 2*5^10 + (4*a + 4)*5^11 + (3*a + 2)*5^12 + (2*a + 3)*5^13 + 2*5^14 + (a + 1)*5^15 + 4*5^16 + (4*a + 1)*5^18 + (3*a + 2)*5^19 + 3*5^20 + O(5^21))*y^3 + (2*a*5^3 + 3*a*5^4 + 4*a*5^5 + a*5^8 + 3*a*5^9 + 3*a*5^11 + 3*a*5^12 + a*5^14 + 3*a*5^15 + 3*a*5^16 + 3*a*5^17 + 4*a*5^18 + a*5^20 + 4*a*5^21 + 3*a*5^22 + O(5^23))*y^2 + (3*a + (4*a + 3)*5 + 2*a*5^2 + a*5^3 + (3*a + 1)*5^4 + 3*a*5^5 + 5^6 + (4*a + 1)*5^7 + (4*a + 4)*5^8 + (4*a + 1)*5^9 + 3*5^11 + (a + 3)*5^12 + (4*a + 3)*5^13 + 3*a*5^14 + 5^15 + (3*a + 3)*5^16 + (2*a + 2)*5^17 + (4*a + 4)*5^18 + 3*5^19 + O(5^20))*y + 3*a + 4*a*5 + (a + 2)*5^2 + 3*5^3 + (4*a + 1)*5^4 + (a + 1)*5^5 + (4*a + 3)*5^6 + (a + 4)*5^7 + 2*5^8 + 3*a*5^9 + 2*a*5^10 + 4*a*5^11 + (3*a + 1)*5^12 + 5^13 + (2*a + 2)*5^14 + (2*a + 2)*5^16 + a*5^17 + (3*a + 4)*5^18 + 3*a*5^19 + O(5^20))
sage: D = T.change(prec=2*T.precision_cap())
# Trying to coerce different elements from T to D:
sage: D(w^12) # works (non-negative power)
w^12 + O(w^92)
sage: D(w^-8) # works (negative power which is 0 modulu 4)
w^-8 + O(w^72)
sage: D(w^-22) # fails
<repr(<sage.rings.padics.relative_ramified_CR.RelativeRamifiedCappedRelativeElement at 0x7f6e06b695c8>) failed: ValueError: No mod p reduction in negative valuation>
sage: D(w^-19) # fails
---------------------------------------------------------------------------
...
ValueError: element has no inverse
```


See also defect #30420.


---

Comment by mkoeppe created at 2021-05-10 17:42:09

Moving to 9.4, as 9.3 has been released.
