# Issue 24191: Substitution should be the same as numerical evaluation

Issue created by migration from https://trac.sagemath.org/ticket/24428

Original creator: jdemeyer

Original creation time: 2017-12-25 09:58:04

CC:  rws slelievre

It is very surprising that these do not give the same result:

```
sage: arccosh(0.9)
NaN
```

and

```
sage: arccosh(x).subs(x=0.9)
0.451026811796262*I
```



---

Comment by rws created at 2017-12-25 13:52:36

I'm not decided on which result is correct. But see also #15344.


---

Comment by rws created at 2017-12-26 06:42:14

> so the first should probably return a complex number too

This would mean either 1. changing general evaluation of `f(arg)` to not try `arg.f()` first or, 2. changing the interface to `mpfr_acosh()` (which is responsible for the NaN), i.e. `RR.arccosh()`, and some others too.

I'm in favor of the latter.


---

Comment by rws created at 2017-12-26 06:44:49

Note that `RBF(0.9).arccosh()` returns nan as well.


---

Comment by mantepse created at 2017-12-26 07:34:33

Does an expression in `SR` (like `acosh`) come with a notion of domain and codomain?


---

Comment by rws created at 2017-12-26 08:14:29

Symbolic function expressions have internal restrictions as to their arguments but there is no information associated regarding domains. The function code in `sage/functions` and in Pynac raises stock Python exceptions and runtime errors if nonsensical arguments are encountered, but just yesterday I wished I could catch them specifically, e.g. by inheriting from domain error---it would enable much better random testing.


---

Comment by mantepse created at 2017-12-26 19:14:03

It might be important to note that this is a regression:

```
sage: arccosh(0.9)
NaN
sage: arccosh(x).subs(x=0.9)
NaN
sage: version()
'SageMath version 8.1.beta5, Release Date: 2017-09-11'
```



---

Comment by mantepse created at 2017-12-27 07:34:06

in fact, the change must have been introduced in 8.2.beta1, because in 8.2.beta0 it still gives the expected result.


---

Comment by rws created at 2017-12-27 07:43:41

That is no surprise as I changed FP evaluation in the commit https://github.com/pynac/pynac/commit/d0f66f94ab4564a9a43aaf5907f7ac2a90047890

It might not be a bug. Still, the necessity of being consistent demands some fix somewhere.


---

Comment by rws created at 2017-12-27 07:52:42

For example

```
sage: arccos(1.1)
NaN
sage: arccos(x).subs(x=1.1)
NaN
```

(EDITED)

So one of `arccos/arccosh` should be changed.


---

Comment by mantepse created at 2017-12-27 08:54:54

Changes in symbolics code are quite likely to produce doctest differences in the fricas interface, so it might make sense to make sure that these doctests are run.

In the case at hand, I guess it would be very important to specify domain and codomain of expressions which can be evaluated numerically, otherwise it will never be clear whether something is a bug or a feature.

Besides, I think that `arccosh` is terrible language :-)


---

Comment by slelievre created at 2018-02-19 21:37:29

Adding an example:

```
sage: arccosh(RDF(0.9))
0.45102681179626236*I
```



---

Comment by vdelecroix created at 2018-02-24 07:29:15

I don't care what you do with the function `arccosh` but *all* of

```
sage: RR(0.9).arccosh()
NaN
sage: RBF(0.9).arccosh()
nan
sage: RIF(0.9).arccosh()
[.. NaN ..]
```

must not change.


---

Comment by rws created at 2018-02-24 07:39:33

With pynac-0.7.17:

```
sage: acos(SR(1.1))
0.443568254385115*I
sage: acosh(SR(0.9))
0.451026811796262*I
sage: acos(x).subs(x=1.1)
0.443568254385115*I
sage: acosh(x).subs(x=0.9)
0.451026811796262*I
```


Replying to [comment:14 vdelecroix]:
> I don't care what you do with the function `arccosh` but *all* of
> {{{
> sage: RR(0.9).arccosh()
> NaN
> sage: RBF(0.9).arccosh()
> nan
> sage: RIF(0.9).arccosh()
> [.. NaN ..]
> }}}
> must not change.

That is however the reason for

```
sage: acos(1.1)
NaN
```

and all the others because here (1.1).acos() is called first.


---

Comment by rws created at 2018-02-24 07:46:06

Replying to [comment:12 slelievre]:
> Adding an example:
> {{{
> sage: arccosh(RDF(0.9))
> 0.45102681179626236*I
> }}}

Note that this only works because RDF has no arccosh member function, so the computation is delegated to Pynac.


---

Comment by vdelecroix created at 2018-02-24 07:52:28

Replying to [comment:16 rws]:
> Replying to [comment:12 slelievre]:
> > Adding an example:
> > {{{
> > sage: arccosh(RDF(0.9))
> > 0.45102681179626236*I
> > }}}
> 
> Note that this only works because RDF has no arccosh member function, so the computation is delegated to Pynac.

In this situation you could just fallback to `acosh`

```
sage: RDF(0.9).acosh()
NaN
```



---

Comment by rws created at 2018-02-24 08:03:32

Replying to [comment:17 vdelecroix]:
> > > {{{
> > > sage: arccosh(RDF(0.9))
> > > 0.45102681179626236*I
> > > }}}
> > 
> > Note that this only works because RDF has no arccosh member function, so the computation is delegated to Pynac.
> 
> In this situation you could just fallback to `acosh`
> {{{
> sage: RDF(0.9).acosh()
> NaN
> }}}

Instead of special casing I'd rather change the name of the inverse hyperbolic functions away from all the wrong `arc`s (arcus) to the `a`s and have `ar` (area) aliases which would be the correct prefix.

Moreover, if I get a review on the change to always delegate to `_eval_()` (EDITED) if NaN is returned then I'd change that too.


---

Comment by rws created at 2018-02-24 08:20:24

So why is this not a bug?!

```
sage: RR(-2).sqrt()
1.41421356237310*I
```



---

Comment by rws created at 2018-02-24 08:32:43

See https://groups.google.com/forum/#!topic/sage-devel/4GwCuJ_-TaQ


---

Comment by vdelecroix created at 2018-02-24 08:58:35

Replying to [comment:16 rws]:
> Replying to [comment:12 slelievre]:
> > Adding an example:
> > {{{
> > sage: arccosh(RDF(0.9))
> > 0.45102681179626236*I
> > }}}
> 
> Note that this only works because RDF has no arccosh member function, so the computation is delegated to Pynac.

In this situation you could just fallback to

```
sage: RDF(0.9).acosh()
NaN
```



---

Comment by vdelecroix created at 2018-02-24 08:59:25

Replying to [comment:20 rws]:
> So why is this not a bug?!
> {{{
> sage: RR(-2).sqrt()
> 1.41421356237310*I
> }}}

It is a bug.


---

Comment by rws created at 2018-02-24 09:32:31

Following your answer in Groups I think then, instead of calling `x.func()` in the symbolic function code, `x.func(extend=True)` should be called, or alternatively, have data in the `Function` when to call `x.func()` and when to call `parent.complex_field(x).func()`.


---

Comment by rws created at 2018-02-25 09:18:58

Changing status from new to needs_review.


---

Comment by rws created at 2018-02-25 09:18:58

This needs fixes from pynac-0.7.17. To fix `RR(-1).log` I'd suggest a similar change in `functions/log.py` to enable the fix of `RR.log()`.
----
New commits:


---

Comment by @kliem created at 2019-12-14 14:03:38

Merge failed.


---

Comment by @kliem created at 2019-12-14 14:03:38

Changing status from needs_review to needs_work.


---

Comment by mmezzarobba created at 2020-10-08 09:34:09

Changing priority from critical to major.
