# Issue 21905: log of algebraic number (QQbar element) gets inprecise

Issue created by migration from Trac.

Original creator: dkrenn

Original creation time: 2017-01-05 18:43:29

CC:  behackl cheuberg

At the moment we have

```
sage: log(QQbar(sqrt(2)))
0.346573590279973
sage: type(_)
<type 'sage.rings.real_mpfr.RealNumber'>
```

So the logarithm of an exact value loses the exactness.

I would expect a symbolic expression

```
sage: log(QQbar(sqrt(2)))
log(1.414213562373095?)
```

where the argument is the symbolic encapsulation of `QQbar(sqrt(2))` (for the same reason why the logarithm of the integer 2 becomes the symbolic `log(2)`.


---

Comment by rws created at 2017-01-07 07:05:12

I have a Pynac patch that does this:

```
sage: log(QQbar(sqrt(2)))
log(1.414213562373095?)
sage: log(QQbar(sqrt(2))*1.)
0.346573590279973
```

However, the question is raised if you don't want this for all functions, and if you do, if we want to hold all functions with exact arguments (except where we have a simplified representation, i.e., a closed form that is simpler than the function expression).

EDIT: or if not all functions, then which?


---

Comment by rws created at 2017-01-07 07:47:02

BTW `polylog` does it already, so this is clearly an inconsistency within Pynac:

```
sage: polylog(QQbar(sqrt(2)),3)
polylog(1.414213562373095?, 3)
```



---

Comment by rws created at 2017-01-07 07:47:02

Changing keywords from "" to "Pynac".


---

Comment by dkrenn created at 2017-01-08 09:02:43

Replying to [comment:1 rws]:
> I have a Pynac patch that does this:
> {{{
> sage: log(QQbar(sqrt(2)))
> log(1.414213562373095?)
> sage: log(QQbar(sqrt(2))*1.)
> 0.346573590279973
> }}}

Good. Thanks :)

> However, the question is raised if you don't want this for all functions, and if you do, if we want to hold all functions with exact arguments (except where we have a simplified representation, i.e., a closed form that is simpler than the function expression).
>
> EDIT: or if not all functions, then which?

IMHO yes, we want this for all symbolic functions, as no exact value should get inexact. What would be the drawbacks?


---

Comment by rws created at 2017-01-08 09:05:38

Replying to [comment:4 dkrenn]:
> IMHO yes, we want this for all symbolic functions, as no exact value should get inexact. What would be the drawbacks?

No drawbacks. I just needed confirmation.


---

Comment by cheuberg created at 2017-01-09 08:01:10

For completeness, I mention the [sage-devel thread on gamma(QQbar(...))](https://groups.google.com/d/msg/sage-devel/jqs3LNeKq5M/v24xFt1zAgAJ)


---

Comment by dkrenn created at 2017-02-04 13:21:37

Changing status from new to needs_review.


---

Comment by dkrenn created at 2017-02-04 13:21:37

New commits:


---

Comment by git created at 2017-02-04 13:26:23

Branch pushed to git repo; I updated commit sha1. This was a forced push. New commits:


---

Comment by rws created at 2017-02-05 08:40:27

Is fine modulo the dependency.


---

Comment by rws created at 2017-02-05 08:40:27

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2017-02-12 22:13:03

The dependency needs to be a ticket number...


---

Comment by vbraun created at 2017-02-12 22:13:03

Changing status from positive_review to needs_work.


---

Comment by dkrenn created at 2017-02-13 05:52:24

Changing status from needs_work to positive_review.


---

Comment by dkrenn created at 2017-02-13 05:53:13

Replying to [comment:11 vbraun]:
> The dependency needs to be a ticket number... 

Ticket number was already there; just the "pynac..." has not been removed.


---

Comment by vbraun created at 2017-02-16 22:28:50

Resolution: fixed
