# Issue 13902: slicing p-adic elements

Issue created by migration from Trac.

Original creator: roed

Original creation time: 2013-02-13 12:27:13

Assignee: roed

CC:  saraedum


```
sage: R = Zp(5,7)
sage: a = R(300)
sage: a
2*5^2 + 2*5^3 + O(5^9)
sage: a[:5]
4*5^2 + O(5^5)
```


This results from the following:


```
sage: a.slice(None, 5, 1) # correct
2*5^2 + 2*5^3 + O(5^5)
sage: a.slice(None, 5, None) # incorrect
4*5^2 + O(5^5)
```



---

Attachment


---

Comment by roed created at 2013-02-13 12:33:13

Changing status from new to needs_review.


---

Comment by saraedum created at 2013-02-13 16:46:12

This is also done in #13299. (Which I should probably set to needs_review again). Should I make #13299 depend on #14106 or should we rather get #13299 into sage?


---

Comment by saraedum created at 2013-02-13 16:46:29

Changing status from needs_review to needs_info.


---

Comment by saraedum created at 2013-02-13 16:59:26

I added the doctest from this patch to #13299 which is waiting for review.


---

Comment by saraedum created at 2013-03-16 23:19:34

This is a part of #13299 now.


---

Comment by saraedum created at 2013-03-16 23:19:34

Changing status from needs_info to needs_review.


---

Comment by saraedum created at 2013-03-17 00:11:10

Changing status from needs_review to positive_review.


---

Comment by jdemeyer created at 2013-03-18 09:17:55

Resolution: duplicate
