# Issue 14242: missing Sage equivalent for RisingFactorial

Issue created by migration from Trac.

Original creator: zimmerma

Original creation time: 2013-04-11 19:48:08

Assignee: burcin

CC:  kcrisman

This is related to #14437:

```
sage: from sympy import Function, Symbol
sage: u = Function('u')
sage: n = Symbol('n', integer=True)
sage: from sympy import rsolve
sage: f = u(n+2) - u(n+1) + u(n)/4
sage: rsolve(f,u(n))
2**(-n)*C0*RisingFactorial(C0/C1 + 1, n)/RisingFactorial(C0/C1, n)
```

The result returned by `rsolve` is a SymPy object:

```
sage: s = rsolve(f,u(n))
sage: type(s)
<class 'sympy.core.mul.Mul'>
```

Ideally, it should be automatically converted to Sage.

However, if we try to convert it manually, we get:

```
sage: s._sage_()
---------------------------------------------------------------------------
AttributeError                            Traceback (most recent call last)

/users/caramel/zimmerma/svn/sagebook/tex/<ipython console> in <module>()

/usr/local/sage-5.1-linux-64bit-ubuntu_12.04_lts-x86_64-Linux/local/lib/python2.7/site-packages/sympy/core/mul.py in _sage_(self)
   1192         s = 1
   1193         for x in self.args:
-> 1194             s *= x._sage_()
   1195         return s
   1196 

/usr/local/sage-5.1-linux-64bit-ubuntu_12.04_lts-x86_64-Linux/local/lib/python2.7/site-packages/sympy/core/power.py in _sage_(self)
    846 
    847     def _sage_(self):
--> 848         return self.args[0]._sage_()**self.args[1]._sage_()
    849 
    850 from add import Add

AttributeError: 'RisingFactorial' object has no attribute '_sage_'
```

Paul


---

Comment by kcrisman created at 2014-06-17 12:43:20

Just as a point of information, nowadays

```
sage: rsolve(f,u(n))
2**(-n)*(C0 + C1*n)
```

so apparently there was some extra simplification that should have happened.  Doesn't mean this ticket is invalid, of course.


---

Comment by rws created at 2014-12-13 08:04:38

Changing assignee from burcin to was.


---

Comment by rws created at 2014-12-13 08:04:38

Changing component from calculus to interfaces.


---

Comment by rws created at 2014-12-14 15:10:44

This is now fixed in the proposed sympy pull request https://github.com/sympy/sympy/pull/8592
but we will upload a branch with the specific sympy patch next.


---

Comment by rws created at 2017-10-03 06:17:36

Changing status from new to needs_review.


---

Comment by rws created at 2017-10-03 06:17:36

This was resolved long ago by the latest SymPy update.


---

Comment by zimmerma created at 2017-10-03 07:11:59

fixed indeed in Sage 8.0 (or before).


---

Comment by zimmerma created at 2017-10-03 07:11:59

Changing status from needs_review to positive_review.


---

Comment by kcrisman created at 2017-10-03 10:14:10

I've noticed a few recent closed tickets which were apparently resolved -- but no one mentioned doctesting these resolutions.  We should do that to avoid regressions.  (Unless they are already tested, of course.)


---

Comment by zimmerma created at 2017-10-03 11:35:48

I tried adding a doctest with those commands:

```
$ git clone git://git.sagemath.org/sage.git
$ cd sage
$ git branch u/zimmerma/14446
$ git co u/zimmerma/14446
$ patch -p1 -i /tmp/patch
$ git commit -a
$ git push --set-upstream origin u/zimmerma/14446
```

but it failed with:

```
$ git push --set-upstream origin u/zimmerma/14446
fatal: remote error: access denied or repository not exported: /sage.git
```

Am I doing something wrong?

For the record:

```
$ cat /tmp/patch
commit ef0235ff466d40c787681e3e483342e091247392
Author: Paul Zimmermann <Paul.Zimmermann`@`inria.fr>
Date:   Tue Oct 3 13:03:18 2017 +0200

    added doctest for #14446

diff --git a/src/sage/calculus/test_sympy.py b/src/sage/calculus/test_sympy.py
index 996e417..15b1d7e 100644
--- a/src/sage/calculus/test_sympy.py
+++ b/src/sage/calculus/test_sympy.py
`@``@` -196,4 +196,15 `@``@` This was fixed in Sympy, see :trac:`14437`::
     sage: rsolve(f,u(n))
     2**(-n)*(C0 + C1*n)
 
+This was fixed in Sympy, see :trac:`14446`::
+
+    sage: import sympy
+    sage: SR(sympy.RisingFactorial(x,x))
+    gamma(2*x)/gamma(x)
+    sage: SR(sympy.RisingFactorial(x,3))
+    (x + 2)*(x + 1)*x
+    sage: SR(sympy.FallingFactorial(x,x))
+    gamma(x + 1)
+    sage: SR(sympy.FallingFactorial(x,3))
+    (x - 1)*(x - 2)*x
 """
```



---

Comment by rws created at 2017-10-03 13:11:18

Actually this was a SymPy fix which should be tested in SymPy:
https://github.com/sympy/sympy/blob/master/sympy/functions/combinatorial/factorials.py#L559
https://github.com/sympy/sympy/blob/master/sympy/external/tests/test_sage.py


---

Comment by kcrisman created at 2017-10-03 13:40:48

That is very interesting.  Is it possible to have this sympy file doctested whenever _Sage_ runs doctests?  (I don't know how many people would run the package doctests, and in any case this probably isn't automatically tested as easily within sympy itself.)  That would be very helpful.


---

Comment by rws created at 2017-10-03 14:13:37

Replying to [comment:14 kcrisman]:
> That is very interesting.  Is it possible to have this sympy file doctested whenever _Sage_ runs doctests? 

Just copy it at SymPy installation time into `src/sage/tests`.

> this probably isn't automatically tested as easily within sympy itself

You're right. Their Travis doesn't have a Sage installation AFAIK.

> That would be very helpful.

So I opened #23960.


---

Comment by embray created at 2017-12-12 08:23:33

Resolution: wontfix
