# Issue 15089: Polynomials exhibit strange behavior when seen in a different parent ring

Issue created by migration from https://trac.sagemath.org/ticket/15326

Original creator: davidamadore

Original creation time: 2013-10-25 13:40:10

CC:  jakobkroeker

Keywords: polynomials

When a polynomial is constructed from a certain polynomial ring and a different ring is constructed with the same indeterminates, Sage attempts to be smart and automatically convert elements of the old ring to the new ring (or something of the sort), but this smartness can cause very wrong behavior:


```
sage: R.<x,y> = PolynomialRing(QQ,['x','y'],order="deglex")
sage: pol = x^2 + y + 42
sage: pol.degree(x)
2
sage: R.<x,y> = PolynomialRing(QQ,['x','y'],order="degrevlex")
sage: pol in R
True
sage: pol == x^2+y+42
True
sage: pol.degree(x)
1
sage: R(pol).degree(x)
2
```


I'm not sure why pol.degree(x) returns 1, but this is certainly wrong.  An error message of the kind "pol is not a polynomial in x" would have been better than a wrong result.


---

Comment by jakobkroeker created at 2017-02-26 00:55:48

seems fixed meanwhile; needs a test?
