# Issue 20945: factorization in ZZ[x] and QQ[x]

Issue created by migration from Trac.

Original creator: mkauers

Original creation time: 2016-08-07 09:56:23

In [SageMath](SageMath) Version 7.1, Release Date: 2016-03-20:


```
sage: x = ZZ['x'].gen()
sage: pol = -6*x^250 + 228*x^246 - 4214*x^242 + 50480*x^238 - 440700*x^234 + 2989688*x^230 - 16413644*x^226 + 75012912*x^222 - 291442710*x^218 + 978786900*x^214 - 2881362198*x^210 + 7527026624*x^206 - 17646750992*x^202 + 37522315680*x^198 - 73058853200*x^194 + 131334032576*x^190 - 219305486988*x^186 + 341323883784*x^182 - 495422448300*x^178 + 669384612000*x^174 - 839013937320*x^170 + 971489822160*x^166 - 1034744073480*x^162 + 1009784848800*x^158 - 899647729500*x^154 + 729380153736*x^150 - 536466861468*x^146 + 356871009984*x^142 - 214019464080*x^138 + 115293687200*x^134 - 55560294608*x^130 + 23833927104*x^126 - 9047408942*x^122 + 3017149460*x^118 - 875973150*x^114 + 218897328*x^110 - 46389564*x^106 + 8174712*x^102 - 1165580*x^98 + 129200*x^94 - 10446*x^90 + 548*x^86 - 14*x^82
sage: pol.factor()
---------------------------------------------------------------------------
NotImplementedError                       Traceback (most recent call last)
<ipython-input-32-b7245330f5b9> in <module>()
----> 1 pol.factor()
(...)
sage: QQ[x](pol).factor()
---------------------------------------------------------------------------
PariError                                 Traceback (most recent call last)
(...)
```




---

Comment by chapoton created at 2016-08-07 10:11:24

works fine in 7.3


---

Comment by chapoton created at 2016-08-07 10:11:24

Changing status from new to needs_review.


---

Comment by chapoton created at 2016-08-07 10:11:53

Changing status from needs_review to positive_review.


---

Comment by bruno created at 2016-08-30 09:33:36

My comment is probably useless but I compiled Sage v7.1 because I was surprised by this ticket, and I get no error:


```python
┌────────────────────────────────────────────────────────────────────┐
│ SageMath Version 7.1, Release Date: 2016-03-20                     │
│ Type "notebook()" for the browser-based notebook interface.        │
│ Type "help()" for help.                                            │
└────────────────────────────────────────────────────────────────────┘
sage: x = ZZ['x'].gen()
sage: pol = -6*x^250 + 228*x^246 - 4214*x^242 + 50480*x^238 - 440700*x^234 + 2989688*x^230 - 16413644*x^226 + 75012912*x^222 - 291442710*x^218 + 978786900*x^214 - 2881362198*x^210 + 7527026624*x^206 - 17646750992*x^202 + 37522315680*x^198 - 73058853200*x^194 + 131334032576*x^190 - 219305486988*x^186 + 341323883784*x^182 - 495422448300*x^178 + 669384612000*x^174 - 839013937320*x^170 + 971489822160*x^166 - 1034744073480*x^162 + 1009784848800*x^158 - 899647729500*x^154 + 729380153736*x^150 - 536466861468*x^146 + 356871009984*x^142 - 214019464080*x^138 + 115293687200*x^134 - 55560294608*x^130 + 23833927104*x^126 - 9047408942*x^122 + 3017149460*x^118 - 875973150*x^114 + 218897328*x^110 - 46389564*x^106 + 8174712*x^102 - 1165580*x^98 + 129200*x^94 - 10446*x^90 + 548*x^86 - 14*x^82
sage: pol.factor()
(-1) * 2 * (x - 1)^40 * (x + 1)^40 * x^82 * (x^2 + 1)^40 * (3*x^8 + 6*x^4 + 7)
sage: QQ['x'](pol).factor()
(-6) * (x - 1)^40 * (x + 1)^40 * x^82 * (x^2 + 1)^40 * (x^8 + 2*x^4 + 7/3)
```



---

Comment by embray created at 2016-08-30 13:32:25

Determined to be invalid/duplicate/wontfix (closing as "wontfix" as a catch-all resolution).


---

Comment by embray created at 2016-08-30 13:32:25

Resolution: wontfix
