# Issue 13769: Upgrade Maxima past the release 5.29.1

Issue created by migration from Trac.

Original creator: dimpase

Original creation time: 2013-01-19 12:29:28

Assignee: tbd

CC:  snark

This is a continuation of #13364, and aims at including more upstream bug fixes, which e.g. fix an
[issue reported on sage-support](http://permalink.gmane.org/gmane.comp.mathematics.sage.support/30644), 
which was reported as Maxima bug [2535](https://sourceforge.net/p/maxima/bugs/2535), and marked there as closed in post-5.29.1.


---

Comment by kcrisman created at 2013-01-20 01:39:55

So for instance going at least as far as the fix for #13733 would be good.


---

Comment by zimmerma created at 2013-01-23 08:08:29

while we are at it, it seems strange to me that `sage/interfaces/maxima_abstract.py` contains a doctest for the maxima version used:

```
File "/localdisk/tmp/sage-5.5/devel/sage-12615b/sage/interfaces/maxima_abstract.py", line 422:
    sage: maxima.version()
Expected:
    '5.26.0'
Got:
    '5.29.1'
```

What really matters is the **functionality** provided, not the actual version?
Does Sage check the actual version of each component?

Paul


---

Comment by dimpase created at 2013-01-23 09:45:14

Replying to [comment:3 zimmerma]:
> while we are at it, it seems strange to me that `sage/interfaces/maxima_abstract.py` contains a doctest for the maxima version used:
> {{{
> File "/localdisk/tmp/sage-5.5/devel/sage-12615b/sage/interfaces/maxima_abstract.py", line 422:
>     sage: maxima.version()
> Expected:
>     '5.26.0'
> Got:
>     '5.29.1'
> }}}

seems that http://trac.sagemath.org/sage_trac/attachment/ticket/13364/doctests.2.patch
was not installed into the Sage installation you work with.

> What really matters is the **functionality** provided, not the actual version?
> Does Sage check the actual version of each component?

Sage provides versions at least for some other components, e.g. `gap.version()`

Sometimes it might be useful; AFAIK some optional packages check this.

Dima


> 
> Paul


---

Comment by zimmerma created at 2013-01-23 10:15:17

Dima, I don't object about **providing** a function `maxima_version()`, but **checking** it returns a particular value.

Paul


---

Comment by dimpase created at 2013-01-23 12:33:14

Replying to [comment:5 zimmerma]:
> Dima, I don't object about **providing** a function `maxima_version()`, but **checking** it returns a particular value.
> 

well, one would like to test Sage functions... How else would you check that it works and returns something meaningful?

> Paul


---

Comment by zimmerma created at 2013-01-23 12:37:01

we could for example check that the version is of the form `x.y.z`, or is greater than or equal to a given number.

Paul


---

Comment by zimmerma created at 2013-05-07 08:54:01

see #14306 (issue fixed in Maxima git)

Paul


---

Comment by kcrisman created at 2013-05-08 02:42:44

Also note that Maxima is now at 5.30.0.


---

Comment by fbissey created at 2013-05-08 09:30:12

Yes it is at 5.30.0. No check from sage-on-gentoo on whether it works so far because the maxima ecl library building is currently broken for that particular version - an adsf upgrade problem in gentoo.

I second checking the form of the version returned rather than the value. That would make my life easier when R, maxima are upgraded in s-o-g independently of sage itself (and without side effects at leat in doctests).


---

Comment by jdemeyer created at 2013-06-13 08:51:24

I'll try making a new Maxima spkg just to see what happpens...


---

Comment by jdemeyer created at 2013-06-13 09:30:54

This looks problematic:

```
sage -t devel/sage/sage/calculus/calculus.py
**********************************************************************
File "devel/sage/sage/calculus/calculus.py", line 145, in sage.calculus.calculus
Failed example:
    e^M
Exception raised:
    Traceback (most recent call last):
      File "/mazur/release/merger/sage-5.10.rc2/local/lib/python2.7/site-packages/sage/doctest/forker.py", line 466, in _run
        self.execute(example, compiled, test.globs)
      File "/mazur/release/merger/sage-5.10.rc2/local/lib/python2.7/site-packages/sage/doctest/forker.py", line 825, in execute
        exec compiled in globs
      File "<doctest sage.calculus.calculus[32]>", line 1, in <module>
        e**M
      File "constants_c.pyx", line 275, in sage.symbolic.constants_c.E.__pow__ (sage/symbolic/constants_c.cpp:2779)
      File "matrix_symbolic_dense.pyx", line 387, in sage.matrix.matrix_symbolic_dense.Matrix_symbolic_dense.exp (sage/matrix/matrix_symbolic_dense.c:3433)
      File "/mazur/release/merger/sage-5.10.rc2/local/lib/python2.7/site-packages/sage/interfaces/interface.py", line 199, in __call__
        return cls(self, x, name=name)
      File "/mazur/release/merger/sage-5.10.rc2/local/lib/python2.7/site-packages/sage/interfaces/interface.py", line 626, in __init__
        raise TypeError, x
    TypeError: ECL says: Error executing code in Maxima: Unable to find the spectral representation
**********************************************************************
```



---

Comment by jdemeyer created at 2013-06-13 09:36:17

Also

```
sage -t devel/sage/sage/interfaces/maxima.py  # Time out
```

due to a timeout of

```
sage: maxima('limit(x^a,x,0)')
```

This is fixable, it is because of a slightly different output format of assumptions.


---

Comment by kcrisman created at 2013-06-13 14:13:29

That is awesome, thanks for checking this, Jeroen.


---

Comment by kcrisman created at 2013-06-18 18:30:29

> This is fixable, it is because of a slightly different output format of assumptions.
Jeroen, while it's true that the error is slightly different in format, I don't think this is the problem (or at least not the whole one).  The other things are still passing doctests, and we never even _get_ to the 

```
           if i > 0:
                v = self._expect.before
```

branch, as one can verify by inserting print statements.
> This looks problematic:
This is #2400 again, to some extent.  Not sure why this doesn't work any more.  In Maxima 5.29.1, this is fine.

```
Maxima 5.29.1 http://maxima.sourceforge.net
using Lisp ECL 12.12.1
Distributed under the GNU Public License. See the file COPYING.
Dedicated to the memory of William Schelter.
The function bug_report() provides bug reporting information.
(%i1) m: matrix([%i*%pi]);
(%o1)                             [ %i %pi ]
(%i4) matrixexp(m), keepfloat:true;
(%o4)                                 - 1
(%i5) matrixexp(m),keepfloat:false;
(%o5)                                 - 1
```


which is good.  In 5.30, though, we have


```
(%i1) m: matrix([%i*%pi]);
(%o1)                             [ %i %pi ]
(%i6) matrixexp(m),keepfloat:true;

Unable to find the spectral representation
 -- an error. To debug this try: debugmode(true);
(%i7) matrixexp(m),keepfloat:false;

Unable to find the spectral representation
 -- an error. To debug this try: debugmode(true);
```



---

Comment by kcrisman created at 2013-06-18 18:37:43

Changing keywords from "" to "sd48".


---

Comment by kcrisman created at 2013-06-18 18:38:58

Note that the spkg changes are not committed.


---

Comment by kcrisman created at 2013-06-19 13:44:13

Thanks to Barton Willis for this workaround.

```
This bug is due to circa January 2013 changes to matrix inversion. A workaround is to set ratmx to true:

Maxima branch_5_30_base_98_g29f9239_dirty http://maxima.sourceforge.net
using Lisp Clozure Common Lisp Version 1.9-r15764  (WindowsX8632)

(%i1) matrixexp(matrix([%i*%pi]));

Unable to find the spectral representation

(%i2) matrixexp(matrix([%i*%pi])), ratmx=true;
(%o2)                                 - 1
```

I've reported this [here](https://sourceforge.net/p/maxima/bugs/2596/).  I don't know if doing this ratmx thing universally is good, though:

```
 if FALSE will cause determinant and matrix addition, subtraction, and multiplication to be performed in the representation of the matrix elements and will cause the result of matrix inversion to be left in general representation. If it is TRUE, the 4 operations mentioned above will be performed in CRE form and the result of matrix inverse will be in CRE form. Note that this may cause the elements to be expanded (depending on the setting of RATFAC) which might not always be desired.
```



---

Comment by kcrisman created at 2013-09-04 22:52:17

5.31 has been released.


---

Comment by pbruin created at 2014-05-15 21:50:37

Maxima is now at version 5.33.0.  The bug described in comments 15, 19 and 22 still exists.


---

Comment by pbruin created at 2014-05-16 03:18:47

I found a patch that I think has the same effect as the workaround in comment:22.  I don't have a sourceforge account, so here it is in case there are any Maxima experts here who want to check it and (if it is any good) maybe forward it to the Maxima bug tracking system:

```diff
--- a/share/linearalgebra/matrixexp.lisp        2013-10-07 04:37:12.000000000 +0100
+++ b/share/linearalgebra/matrixexp.lisp        2014-05-16 02:16:09.112011893 +0100
`@``@` -138,8 +138,8 `@``@`
           (print `(ratvars = ,$ratvars gcd = '$gcd algebraic = ,$algebraic))
           (print `(ratfac = ,$ratfac))
           (merror "Unable to find the spectrum")))
-   
-    (setq res ($fullratsimp (ncpower (sub (mult z ($ident n)) mat) -1) z))
+
+    (setq res ($fullratsimp ($invert (sub (mult z ($ident n)) mat) '$crering) z))
     (setq m (length sp))
     (dotimes (i m)
       (setq zi (nth i sp))
```

I'll try to see if upgrading to 5.33.0 gives any further unexpected problems.


---

Comment by kcrisman created at 2014-05-16 13:47:03

> I found a patch that I think has the same effect as the workaround in comment:22.  I don't have a sourceforge account, so here it is in case there are any Maxima experts here who want to check it and (if it is any good) maybe forward it to the Maxima bug tracking system:

I have added it to the [bug report in question](https://sourceforge.net/p/maxima/bugs/2596/).
> I'll try to see if upgrading to 5.33.0 gives any further unexpected problems.
Let's hope not!


---

Comment by pbruin created at 2014-05-16 14:14:37

Thanks!  No major problems so far; there is one integration doctest that does not finish, but Maxima itself returns the answer quickly, so the timeout has to occur in the interface.


---

Comment by pbruin created at 2014-05-16 15:14:42

The problematic doctest is the following one from `sage/misc/functional.py`:

```
sage: f = exp(-x) * sinh(sqrt(x))
sage: t = integrate(f, x, 0, Infinity)
```

With an unpatched Sage 6.2 this does finish, but takes a very long time (2-3 minutes).  The same situation occurs for

```
sage: maxima('integrate(exp(-x)*sinh(sqrt(x)), x, 0, inf);')
```


This is surprising given that the following takes less than a second in Maxima (both the one that comes with Sage and a standalone copy, and both versions 5.29.1 and 5.33.0):

```
(%i1) integrate(exp(-x)*sinh(sqrt(x)), x, 0, inf); 
(%o1) 
    1/4                                              1
  %e    (2 gamma_incomplete(1, 1) - gamma_incomplete(-, 1) - sqrt(%pi) - 2)
                                                     2
- -------------------------------------------------------------------------
                                      4
                                    1/4                  1
     1/4                          %e    gamma_incomplete(-, 1)
   %e    gamma_incomplete(1, 1)                          2
 + ---------------------------- - ----------------------------
                2                              4
     1/4               1/4
   %e    sqrt(%pi)   %e
 + --------------- - -----
          4            2
```

It would seem to be an interface problem that already exists in some form in Sage 6.2 and manifests itself more relentlessly with the Maxima 5.33.0 spkg I am making.


---

Comment by dimpase created at 2014-05-16 15:38:29

Replying to [comment:32 pbruin]:
> The problematic doctest is the following one from `sage/misc/functional.py`:
> {{{
> sage: f = exp(-x) * sinh(sqrt(x))
> sage: t = integrate(f, x, 0, Infinity)
> }}}
> With an unpatched Sage 6.2 this does finish, but takes a very long time (2-3 minutes).  The same situation occurs for
> {{{
> sage: maxima('integrate(exp(-x)*sinh(sqrt(x)), x, 0, inf);')
> }}}
> 
> This is surprising given that the following takes less than a second in Maxima (both the one that comes with Sage and a standalone copy, and both versions 5.29.1 and 5.33.0):

I am not at all convinced it is the interface problem. It is more likely the Maxima packages loaded by default in Sage library (see the corr. Sage source files) and not loaded in your test run. When I only `load(abs_integrate)` i Sage's 6.2 Maxima, or don't load anything at all, I get an almost instant answer.
When I load the whole bunch from lines 142-4 of `sage/interfaces/maxima_lib.py`

```
init_code = ['display2d : false', 'domain : complex', 'keepfloat : true',
            'load(to_poly_solve)', 'load(simplify_sum)',
            'load(abs_integrate)']
```

it goes much slower.


---

Comment by pbruin created at 2014-05-16 15:44:22

Thanks!  In fact it seems to be the `domain : complex` setting that is causing the slowness.


---

Comment by pbruin created at 2014-05-16 15:55:38

How about the minimal workaround of temporarily setting `domain: real` in this doctest?


---

Comment by dimpase created at 2014-05-17 08:27:50

Replying to [comment:35 pbruin]:
> How about the minimal workaround of temporarily setting `domain: real` in this doctest?

sure, this is not the 1st time something like this is needed.


---

Comment by pbruin created at 2014-05-17 11:28:04

Changing status from new to needs_review.


---

Comment by pbruin created at 2014-05-17 14:00:00

Note about the patches: `maxima_bug_2526.patch`, which fixes http://sourceforge.net/p/maxima/bugs/2526/, is still necessary even though the bug is marked "closed" in the Maxima bug tracking system; the commit somehow didn't make it into the Maxima repository.


---

Comment by mmezzarobba created at 2014-05-23 12:46:50


```
sage -t --long src/sage/interfaces/maxima_lib.py
**********************************************************************
File "src/sage/interfaces/maxima_lib.py", line 702, in sage.interfaces.maxima_lib.MaximaLib.sr_integral
Failed example:
    integrate(cos(x + abs(x)), x)
Expected:
    -1/4*(2*x - sin(2*x))*realpart(sgn(x)) + 1/2*x + 1/4*sin(2*x)
Got:
    -1/4*(2*x - sin(2*x))*real_part(sgn(x)) + 1/2*x + 1/4*sin(2*x)
**********************************************************************
```


This is with Volker's current `develop` branch on github (`d409685`), which includes a few dozens new tickets compared to `6.3.beta1`.


---

Comment by mmezzarobba created at 2014-05-23 12:46:50

Changing status from needs_review to needs_work.


---

Comment by git created at 2014-05-23 13:05:24

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by pbruin created at 2014-05-23 13:05:51

Thanks, that must be a consequence of #16224.


---

Comment by pbruin created at 2014-05-23 13:05:51

Changing status from needs_work to needs_review.


---

Comment by kcrisman created at 2014-05-23 13:46:38

> Thanks, that must be a consequence of #16224.
So... did we have an incorrect translation of Maxima's `realpart` all along?  Interesting.


---

Comment by mmezzarobba created at 2014-05-23 15:11:14

Is there a reason for no longer using `z...` in the following test?


```
`@``@` -9231,7 +9231,7 `@``@` cdef class Expression(CommutativeRingElement):
             sage: from sage.calculus.calculus import maxima
             sage: sol = maxima(cos(x)==0).to_poly_solve(x)
             sage: sol.sage()
-            [[x == -1/2*pi + 2*pi*z...], [x == 1/2*pi + 2*pi*z...]]
+            [This is the Trac macro *x == 1/2*pi + pi*z82* that was inherited from the migration](https://trac.sagemath.org/wiki/WikiMacros#x == 1/2*pi + pi*z82-macro)
 
         If a returned unsolved expression has a denominator, but the
         original one did not, this may also be true::
```


The same comment may apply to `z[0-9]+` in 

```
src/sage/interfaces/maxima_lib.py:            [This is the Trac macro *x == pi*z54* that was inherited from the migration](https://trac.sagemath.org/wiki/WikiMacros#x == pi*z54-macro)
src/sage/symbolic/relation.py:        [This is the Trac macro *x == 1/4*pi + pi*z80, y == -1/4*pi - pi*z80* that was inherited from the migration](https://trac.sagemath.org/wiki/WikiMacros#x == 1/4*pi + pi*z80, y == -1/4*pi - pi*z80-macro)
```


The bugs listed in the description indeed appear to be fixed with the update, *except* #13733, for which I get:

```
sage: integral(log(cot(x)-1),x,0,pi/4)
...
RuntimeError: ECL says: Error executing code in Maxima: PSLOG: internal error.
```


Otherwise looks good to me.


---

Comment by pbruin created at 2014-05-23 17:26:47

Replying to [comment:45 mmezzarobba]:
> Is there a reason for no longer using `z...` in the following test?
Mostly readability (since the tests are also part of the documentation); with the `...` it is not clear that it is just a "serial number" and not part of a larger expression that has been left out.  Of course it is somewhat random, so it may change once in a while with Maxima upgrades or changes in other doctests in the same file.  I personally think displaying a complete answer is worth the trouble of having to change it every now and then, but if you insist I can change all such examples to `...`.
> The bugs listed in the description indeed appear to be fixed with the update, *except* #13733, for which I get:
> {{{
> sage: integral(log(cot(x)-1),x,0,pi/4)
> ...
> RuntimeError: ECL says: Error executing code in Maxima: PSLOG: internal error.
> }}}
You're right; I tested this inside Maxima (`sage --maxima`), but Sage loads additional packages.  In this case the failure is caused by loading `abs_integrate`.  Using 5.33.0:

```
$ sage --maxima
...
(%i1) display2d: false$

(%i2) integrate(log(cot(x)-1),x,0,%pi/4);

(%o2) (%i*li[2]((%i+1)/2)-%i*li[2](-(%i-1)/2))/2
 -(%i*(2*li[2](%i+1)-2*li[2](1-%i))+%pi*log(2))/4
(%i3) load(abs_integrate)$

(%i4) integrate(log(cot(x)-1),x,0,%pi/4);

log: encountered log(0).
log: encountered log(0).
log: encountered log(0).
log: encountered log(0).
log: encountered log(0).
log: encountered log(0).
log: encountered log(0).
log: encountered log(0).
log: encountered log(0).
PSLOG: internal error.
 -- an error. To debug this try: debugmode(true);
```



---

Comment by mmezzarobba created at 2014-05-23 17:46:45

Replying to [comment:46 pbruin]:
> Replying to [comment:45 mmezzarobba]:
> > Is there a reason for no longer using `z...` in the following test?
> Mostly readability (since the tests are also part of the documentation); with the `...` it is not clear that it is just a "serial number" and not part of a larger expression that has been left out.  Of course it is somewhat random, so it may change once in a while with Maxima upgrades or changes in other doctests in the same file.  I personally think displaying a complete answer is worth the trouble of having to change it every now and then, but if you insist I can change all such examples to `...`.

No, that's fine with me, I just wanted to make sure that it was intentional.


---

Comment by mmezzarobba created at 2014-05-23 17:46:45

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2014-05-25 17:31:52

Resolution: fixed


---

Comment by kcrisman created at 2014-06-04 13:40:11

> Note about the patches: `maxima_bug_2526.patch`, which fixes http://sourceforge.net/p/maxima/bugs/2526/, is still necessary even though the bug is marked "closed" in the Maxima bug tracking system; the commit somehow didn't make it into the Maxima repository.

Okay, this is [finally in Maxima](http://sourceforge.net/p/maxima/bugs/2526/?limit=10&page=1#4cee), so the next Maxima upgrade will get to remove this patch.


---

Comment by kcrisman created at 2014-06-04 13:55:50

#14306 needs review.
