# Issue 23616: libgap can not use gap packages

archive/issues_023616.json:
```json
{
    "body": "Keywords: thursdaysbdx\n\nWith gap pexpect interface\n\n```\nsage: gap.LoadPackage('\"cryst\"')\ntrue\nsage: gap.SpaceGroupIT(2,14)\nSpaceGroupOnRightIT(2,14,'1')\n```\n\nWith libgap\n\n```\nsage: libgap.LoadPackage(\"cryst\")\ntrue\nsage: libgap.SpaceGroupIT(2,14)\nTraceback (most recent call last):\n...\nAttributeError: No such attribute: SpaceGroupIT.\n```\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/23853\n\n",
    "created_at": "2017-09-14T09:09:22Z",
    "labels": [
        "interfaces",
        "major",
        "bug"
    ],
    "title": "libgap can not use gap packages",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/23616",
    "user": "vdelecroix"
}
```
Keywords: thursdaysbdx

With gap pexpect interface

```
sage: gap.LoadPackage('"cryst"')
true
sage: gap.SpaceGroupIT(2,14)
SpaceGroupOnRightIT(2,14,'1')
```

With libgap

```
sage: libgap.LoadPackage("cryst")
true
sage: libgap.SpaceGroupIT(2,14)
Traceback (most recent call last):
...
AttributeError: No such attribute: SpaceGroupIT.
```


Issue created by migration from https://trac.sagemath.org/ticket/23853





---

archive/issue_comments_330868.json:
```json
{
    "body": "This is fixed since some time ago.  You could use any package to demonstrate, but I installed the cryst package to demonstrate the same example:\n\n\n```\nsage: libgap.load_package('cryst')                                                                                                                                                               \ntrue\nsage: libgap.SpaceGroupIT(2,14)                                                                                                                                                                  \nSpaceGroupOnRightIT(2,14,'1')\n```\n\n\nThis was likely fixed by #27911.",
    "created_at": "2021-02-16T13:35:39Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23616",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23616#issuecomment-330868",
    "user": "embray"
}
```

This is fixed since some time ago.  You could use any package to demonstrate, but I installed the cryst package to demonstrate the same example:


```
sage: libgap.load_package('cryst')                                                                                                                                                               
true
sage: libgap.SpaceGroupIT(2,14)                                                                                                                                                                  
SpaceGroupOnRightIT(2,14,'1')
```


This was likely fixed by #27911.



---

archive/issue_comments_330869.json:
```json
{
    "body": "Resolution: worksforme",
    "created_at": "2021-02-16T13:35:39Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23616",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23616#issuecomment-330869",
    "user": "embray"
}
```

Resolution: worksforme
