# Issue 20494: shortcut coercion for Integer-Rational operations

Issue created by migration from https://trac.sagemath.org/ticket/20731

Original creator: vdelecroix

Original creation time: 2016-05-31 13:38:42

CC:  jdemeyer

Keywords: sd74

Doing some shortcut to coercion actually fasten the code

Old version

```
sage: z = 2
sage: q = QQ((-1,5))
sage: %timeit z + q
sage: %timeit q + z
sage: %timeit z - q
sage: %timeit q - z
sage: %timeit z * q
sage: %timeit q * z
sage: %timeit z / q
sage: %timeit q / z
```

New version

```
sage: z = 2
sage: q = QQ((-1,5))
sage: %timeit z + q
1000000 loops, best of 3: 265 ns per loop
sage: %timeit q + z
1000000 loops, best of 3: 323 ns per loop
sage: %timeit z - q
1000000 loops, best of 3: 261 ns per loop
sage: %timeit q - z
1000000 loops, best of 3: 319 ns per loop
sage: %timeit z * q
1000000 loops, best of 3: 341 ns per loop
sage: %timeit q * z
1000000 loops, best of 3: 446 ns per loop
sage: %timeit z / q
1000000 loops, best of 3: 341 ns per loop
sage: %timeit q / z
1000000 loops, best of 3: 396 ns per loop
```



---

Comment by vdelecroix created at 2016-05-31 13:44:41

Changing status from new to needs_review.


---

Comment by git created at 2016-05-31 13:44:45

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by git created at 2016-05-31 19:20:28

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by jdemeyer created at 2016-06-01 08:21:40

Move `src/sage/rings/binop.pyx` to `src/sage/libs/gmp` since it has nothing to with rings. And I would just use a `.pxd` file with inline functions, no `.pyx` file.


---

Comment by git created at 2016-06-01 08:26:01

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by git created at 2016-06-01 08:30:51

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by jdemeyer created at 2016-06-01 15:52:51

I think that `mpq_mul_z` and `mpq_div_z` are overkill. Why don't you just multiply the numerator or denominator with the integer and call `mpq_canonicalize`, similar to what you do for `Integer/Integer` division?


---

Comment by jdemeyer created at 2016-06-01 15:52:51

Changing status from needs_review to needs_work.


---

Comment by vdelecroix created at 2016-06-01 16:24:46

`QQ((2^100, 3^100)) * 3^100`


---

Comment by jdemeyer created at 2016-06-01 16:28:54

Right, but that's a rather artificial example. What about simple cases?


---

Comment by jdemeyer created at 2016-06-01 16:30:04

In `src/sage/repl/interpreter.py`, there is a good reason that the line numbers were changed to `...`


---

Comment by jdemeyer created at 2016-06-01 19:55:20

I just thought about the following very simple algorithm for the multiplication (division is analogous):

To compute `(A/B) * C`, you initialize the result as `C/B`, canonicalize it and then multiply the numerator by `A`.

You don't need to canonicalize the final result, since `gcd(A,B) = 1` by assumption.


---

Comment by git created at 2016-06-02 02:44:24

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by vdelecroix created at 2016-06-02 07:19:23

Changing status from needs_work to needs_review.


---

Comment by jdemeyer created at 2016-06-02 08:13:58

[comment:10]


---

Comment by jdemeyer created at 2016-06-02 08:13:58

Changing status from needs_review to needs_work.


---

Comment by vdelecroix created at 2016-06-02 08:19:59

Which line numbers?


---

Comment by vdelecroix created at 2016-06-02 08:20:26

I see...


---

Comment by git created at 2016-06-02 08:25:45

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by vdelecroix created at 2016-06-02 08:26:19

Changing status from needs_work to needs_review.


---

Comment by jdemeyer created at 2016-06-02 08:36:49

Changing status from needs_review to needs_work.


---

Comment by jdemeyer created at 2016-06-02 08:36:49

`12883`


---

Comment by git created at 2016-06-02 08:40:56

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by vdelecroix created at 2016-06-02 08:41:03

Changing status from needs_work to needs_review.


---

Comment by jdemeyer created at 2016-06-02 09:34:30

Given that the block

```
        mpz_set(mpq_numref(X), A)
        mpz_set(mpq_denref(X), B)
        mpq_canonicalize(X)
```

occurs many times, you should probably make it a separate inline function too, let's call it `mpq_div_zz`.


---

Comment by jdemeyer created at 2016-06-02 09:42:15

I'm still not convinced by the `if type(x) is type(y)`. That would break if somebody wants to subclass `Integer` for some reason. You can check the types first as an optimization, but you should still support the case where `isinstance(x, Integer) and isinstance(y, Integer)`.


---

Comment by git created at 2016-06-02 12:34:07

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by vdelecroix created at 2016-06-02 13:11:39

Replying to [comment:23 jdemeyer]:
> I'm still not convinced by the `if type(x) is type(y)`. That would break if somebody wants to subclass `Integer` for some reason. You can check the types first as an optimization, but you should still support the case where `isinstance(x, Integer) and isinstance(y, Integer)`.

It perfectly works ;-)

```
sage: class A(Integer): pass
sage: A() + 1
1
sage: 1 + A()
1
```



---

Comment by jdemeyer created at 2016-06-03 08:25:13

Right, subclassing `Integer` works because `__add__` calls the coercion model and the coercion model calls `_add_` (single underscore).


---

Comment by jdemeyer created at 2016-06-03 08:33:20

Some ---hopefully final--- notes:

1. Check documentation (for example, `Rational.__sub__` documents plus)

2. In `mpq_div_z`, you do not need to check the sign since the denominator is the product of two denominators, so it must be positive.

3. I would remove functions `mpq_sub_z` and `mpq_div_z` since they do not commute and are less useful: just implement them directly. Then you can also avoid `mpq_neg` and `mpq_inv` if you do it correctly.


---

Comment by jdemeyer created at 2016-06-03 08:33:20

Changing status from needs_review to needs_work.


---

Comment by git created at 2016-06-04 11:20:26

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by vdelecroix created at 2016-06-04 11:26:00

Changing status from needs_work to needs_review.


---

Comment by vdelecroix created at 2016-06-04 11:27:42

Curiously `Integer + Rational` is faster than `Rational + Integer`

```
sage: z = 2
sage: q = QQ((-1,5))
sage: %timeit z + q
1000000 loops, best of 3: 251 ns per loop
sage: %timeit q + z
1000000 loops, best of 3: 323 ns per loop
```



---

Comment by tscrim created at 2016-06-25 04:17:48

Changing status from needs_review to needs_work.


---

Comment by tscrim created at 2016-06-25 04:17:48

Changing keywords from "sd74" to "days74".


---

Comment by tscrim created at 2016-06-25 04:17:48

I'm not quite sure without looking through it. It might be something at a lower level than Sage.

However, this needs rebasing.


---

Comment by git created at 2016-06-26 20:53:01

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by vdelecroix created at 2016-06-26 20:56:32

Changing status from needs_work to needs_review.


---

Comment by vdelecroix created at 2016-06-26 20:56:32

Replying to [comment:32 tscrim]:
> I'm not quite sure without looking through it. It might be something at a lower level than Sage.

I really do not understand this comment.

> However, this needs rebasing.

This I understood. Done!


---

Comment by tscrim created at 2016-06-26 21:29:30

Replying to [comment:34 vdelecroix]:
> Replying to [comment:32 tscrim]:
> > I'm not quite sure without looking through it. It might be something at a lower level than Sage.
> 
> I really do not understand this comment.

This was in reference to comment:31, where I was thinking the issue with the time difference might be something in mpz instead of something we are doing in Sage. It might be better to take the faster version and utilize that addition/multiplication is commutative to get that extra little bit of speed.


---

Comment by vdelecroix created at 2016-06-27 05:45:47

Replying to [comment:35 tscrim]:
> Replying to [comment:34 vdelecroix]:
> > Replying to [comment:32 tscrim]:
> > > I'm not quite sure without looking through it. It might be something at a lower level than Sage.
> > 
> > I really do not understand this comment.
> 
> This was in reference to comment:31, where I was thinking the issue with the time difference might be something in mpz instead of something we are doing in Sage. It might be better to take the faster version and utilize that addition/multiplication is commutative to get that extra little bit of speed.

There is no fundamental difference between `z+q` and `q+z`. The code is copy paste calling the very same functions. [comment:31 comment:31] is just something that I do not understand.


---

Comment by tscrim created at 2016-06-27 13:58:04

Ah, I see it now. I guess the only difference is checking `isinstance` for `Integer` is longer than that of `Rational` because of a longer MRO:

```
sage: p = 2
sage: p.__class__.__mro__
(<type 'sage.rings.integer.Integer'>,
 <type 'sage.structure.element.EuclideanDomainElement'>,
 <type 'sage.structure.element.PrincipalIdealDomainElement'>,
 <type 'sage.structure.element.DedekindDomainElement'>,
 <type 'sage.structure.element.IntegralDomainElement'>,
 <type 'sage.structure.element.CommutativeRingElement'>,
 <type 'sage.structure.element.RingElement'>,
 <type 'sage.structure.element.ModuleElement'>,
 <type 'sage.structure.element.Element'>,
 <type 'sage.structure.sage_object.SageObject'>,
 <type 'object'>)
sage: q = 2/3
sage: q.__class__.__mro__
(<type 'sage.rings.rational.Rational'>,
 <type 'sage.structure.element.FieldElement'>,
 <type 'sage.structure.element.CommutativeRingElement'>,
 <type 'sage.structure.element.RingElement'>,
 <type 'sage.structure.element.ModuleElement'>,
 <type 'sage.structure.element.Element'>,
 <type 'sage.structure.sage_object.SageObject'>,
 <type 'object'>)
```


I'm happy with this ticket as-is. Jeroen, any more comments?


---

Comment by vdelecroix created at 2016-07-08 20:37:05

One way to shortcut the `isinstance(right, Rational)` is to instead do `type(right) is Rational`. That would actually be the fastest. (And it will still work with an element that inherits from `Rational` since `_add_`, `_mul_` etc are properly implemented.) What do you think?


---

Comment by tscrim created at 2016-07-09 19:19:34

I was originally thinking that we should keep it as `isinstance`, but since we explicitly construct a new `Rational` (and I don't think it could be made to work with subtypes [easily]), I think we should only test against `Rational`. Plus those extra little nanoseconds can matter at this level. Subclasses can just fall into the coercion framework.


---

Comment by vdelecroix created at 2016-07-09 20:35:46

hum... with `isinstance(X,Y)`

```
sage: %timeit z+q                                                              
1000000 loops, best of 3: 242 ns per loop
sage: %timeit q+z                                                              
1000000 loops, best of 3: 306 ns per loop
```

with `type(X) is Y`

```
sage: %timeit z+q
1000000 loops, best of 3: 243 ns per loop                                      
sage: %timeit q+z
1000000 loops, best of 3: 334 ns per loop
```



---

Comment by vdelecroix created at 2016-07-09 20:50:47

Independent time testing with a Cython class (without inheritance)

|  code | relative time |
|:-------:|:---------------:|
| `type(a) == A`      | 10500000ns|
| `isinstance(a,A)`   |   559000ns|
| `type(a) is A`      |       55ns|
I guess something else is happening with `z+q` versus `q+z`...


---

Comment by git created at 2016-07-09 20:51:59

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by tscrim created at 2016-07-10 18:01:19

Changing status from needs_review to positive_review.


---

Comment by tscrim created at 2016-07-10 18:01:19

That really suggests that it has to do with the MRO length (comment:37), but I am somewhat surprised that does matter. Well, this is a definite improvement and should get into 7.3.


---

Comment by vbraun created at 2016-07-10 21:44:47

Changing status from positive_review to needs_work.


---

Comment by vbraun created at 2016-07-10 21:44:47


```
sage -t --long src/sage/repl/interpreter.py
**********************************************************************
File "src/sage/repl/interpreter.py", line 77, in sage.repl.interpreter
Failed example:
    shell.run_cell('1/0')
Expected:
    ---------------------------------------------------------------------------
    ZeroDivisionError                         Traceback (most recent call last)
    <ipython-input-...> in <module>()
    ----> 1 Integer(1)/Integer(0)
    <BLANKLINE>
    .../src/sage/rings/integer.pyx in sage.rings.integer.Integer.__div__ (build/cythonized/sage/rings/integer.c:...)()
       ...          if type(left) is type(right):
       ...              if mpz_sgn((<Integer>right).value) == 0:
    -> ...                  raise ZeroDivisionError("rational division by zero")
       ...              x = <Rational> Rational.__new__(Rational)
       ...              mpq_div_zz(x.value, (<Integer>left).value, (<Integer>right).value)
    <BLANKLINE>
    ZeroDivisionError: rational division by zero
Got:
    ---------------------------------------------------------------------------
    ZeroDivisionError                         Traceback (most recent call last)
    <ipython-input-1-6f88eab09598> in <module>()
    ----> 1 Integer(1)/Integer(0)
    <BLANKLINE>
    /home/buildslave-sage/slave/sage_git/build/src/sage/rings/integer.pyx in sage.rings.integer.Integer.__div__ (/home/buildslave-sage/slave/sage_git/build/src/build/cythonized/sage/rings/integer.c:12882)()
       1841         if type(left) is type(right):
       1842             if mpz_sgn((<Integer>right).value) == 0:
    -> 1843                 raise ZeroDivisionError("rational division by zero")
       1844             x = <Rational> Rational.__new__(Rational)
       1845             mpq_div_zz(x.value, (<Integer>left).value, (<Integer>right).value)
    <BLANKLINE>
    ZeroDivisionError: rational division by zero
**********************************************************************
1 item had failures:
   1 of   5 in sage.repl.interpreter
    [133 tests, 1 failure, 3.60 s]
```



---

Comment by vdelecroix created at 2016-07-11 16:15:31

Dear Volker,

I am not able to reproduce this... could you tell us on which kind of configuration you obtained that?

Vincent


---

Comment by tscrim created at 2016-07-15 20:00:53

I think the test is just fragile:

```
    .../src/sage/rings/integer.pyx in sage.rings.integer.Integer.__div__ (build/cythonized/sage/rings/integer.c:...)()
```

vs the actual output:

```
    /home/buildslave-sage/slave/sage_git/build/src/sage/rings/integer.pyx in sage.rings.integer.Integer.__div__ (/home/buildslave-sage/slave/sage_git/build/src/build/cythonized/sage/rings/integer.c:12882)()
```

Note the path is `.../build/src/...` and compare with the previous doctest output format.


---

Comment by git created at 2016-07-22 22:41:34

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by vdelecroix created at 2016-07-22 22:42:10

Changing status from needs_work to needs_review.


---

Comment by tscrim created at 2016-07-22 22:47:47

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2016-07-23 18:38:25

Resolution: fixed
