# Issue 12070: Divisibility of number field order elements needs work

Issue created by migration from Trac.

Original creator: davidloeffler

Original creation time: 2011-12-31 15:03:56

Assignee: davidloeffler

This is a followup to #11673. Elements of orders in number fields inherit from FieldElement, despite not being elements of a field, and hence some arithmetic operations give nonsense:

```
sage: K.<a> = NumberField(x^2 - x - 1); OK = K.ring_of_integers()
sage: OK(12).divides(OK(13))
True
sage: OK(12) // OK(13)
12/13
```

The first should clearly be `False`, and I'm not sure what the second should be (perhaps a TypeError) but it certainly shouldn't be 12/13.


---

Comment by mstreng created at 2012-08-13 08:37:54


```
sage: OK(12) % OK(13)
TypeError: unsupported operand type(s) for %: 'sage.rings.number_field.number_field_element_quadratic.OrderElement_quadratic' and 'sage.rings.number_field.number_field_element_quadratic.OrderElement_quadratic'
```

So "TypeError" would be consistent. It would also be a quick and easy fix of this bug

Where is "`//`" implemented? Note

```
sage: OK(12).quo_rem(OK(13))
(12/13, 0)
```

which may be the same bug.
