# Issue 33570: is_subring fails on finite field extensions with explicit gens

archive/issues_033570.json:
```json
{
    "body": "CC:  zimmerma\n\nHi!\n\nThe following works:\n\n\n```\nsage: Fq = GF(3^2)\nsage: L = Fq.extension(6)\nsage: M = L.extension(2)\nsage: assert Fq.is_subring(M)\nTrue\n```\n\n\nThe following does not:\n\n\n```\nsage: Fq.<z2> = GF(3^2)\nsage: L = Fq.extension(6)\nsage: M = L.extension(2)\nsage: Fq.is_subring(M)\nFalse\n```\n\n\nThis is dispite\n\n```\nsage: Fq.is_subring(L)\nTrue\nsage: L.is_subring(M)\nTrue\n```\n\n\nI am using version `SageMath version 9.6.rc2, Release Date: 2022-04-25`.\n\nIssue created by migration from https://trac.sagemath.org/ticket/33807\n\n",
    "created_at": "2022-05-05T12:12:57Z",
    "labels": [
        "finite rings",
        "major",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-9.8",
    "title": "is_subring fails on finite field extensions with explicit gens",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/33570",
    "user": "antoine-leudiere"
}
```
CC:  zimmerma

Hi!

The following works:


```
sage: Fq = GF(3^2)
sage: L = Fq.extension(6)
sage: M = L.extension(2)
sage: assert Fq.is_subring(M)
True
```


The following does not:


```
sage: Fq.<z2> = GF(3^2)
sage: L = Fq.extension(6)
sage: M = L.extension(2)
sage: Fq.is_subring(M)
False
```


This is dispite

```
sage: Fq.is_subring(L)
True
sage: L.is_subring(M)
True
```


I am using version `SageMath version 9.6.rc2, Release Date: 2022-04-25`.

Issue created by migration from https://trac.sagemath.org/ticket/33807


