# Issue 26138: TypeError: unable to make sense of Maxima expression 'k[3]' in Sage

Issue created by migration from Trac.

Original creator: pelegm

Original creation time: 2018-10-01 13:27:55

CC:  kcrisman

Keywords: sum,maxima,symbolics

I was trying to calculate a simple sum:

```py
sage: c(n,l) = binomial(n, l) * factorial(l-1) / 2
sage: cyc(n) = sum(c(n,l), l, 3, n)
Traceback (most recent call last):
  File "<ipython-input-3-1c00c526bb49>", line 1, in <module>
    __tmp__=var("n"); cyc = symbolic_expression(sum(c(n,l), l, Integer(3), n)).function(n)
  File "/sage/local/lib/python2.7/site-packages/sage/misc/functional.py", line 575, in symbolic_sum
    return expression.sum(*args, **kwds)
  File "sage/symbolic/expression.pyx", line 12269, in sage.symbolic.expression.Expression.sum (build/cythonized/sage/symbolic/expression.cpp:68969)
    return symbolic_sum(self, *args, **kwds)
  File "/sage/local/lib/python2.7/site-packages/sage/calculus/calculus.py", line 611, in symbolic_sum
    return maxima.sr_sum(expression,v,a,b)
  File "/sage/local/lib/python2.7/site-packages/sage/interfaces/maxima_lib.py", line 891, in sr_sum
    return max_to_sr(maxima_eval([[max_ratsimp],[[max_simplify_sum],([max_sum],[sr_to_max(SR(a)) for a in args])]]));
  File "/sage/local/lib/python2.7/site-packages/sage/interfaces/maxima_lib.py", line 1699, in max_to_sr
    args=[max_to_sr(a) for a in max_args]
  File "/sage/local/lib/python2.7/site-packages/sage/interfaces/maxima_lib.py", line 1699, in max_to_sr
    args=[max_to_sr(a) for a in max_args]
  File "/sage/local/lib/python2.7/site-packages/sage/interfaces/maxima_lib.py", line 1699, in max_to_sr
    args=[max_to_sr(a) for a in max_args]
  File "/sage/local/lib/python2.7/site-packages/sage/interfaces/maxima_lib.py", line 1690, in max_to_sr
    sage_expr=SR(maxima(expr))
  File "sage/structure/parent.pyx", line 920, in sage.structure.parent.Parent.__call__ (build/cythonized/sage/structure/parent.c:9734)
    return mor._call_(x)
  File "sage/structure/coerce_maps.pyx", line 145, in sage.structure.coerce_maps.DefaultConvertMap_unique._call_ (build/cythonized/sage/structure/coerce_maps.c:4555)
    raise
  File "sage/structure/coerce_maps.pyx", line 140, in sage.structure.coerce_maps.DefaultConvertMap_unique._call_ (build/cythonized/sage/structure/coerce_maps.c:4417)
    return C._element_constructor(x)
  File "sage/symbolic/ring.pyx", line 340, in sage.symbolic.ring.SymbolicRing._element_constructor_ (build/cythonized/sage/symbolic/ring.cpp:6126)
    return x._symbolic_(self)
  File "/sage/local/lib/python2.7/site-packages/sage/interfaces/maxima_abstract.py", line 1263, in _symbolic_
    return R(self._sage_())
  File "/sage/local/lib/python2.7/site-packages/sage/interfaces/maxima_abstract.py", line 1238, in _sage_
    maxima=self.parent())
  File "/sage/local/lib/python2.7/site-packages/sage/calculus/calculus.py", line 2158, in symbolic_expression_from_maxima_string
    raise TypeError("unable to make sense of Maxima expression '%s' in Sage"%s)
TypeError: unable to make sense of Maxima expression 'k[3]' in Sage
```


I don't know what else to write here, as I have no clue regarding the origins of the problem.

Just as a remark, for my use case I probably could just use lambda functions:

```py
sage: c = lambda n, l: binomial(n, l) * factorial(l-1) / 2
sage: cyc = lambda n: sum(c(n, l) for l in range(3, n+1))
```



---

Comment by tscrim created at 2018-10-01 15:27:48

The factorial seems to be part of the problem. Compare:

```
sage: cyc(n) = sum(factorial(l)*binomial(n,l), l, 3, n)
sage: cyc(n) = sum(factorial(l-1)*binomial(n,l), l, 3, n)
```

and we have

```
sage: c(n,0)
---------------------------------------------------------------------------
ValueError                                Traceback (most recent call last)
<ipython-input-21-1d73d88265c7> in <module>()
----> 1 c(n,Integer(0))

/home/travis/sage-build/local/lib/python2.7/site-packages/sage/symbolic/expression.pyx in sage.symbolic.expression.Expression.__call__ (build/cythonized/sage/symbolic/expression.cpp:34053)()
   5465             z^2 + x^y
   5466         """
-> 5467         return self._parent._call_element_(self, *args, **kwds)
   5468 
   5469     def variables(self):

/home/travis/sage-build/local/lib/python2.7/site-packages/sage/symbolic/callable.pyc in _call_element_(self, _the_element, *args, **kwds)
    461         d = dict(zip([repr(_) for _ in self.arguments()], args))
    462         d.update(kwds)
--> 463         return SR(_the_element.substitute(**d))
    464 
    465     # __reduce__ gets replaced by the CallableSymbolicExpressionRingFactory

/home/travis/sage-build/local/lib/python2.7/site-packages/sage/symbolic/expression.pyx in sage.symbolic.expression.Expression.substitute (build/cythonized/sage/symbolic/expression.cpp:32983)()
   5317         sig_on()
   5318         try:
-> 5319             res = self._gobj.subs_map(smap, 0)
   5320         finally:
   5321             sig_off()

/home/travis/sage-build/local/lib/python2.7/site-packages/sage/functions/other.pyc in _eval_(self, x)
   1451         if isinstance(x, Integer):
   1452             try:
-> 1453                 return x.factorial()
   1454             except OverflowError:
   1455                 return

/home/travis/sage-build/local/lib/python2.7/site-packages/sage/rings/integer.pyx in sage.rings.integer.Integer.factorial (build/cythonized/sage/rings/integer.c:28743)()
   4346         """
   4347         if mpz_sgn(self.value) < 0:
-> 4348             raise ValueError("factorial only defined for non-negative integers")
   4349 
   4350         if not mpz_fits_ulong_p(self.value):

ValueError: factorial only defined for non-negative integers
```

However, this error may not be handled properly and lead to the invalid state above. It may also be an issue with Maxima or the translation to/from Maxima.


---

Comment by nbruin created at 2018-10-01 20:24:37

I think the main problem comes from something in maxima. In essence, we execute the following:

```
from sage.interfaces.maxima_lib import *
c(n,l) = binomial(n, l) * factorial(l-1) / 2
args=[c(n,l), l, 3, n]
S=maxima_eval([[max_ratsimp],[[max_simplify_sum],([max_sum],[sr_to_max(SR(a)) for a in args])]])
```

The expression we get is this:

```
sage: maxima_calculus(S)
(%k[3]*_SAGE_VAR_n^2-%k[3]*_SAGE_VAR_n)/2
```

The "%k[3]" cannot be read back into sage. I'm not quite sure what it stands for.


---

Comment by nbruin created at 2018-10-02 17:48:23

Yup, this is reproducible in maxima itself:

```
Maxima 5.41.0 http://maxima.sourceforge.net
using Lisp SBCL 1.4.2-1.fc27
Distributed under the GNU Public License. See the file COPYING.
Dedicated to the memory of William Schelter.
The function bug_report() provides bug reporting information.
(%i1) load(simplify_sum);
(%o1)      /usr/share/maxima/5.41.0/share/solve_rec/simplify_sum.mac
(%i2) display2d:false;

(%o2) false
(%i3) simplify_sum(sum(factorial(l-1)*binomial(n,l), l, 3, n));

(%o3) %k[3]*n^2-%k[3]*n
```

It looks like these are constants produces by a linear recurrence solver:

http://maxima.sourceforge.net/docs/manual/de/maxima_70.html

the fact that they escape into results returned by simplify_sum seems like an error (and a wrong answer).

Maxima bug:

https://sourceforge.net/p/maxima/bugs/3469/


---

Comment by chapoton created at 2021-08-28 08:31:34

using verbose_level : 3 in maxima, one gets

```
(%i7) simplify_sum(sum(factorial(l-1)*binomial(n,l), l, 3, n));

Trying with simpsum=true ... 
sum with simpsum=true returns: 'sum((l-1)!*binomial(n,l),l,3,n) 
sum_by_parts returns 'sum((l-1)!*binomial(n,l),l,3,n) 
Trying with integral representation. 
Trying with Gosper ... 
Trying with extended Gosper ... 
Trying with Zeilberger ... 
Summand: g511!*binomial(n,g511+1) 
Changed to: n!/((g511+1)*(n-g511-1)!) 
Found support: [minf,n-1] 
Zeilberger returns: [This is the Trac macro *-* that was inherited from the migration](https://trac.sagemath.org/wiki/WikiMacros#--macro)]
                    
Degree of recurrence: 2 
Zeilberger recurrence: sm[n+2]-(n+2)*sm[n+1]+(n+1)*sm[n] = n*(n+1) 
Initial conditions: [sm[0] = 0,sm[1] = 0] 
Solving recurrence returns: sm[n] = %k[3]*n^2-%k[3]*n 
Zeilberger method returns: %k[3]*n^2-%k[3]*n 
(%o7) %k[3]*n^2-%k[3]*n
```



---

Comment by chapoton created at 2021-08-28 08:48:11

So the minimal problem is

```
load("solve_rec")$
solve_rec(sm[n+2]-(n+2)*sm[n+1]+(n+1)*sm[n] = n*(n+1),sm[n],sm[0]=0,sm[1]=0)
```

which gives

```
sm[n]=%k[3]*n^2-%k[3]*n
```


Here is a slightly simplified example:

```
load("solve_rec")$
solve_rec(a[n+2]-n*a[n+1]+n*a[n] = n*n,a[n])
```



---

Comment by chapoton created at 2021-08-29 08:49:06

Karl-Dieter, would you please report upstream to maxima these new details about the problem ?


---

Comment by kcrisman created at 2021-08-30 16:56:28

I thought this was already at https://sourceforge.net/p/maxima/bugs/3469/ ?  Sorry, I'm not very familiar with this one or what its bug is.
