# Issue 28267: conversion of posets to libgap

Issue created by migration from https://trac.sagemath.org/ticket/28504

Original creator: chapoton

Original creation time: 2019-09-15 20:23:07

CC:  tscrim jmantysalo

using the QPA package

https://folk.ntnu.no/oyvinso/QPA/


---

Comment by chapoton created at 2019-09-15 20:23:30

New commits:


---

Comment by chapoton created at 2019-09-15 20:23:30

Changing status from new to needs_review.


---

Comment by tscrim created at 2019-09-15 21:04:27

Changing status from needs_review to positive_review.


---

Comment by tscrim created at 2019-09-15 21:04:27

LGTM.


---

Comment by chapoton created at 2019-09-16 07:23:19

one second. It seems to depend on gap_packages.


---

Comment by chapoton created at 2019-09-16 07:23:19

Changing status from positive_review to needs_work.


---

Comment by git created at 2019-09-16 07:38:58

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by chapoton created at 2019-09-16 07:41:42

ok, fixed. Back to needs review

By the way, conversion back from gap matrices seems not to work correctly.

```
sage: P = posets.TamariLattice(3)
sage: libgap(P)
<A poset on 5 points>
sage: A = libgap(QQ).PosetAlgebra(P)
sage: A.CoxeterMatrix().sage()
[[0, 0, 0, -1, -1],
 [0, 0, 1, 1, 1],
 [0, 0, 0, 1, 0],
 [0, 1, 0, 0, 1],
 [-1, -1, -1, -1, -1]]
sage: type(_)
<class 'list'>
```

But this would be for another ticket.


---

Comment by chapoton created at 2019-09-16 07:41:42

Changing status from needs_work to needs_review.


---

Comment by tscrim created at 2019-09-16 07:54:06

I agree, that should be another ticket. Although it just seems to be the transpose here. Or do you mean that gap matrices are just lists of lists, so it comes back as a list in Sage?


---

Comment by tscrim created at 2019-09-16 07:54:06

Changing status from needs_review to positive_review.


---

Comment by chapoton created at 2019-09-16 07:56:11

Still gap know that this is a matrix:

```
sage: M = A.CoxeterMatrix()
sage: M.IsMatrix()
true
```



---

Comment by tscrim created at 2019-09-16 08:01:22

It also recognizes it for any square array:

```
sage: gap([[1,2],[3,4]]).IsMatrix()
true
```

I suspect a decision was made at some point to not have things that pass `IsMatrix()` be matrices when given to Sage. (Maybe this is a standard Young tableaux.) However, this is probably something to ask on sage-devel.


---

Comment by chapoton created at 2019-09-29 15:23:01

moving milestone to 9.0


---

Comment by vbraun created at 2019-10-05 07:57:48

Resolution: fixed
