# Issue 18829: Constructing an empty polyhedron raises AssertionError

Issue created by migration from https://trac.sagemath.org/ticket/19066

Original creator: yzh

Original creation time: 2015-08-21 01:21:14

CC:  mkoeppe vbraun

Got `AssertionError` when constructing `Polyhedron` from an H-representation that has unusual base_ring and is infeasible,

```
sage: Polyhedron(ieqs=[(-sqrt(2),1,1),(0,-1,-1)])
AssertionError
sage: Polyhedron(ieqs=[(-sqrt(2),1,1),(0,-1,-1)], base_ring=AA)
AssertionError
```

whereas the following works well.

```
sage: Polyhedron(ieqs=[(-1.414,1,1),(0,-1,-1)])
The empty polyhedron in RDF^2
sage: Polyhedron(ieqs=[(sqrt(2),1,1),(0,-1,-1)])
```



---

Comment by mkoeppe created at 2015-08-21 17:06:32

I can't reproduce this with 6.9.beta2


---

Comment by mkoeppe created at 2015-08-21 17:06:32

Changing status from new to needs_info.


---

Comment by mkoeppe created at 2015-08-21 17:06:32

Changing keywords from "" to "polyhedron".


---

Comment by jdemeyer created at 2016-03-31 13:06:35

Changing status from needs_info to positive_review.


---

Comment by vbraun created at 2016-06-12 12:02:30

Resolution: fixed
