# Issue 29804: coefficients of a polynomial yielding an element in an extension of a p-adic field

Issue created by migration from https://trac.sagemath.org/ticket/30041

Original creator: @walnutmonster

Original creation time: 2020-07-01 15:20:01

CC:  pbruin

In [SageMath](SageMath) 9.0, I do the following:


```
sage: K = Qp(3)
sage: R.<x> = K[]
sage: L.<b> = K.extension(x^3+3)
sage: a = O(b^60)

```


and then I try to get the padded coefficients of the polynomial yielding this "almost zero" element


```

sage: a == 0
True
sage: a._polynomial_list(pad=True)
---------------------------------------------------------------------------
UnboundLocalError                         Traceback (most recent call last)
<ipython-input-10-849cb5543284> in <module>()
----> 1 a._polynomial_list(pad=True)

/opt/sagemath-9.0/local/lib/python3.7/site-packages/sage/rings/padics/padic_ZZ_pX_CR_element.pyx in sage.rings.padics.padic_ZZ_pX_CR_element.pAdicZZpXCRElement._polynomial_list (build/cythonized/sage/rings/padics/padic_ZZ_pX_CR_element.cpp:21303)()
   2540             return [R(c, prec) >> k for c in L]
   2541         else:
-> 2542             return [R(c, (prec - i - 1) // e + 1) >> k for i, c in enumerate(L)]
   2543
   2544     def polynomial(self, var='x'):

UnboundLocalError: local variable 'k' referenced before assignment

```


I think the output of the above should be the same as below



```
sage: K.zero()._polynomial_list(pad=True)
[0]
sage:
```




---

Comment by pbruin created at 2020-07-03 07:38:24

See also #29932.


---

Comment by git created at 2020-09-08 11:43:28

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by @n-vi created at 2020-09-08 11:48:14

I changed the behaviour of _polynomial_list at file padic_ZZ_pX_CR_element.pyx, so that now:

```
sage: K = Qp(3)
sage: R.<x> = K[]
sage: L.<b> = K.extension(x^3+3)
sage: a = O(b^60)
sage: a._polynomial_list(pad=True)
[O(3^20), O(3^20), O(3^20)]
# and indeed:
sage: b^0*O(3^20) + b^1*O(3^20) + b^2*O(3^20)
O(b^60)
```

A more detailed example that demonstrates the behaviour of _polynomial_list on zeros:

```
sage: R.<x> = ZZ[]
sage: W.<w> = Qp(5).extension(x^3-5)
sage: W(0)._polynomial_list()
[]
sage: W(0)._polynomial_list(pad=True)
[0, 0, 0]
sage: W(O(w^7))._polynomial_list()
[]
sage: W(O(w^7))._polynomial_list(pad=True)
[O(5^3), O(5^2), O(5^2)]
```


This behaviour is consistent with some other implementations of _polynomial_list, at files: CR_template.pxi, padic_ZZ_pX_CA_element.pyx, CA_template.pxi. In those files I also added doctests for the zero and O(w<sup>7</sup>) cases, to demonstrate their behaviour.


---

Comment by @n-vi created at 2020-09-08 11:48:47

Changing status from new to needs_review.


---

Comment by tscrim created at 2020-09-10 00:04:19

Changing status from needs_review to positive_review.


---

Comment by tscrim created at 2020-09-10 00:04:19

LGTM.


---

Comment by @n-vi created at 2020-09-10 00:09:40

Thanks!


---

Comment by vbraun created at 2020-09-15 21:58:43

Resolution: fixed
