# Issue 22435: Definite integral of (1-x)^(1/5)/sqrt(x) crashes with both GSL and Maxima

Issue created by migration from Trac.

Original creator: rws

Original creation time: 2017-03-22 09:20:10


```
sage: ((1-x)^(1/5)/sqrt(x)).nintegral(x,2,3)
...
TypeError: ECL says: Error executing code in Maxima: 

sage: ((1-x)^(1/5)/sqrt(x)).integrate(x,2,3,hold=True)
integrate((-x + 1)^(1/5)/sqrt(x), x, 2, 3)
sage: _.n()
...
Exception ValueError: ValueError('negative number to a fractional power not real',) in 'sage.calculus.integration.c_ff' ignored
```



---

Comment by rws created at 2017-03-22 09:24:31

The correct value would be `0.554731721677539 + 0.403036187432365*I`.


---

Comment by zimmerma created at 2017-06-22 10:59:31

I'm not sure, but I believe numerical integration only works for **real** functions:

```
sage: numerical_integral(I,0,1)
...
TypeError: unable to simplify to float approximation
```

Here, the function is complex in [2,3]:

```
sage: n((1-2)^(1/5))
0.809016994374947 + 0.587785252292473*I
```



---

Comment by rws created at 2017-06-23 13:22:22

Changing status from new to needs_review.


---

Comment by rws created at 2017-06-23 13:22:22

Yes right.


---

Comment by rws created at 2017-06-23 13:22:37

Changing status from needs_review to positive_review.


---

Comment by embray created at 2017-07-13 07:54:31

Resolution: wontfix


---

Comment by embray created at 2017-07-13 07:54:31

Closing tickets in the sage-duplicate/invalid/wontfix module with positive_review (i.e. someone has confirmed they should be closed).
