# Issue 12054: rational a finite word

archive/issues_012054.json:
```json
{
    "body": "Assignee: sage-combinat\n\nCC:  @videlec @seblabbe\n\nUpgrade exponent of a FiniteWord_class to calculate rational exponents.\n\nNow:\n\n```\nsage: Word('1231').exponent()\n1\n```\n\n\nExpected:\n\n```\nsage: Word('1231').exponent()\n4/3\n```\n\n\nThe goal\n\n```\nsage: Word('1231').exponent()\n4/3\nsage: Word('1231').exponent(integer=True)\n1\n```\n\n\n\nAlso, upgrade (deprecate, review, and/or change name) the method primitive() to be in accordance with the terminology used in literature (the word is usually called the period instead of the primitive)\n\n```\nsage: Word('1231').exponent()\n4/3\nsage: Word('1231').period()\nword: 123\n```\n\n\nUpgrade influenced methods (primitive_length(), ...).\n\nIssue created by migration from https://trac.sagemath.org/ticket/12226\n\n",
    "created_at": "2011-12-23T10:57:52Z",
    "labels": [
        "component: combinatorics",
        "minor"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-6.4",
    "title": "rational a finite word",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/12054",
    "user": "https://github.com/staroste"
}
```
Assignee: sage-combinat

CC:  @videlec @seblabbe

Upgrade exponent of a FiniteWord_class to calculate rational exponents.

Now:

```
sage: Word('1231').exponent()
1
```


Expected:

```
sage: Word('1231').exponent()
4/3
```


The goal

```
sage: Word('1231').exponent()
4/3
sage: Word('1231').exponent(integer=True)
1
```



Also, upgrade (deprecate, review, and/or change name) the method primitive() to be in accordance with the terminology used in literature (the word is usually called the period instead of the primitive)

```
sage: Word('1231').exponent()
4/3
sage: Word('1231').period()
word: 123
```


Upgrade influenced methods (primitive_length(), ...).

Issue created by migration from https://trac.sagemath.org/ticket/12226





---

archive/issue_comments_139571.json:
```json
{
    "body": "Changing assignee from sage-combinat to @staroste.",
    "created_at": "2011-12-23T10:58:41Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12054",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12054#issuecomment-139571",
    "user": "https://github.com/staroste"
}
```

Changing assignee from sage-combinat to @staroste.



---

archive/issue_comments_139572.json:
```json
{
    "body": "Should not period be an integer?\n\n... I already had the idea of making `period` an alias of `minimal_period`:\n\n\n```\nsage: Word('1231').minimal_period()\n3\n```\n\n\nWhat do you think?",
    "created_at": "2012-01-09T16:41:19Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12054",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12054#issuecomment-139572",
    "user": "https://github.com/seblabbe"
}
```

Should not period be an integer?

... I already had the idea of making `period` an alias of `minimal_period`:


```
sage: Word('1231').minimal_period()
3
```


What do you think?



---

archive/issue_comments_139573.json:
```json
{
    "body": "Replying to [comment:2 slabbe]:\n> Should not period be an integer?\n\nYou are right, I found both versions in the literature (integer in Lothaire, word for instance in http://www.springerlink.com/content/t59071u33573168v/ )\n\nWhen hearing period without context, I think an integer is expected. Although a word is definitely more useful in papers and you have the integer by taking just the length of the word.\n\nIs something like that stupid?\n\n```\nsage: Word('1231').period(word=True)\nword: 123\nsage: Word('1231').period()\n3\n```\n\n\n\n\n> What do you think?\n\nI think an alias is not necessary. There is no other period, and anyone looking for that notion will use \"period\" anyway.",
    "created_at": "2012-01-09T20:58:29Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12054",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12054#issuecomment-139573",
    "user": "https://github.com/staroste"
}
```

Replying to [comment:2 slabbe]:
> Should not period be an integer?

You are right, I found both versions in the literature (integer in Lothaire, word for instance in http://www.springerlink.com/content/t59071u33573168v/ )

When hearing period without context, I think an integer is expected. Although a word is definitely more useful in papers and you have the integer by taking just the length of the word.

Is something like that stupid?

```
sage: Word('1231').period(word=True)
word: 123
sage: Word('1231').period()
3
```




> What do you think?

I think an alias is not necessary. There is no other period, and anyone looking for that notion will use "period" anyway.



---

archive/issue_comments_139574.json:
```json
{
    "body": "> I think an alias is not necessary. There is no other period, and anyone looking for that notion will use \"period\" anyway.\n\nIf 3 is a period, than 6, 9, 12 are period as well. But I agree that 3 is *the* period. \n\nI would rather suggest the following :\n\n\n```\nsage: Word('1231').period_word()\nword: 123\nsage: Word('1231').period()\n3\n```\n",
    "created_at": "2012-01-10T19:42:02Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12054",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12054#issuecomment-139574",
    "user": "https://github.com/seblabbe"
}
```

> I think an alias is not necessary. There is no other period, and anyone looking for that notion will use "period" anyway.

If 3 is a period, than 6, 9, 12 are period as well. But I agree that 3 is *the* period. 

I would rather suggest the following :


```
sage: Word('1231').period_word()
word: 123
sage: Word('1231').period()
3
```




---

archive/issue_comments_139575.json:
```json
{
    "body": "> The goal\n> {{{\n> sage: Word('1231').exponent()\n> 4/3\n> sage: Word('1231').exponent(integer=True)\n> 1\n> }}}\n\nI would prefer the argument to speak about the use or not of the fraction :\n\n\n```\nsage: Word('1231').exponent() # default\n1\nsage: Word('1231').exponent(allow_fraction=True)\n4/3\n```\n\n\nor \n\n\n```\nsage: Word('1231').exponent(allow_fraction=False)\n1\nsage: Word('1231').exponent() # default\n4/3\n```\n",
    "created_at": "2012-01-10T19:46:35Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12054",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12054#issuecomment-139575",
    "user": "https://github.com/seblabbe"
}
```

> The goal
> {{{
> sage: Word('1231').exponent()
> 4/3
> sage: Word('1231').exponent(integer=True)
> 1
> }}}

I would prefer the argument to speak about the use or not of the fraction :


```
sage: Word('1231').exponent() # default
1
sage: Word('1231').exponent(allow_fraction=True)
4/3
```


or 


```
sage: Word('1231').exponent(allow_fraction=False)
1
sage: Word('1231').exponent() # default
4/3
```




---

archive/issue_events_032586.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2013-08-13T15:35:53Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/12054",
    "milestone": "sage-5.12",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/12054#event-32586"
}
```



---

archive/issue_events_032587.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-01-30T21:20:52Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/12054",
    "milestone": "sage-5.12",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/12054#event-32587"
}
```



---

archive/issue_events_032588.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-01-30T21:20:52Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/12054",
    "milestone": "sage-6.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/12054#event-32588"
}
```



---

archive/issue_events_032589.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-05-06T15:20:58Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/12054",
    "milestone": "sage-6.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/12054#event-32589"
}
```



---

archive/issue_events_032590.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-05-06T15:20:58Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/12054",
    "milestone": "sage-6.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/12054#event-32590"
}
```



---

archive/issue_events_032591.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-08-10T16:51:03Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/12054",
    "milestone": "sage-6.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/12054#event-32591"
}
```



---

archive/issue_events_032592.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-08-10T16:51:03Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/12054",
    "milestone": "sage-6.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/12054#event-32592"
}
```
