# Issue 14729: multiple instances of Partitions with side-parameters

Issue created by migration from Trac.

Original creator: dkrenn

Original creation time: 2013-07-24 15:39:51

CC:  sage-combinat nthiery

Keywords: Partitions, id, multiple instances

If I generate two `Partition`-objects with some side-paramters I get different objects:

```
sage: A=Partitions(4, min_length=2)
sage: B=Partitions(4, min_length=2)
sage: id(A), id(B)
(116527952, 116528976)
```

But when I do the same without side-parameters I get the same object:

```
sage: A=Partitions(4)
sage: B=Partitions(4)
sage: id(A), id(B)   
(116529232, 116529232)
```

Both should behave in the same way (AFAIK, like the second example)


---

Comment by tscrim created at 2013-07-29 00:40:51

This is actually not a bug, but instead a consequence of the different classes needed to handle some inputs. In particular, we can't hash the arguments since sometimes they need [lambda] functions as input. Unfortunately I don't think we can work around this, so I'm thinking we should close this ticket as won't-fix.


---

Comment by tscrim created at 2013-07-29 00:40:51

Changing status from new to needs_review.


---

Comment by ncohen created at 2013-08-08 16:14:36

Changing status from needs_review to positive_review.


---

Comment by jdemeyer created at 2013-08-13 08:45:34

Resolution: wontfix
