# Issue 13460: Another bug in add_edge

Issue created by migration from Trac.

Original creator: ncohen

Original creation time: 2012-10-28 08:34:52

Assignee: jason, ncohen, rlm

CC:  nthiery fhivert dcoudert

A bug report from Nicolas Thiery. Since we all work together at the LRI we did not send much new patches, but for sure we find a lot of bugs ! `:-P`

Nathann


```
sage: W = WeylGroup(["A",1])                                                                                                                                                       
sage: G = W.cayley_graph()                                                                                                                                                         
sage: Graph(G).degree()  
[2, 1]
sage: h = Graph()                                                                                                                                                                  
sage: h.add_edge(1,2,"a")                                                                                                                                                          
sage: h.add_edge(1,2,"a")                                                                                                                                                          
sage: h.degree()
[1, 2]
```


APPLY:
    * [attachment:trac_x.patch]


---

Attachment

P.S. : I hate edge labels. I hate multiple edges `:-P`


---

Comment by ncohen created at 2012-10-28 08:37:36

Changing status from new to needs_review.


---

Comment by dcoudert created at 2012-10-28 11:10:16

For me the patch is working.


---

Comment by dcoudert created at 2012-10-28 11:10:16

Changing status from needs_review to positive_review.


---

Comment by jdemeyer created at 2012-11-17 08:56:04

Resolution: fixed
