# Issue 13615: arrow2d path keyword is confusing

archive/issues_013615.json:
```json
{
    "body": "Assignee: jason, was\n\nCC:  @ppurka @orlitzky\n\nBasically, there is no true documentation for this, so that it's not obvious that\n\n```\nsage: arrow2d(path=[[(1,1),(2,3),(3,3)]])\n```\n\nis the correct syntax (note the double brackets) and it's not at all clear that the head and tail point are ignored.  Is that even what we want?  I find it annoying to send people to `bezier_path` for more details when there is not a hyperlink (though that's easily fixed) and (worse) it would make more sense to have\n\n```\nsage: arrow2d((1,1),(3,3),path=[(2,3)])\n```\n\nas a syntax.  (Maybe `bezier_path` itself should allow a single list of tuples as a shorthand when there is just one path...)\n\nAnyway, there are a number of ways to solve the problem of confusion, such as better documentation, but I figure whoever works on this should think of what our real goal is here, too.\n\nIssue created by migration from https://trac.sagemath.org/ticket/13819\n\n",
    "created_at": "2012-12-11T13:47:34Z",
    "labels": [
        "graphics",
        "minor",
        "enhancement"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-6.4",
    "title": "arrow2d path keyword is confusing",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/13615",
    "user": "@kcrisman"
}
```
Assignee: jason, was

CC:  @ppurka @orlitzky

Basically, there is no true documentation for this, so that it's not obvious that

```
sage: arrow2d(path=[[(1,1),(2,3),(3,3)]])
```

is the correct syntax (note the double brackets) and it's not at all clear that the head and tail point are ignored.  Is that even what we want?  I find it annoying to send people to `bezier_path` for more details when there is not a hyperlink (though that's easily fixed) and (worse) it would make more sense to have

```
sage: arrow2d((1,1),(3,3),path=[(2,3)])
```

as a syntax.  (Maybe `bezier_path` itself should allow a single list of tuples as a shorthand when there is just one path...)

Anyway, there are a number of ways to solve the problem of confusion, such as better documentation, but I figure whoever works on this should think of what our real goal is here, too.

Issue created by migration from https://trac.sagemath.org/ticket/13819





---

archive/issue_comments_168450.json:
```json
{
    "body": "For one segment, the notation,\n\n\n```\nsage: arrow2d((1,1),(3,3), control_points=[(2,3)])\n```\n\n\nmakes more intuitive sense, but may not be as convenient as throwing all of the points in the same list. When you consider multiple segments with an arrowhead at the end, though,\n\n\n```\nsage: arrow2d(path=[[(1,1),(2,3),(3,3)], [(4,4),(5,5)]])\n```\n\n\nis probably as simple as it's going to get. In any case, we should document how/why it works.\n\nI was going to argue that the current syntax makes it easy to reuse an existing bezier path, but here be dragons:\n\n\n```\nsage: bp = [[(1,1),(2,3),(3,3)], [(4,4),(5,5)]]\nsage: bezier_path(bp)\nsage: bp                                       \n[[(1, 1), (2, 3), (3, 3), (4, 4), (5, 5)], [(4, 4), (5, 5)]]\n```\n\n\nThat probably deserves its own ticket; the `bezier_path` function should copy its argument rather than modify the user's list.",
    "created_at": "2012-12-11T17:00:57Z",
    "issue": "https://github.com/sagemath/sagetest/issues/13615",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/13615#issuecomment-168450",
    "user": "@orlitzky"
}
```

For one segment, the notation,


```
sage: arrow2d((1,1),(3,3), control_points=[(2,3)])
```


makes more intuitive sense, but may not be as convenient as throwing all of the points in the same list. When you consider multiple segments with an arrowhead at the end, though,


```
sage: arrow2d(path=[[(1,1),(2,3),(3,3)], [(4,4),(5,5)]])
```


is probably as simple as it's going to get. In any case, we should document how/why it works.

I was going to argue that the current syntax makes it easy to reuse an existing bezier path, but here be dragons:


```
sage: bp = [[(1,1),(2,3),(3,3)], [(4,4),(5,5)]]
sage: bezier_path(bp)
sage: bp                                       
[[(1, 1), (2, 3), (3, 3), (4, 4), (5, 5)], [(4, 4), (5, 5)]]
```


That probably deserves its own ticket; the `bezier_path` function should copy its argument rather than modify the user's list.
