# Issue 25165: L-series for modular form has incorrectly shifted Taylor expansion

Issue created by migration from https://trac.sagemath.org/ticket/25402

Original creator: arminstraub

Original creation time: 2018-05-19 14:49:44

CC:  pbruin

Keywords: lseries

Using Sage 8.3.beta2:

```
sage: L = EllipticCurve("24a1").modular_form().lseries(); L
L-series associated to the cusp form q - q^3 - 2*q^5 + O(q^6)
sage: L(-1)
0.000000000000000
sage: L.taylor_series(-1, 3)
-0.702565506265199 + 0.638929001045535*z + 0.526515658001218*z^2 + O(z^3)
```

The terms of the Taylor series appear fine, just shifted:

```
sage: def D_n(f):
....:     return lambda x: (f(x+10^-4)-f(x))/10^-4
....: 
sage: D_n(L)(-1)
-0.702501608100647
sage: D_n(D_n(L))(-1) / 2
0.639086906100705
sage: D_n(D_n(D_n(L)))(-1) / 6
0.526090199182150
```

Not sure if this is a problem in the underlying Pari code or, maybe, the !Sage/Pari interface.


---

Comment by alexjbest created at 2018-05-20 17:54:58

Changing status from new to needs_review.


---

Comment by alexjbest created at 2018-05-20 17:54:58

So the problem is the conversion of a pari power series to a pari vector using `Vec`, this is quite inconsistent as a power `1E-58 + S +O(S^2)` becomes `[1E-58, 1]` but `0 + S + O(S^2)` becomes `[1]`.  Sometimes pari gives an exact zero as `Lseries` output which causes Sage to read the coefficients wrong in `dokchitser.taylor_series`. As per [https://pari.math.u-bordeaux.fr/archives/pari-users-1408/msg00000.html](https://pari.math.u-bordeaux.fr/archives/pari-users-1408/msg00000.html) instead using `Vecrev(Pol(...))` is one way to change this.
Another 1 line fix it seems :)!
----
New commits:


---

Comment by arminstraub created at 2018-05-20 18:31:16

Excellent!  That nicely fixes the incorrect Taylor series.

Before testing some more and reviewing this positively, there is one small issue that should probably be fixed: namely, the documentation promises that the series is `O(z^k)`, while the output for `L.taylor_series(-1, 3)` is `O(z^4)`.


---

Comment by git created at 2018-05-20 21:00:41

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by alexjbest created at 2018-05-20 21:03:14

Ahh nice catch, it seems this discrepancy is there in Dokchitser's computel in the first place, so I changed it to just truncate to `k` terms rather than just output as many as we are given by pari, I guess one could report this upstream as it is a little weird, but probably nobody is too bothered getting more terms than they hoped for! Maybe there are efficiency reasons this is bad though.

Also FYI: this sheds some light on the original discrepancy between exact zeroes and approximate zeroes in the output that started this in the first place, we get too many terms and an exact zero because there is an `S^(-1)` in the `fullgammafactor` which the `Lseries` is divided by to give the taylor series.


---

Comment by arminstraub created at 2018-05-21 00:46:00

Changing status from needs_review to positive_review.


---

Comment by arminstraub created at 2018-05-21 00:46:00

Awesome!  Fixes the bug and passed several tests.

I did notice that, for the L-function in the ticket description, `L.taylor_series(0, 3)` results in a GP error (it did that before, too, and it is unrelated to the issue in this ticket).  Is that worth reporting?


---

Comment by alexjbest created at 2018-05-21 16:44:08

Yes I think so, I'll try and email Tim Dokchitser.
Funnily enough  while I don't know what the problem is for sure, I have a fix in this case, changing the line in `sage/ext/pari/dokchitser/computel.gp.template` that reads `gmser=fullgammaseries_$i(ss,der)/t^(S+ss);` to `gmser=fullgammaseries_$i(ss,der + 1)/t^(S+ss);` and remaking everything (I don't know how to properly just update this script in `SAGE_EXTCODE`...) gets us nice taylor expansions around 0, e.g.

```
sage: L2 = EllipticCurve("37a1").modular_form().lseries(); L2
L-series associated to the cusp form q - 2*q^2 - 3*q^3 + 2*q^4 - 2*q^5 + O(q^6)
sage: L2.taylor_series(0,4)
0.000000000000000 - 0.357620466127498*z + 0.273373112603865*z^2 + 0.303362857047671*z^3 + O(z^4)
sage: L2.taylor_series(0,1)
O(z^1)
sage: L2(0)
0.000000000000000
```

It seems that dividing by `t^S` makes fullgammaseries not have as many terms as it thinks it should? So that the next line fails to get the coefficient of `O(S^der)`, so computing 1 extra term to begin with saves us?

Also when I googled the error message I found [https://www.few.vu.nl/~sdn249/modularforms16/SageMathIntro.pdf](https://www.few.vu.nl/~sdn249/modularforms16/SageMathIntro.pdf) where the same error occurs for a different example so I have cc'd pbruin in case he also thought about this before or was interested.


---

Comment by pbruin created at 2018-05-22 09:54:40

Replying to [comment:7 alexjbest]:
> Also when I googled the error message I found [https://www.few.vu.nl/~sdn249/modularforms16/SageMathIntro.pdf](https://www.few.vu.nl/~sdn249/modularforms16/SageMathIntro.pdf) where the same error occurs for a different example so I have cc'd pbruin in case he also thought about this before or was interested.
Thanks!  I did notice that this error still existed when doing a Sage demonstration in my Modular Forms lecture two weeks ago, but never got around to looking into it or even reporting it...


---

Comment by vbraun created at 2018-05-24 07:10:34

Resolution: fixed
