# Issue 13670: Allow automorphism of groups to work on the original vertex set

Issue created by migration from Trac.

Original creator: azi

Original creation time: 2012-12-28 11:03:06

Assignee: jason, ncohen, rlm

CC:  rbeezer ncohen dcoudert benjaminfjones

The current implementation of the automorphism group of a graph always relabels the graph in question to use the vertex set $1,2,...,$ and then returns the automorphism group based on this labelling and potentially a translation for the labelling as well.

Needless to say that this is time consuming, confusing and also prone to bugs since if one uses integers as labels (starting at 0 for example) the relabelling might go unnoticed. 

As it appears from [this](https://groups.google.com/forum/?fromgroups=#!topic/sage-devel/wLtbNpeYrok) sage-devel post  it is now possible to use arbitrary domains for permutation groups.

Hence, it would be nice to integrate this change into the automorphism_group function as well.


---

Comment by jason created at 2012-12-31 15:40:07

I posted this to the mailing list, but it's relevant here too:

Until we have proper support for this, you can do:


```
sage: g=Graph({'a': 'b', 'b': 'c'})
sage: p,q=g.automorphism_group(translation=True)
sage: pp=PermutationGroup(gap_group=p._gap_(), domain=sorted(q, key=q.get))

sage: pp
Permutation Group with generators [('c','a')]
```

(this also helps you see how to implement it...)

Unfortunately, there is a bug in the stabilizer method when the permutation group has a custom domain, which is now fixed at #13893, which now needs review.

a workaround for the stabilizer bug is:


```
sage: pp.subgroup(gap_group=gap.Stabilizer(pp, pp._domain_to_gap['b']))
Subgroup of (Permutation Group with generators [('c','a')]) generated by [('c','a')] 
```

