# Issue 22040: change ring multivariate Laurent Polynomials

Issue created by migration from Trac.

Original creator: edgarcosta

Original creation time: 2017-01-30 17:17:24

Keywords: change_ring, Laurent Polynomial ring, multivariate

The following does not work:



```
sage: R.<x, y> = LaurentPolynomialRing(QQ)
sage: a = x^2 + 3*x^3 + 5*x^-1
sage: a.change_ring(GF(3))
```



However, the following works:



```
sage: R.<x> = LaurentPolynomialRing(QQ)
sage: a = x^2 + 3*x^3 + 5*x^-1
sage: a.change_ring(GF(3))
```

and


```
sage: R.<x, y> = LaurentPolynomialRing(QQ)
sage: a = x^2 + 3*x^3 + 5*x^-1
sage: R.change_ring(GF(3))(a)
```



   


---

Comment by tscrim created at 2017-01-31 15:10:54

Changing type from PLEASE CHANGE to defect.


---

Comment by tscrim created at 2017-01-31 15:10:54

Good catch; `change_ring` should be there for consistency. The best fix IMO would be to move the `change_ring` method from the `LaurentPolynomial_univariate` class to `LaurentPolynomial_generic`.


---

Comment by chapoton created at 2017-06-22 18:03:35

Changing status from new to needs_review.


---

Comment by chapoton created at 2017-06-22 18:03:35

done, please review
----
New commits:


---

Comment by tscrim created at 2017-06-22 22:20:53

LGTM.


---

Comment by tscrim created at 2017-06-22 22:20:53

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2017-06-25 15:44:52

Resolution: fixed
