# Issue 16879: Inconsistency between imag function and method

Issue created by migration from Trac.

Original creator: gagern

Original creation time: 2014-10-08 14:29:56

I find the following strange and confusing:


```
sage: z6 = CyclotomicField(6).gen()
sage: z = 1 - z6
sage: imag(z)
-1/2*sqrt(3)
sage: imag(z).parent()
Symbolic Ring
sage: z.imag()
-1/2*sqrt3
sage: z.imag().parent()
Number Field in sqrt3 with defining polynomial x^2 - 3
```


In my opinion, the function and the method should yield the same result. I'd prefer the number field result.


---

Comment by gagern created at 2014-10-08 16:19:21

Even more bizarre:


```
sage: CyclotomicField(6).gen().real()
1/2
sage: CyclotomicField(12).gen().real()
---------------------------------------------------------------------------
AttributeError                            Traceback (most recent call last)

sage/structure/element.so
in sage.structure.element.Element.__getattr__
(sage/structure/element.c:4022)()

sage/structure/misc.so
in sage.structure.misc.getattr_from_other_class
(sage/structure/misc.c:1775)()

AttributeError:
'sage.rings.number_field.number_field_element.NumberFieldElement_absolute'
object has no attribute 'real'
```



---

Comment by gagern created at 2014-10-08 21:51:15

There is a third option: instead of returning a symbolic expression or a number field element, I could also have `imag` return an element of a cyclotomic field of possibly higher order. For a field of order `n`, the field of order `lcm(n, 4)` will contain `I` and can therefore be used to represent the imaginary part as a real number. I would think that staying in the world of cyclotomic fields might reduce the number of conversions in some cases. But I don't have any real experience how these two compare performance-wise for real world computations. Any opinions on this?
