# Issue 25805: Real transcendental extension fields

Issue created by migration from https://trac.sagemath.org/ticket/26042

Original creator: slelievre

Original creation time: 2018-08-10 11:54:29

CC:  dimpase mmarco vdelecroix saraedum slelievre

Keywords: transcendental, field extension

- [2018-08-08, Pat Hooper on sage-devel](https://groups.google.com/d/topic/sage-devel/80zQZFX8NEE/discussion)

    > I think Sage should support real transcendental extension fields.
    > It does not as far as I can tell. For example it should support
    > arithmetic and comparisons in Q(e) with e the usual constant e [...]

- [2014-03-13, Miguel Marco on sage-devel](https://groups.google.com/d/msg/sage-devel/0vAo1AnPVOU/2L_HrHR9Q4wJ)

    > The problem is that you cannot know if a certain expression involving
    > pi, e and cos(3/4) is zero or not [...]. That means that, for instance,
    > you don't know if you can take its inverse.

- [2013-05-20, Vincent Delecroix on sage-devel](https://groups.google.com/d/msg/sage-devel/aPk-mGKH8eI/yMGxUFZ4Z3YJ):

    > I would be happy if there was a way to work with the transcendental
    > extension QQ[pi] where I can assert that an expression is zero.


---

Comment by slelievre created at 2018-08-10 12:00:02

Not sure what component to set this to: algebra? basic arithmetic? symbolics?
or maybe something else?


---

Comment by wphooper created at 2018-08-10 14:58:23

Thanks Samuel for posting this. Two comments:

1) You can't rigorously decide equality in Q(e,pi) because you don't know if Q(e)(pi) is a transcendental extension of Q(e). If this extension is not transcendental, it would mean that in my implementation checking when calling x<y for x,y in Q(e,pi) could enter an infinite loop (in the case where x=y but are represented differently as rational functions in e and pi), but when a result is returned to x<y, then that answer would be rigorous. So, there might still be some point in supporting Q(e,pi)...

2) Defining Q(r) where r is a random number in (say) [0, 1] would be important to me. I'm not sure how many chains of transcendental extensions are known, but I think Sage should support chains involving random numbers at least, e.g., Q(e, r_1, r_2, ...)


---

Comment by vdelecroix created at 2018-08-10 15:29:12

Replying to [comment:3 wphooper]:
> 2) Defining Q(r) where r is a random number in (say) [0, 1] would be important to me.

+1. And even K(r) where K is a (real embedded) number field.


---

Comment by vdelecroix created at 2018-08-17 22:33:03

Hi Pat,

You should not be creating `NestedIntervalRealSet` but use `RealLazyField`. The latter is far from being perfect, but it is exactly inteded for this purpose.

```
sage: RLF.pi()
3.141592653589794?
sage: my_pi = RLF.pi()
sage: my_pi.numerical_approx(digits=50)
3.1415926535897932384626433832795028841971693993751
sage: RealIntervalField(100)(my_pi)
3.14159265358979323846264338328?
```

----
New commits:


---

Comment by wphooper created at 2018-08-18 01:36:00

Hi Vincent,

Thank you. Sure, I'll try to switch to RealLazyField. I hadn't realized that you could get intervals from RLF.

The other thing I use is FunctionField. One issue I was having was that it seems not to cancel constants in the numerator and denominator:

```
sage: K.<x>=FunctionField(QQ)
sage: y = (2*x)/(2*(x+1)); y
2*x/(2*x + 2)
sage: y^2
4*x^2/(4*x^2 + 8*x + 4)
```

These constants build up when performing the kind of repeated operations I was doing and slow things down a lot. I deal with this by calling ".factor().expand()" on FunctionField elements at every step, but this also seems slow and I'm not sure if it will work in all fields...


---

Comment by vdelecroix created at 2018-08-18 03:08:49

This will not solve your simplification problem but I wonder why these two are different

```
sage: QQ['t'].fraction_field()
Fraction Field of Univariate Polynomial Ring in t over Rational Field
sage: FunctionField(QQ, 't')
Rational function field in t over Rational Field
```

It seems that the second is just a wrapper over the first one

```
sage: K = FunctionField(QQ, 't')
sage: t = K.gen()
sage: parent(t._x) is QQ['t'].fraction_field()
True
sage: 
```


Concerning simplification in fraction field, this is a non-trivial matter and you may want to have a look at

- https://groups.google.com/forum/#!topic/sage-devel/vaHMDSt1bgs
- https://groups.google.com/forum/#!topic/sage-devel/Pzkkfjhj3XI

If you really want to work with a transcendental extension of QQ then better work with `ZZ['x'].fraction_field()` that apparently works better with simplification.


---

Comment by git created at 2018-12-03 17:02:32

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by wphooper created at 2018-12-03 17:15:17

I switched to `RealLazyField`. I also created a class (and parent) which represents a lazily computed random number in [0,1] (and created a `random_real` convenience function).

I did not address the simplifications problem. I'd like to work in the general case at first. Once people are happy with the general case, I think it will be worth doing some optimization when the base is `QQ` and perhaps also for number fields.


---

Comment by vdelecroix created at 2018-12-04 07:15:59

Hi Pat,

Some random thoughts

1. It does not make much sense to generate the bits by packets of 53. I know that 53 is the standard mantissa for double floating point, but in the present situation it would be more natural to use 64 bits. (idem in `_mpfr_` or `_richcmp_`)

2. I don't think that the following is necessary in `_coerce_map_from_`

```
+        if S == self:
+            return True
```


3. Why not make the `LazyRandomElement` an actual element of the real lazy field `RLF`? It would be better than having the ad-hoc `LazyRandomNumberSet_class`.


---

Comment by git created at 2018-12-05 16:42:15

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by git created at 2018-12-05 16:55:04

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by wphooper created at 2018-12-05 17:16:36

Hi Vincent,

3. I originally wanted to do this, but I ran into trouble with categories. I made changes in this direction, but I'm still having the issue. Namely `RLF.random()._test_category()` gives an error. It would be great if you could fix or tell me how to fix it.

1. In `LazyRandomNumber` I decided to store representations of `RealIntervalField`s with precision `64*2^k` for `k=0,1,2,...`. Previously, I was doing `53*k`. The new use of exponential growth here means that the memory requirements to get a random number of large precision drop from quadratic to linear (and presumably some algorithm times drop as well).

2. Fixed in second commit above.

4. I noticed a bug in `RealLazyField`: 

```
sage: float(sin(RLF.pi()))
AttributeError: type object 'float' has no attribute 'pi'
```

The same error appears with `RDF` replacing `float`.

I'm thinking we solve issue 3 above, then maybe it makes sense to make `RealTranscendentalExtensionField` support underlying functions fields such as `ZZ['x'].fraction_field()`. I wanted to see that people are happy with this scheme before I put more work in.


---

Comment by vdelecroix created at 2018-12-05 18:05:03

Replying to [comment:14 wphooper]:
> 4. I noticed a bug in `RealLazyField`: 
> {{{
> sage: float(sin(RLF.pi()))
> AttributeError: type object 'float' has no attribute 'pi'
> }}}
> The same error appears with `RDF` replacing `float`.

It is indeed a bug. A new ticket should be open to fix the issue. Note that curiously the following does work

```
sage: (sin(RLF.pi())).eval(RDF)
1.2246467991473515e-16
```



---

Comment by wphooper created at 2018-12-05 19:13:54

Replying to [comment:15 vdelecroix]:
> 
> It is indeed a bug. A new ticket should be open to fix the issue. Note that curiously the following does work
> {{{
> sage: (sin(RLF.pi())).eval(RDF)
> 1.2246467991473515e-16
> }}}

I opened a ticket: [https://trac.sagemath.org/ticket/26839](https://trac.sagemath.org/ticket/26839)


---

Comment by vdelecroix created at 2018-12-06 17:40:51

Replying to [comment:14 wphooper]:
> 3. I originally wanted to do this, but I ran into trouble with categories. I made changes in this direction, but I'm still having the issue. Namely `RLF.random()._test_category()` gives an error. It would be great if you could fix or tell me how to fix it.

This fails for a very bad reason. One quick fix is to change the declaration

```diff
- class LazyRandomNumber(LazyFieldElement):
+ cdef class LazyRandomNumber(LazyFieldElement):
```

(and you probably want to copy the declaration in `real_lazy.pxd`)

The reason why it fails is because any element of a parent should also inherit some methods that are defined by the category mechanism (the stuff in `sage/categories/`). For that machinery to work some extra inheritance construction is done on the fly. But this operates differently on Python classes (without cdef) and Cython classes (with cdef). For clearer explanation, you might want to have a look at [Simon King's tutorial](http://doc.sagemath.org/html/en/thematic_tutorials/coercion_and_categories.html#coercion-and-categories).

An alternative way to solve the problem is to call explicitely the inheritance machinery on your Python class... but the quick fix above is probably nicer.


---

Comment by git created at 2019-09-17 16:17:46

Branch pushed to git repo; I updated commit sha1. This was a forced push. New commits:


---

Comment by wphooper created at 2019-09-17 16:22:10

Rebased on 8.9.rc0.

Cythonized `LazyRandomNumber` so that now `RLF.random()._test_category()` passes.


---

Comment by slelievre created at 2019-09-17 20:10:04

Setting component to algebra for lack of a better idea.


---

Comment by slelievre created at 2019-09-17 20:10:04

Changing component from PLEASE CHANGE to algebra.


---

Comment by dimpase created at 2019-09-17 20:14:47

Replying to [comment:20 slelievre]:
> Setting component to algebra for lack of a better idea.

Tarski rotating in his grave...


---

Comment by git created at 2019-09-18 04:20:24

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by slelievre created at 2019-09-18 04:27:09

Replying to [comment:21 dimpase]:
> Replying to [comment:20 slelievre]:
> > Setting component to algebra for lack of a better idea.
> 
> Tarski rotating in his grave...

The "number fields" component might be the closest fit...


---

Comment by git created at 2019-09-18 04:55:47

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by wphooper created at 2019-09-18 05:19:48

The issues mentioned in the discussion above all seem resolved now. All tests are passing for me in both python2 and python3 now. Also the cancellation issue mentioned in comment 7 seems to have been resolved by changes in `FunctionField`.

Changed to "needs review".

(I'm grateful to Samuel Lelièvre for help getting through some issues I was having with cython and compiling sage.)


---

Comment by wphooper created at 2019-09-18 05:19:48

Changing status from new to needs_review.


---

Comment by @mjungmath created at 2020-10-14 21:43:28

This is a nice feature!

Unfortunately, most functions miss a test and/or example block.

See [here](https://doc.sagemath.org/html/en/developer/coding_basics.html#the-docstring-of-a-function-content) for details.


---

Comment by dimpase created at 2020-10-15 11:05:09

Changing status from needs_review to needs_work.


---

Comment by dimpase created at 2020-10-15 11:05:09

Indeed, tests/examples should be present for all the public functions. Setting to needs work due to this.
