# Issue 23616: libgap can not use gap packages

Issue created by migration from Trac.

Original creator: vdelecroix

Original creation time: 2017-09-14 09:09:22

Keywords: thursdaysbdx

With gap pexpect interface

```
sage: gap.LoadPackage('"cryst"')
true
sage: gap.SpaceGroupIT(2,14)
SpaceGroupOnRightIT(2,14,'1')
```

With libgap

```
sage: libgap.LoadPackage("cryst")
true
sage: libgap.SpaceGroupIT(2,14)
Traceback (most recent call last):
...
AttributeError: No such attribute: SpaceGroupIT.
```



---

Comment by embray created at 2021-02-16 13:35:39

This is fixed since some time ago.  You could use any package to demonstrate, but I installed the cryst package to demonstrate the same example:


```
sage: libgap.load_package('cryst')                                                                                                                                                               
true
sage: libgap.SpaceGroupIT(2,14)                                                                                                                                                                  
SpaceGroupOnRightIT(2,14,'1')
```


This was likely fixed by #27911.


---

Comment by embray created at 2021-02-16 13:35:39

Resolution: worksforme
