# Issue 13839: zeta(n) gets converted to incorrect interval

Issue created by migration from Trac.

Original creator: fredrik.johansson

Original creation time: 2013-01-31 14:34:50

Assignee: jason, jkantor

This is bad:

```
sage: zeta(3)
zeta(3)
sage: parent(_)
Symbolic Ring
sage: RealIntervalField(100)(zeta(3))                           
1.20205690315959000000000000000?
```


This should either be fixed to return a correct interval, or give a default error similar to


```
sage: RealIntervalField(100)(psi(1/3))
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)
    ...
TypeError: unable to simplify to a real interval approximation
```




---

Comment by jakobkroeker created at 2016-07-09 11:35:59

fixed?


---

Comment by rws created at 2017-05-15 08:18:01

Seems like it's fixed.


---

Comment by rws created at 2017-05-15 08:18:01

Changing status from new to needs_review.


---

Comment by chapoton created at 2017-06-02 09:15:19

Changing status from needs_review to positive_review.


---

Comment by embray created at 2017-07-13 07:54:31

Closing tickets in the sage-duplicate/invalid/wontfix module with positive_review (i.e. someone has confirmed they should be closed).


---

Comment by embray created at 2017-07-13 07:54:31

Resolution: wontfix
