# Issue 10462: Removed bug in MatrixGroup.list()

Issue created by migration from Trac.

Original creator: stumpc5

Original creation time: 2010-12-22 14:11:43

Assignee: joyner

Keywords: matrix group

the list method for `MatrixGroup` worked only for ZZ and GF(p), but not for QQ. This one line patch should do the job.

We had:

```

sage: gens = [matrix(ZZ,2,[1,0,0,1])]
sage: MatrixGroup(gens).list()
[[1 0]
[0 1]]

sage: gens = [matrix(GF(5),2,[1,0,0,1])]
sage: MatrixGroup(gens).list()
[[1 0]
[0 1]]

sage: gens = [matrix(QQ,2,[1,0,0,1])]
sage: MatrixGroup(gens).list()
...
AttributeError: 'RationalField_with_category' object has no attribute 'multiplicative_generator'
```


Now, the third works as well:


```
sage: gens = [matrix(QQ,2,[1,0,0,1])]
sage: MatrixGroup(gens).list()
[[1 0]
[0 1]]
```



---

Attachment

Patch removing bug in listing elements in a matrix group


---

Comment by stumpc5 created at 2010-12-22 14:14:40

Changing status from new to needs_review.


---

Comment by aly.deines created at 2011-01-10 01:27:54

added doctests


---

Comment by gagansekhon created at 2011-01-10 05:47:53

Changing status from needs_review to positive_review.


---

Attachment


---

Comment by jdemeyer created at 2011-01-23 20:25:49

Gagan: perhaps you meant to add yourself as reviewer instead of author?


---

Comment by jdemeyer created at 2011-01-26 22:28:07

Resolution: fixed


---

Comment by jdemeyer created at 2011-01-28 09:28:25

Fixed commit message, apply only this
