# Issue 16567: points() has problems with some lists of complexes containing real (i.e imag(x==0)) values.

Issue created by migration from https://trac.sagemath.org/ticket/16804

Original creator: charpent

Original creation time: 2014-08-12 17:52:12

CC:  vdelecroix tscrim

Keywords: graphics, plot, complex

Motivating example :

`sage: points(map(lambda x:x[0].N(),(z^20+1).roots()), figsize=4, aspect_ratio=1)` works as expected.

`sage: points(map(lambda x:x[0].N(),(z^20-1).roots()), figsize=4, aspect_ratio=1)` gives an error.

One (namely K. Crisman ) notes ([https://groups.google.com/forum/#!topic/sage-support/uyiSDTxQ_2U](https://groups.google.com/forum/#!topic/sage-support/uyiSDTxQ_2U)) that some of the member of the second set are real (namely -1 and 1) while none of the members of the first set is real.

Indeed :

`points(map(N, [1+I,I,I-1,-1-I,-I,1-I]),figsize=4)` works as expected.

`points(map(N, [0,1,1+I,I,I-1,-1,-1-I,-I,1-I]),figsize=4)` gives an error.

One also notes that `points([1+I,I,I-1,-1-I,-I,1-I],figsize=4)` while conforming to `points()` documentation, gives another, different error.

Workaround suggested by K. Crisman :

`sage: points(map(lambda x:CC(x[0].N()),(z^20-1).roots()), figsize=4, aspect_ratio=1)` works as expected.


---

Comment by jhonrubia6 created at 2016-04-05 18:05:34

The problem seems to be in xydata_from_point_list() that only checks the first element of the list to determine whether it is a [ComplexNumber](ComplexNumber) or not. Getting patched


---

Comment by git created at 2016-04-05 18:13:47

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by jhonrubia6 created at 2016-04-05 18:15:34

Obviously the patch also fixes the bug. Somehow the commit text was lost.


---

Comment by jhonrubia6 created at 2016-04-05 18:16:28

Changing status from new to needs_review.


---

Comment by vdelecroix created at 2016-04-05 19:56:13

Changing status from needs_review to needs_work.


---

Comment by vdelecroix created at 2016-04-05 19:56:13

- Please add spaces around the `=` sign in affectation.

- There is a nice `elif` in Python.

- `RealNumber` and `ComplexNumber` is highly restrictive. You should use `numbers.Real` and `numbers.Complex` from Python which works well under inclusion

```
sage: import numbers
sage: isinstance(ZZ.an_element(), numbers.Real)
True
sage: isinstance(1.0r, numbers.Real)
True
sage: isinstance(CC.an_element(), numbers.Real)
False
```

  Once done, you should add doctests accordingly.


---

Comment by git created at 2016-04-06 16:51:00

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by jhonrubia6 created at 2016-04-06 16:53:31

Changing status from needs_work to needs_review.


---

Comment by jhonrubia6 created at 2016-04-06 16:53:31

I think I got all your points.
I corrected all three motivating examples.


---

Comment by vdelecroix created at 2016-04-06 17:59:54

Could you also add doctests for `points` that are at the origin of this ticket like:

```
sage: points([0, 1, I])
Graphics object consisting of 1 graphics primitive
sage: points([0, 1., CC(0,1)])
Graphics object consisting of 1 graphics primitive
sage: points((x^5-1).roots(multiplicities=False))
Graphics object consisting of 1 graphics primitive
```



---

Comment by jhonrubia6 created at 2016-04-06 19:44:26

Changing status from needs_review to needs_work.


---

Comment by jhonrubia6 created at 2016-04-06 19:44:26

while doing the doctest I have discovered a case I haven't take into account. Working on it


---

Comment by git created at 2016-04-16 14:44:51

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by jhonrubia6 created at 2016-04-16 14:59:09

Reverted back to [ComplexNumber](ComplexNumber). After ` sage -t -a ` with some errors using numbers.Complex I decided to go back to [ComplexNumber](ComplexNumber) and everything worked. `xydata_from_point_list` is widely used across the libraries and in many different ways.
I have added doctests to point.py and more examples in plot.py.
Maybe in a different trac ticket somebody can make it work with numbers.complex if it is better as you say (I do not know). As it is the bug is fixed.


---

Comment by jhonrubia6 created at 2016-04-16 14:59:52

Changing status from needs_work to needs_review.


---

Comment by git created at 2016-04-16 15:04:40

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by vdelecroix created at 2016-04-16 19:52:34

Replying to [comment:14 jhonrubia6]:
> Reverted back to [ComplexNumber](ComplexNumber). After ` sage -t -a ` with some errors using numbers.Complex I decided to go back to [ComplexNumber](ComplexNumber) and everything worked.

What problems?

> `xydata_from_point_list` is widely used across the libraries and in many different ways.
> I have added doctests to point.py and more examples in plot.py.
> Maybe in a different trac ticket somebody can make it work with numbers.complex if it is better as you say (I do not know). As it is the bug is fixed.

Apparently not, there are plenty of doctest failures...


---

Comment by jhonrubia6 created at 2016-04-16 21:59:49

Replying to [comment:17 vdelecroix]:
> Replying to [comment:14 jhonrubia6]:
> > Reverted back to [ComplexNumber](ComplexNumber). After ` sage -t -a ` with some errors using numbers.Complex I decided to go back to [ComplexNumber](ComplexNumber) and everything worked.
> 
> What problems?
It failed the doctest


```
sage: xydata_from_point_list((1,2))
        ([1.0], [2.0])
```

when changing `CompleNumber` to `number.Complex` it did not recognize the tuple as such, interpreting it as two complex numbers on the real line. And, as [ComplexNumber](ComplexNumber) was used in the original code I thought it was justified its use. If you'd be so kind to tell me in which cases is better `number.Complex` I will do my best to use it.

> 
> > `xydata_from_point_list` is widely used across the libraries and in many different ways.
> > I have added doctests to point.py and more examples in plot.py.
> > Maybe in a different trac ticket somebody can make it work with numbers.complex if it is better as you say (I do not know). As it is the bug is fixed.
> 
> Apparently not, there are plenty of doctest failures...

I will double-check (right now I am running the full set of tests `sage -t -a ` again), I did it before pushing the commit and all tests passed OK. If you please give me one example of the tests that fails in your setting I will check it with my results asap.


---

Comment by vdelecroix created at 2016-04-16 22:12:36

There is no need to run the test yourself. There are computers that are doing that for each ticket. If you click on the blob on the up right of the ticket description you access the patchbot reports. Or directly [http://patchbot.sagemath.org/ticket/16804/](http://patchbot.sagemath.org/ticket/16804/).


---

Comment by vdelecroix created at 2016-04-16 22:21:22

In the commit `327d817` why did you add the line `points = map(N,points)` at the begining?


---

Comment by git created at 2016-04-16 22:26:57

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by jhonrubia6 created at 2016-04-16 22:31:31

Replying to [comment:20 vdelecroix]:
> In the commit `327d817` why did you add the line `points = map(N,points)` at the beginning?
It was an early unsuccessful attempt to rewrite the code from scratch. After running into many dead ends, I decided to patch the existing code to take into account the new bug, checking if there is at least one complex number within the list, the result is the last commit `df6da21` (except the debugging code line that I forgot to remove)


---

Comment by jhonrubia6 created at 2016-04-16 22:36:40

I uploaded the code as an attachment for the sake of clarity


---

Comment by git created at 2016-04-17 09:10:19

Branch pushed to git repo; I updated commit sha1. New commits:


---

Attachment

Patched code


---

Comment by git created at 2016-04-17 10:04:36

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by jhonrubia6 created at 2016-04-21 18:07:37

Replying to [comment:19 vdelecroix]:
> There is no need to run the test yourself. There are computers that are doing that for each ticket. If you click on the blob on the up right of the ticket description you access the patchbot reports. Or directly [http://patchbot.sagemath.org/ticket/16804/](http://patchbot.sagemath.org/ticket/16804/).
All test pass ok in my installation. The error I see in the patchbot report does not seem related to this patch.


---

Comment by vdelecroix created at 2016-05-08 02:52:17

Changing status from needs_review to needs_work.


---

Comment by vdelecroix created at 2016-05-08 02:52:17

You introduced trailing whitespaces (i.e. space just before the end of a new line). You should get rid of them.

In the documentation, if there is a comment then you should add two colons and a linebreak before a new test. In other words replace

```
    but 
        sage: xydata_from_point_list((1,5,2))
        Traceback (most recent call last):
        ...
```

with

```
    but::

        sage: xydata_from_point_list((1,5,2))
        Traceback (most recent call last):
        ...
```



---

Comment by git created at 2016-05-08 16:41:04

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by jhonrubia6 created at 2016-05-08 16:48:42

Changing status from needs_work to needs_review.


---

Comment by vdelecroix created at 2016-05-31 05:16:20

Changing status from needs_review to needs_work.


---

Comment by vdelecroix created at 2016-05-31 05:16:20

There should be a line break at the end of the function `xydata_from_point_list` to separate it from `plot`.

In your context, it makes no sense to use reduce. You should use either `all` or `any`.

I do not feel very confortable with the syntax

```
sage: points(CC(0,1))   # only one point !
sage: points(1)         # one point but does not work!
```

As the method is plural, I guess we should just forbid this case. What do you think? Depending on your answer you might want to fix

```
sage: points(CC(0,1))       # fine
sage: points(CDF(0,1))      # fine
sage: points(complex(1j))   # used to work
```

And ideally, numpy complex numbers should also be supported. You would better use `numbers` as adviced in [comment:8 comment:8].


---

Comment by jhonrubia6 created at 2016-05-31 06:13:14

Replying to [comment:31 vdelecroix]:
> There should be a line break at the end of the function `xydata_from_point_list` to separate it from `plot`.
ok, I will do it.
> 
> In your context, it makes no sense to use reduce. You should use either `all` or `any`.
ok, I will do it.

> I do not feel very confortable with the syntax
> {{{
> sage: points(CC(0,1))   # only one point !
> sage: points(1)         # one point but does not work!
> }}}
> As the method is plural, I guess we should just forbid this case. What do you think?
The original method is `point` and at the end of the model there is a `points = point` line, so I guess we have to support the 'singular' case of only one point in `xydata_from_point_list` I'll have a look into the failing case `point(1)`.

> Depending on your answer you might want to fix
> {{{
> sage: points(CC(0,1))       # fine
> sage: points(CDF(0,1))      # fine
> sage: points(complex(1j))   # used to work
> }}}
What do you mean by 'used to work'? I tested `points(complex(1j))` in cloud.sagemath.com (v6.10) and it doesn't work.

> And ideally, numpy complex numbers should also be supported. You would better use `numbers` as adviced in [comment:8 comment:8].
ok, ok, ok :-) I'll give it another try, last time I tried I wasn't able to make it work.


---

Comment by chapoton created at 2020-09-21 20:14:34

Changing status from needs_work to needs_review.


---

Comment by chapoton created at 2020-09-21 20:14:34

Here is another tentative
----
New commits:


---

Comment by git created at 2020-09-22 06:27:49

Branch pushed to git repo; I updated commit sha1. This was a forced push. New commits:


---

Comment by git created at 2020-09-25 17:09:05

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by chapoton created at 2020-10-03 07:32:53

green bot, please review


---

Comment by klee created at 2020-10-07 08:59:37

I suggest to move the handlings of specials cases to the `plot` definition.


```diff
diff --git a/src/sage/plot/plot.py b/src/sage/plot/plot.py
index 5f78020eec..be5d8ef784 100644
--- a/src/sage/plot/plot.py
+++ b/src/sage/plot/plot.py
@@ -799,21 +799,7 @@ def xydata_from_point_list(points):
     """
     import numbers
     zero = float(0)
-    # input could be a single number
-    if isinstance(points, numbers.Complex):
-        return [float(points.real())], [float(points.imag())]
-    elif isinstance(points, numbers.Real):
-        return [float(points)], [zero]
-    # create a list
-    if not isinstance(points, (list, tuple)):
-        points = list(points)
-    # special case for a single 2D or 3D point (resolve ambiguity)
-    if len(points) == 2:
-        if all(isinstance(z, numbers.Real) for z in points):
-            points = [points]
-    elif len(points) == 3:
-        if all(isinstance(z, numbers.Real) for z in points):
-            raise TypeError('not a 2D point')
+
     xdata = []
     ydata = []
     # otherwise input is an iterable
diff --git a/src/sage/plot/point.py b/src/sage/plot/point.py
index de9ae7d1d1..531929da0e 100644
--- a/src/sage/plot/point.py
+++ b/src/sage/plot/point.py
@@ -343,7 +343,7 @@ def point(points, **kwds):
     """
     if isinstance(points, Iterator):
         points = list(points)
-        
+
     try:
         return point2d(points, **kwds)
     except (ValueError, TypeError):
@@ -464,18 +464,24 @@ def point2d(points, **options):
     """
     from sage.plot.plot import xydata_from_point_list
     from sage.plot.all import Graphics
+
+    # points could be a single number
     if isinstance(points, numbers.Complex):
-        pass
-    else:
-        try:
-            l = len(points)
-        except TypeError:
-            # argument is an iterator
-            points = list(points)
-            l = len(points)
-
-        if l == 0:
-            return Graphics()
+        points = [(points.real(), points.imag())]
+    elif isinstance(points, numbers.Real):
+        points = [points]
+    elif not isinstance(points, (list, tuple)):
+        points = [points]
+
+    l = len(points)
+    if l == 0:
+        return Graphics()
+    elif l == 2:  # special case for a single 2D point
+        if all(isinstance(z, numbers.Real) for z in points):
+            points = [points]
+    elif l == 3:  # special case for a single 3D point
+        if all(isinstance(z, numbers.Real) for z in points):
+            raise TypeError('not a 2D point')
 
     xdata, ydata = xydata_from_point_list(points)
     g = Graphics()                  
```



---

Comment by chapoton created at 2020-10-08 16:11:17

you mean to the `point` definition ?


---

Comment by klee created at 2020-10-09 01:08:42

Replying to [comment:38 chapoton]:
> you mean to the `point` definition ?

Yes, `point2d` exactly.


---

Comment by klee created at 2020-10-28 09:11:33

If you have no objection, I am willing to upload a public branch containing the commit I suggested.


---

Comment by chapoton created at 2020-10-28 09:12:32

please do so.


---

Comment by git created at 2020-10-28 10:40:12

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by git created at 2020-10-28 10:48:11

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by klee created at 2020-10-29 00:21:10

Positive review on Frédéric's code.

If you are ok with the last changes, you set the flag on.


---

Comment by klee created at 2020-10-31 11:36:54

Changing status from needs_review to positive_review.


---

Comment by klee created at 2020-10-31 11:36:54

Green light on a bot.


---

Comment by vbraun created at 2020-11-01 01:13:46

Changing status from positive_review to needs_work.


---

Comment by vbraun created at 2020-11-01 01:13:46

Merge conflict


---

Comment by git created at 2020-11-01 09:04:40

Branch pushed to git repo; I updated commit sha1. This was a forced push. New commits:


---

Comment by klee created at 2020-11-01 09:05:29

Changing status from needs_work to needs_review.


---

Comment by klee created at 2020-11-02 00:05:57

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2020-11-22 15:05:14

Resolution: fixed


---

Comment by slelievre created at 2020-11-23 00:35:53

The code here has `points.real()`, `points.imag()`,
`xy.real()`, `xy.imag()`.


In some cases, see #30942, `real(z)` and `imag(z)`
work better than `z.real()` and `z.imag()`.


---

Comment by egourgoulhon created at 2020-11-27 12:52:44

See #30970 for a possible follow up.
