# Issue 22816: database_gap doesn't work after installing it

Issue created by migration from https://trac.sagemath.org/ticket/23053

Original creator: jdemeyer

Original creation time: 2017-05-22 10:32:25

CC:  dimpase

Reported by Paul Zimmerman and confirmed by me:

With Sage 7.6, after having done `sage -i database_gap`, I get:


```
sage: from sage.misc.package import is_package_installed
sage: is_package_installed("database_gap")
True
sage: x = polygen(QQ); G = (x^5 - x - 1).galois_group(); G
verbose 0 (2061: permgroup_named.py, cardinality) Warning: TransitiveGroups requires the GAP database package. Please install it with `sage -i database_gap`.
[...]
```



---

Comment by zimmerma created at 2017-05-22 11:02:13

it worked (for me) with Sage 7.5.1.


---

Comment by dimpase created at 2017-05-22 11:46:53

Probably you need to force the re-creation of GAP workspaces.
I thought all this was fixed in #22570...

What is the output of 

```
sage: gap_console()
```

in your case?


---

Comment by dimpase created at 2017-05-22 11:47:52

Also, does it go away if you install `gap_packages()` ?


---

Comment by jdemeyer created at 2017-05-22 11:50:49

Replying to [comment:2 dimpase]:
> What is the output of 
> {{{
> sage: gap_console()
> }}}
> in your case?


```
 ┌───────┐   GAP 4.8.6, 12-Nov-2016, build of 2017-05-22 13:45:59 (CEST)
 │  GAP  │   http://www.gap-system.org
 └───────┘   Architecture: x86_64-unknown-linux-gnu-gcc-default64
 Libs used:  gmp, readline
 Loading the library and packages ...
 Packages:   GAPDoc 1.5.1
 Try '??help' for help. See also '?copyright', '?cite' and '?authors'
```



---

Comment by jdemeyer created at 2017-05-22 11:55:01

Replying to [comment:3 dimpase]:
> Also, does it go away if you install `gap_packages()` ?

No. I also tried to re-installed various GAP-related packages (`gap` itself, `libgap`, `database_gap`, `gap_packages`) but that didn't help either.


---

Comment by dimpase created at 2017-05-22 12:13:40

I don't know, it works for me in a recent beta.

Could you remove `~/.sage/gap/` and re-try `gap_console()` ?


---

Comment by dimpase created at 2017-05-22 12:22:11

Oops, I spoke too soon. Unlike you, I do see 

```
Components: trans 1.0, prim 2.1, small* 1.0, id* 1.0
```

in `gap_console()` output, 
which should indicate that `database_gap` has been loaded etc., but I still get the error as indicated in the ticket description. Could it be that it's not really related to GAP?


---

Comment by zimmerma created at 2017-05-22 12:36:45

after I remove `~/.sage/gap/` it works with Sage 7.6:

```
┌────────────────────────────────────────────────────────────────────┐
│ SageMath version 7.6, Release Date: 2017-03-25                     │
│ Type "notebook()" for the browser-based notebook interface.        │
│ Type "help()" for help.                                            │
└────────────────────────────────────────────────────────────────────┘
sage: is_package_installed("database_gap")
True
sage: x = polygen(QQ); (x^5 - x - 1).galois_group()
Transitive group number 5 of degree 5
```



---

Comment by dimpase created at 2017-05-22 13:14:32

OK, so on the installation I was getting that error, removing `~/.sage/gap/` also makes it work. Apparently one can have different levels of brokenness: 

* no workspaces rebuilt
* workspaces needed for console gap are rebuilt, but not the ones needed for the issue at hand.


---

Comment by vbraun created at 2017-06-11 11:57:14

Changing status from new to needs_review.


---

Comment by dimpase created at 2017-06-11 21:00:17

I suppose branch deletion was a typo... :-)
----
New commits:


---

Comment by dimpase created at 2017-06-12 13:33:55

Looks good to me.
Any more interested parties to try this?


---

Comment by zimmerma created at 2017-06-12 14:25:18

> Looks good to me. Any more interested parties to try this?

I'd like to try the patch, but I don't know how. I have Sage 7.6 installed.


---

Comment by dimpase created at 2017-06-12 15:23:55

Replying to [comment:16 zimmerma]:
> > Looks good to me. Any more interested parties to try this?
> 
> I'd like to try the patch, but I don't know how. I have Sage 7.6 installed.
build from scratch, perhaps?

```
git clone  git@trac.sagemath.org:sage.git
cd sage
git pull origin u/vbraun/database_gap_doesn_t_work_after_installing_it
./configure
MAKE="make -j8" make
```

etc


---

Comment by zimmerma created at 2017-06-12 15:35:52

thanks. I guess I have to type `autoreconf -i` before `./configure`.


---

Comment by dimpase created at 2017-06-12 15:50:33

Replying to [comment:18 zimmerma]:
> thanks. I guess I have to type `autoreconf -i` before `./configure`.

IMHO if you don't do this, the needed stuff will be fetched from the net.


---

Comment by zimmerma created at 2017-06-12 18:44:21

Replying to [comment:19 dimpase]:
> Replying to [comment:18 zimmerma]:
> > thanks. I guess I have to type `autoreconf -i` before `./configure`.
> 
> IMHO if you don't do this, the needed stuff will be fetched from the net.

since there is no `configure` file, only `configure.ac`, `./configure` will fail.


---

Comment by vbraun created at 2017-06-12 18:57:09

The configure file is generate by the `bootstrap` script (standard stuff)

But you really only need to run "make", it will do the right thing even if you did not run bootstrap/configure yet.


---

Comment by zimmerma created at 2017-06-14 09:22:34

I confirm it works now with the git version (SageMath version 8.0.beta9).

1) I first tried without the Gap database, and I get the error:

```
verbose 0 (2061: permgroup_named.py, cardinality) Warning: TransitiveGroups requires the GAP database package. Please install it with ``sage -i database_gap``.
```


2) then I did `sage -i database_gap`, and then I get:

```
┌────────────────────────────────────────────────────────────────────┐
│ SageMath version 8.0.beta9, Release Date: 2017-05-31               │
│ Type "notebook()" for the browser-based notebook interface.        │
│ Type "help()" for help.                                            │
└────────────────────────────────────────────────────────────────────┘
┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
┃ Warning: this is a prerelease version, and it may be unstable.     ┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛
Forcing sage-location, probably because a new package was installed.
Updating various hardcoded paths...
(Please wait at most a few minutes.)
DO NOT INTERRUPT THIS.
Done updating paths.
sage: x = polygen(QQ); (x^5 - x - 1).galois_group()
Transitive group number 5 of degree 5
```

thus positive review on my side.


---

Comment by jdemeyer created at 2017-06-14 09:24:31

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2017-06-15 16:45:37

Resolution: fixed
