# Issue 10277: random_prime() is incredably slow compared to Mathematica

Issue created by migration from https://trac.sagemath.org/ticket/10278

Original creator: drkirkby

Original creation time: 2010-11-16 01:23:39

Assignee: was

Trying to compute a random prime up to 10<sup>1000</sup> took 1455 seconds on Sage 4.6.1.alpha1 on my 3.33 GHz Sun Ultra 27. 

Doing the same in Mathematica 7.0.1 takes just 7 seconds, making Mathematica 208 times faster. 

Some of that is probably due to the fact this is a 32-bit build of Sage, but a 64-bit build of Mathematica. But that can't explain a 208 time difference 

Related ticket #10277


---

Comment by drkirkby created at 2010-11-16 01:37:20

Changing type from PLEASE CHANGE to defect.


---

Comment by dsm created at 2010-11-16 03:57:24

"I realise that if one uses the pseudo-prime option to Sage, then it's a comparable speed to Mathematica. But there's no mention in the Mathematica documentation that the algorithm is only a pseudo-prime, though it might be. If it is, it's not documented"

I think it is, albeit at a remove.  From http://reference.wolfram.com/mathematica/tutorial/SomeNotesOnInternalImplementation.html#6849 :

"PrimeQ first tests for divisibility using small primes, then uses the Miller-Rabin strong pseudoprime test base 2 and base 3, and then uses a Lucas test.   As of 1997, this procedure is known to be correct only for n<10^(16), and it is conceivable that for larger n it could claim a composite number to be prime.  The Primality Proving Package contains a much slower algorithm which has been proved correct for all n. It can return an explicit certificate of primality. "

It seems more likely to me that the Mma random prime function is using the PrimeQ pseudoprime tests than that they're using a superefficient primality proving technique.

Indeed, if I take a smallish random prime in sage:


```
sage: time p = random_prime(10**150, proof=False)
CPU times: user 0.02 s, sys: 0.00 s, total: 0.02 s
Wall time: 0.02 s
sage: time is_prime(p)
CPU times: user 0.46 s, sys: 0.00 s, total: 0.46 s
Wall time: 0.46 s
True
sage: p
396968285437955531988467701547921075224667108600397832923955225840414797704080878380796474497239020444324579027811036089611598312820681956048457054889
```


and then try to test its primality in Mma:


```
In[3]:= Timing[ProvablePrimeQ[396968285437955531988467701547921075224667108600397832923955225840414797704080878380796474497239020444324579027811036089611598312820681956048457054889]]

Out[3]= {9.00663, True}
```


it actually takes much longer.  Apples to oranges, I admit: my notebook w/Sage 4.6 is 2.4 GHz, and the box with Mma 7.0 is 2.9 GHz, so if anything I'd have thought Mma would be faster..


---

Comment by drkirkby created at 2010-11-17 02:17:04

I'm closing this as invalid, for the reasons given above.


---

Comment by drkirkby created at 2010-11-17 02:17:04

Resolution: invalid
