# Issue 14837: Allowing 'textbook style' derivative output from pynac

Issue created by migration from Trac.

Original creator: mbejger

Original creation time: 2013-08-21 13:38:18

CC:  egourgoulhon

This is to allow for 'textbook style' of derivatives - something like \partial!^!{2}/\partial xy\,f(x, y), instead of D[0,1](f)(x,y) for a more readable output, especially in LaTeX in the notebook environment. I imagine it working like this:


```
sage: var('x y z'); f = function('f', x, y, z)
sage: from sage.symbolic.pynac import textbook_style_deriv 
sage: textbook_style_deriv(True) 
sage: f.diff(x,z,y,z) 
D^4/Dxyzz f(x, y, z) 
sage: latex(f.diff(x,z,y,z)) 
\frac{\partial^4}{\partial\,xyzz}f(x, y, z) 
sage: textbook_style_deriv(False) 
sage: f.diff(x,z,y,z) 
D[0, 1, 2, 2](f)(x, y, z)
```



---

Attachment

I think this has been proposed before. The problem is that there is not enough information available to use Leibniz notation. Consider the following examples and decide 

```
sage: var("x,y,u,v")
sage: function('f')
sage: ddf=f(x,y).diff(x,y).operator()
sage: ddf(x^2+y^2,x-y)   ## 1
D[0, 1](f)(x^2 + y^2, x - y)
sage: ddf(v,u)           ## 2
D[0, 1](f)(v, u)
sage: ddf(x,x^2+y)           ## 3
D[0, 1](f)(x, x^2+y)
```

I think Maple uses Leibniz notation if it applies (i.e., all parameters are distinct pure variables) and reverts to operator (Euler?) notation otherwise; also indexed by parameter position rather than name.


---

Comment by mbejger created at 2013-08-22 08:17:31

I see your point, but still think that it would be good to have an option for the Leibniz notation. Most of the time in physical applications the variables are pure variables anyway, and for some reason, depending on the context the user may decide to have such an output. Also, these notations are equivalent in the sense that no new information is added or taken away, it is just a matter of presenting them this of that way.


---

Attachment

Dear All, I have added a newer patch with an additional switch that allows for omitting the arguments of a function: 


```
var('x y z'); f = function('f', x, y, z)
f.diff(x,z,y,z)
D[0, 1, 2, 2](f)(x, y, z)
from sage.symbolic.pynac import omit_function_args
omit_function_args(True)
D[0, 1, 2, 2](f)
```



---

Comment by nbruin created at 2013-09-10 21:39:32

Replying to [comment:4 mbejger]:
> Dear All, I have added a newer patch with an additional switch that allows for omitting the arguments of a function: 
> 
> {{{
> var('x y z'); f = function('f', x, y, z)
> f.diff(x,z,y,z)
> D[0, 1, 2, 2](f)(x, y, z)
> from sage.symbolic.pynac import omit_function_args
> omit_function_args(True)
> D[0, 1, 2, 2](f)
> }}}
Not a good idea. How do you tell apart the two following extremely different objects:

```
sage: sage.symbolic.operators.FDerivativeOperator(f,[0,1,2,2])
D[0, 1, 2, 2](f)
sage: f(x,y,z).diff(x,z,y,z)
D[0, 1, 2, 2](f)(x, y, z)
```

The standard printing reflects exactly their relation: The second is obtained by evaluating the first at `(x,y,z)`.

I think having a printing option that does something along the lines of

```
if (isinstance(expr.operator(), sage.symbolic.operators.FDerivativeOperator) and
        are_all_distinct_pure_variables(expr.operands())):
    return "diff(%s%s,%s)"%(
        expr.operator().function(),
        tuple(expr.operands()),
        tuple( v.operands()[i] for i in v.operator().parameter_set())
else:
    return <normal string rep>
```

would be reasonable. That's the same approach maple seems to take.


---

Comment by egourgoulhon created at 2013-09-11 08:07:38

I agree that the arguments must be kept if the output is subject to further manipulations (e.g. the output is a symbolic expression). But it would be nice to remove them for *final* outputs, like LaTeX printing: this would greatly improve human readability of lengthy expressions.


---

Comment by nbruin created at 2021-09-23 17:19:39

Changing status from new to needs_review.


---

Comment by nbruin created at 2021-09-23 17:19:39

I think this can be closed as "invalid/fixed/obsolete". This is how it works nowadays:

```
sage: var('x,y,z')                                                                                                          
(x, y, z)
sage: function('f')                                                                                                         
f
sage: f(x,y,z).diff(x,z,y,z)                                                                                                
diff(f(x, y, z), x, y, z, z)
```



---

Comment by egourgoulhon created at 2021-09-23 18:52:20

Indeed this can be closed.


---

Comment by egourgoulhon created at 2021-09-23 18:52:20

Changing status from needs_review to positive_review.


---

Comment by mkoeppe created at 2021-10-04 23:44:13

Resolution: invalid
