# Issue 12981: Power series ideals don't implement reduce

archive/issues_012981.json:
```json
{
    "body": "Assignee: @malb\n\n\n```\nsage: Q.<q> = QQ[[]]\nsage: F = Q.fraction_field()\nsage: S.<s> = F[[]]\nsage: I = S.ideal(s^2 - q)\nsage: I.reduce(s^2)\ns^2\nsage: I.reduce(q)\nq\nsage: T.<sb> = S.quotient(I)\nsage: T(q) == T(s)^2\nFalse\n```\n\n\nThe current implemention of reduce in #12053 might need to be modified to work better in the power series case.\n\nIssue created by migration from https://trac.sagemath.org/ticket/13153\n\n",
    "created_at": "2012-06-22T19:05:42Z",
    "labels": [
        "commutative algebra",
        "major",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-6.4",
    "title": "Power series ideals don't implement reduce",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/12981",
    "user": "@roed314"
}
```
Assignee: @malb


```
sage: Q.<q> = QQ[[]]
sage: F = Q.fraction_field()
sage: S.<s> = F[[]]
sage: I = S.ideal(s^2 - q)
sage: I.reduce(s^2)
s^2
sage: I.reduce(q)
q
sage: T.<sb> = S.quotient(I)
sage: T(q) == T(s)^2
False
```


The current implemention of reduce in #12053 might need to be modified to work better in the power series case.

Issue created by migration from https://trac.sagemath.org/ticket/13153


