# Issue 23856: Cannot compute Gröbner fan when ring variables contain each other as prefixes

Issue created by migration from https://trac.sagemath.org/ticket/24093

Original creator: clienkaemper

Original creation time: 2017-10-23 22:28:57

Keywords: Gröbner basis,  Gröbner fan, gfan

Trying to compute a Gröbner fan over a ring in which one variable name contains the other as a prefix gives the following error:


```
sage: P = PolynomialRing(QQ,3*5,"x"); x = P.gens(); M = Matrix(3,x)
sage: M
[ x0  x1  x2  x3  x4]
[ x5  x6  x7  x8  x9]
[x10 x11 x12 x13 x14]
sage: I = P.ideal(M.minors(2))
sage: I.groebner_fan()
---------------------------------------------------------------------------
RuntimeError                              Traceback (most recent call last)
...
RuntimeError: Ring variables cannot contain each other as prefixes 
```



This was brought up in comments on ticket #20146 (now closed), but doesn't seem to have its own ticket. 



---

Comment by clienkaemper created at 2017-10-23 22:29:17

Changing keywords from "Gröbner basis,  Gröbner fan, gfan" to "Gröbner basis,  Gröbner fan, gfan, sd90".


---

Comment by chapoton created at 2017-10-24 18:06:12

Minimal case:

```
sage: R = PolynomialRing(QQ, 'x1,x11')
sage: I = R.ideal(R.gens())
sage: I.groebner_fan()
```

