# Issue 25045: Fix .is_prime() for symbolic expression

Issue created by migration from Trac.

Original creator: vklein

Original creation time: 2018-05-02 19:33:53

CC:  vdelecroix rws

sage: f(n)=n^2
sage: f(3).is_prime()
---------------------------------------------------------------------------
NotImplementedError                       Traceback (most recent call last)
<ipython-input-2-9727cba91e39> in <module>()
----> 1 f(Integer(3)).is_prime()

/home/vklein/odk/sage/src/sage/structure/element.pyx in sage.structure.element.RingElement.is_prime (build/cythonized/sage/structure/element.c:19230)()
   2741         if not self:  # We exclude the 0 element
   2742             return False
-> 2743         return self._parent.ideal(self).is_prime()
   2744 
   2745 

/home/vklein/odk/sage/local/lib/python2.7/site-packages/sage/rings/ideal.pyc in is_prime(self)
    822             ass = self.associated_primes()
    823         except (NotImplementedError, ValueError):
--> 824             raise NotImplementedError
    825         if len(ass) != 1:
    826             return False

NotImplementedError:


---

Comment by vklein created at 2018-05-07 09:19:06

Set assignee to vklein.


---

Comment by vklein created at 2018-05-07 11:56:29

Changing status from new to needs_review.


---

Comment by git created at 2018-05-07 12:00:18

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by vdelecroix created at 2018-05-15 06:55:36

Changing status from needs_review to needs_work.


---

Comment by vdelecroix created at 2018-05-15 06:55:36

1. Instead of `prime number` I would rather use `prime integer`.

2. Because of the changes in this branch, the following

```
sage: is_prime(SR(2/3))
Traceback (most recent call last):
...
TypeError: no conversion of this rational to integer
```

  becomes

```
sage: is_prime(SR(2/3))
False
```

  you need to check whether `self.pyobject()` is actually an integer.

3. (possibly for a later ticket) I think that a cleaner way to proceed is to introduce a symbolic `is_prime` function that would also handle variables like

```
sage: factorial(x)
factorial(x)
sage: factorial(x).subs(x=3)
6
```

  In other words the following should ideally work

```
sage: n = SR.var('n')
sage: assume(n, 'integer')
sage: is_prime(n)
is_prime(n)
sage: is_prime(n).subs(n=3)
True
```

  You can have a look at `sage.functions.other`.


---

Comment by vklein created at 2018-05-15 09:06:48

Replying to [comment:10 vdelecroix]:
> 2. Because of the changes in this branch, the following
> {{{
> sage: is_prime(SR(2/3))
> Traceback (most recent call last):
> ...
> TypeError: no conversion of this rational to integer
> }}}
>   becomes
> {{{
> sage: is_prime(SR(2/3))
> False
> }}}
>   you need to check whether `self.pyobject()` is actually an integer.\\

On the other hand even without this branch we have this :


```
sage: is_prime(2/3)
False
```



Shouldn't `is_prime(SR(2/3))` and `is_prime(2/3)` behave the same way ?

The next question is if we want "This number is not an integer and therefore it is not prime" or "This number is not an integer so calling is_prime on it is an error"


---

Comment by vdelecroix created at 2018-05-15 12:50:21

Replying to [comment:11 vklein]:
> Replying to [comment:10 vdelecroix]:
> > 2. Because of the changes in this branch, the following
> > {{{
> > sage: is_prime(SR(2/3))
> > Traceback (most recent call last):
> > ...
> > TypeError: no conversion of this rational to integer
> > }}}
> >   becomes
> > {{{
> > sage: is_prime(SR(2/3))
> > False
> > }}}
> >   you need to check whether `self.pyobject()` is actually an integer.\\
> 
> On the other hand even without this branch we have this :
> 
> {{{
> sage: is_prime(2/3)
> False
> }}}
> 
> 
> Shouldn't `is_prime(SR(2/3))` and `is_prime(2/3)` behave the same way ?

Perhaps.

> The next question is if we want "This number is not an integer and therefore it is not prime" or "This number is not an integer so calling is_prime on it is an error"

I think so, see https://groups.google.com/forum/#!topic/sage-devel/NN0VP-OVZLw (but definitely a distinct ticket)


---

Comment by vklein created at 2018-05-15 13:10:40

Changing status from needs_work to needs_info.


---

Comment by vklein created at 2018-05-15 13:10:40

This ticket is on hold. A discussion about what `is_prime` should do is in progress : ["How much do we support the casual user"](https://groups.google.com/forum/#!topic/sage-devel/NN0VP-OVZLw).


---

Comment by vdelecroix created at 2018-08-03 19:18:42

milestone update 8.3 -> 8.4
