# Issue 10846: Bad sign in integral()

Issue created by migration from https://trac.sagemath.org/ticket/10923

Original creator: tmonteil

Original creation time: 2011-03-12 22:04:19

Assignee: burcin

CC:  mjo

Keywords: integral

Here is the problem (tested on 4.6.2) :


```
sage: i = integral(e^(-1/x^2),x,0,1)
sage: i.numerical_approx()          
-0.0890738558907803
```


This should be a positive number since the map is positive.


---

Comment by kcrisman created at 2011-03-14 20:06:07

This is probably a bug in Maxima. 

```
sage: integral(e^(-1/x^2),x,0,1)
-1/2*gamma(-1/2, 1)
sage: integral(e^(-1/x^2),x,0,1).n()
-0.0890738558907803
sage: n(1/2*gamma(-1/2,1))
0.0890738558907803
sage: numerical_integral(e^(-1/x^2),0,1)
(0.08907385589078036, 1.4474177932169952e-15)
```

So probably a minus sign got in there somehow.

This is now Maxima bug 3211937.


---

Comment by tmonteil created at 2011-03-14 23:04:52

Thanks for reporting this to Maxima.

By the way, here is a direct link to [the related maxima bug](http://sourceforge.net/tracker/?func=detail&aid=3211937&group_id=4933&atid=104933)).


---

Comment by kcrisman created at 2011-03-30 15:18:58

Apparently this is now fixed.  See the bug report above.  

So this will need a doctest when we upgrade our Maxima.


---

Comment by tmonteil created at 2011-03-31 23:49:40

To be applied when Maxima will be updated.


---

Attachment

As you suggested, i added a doctest to ensure that the correct integral is computed.


---

Comment by kcrisman created at 2011-04-01 01:54:13

Changing status from new to needs_info.


---

Comment by kcrisman created at 2011-04-01 01:54:13

Great.  Once we get a Maxima in with this, I'll be sure to review the patch :)

Putting as 'needs info' because of waiting for that, which will likely be a little while since we just upgraded.


---

Comment by mjo created at 2011-12-13 18:25:40

I've confirmed that this is fixed in maxima-5.24.0.


---

Comment by kcrisman created at 2012-01-09 16:49:09

This does not apply on sage-4.8.alpha5.  We just tried it at Sage Days 35.5.


---

Comment by kcrisman created at 2012-01-09 16:49:09

Changing keywords from "integral" to "integral sd35.5".


---

Comment by mjo created at 2012-01-09 17:46:01

We don't get such a nice answer, anyway, so the doctest from the patch would fail. With maxima-5.24,


```
sage: integral(e^(-1/x^2),x,0,1).full_simplify()
((e*erf(1) - e)*sqrt(pi) + 1)*e^(-1)
```


I can update the patch; should we test that the numerical approximation is close to what it should be, or should we check for the symbolic result?


---

Comment by kcrisman created at 2012-01-09 18:49:55

So are you participating remotely at [Sage Days 35.5](http://wiki.sagemath.org/days35.5)?

We should probably test both, though of course this is not as pretty.

```
sage: ((e*erf(1) - e)*sqrt(pi) + 1)*e^(-1)
((e*erf(1) - e)*sqrt(pi) + 1)*e^(-1)
sage: _.n()
0.0890738558907804
```

I never know what incomplete gamma is supposed to give in terms of "normal" functions.


---

Comment by mjo created at 2012-01-09 19:03:43

Is "participating remotely" the same thing as "goofing off at work"? If so, I'm doing it. One more question: is there a good way to test almost-equals, for the numerical approximation? Or do I just do `abs(x - y) < epsilon`?


---

Comment by kcrisman created at 2012-01-09 20:28:06

Hmm.  Yes, there is something new to do this much better.   See #10952.


---

Comment by mjo created at 2012-01-09 20:39:12

Replying to [comment:11 kcrisman]:
> Hmm.  Yes, there is something new to do this much better.   See #10952.

Thanks for this tip. I have a documentation bug open at #12281 for these doctest options if you guys get bored up there at sage days!


---

Attachment

Updated patch for maxima-5.24 against sage-4.8.alpha6.


---

Comment by mjo created at 2012-01-09 21:13:14

There you go. I threw in a few orders of magnitude more tolerance than I think we need to account for platform differences.


---

Comment by mjo created at 2012-01-09 21:13:14

Changing status from needs_info to needs_review.


---

Comment by benjaminfjones created at 2012-01-10 16:15:03

Michael, can you post the location of your Maxima-5.24 spkg so we can test this patch?


---

Comment by mjo created at 2012-01-10 16:32:58

Replying to [comment:14 benjaminfjones]:
> Michael, can you post the location of your Maxima-5.24 spkg so we can test this patch?

Yup:

  http://michael.orlitzky.com/sage/maxima-5.24.0.p0.spkg


---

Comment by benjaminfjones created at 2012-01-10 20:34:02

I can verify that the issue is solved after building the maxima-5.24 spkg that Michael provided and then applying the patch [attachment:sage-trac_10923.patch]. 


```
sage: i = integral(e^(-1/x^2),x,0,1)
sage: i.numerical_approx()
0.0890738558907802
```


Doctests in the affected file all pass. I'm running all tests now, but  pending that, I give the ticket a positive review.


---

Comment by benjaminfjones created at 2012-01-11 05:16:23

OK, `make ptestlong` finished. There were failures, but none of them are due to this ticket specifically as far as I can tell. They are all due to the maxima-5.24 spkg I believe. I need to look into #12094 to be sure but it's too late to do that tonight..


---

Comment by kcrisman created at 2012-01-28 02:29:29

Changing status from needs_review to positive_review.


---

Comment by kcrisman created at 2012-01-28 02:29:29

Yes, this all works fine.


---

Comment by jdemeyer created at 2012-02-06 21:23:35

Resolution: fixed


---

Comment by mstreng created at 2012-02-10 19:11:26

Something in this patch seems to trigger a doctesting bug. Try

```
./sage -t -only-optional=magma "devel/sage/sage/symbolic/integration/integral.py"
```

See [sage release](http://groups.google.com/group/sage-release/browse_thread/thread/7a3905744b6c6e9f)


---

Comment by kcrisman created at 2012-02-10 19:29:16

See #12493 for followup.
