# Issue 10514: Parentheses break implicit_multiplication

Issue created by migration from https://trac.sagemath.org/ticket/10567

Original creator: eviatarbach

Original creation time: 2011-01-07 03:07:24

Assignee: was

Parentheses (brackets) seem to break implicit_multiplication, but only in some cases. This seems to be when a non-bracketed factor is followed by a bracketed. It seems to be a problem with the preparser. Here are a few examples:


```
sage: implicit_multiplication(True)

Working examples:

sage: (x+3)(x+4)
(x + 3)*(x + 4)
sage: (3) x
3*x
sage: 3(x+3)
3*x + 9

Non-working examples:

sage: x(x+3)
x + 3
sage: x (3)
3

Preparser does not work:

sage: preparse('x(x+3)')
'x(x+Integer(3))'
```

This is quite a major issue for implicit_multiplication.


---

Comment by lftabera created at 2011-01-07 09:06:08

Well,

I think that "x(x+3)" and "x(3)" will never work, since this is the syntax of function call.

If you made the preparser to transform "x(3)" to "x*3". How will you be able to use a function named x to value 3?


---

Comment by eviatarbach created at 2011-01-08 04:36:17

Oh, that's why! I can't believe I didn't notice that.


---

Comment by eviatarbach created at 2011-01-08 04:36:17

Resolution: invalid


---

Comment by eviatarbach created at 2011-01-08 04:40:52

Resolution changed from invalid to 


---

Comment by eviatarbach created at 2011-01-08 04:40:52

However, here are some examples where this doesn't work when it should.


```
sage: (5) (3*5)
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)

/home/eviatar/<ipython console> in <module>()

TypeError: 'sage.rings.integer.Integer' object is not callable
sage: (x+3) (x+3)
x + 6
```



---

Comment by eviatarbach created at 2011-01-08 04:40:52

Changing status from closed to new.


---

Comment by @black-stones created at 2018-05-21 18:03:49

Changing status from new to needs_review.


---

Comment by @black-stones created at 2018-05-21 18:03:49

There's nothing wrong with either example

(5) (3*5) is still a function call and therefore invalid because "(5)" is not a function

(x+3) (x+3) - the first (x + 3) creates an expression, and then you call the expression with the argument (x + 3). So for example (x + 3)(2) would be 2 + 3 = 5, (x + 3)(y) = y + 3, and (x + 3)(x + 3) = x + 3 + 3 = x + 6


---

Comment by nbruin created at 2018-05-21 21:16:04

Replying to [comment:4 gh-black-stones]:

> (5) (3*5) is still a function call and therefore invalid because "(5)" is not a function
> 
> (x+3) (x+3) - the first (x + 3) creates an expression, and then you call the expression with the argument (x + 3). So for example (x + 3)(2) would be 2 + 3 = 5, (x + 3)(y) = y + 3, and (x + 3)(x + 3) = x + 3 + 3 = x + 6

These are not examples the ticket complains about. These are in fact handled as multiplication if one sets `implicit_multiplication(level=10)` (so `(sin)(x)` and `sin(x)` get preparsed differently depending on level)

The ticket can probably still be closed as "wontfix" because the preparser can't see the difference between `x` and `sin`, and hence parsing `x(1)` as multiplication would make function calls indeed impossible.


---

Comment by @black-stones created at 2018-05-21 22:10:07

Replying to [comment:5 nbruin]:
> These are not examples the ticket complains about. 

See comment 3

I am just saying that when the level is set to True, the two examples are not treated as multiplication and this is intentional. To treat them as multiplication, as you pointed out, we should set the level to 10. Anyways, I concur that we should close this ticket as wontfix.


---

Comment by embray created at 2018-08-14 17:35:53

Resolution: wontfix
