# Issue 33511: make accessing coefficients of finite-field elements easier

Issue created by migration from https://trac.sagemath.org/ticket/33748

Original creator: lorenz

Original creation time: 2022-04-23 08:42:47

This comes up rather frequently:

```sage
sage: F.<i> = GF(431^2, modulus=x^2+1)
sage: a = F.random_element()  # some computation
sage: coeffs = a.polynomial().padded_list(2)  # cumbersome!
```


For number fields, we do have a shorthand:

```sage
sage: K.<i> = NumberField(x^2+1)
sage: b = K.random_element()  # some computation
sage: coeffs = b.list()
```



This patch adds a `.__getitem__()` method to the class `FinitePolyExtElement`, which makes `a[i]` and `list(a)` and `tuple(a)` work as expected.

For compatibility with number-field elements, we also add `.list()`, which should behave identically to calling `list()` on the element.


---

Comment by lorenz created at 2022-04-23 08:43:06

Changing status from new to needs_review.


---

Comment by tscrim created at 2022-04-25 00:27:43

Should we also add an `__iter__` method too?

While it is not in the built documentation, if this ever gets moved into something public, the ``n`th` will fail.


---

Comment by git created at 2022-04-25 03:16:34

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by git created at 2022-04-25 03:34:50

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by lorenz created at 2022-04-25 03:35:46

Thanks â€” indeed, `.__iter__()` is significantly faster than the fallback through `.__getitem__()`.


---

Comment by tscrim created at 2022-04-25 07:08:29

Changing status from needs_review to positive_review.


---

Comment by tscrim created at 2022-04-25 07:08:29

Thanks. LGTM.


---

Comment by vbraun created at 2022-05-22 16:32:14

Resolution: fixed
