# Issue 11625: Finite field elements are allowed in exponents

archive/issues_011625.json:
```json
{
    "body": "Assignee: @aghitza\n\n\n```\nsage: p=7\nsage: k=GF(p)\nsage: k(2)^k(p)\n1\nsage: (GF(7)(2))^(GF(5)(2))\n4\nsage: k(2)^p\n2\n```\n\nIt looks like it's simply quietly lifting the exponent to the integers, which it shouldn't do because there is no coercion in that direction (only a conversion):\n\n```\nsage: k.<a>=GF(p^2)\nsage: k(2)^k(p)\n1\nsage: k(2)^k(a)\nTypeError: not in prime subfield\nsage: ZZ(k(1))\n1\nsage: ZZ(k(a))\nTypeError: not in prime subfield\n```\n\nThere is one side-effect of this that does look elegant:\n\n```\nsage: R=Integers(p-1)\nsage: (k(2))^(R(p))\n2\n```\n\nbut in general I'd say an error should result from exponentiations like this.\n\nIssue created by migration from https://trac.sagemath.org/ticket/11797\n\n",
    "created_at": "2011-09-13T20:52:02Z",
    "labels": [
        "component: basic arithmetic",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-duplicate/invalid/wontfix",
    "title": "Finite field elements are allowed in exponents",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/11625",
    "user": "https://github.com/nbruin"
}
```
Assignee: @aghitza


```
sage: p=7
sage: k=GF(p)
sage: k(2)^k(p)
1
sage: (GF(7)(2))^(GF(5)(2))
4
sage: k(2)^p
2
```

It looks like it's simply quietly lifting the exponent to the integers, which it shouldn't do because there is no coercion in that direction (only a conversion):

```
sage: k.<a>=GF(p^2)
sage: k(2)^k(p)
1
sage: k(2)^k(a)
TypeError: not in prime subfield
sage: ZZ(k(1))
1
sage: ZZ(k(a))
TypeError: not in prime subfield
```

There is one side-effect of this that does look elegant:

```
sage: R=Integers(p-1)
sage: (k(2))^(R(p))
2
```

but in general I'd say an error should result from exponentiations like this.

Issue created by migration from https://trac.sagemath.org/ticket/11797





---

archive/issue_comments_131176.json:
```json
{
    "body": "Resolution: duplicate",
    "created_at": "2014-09-10T11:50:57Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11625",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11625#issuecomment-131176",
    "user": "https://github.com/jdemeyer"
}
```

Resolution: duplicate



---

archive/issue_events_011703.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2014-09-10T11:50:57Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/11625",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/11625#event-11703"
}
```
