# Issue 34063: Sage mishandles relational expressions passed on to the maxima assume function

Issue created by migration from https://trac.sagemath.org/ticket/34300

Original creator: @spaghettisalat

Original creation time: 2022-08-07 16:24:01

CC:  burcin

Since ticket #9961, relational expressions are not passed on to the maxima `assume` unmodified. Instead, relations like `f(x) > g(y)` are changed by sage to `f > g`, i.e. the arguments of any functions on the left and right hand side are stripped out (at least if only a user-defined function with a single argument is given on either one or both sides of the relation).


This ad-hoc modification is problematic for several reasons:

1. it is nonsensical for relations like `f(x) > f(y)` or `f(x) > f(x+1)`
2. it prevents users from assuming for instance both `f(x) > 0` and `f(y) < 0`
3. it leads to strange behaviour where one form of a relation works correctly while an equivalent form doesn't, such as in the following example:

```
sage: function('f g'); var('x')
sage: assume(f(x) > f(x+1)); assume(g(x) - g(x+1) > 0)
sage: bool(f(x) > f(x+1))
False
sage: bool(g(x) > g(x+1))
True
```


Therefore, in my view the solution to ticket #9961 is inadequate and should be removed.

Perhaps a better solution would be to introduce relational expressions for functions to allow a syntax like

```
sage: function('f')
sage: assume(f > 0)
```

with the assumed meaning that `f` always returns a positive result.

