# Issue 11732: Change default variable name for NumberFieldElement -> PARI conversion

Issue created by migration from https://trac.sagemath.org/ticket/11904

Original creator: jdemeyer

Original creation time: 2011-10-07 10:24:59

Assignee: davidloeffler

Currently, we get:

```
sage: K.<a> = NumberField(x^3 + 2)
sage: (a + 2)._pari_()
Mod(x + 2, x^3 + 2)
```

Note that the variable `x` is used. Since polynomials prefer the variable name `x`, it might be better to use `y` by default (or any other name) for number field elements.

Also, the `_pari_()` methods for `NumberFieldElement_absolute` and `NumberFieldElement_relative` are exactly the same, so we should avoid code duplication.


---

Comment by jdemeyer created at 2011-10-10 13:10:05

Changing status from new to needs_review.


---

Comment by jdemeyer created at 2011-10-10 20:20:32

Changing status from needs_review to needs_work.


---

Comment by jdemeyer created at 2011-10-15 11:06:56

Changing status from needs_work to needs_review.


---

Comment by was created at 2011-10-30 04:11:05

Quick question?   What happens if I do:

```
sage: K.<a> = NumberField(x^3 + 2)
sage: R.<y> = PolynomialRing(K)
sage: pari(a*y)
```


I would find out for myself, but with sage-4.7.2.alpha3, I get 13 hunks fail, so I can't apply the patch.  And I don't know which version of Sage this patch is against.


If the above fails, isn't this a pretty bad approach to this problem?    Wouldn't it be better to call the variable in PARI something like "__x" or "_x" (say), which is very very unlikely to class.   That would use the standard Sage/Python convention that one should not use stuff prefixed with underscores except in programming.


---

Comment by ohanar created at 2011-10-30 04:28:35

It might make sense to set the default value to depend on the name of the generator (e.g. for instance `a` -> `a_pari` or `a_parivar`).


---

Comment by jdemeyer created at 2011-10-30 11:48:27

Replying to [comment:9 was]:
> Quick question?   What happens if I do:
> {{{
> sage: K.<a> = NumberField(x^3 + 2)
> sage: R.<y> = PolynomialRing(K)
> sage: pari(a*y)
> }}}
This fails by raising `PariError`.

The following _does_ work (and it does _not_ without the patch):

```
sage: K.<a> = NumberField(x^3 + 2)
sage: R.<y> = PolynomialRing(K)
sage: (a*y)._pari_with_name('x')
Mod(y, y^3 + 2)*x
```


> I would find out for myself, but with sage-4.7.2.alpha3, I get 13 hunks fail, so I can't apply the patch.  And I don't know which version of Sage this patch is against.
Well, it should apply against sage-4.7.2.alpha3 (or more recent) if you apply all the dependencies.  But it is possible that I forgot a dependency.

> If the above fails, isn't this a pretty bad approach to this problem?    Wouldn't it be better to call the variable in PARI something like `__x` or `_x` (say).
No, this has to do with variable priorities and is not something which is easily fixed.  Besides, even if we do this, then you would still have problems again with polynomial rings in multiple variables or relative extensions.

So I'm not claiming this patch fixes all issues, it just _improves_ on the existing behaviour.  My patch changes the `pari` function for number field polynomials from *never* working to *sometimes* working (it works if you use _x_ as polynomial variable).

I also think this patch is important for the Sage library, since there we can easily take the PARI variable to be _x_.  For example, my patch changes

```
Kbnf = self.pari_bnf(proof=proof).nf_subst("'y")
coeffs = [ a._pari_("y") for a in relpoly.coeffs() ]
polrel = pari(coeffs).Polrev()
return Kbnf.rnfisnorminit(polrel)
```

to the much simpler

```
Kbnf = self.pari_bnf(proof=proof)
return Kbnf.rnfisnorminit(relpoly._pari_with_name())
```



---

Comment by jdemeyer created at 2011-10-30 11:54:48

`@`was: truly fixing the whole Sage<->PARI variable conversion is possible but would require some serious redesigning.  Basically, before every computation, we should fix the PARI variables in the correct order.


---

Comment by jdemeyer created at 2011-10-30 20:28:25

Replying to [comment:9 was]:
> I would find out for myself, but with sage-4.7.2.alpha3, I get 13 hunks fail, so I can't apply the patch.  And I don't know which version of Sage this patch is against.

I just tried to apply all dependencies + this patch against sage-4.7.2.alpha4 without any problems at all.  Probably you missed some dependency.


---

Comment by jdemeyer created at 2011-11-03 16:14:43

Milestone sage-4.7.3 deleted


---

Attachment


---

Comment by cremona created at 2011-12-16 14:59:57

Applies fine to 4.8.alpha4.  Testing now.  I take the point that this may not be perfect but it's a lot better than it was, so I'll give it a positive review when the tests finish.  (Given the author I am not expecting a problem....)


---

Comment by cremona created at 2011-12-16 15:56:53

Happy Christmas!


---

Comment by cremona created at 2011-12-16 15:56:53

Changing status from needs_review to positive_review.


---

Comment by jdemeyer created at 2011-12-17 09:11:39

Happy Christmas to you too, and see you on monday!


---

Comment by jdemeyer created at 2011-12-17 09:11:39

Resolution: fixed
