# Issue 33029: Complex Plots EXAMPLE makes small image

Issue created by migration from https://trac.sagemath.org/ticket/33266

Original creator: @umedoblock

Original creation time: 2022-01-31 22:25:50

CC:  slelievre

I tried to run all of the EXAMPLE in [Complex Plots](https://doc.sagemath.org/html/en/reference/plotting/sage/plot/complex_plot.html)

## environment

```
macOS Monterey
Version 12.1
```



```
┌────────────────────────────────────────────────────────────────────┐
│ SageMath version 9.5.rc2, Release Date: 2022-01-16                 │
│ Using Python 3.9.9. Type "help()" for help.                        │
└────────────────────────────────────────────────────────────────────┘
┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
┃ Warning: this is a prerelease version, and it may be unstable.     ┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛
```


# Complex Plots EXAMPLE make small image:

## small image
![](/Users/umedoblock/.sage/temp/umec/75342/tmp_ey1c6_bv.png)

```
sage: sage: complex_plot(lambda z: z, (-3, 3), (-3, 3), figsize=[1,1]) 
....:                                                                           
Launched png viewer for Graphics object consisting of 1 graphics primitive
sage: sage: complex_plot(lambda z: z, (-3, 3), (-3, 3)).show(figsize=[1,1]) # Th
....: ese are equivalent 
```


## enough size image
![](/Users/umedoblock/.sage/temp/umec/75342/tmp_z9r2h9q_.png)

```
sage: sage: complex_plot(lambda z: z, (-3, 3), (-3, 3)).show(figsize=[10,10]) # 
....: These are equivalent 
....:  
....:                                                                           
Launched png viewer for Graphics object consisting of 1 graphics primitive
sage: sage: complex_plot(lambda z: z, (-3, 3), (-3, 3), figsize=[10,10]) 
....:                                                                           
Launched png viewer for Graphics object consisting of 1 graphics primitive
```



---

Attachment

small image


---

Comment by @umedoblock created at 2022-01-31 22:27:35

enough size image


---

Attachment


---

Comment by slelievre created at 2022-02-01 12:50:14

Changing type from PLEASE CHANGE to enhancement.


---

Comment by slelievre created at 2022-02-01 12:50:14

The examples could indeed include a `figsize` setting.

So we could change the examples along the lines of

```diff
- sage: complex_plot(lambda z: z, (-3, 3), (-3, 3))
+ sage: G = complex_plot(lambda z: z, (-3, 3), (-3, 3))
+ sage: G.show(figsize=8)
```



---

Comment by slelievre created at 2022-02-01 12:50:14

Changing component from PLEASE CHANGE to graphics.
