# Issue 21955: Insufficient checks when constructing matrix group elements from GAP

Issue created by migration from https://trac.sagemath.org/ticket/22192

Original creator: pbruin

Original creation time: 2017-01-16 15:28:21

In Sage 7.5:

```
sage: G = GL(2, GF(2))
sage: H = G.subgroup([])
sage: g = G([[0, 1], [1, 0]])
sage: H(g.gap())
[0 1]
[1 0]
```

This should raise an error since `g` is not in `H`.



---

Comment by pbruin created at 2017-01-17 15:39:07

This is not so straightforward since for e.g. matrix groups over *Z*, testing membership seems to cause infinite(?) loops in GAP:

```
sage: a = matrix(ZZ,2,[1,1,0,1])
sage: b = matrix(ZZ,2,[1,0,1,1])
sage: G = MatrixGroup([a])
sage: G(b)  # seems to run forever
```

We could decide to add checks only over finite base rings.


---

Comment by pbruin created at 2017-01-17 17:23:59

First attempt (does not work due to the above and other reasons)
