# Issue 13258: log plots blank with points, but fine with lines

Issue created by migration from Trac.

Original creator: jason

Original creation time: 2012-09-04 14:35:12

Assignee: jason, was

CC:  kcrisman ppurka

Inspired by http://ask.sagemath.org/question/1743/list_plot_semilogy-not-working, look at this.  The following three plots are all blank (and the log axes also seem blank)


```
import mpmath
ber = [0.5*mpmath.erfc(i)/sqrt(2) for i in range(10)]
points(enumerate(ber)).show(scale='semilogx')
points(enumerate(ber)).show(scale='semilogy')
points(enumerate(ber)).show(scale='loglog')
```


while the following (obtained by changing `points` to `line`) seem to work fine.


```
import mpmath
ber = [0.5*mpmath.erfc(i)/sqrt(2) for i in range(10)]
line(enumerate(ber)).show(scale='semilogx')
line(enumerate(ber)).show(scale='semilogy')
line(enumerate(ber)).show(scale='loglog')
```



---

Comment by ppurka created at 2012-09-05 02:17:30

The problem seems more generic. This works:

```
sage: list_plot_semilogy([10^-i for i in range(3)])
```

This doesn't work:

```
sage: list_plot_semilogy([10^-i for i in range(4)])
```

So, the bug might be in points itself, or in matplotlib.


---

Comment by ppurka created at 2012-10-08 10:54:38

About the second plot in comment:1 - this is fixed on adding #13528. Don't ask me why. `<sup>_</sup>`

About the original question, the problem with the plot is that the point `x=0` is present in the plot. This is a documented fail situation - look at the doc `list_plot?` or `point2d?`, both of which mention that non-positive points should not be used in the log scale. This is the reason why `point` works with `semilogy` scale and not with `semilogx` or `loglog`.

Instead, both these commands work:

```
sage: points(zip(*(range(1,len(ber)+1), ber))).show(scale='loglog')
sage: points(zip(*(range(1,len(ber)+1), ber))).show(scale='semilogx')
```


If you want to use the `x=0` point, then use `list_plot` along with `plotjoined=True, linestyle='', marker='o'`:

```
sage: list_plot(list(enumerate(ber)), plotjoined=True, linestyle='', marker='o').show(scale='semilogx')
sage: list_plot(list(enumerate(ber)), plotjoined=True, linestyle='', marker='o').show(scale='semilogy')
sage: list_plot(list(enumerate(ber)), plotjoined=True, linestyle='', marker='o').show(scale='loglog')
```

This latter command runs through the `line` command in Sage, which uses the usual `plot` of matplotlib. `plotjoined=False` runs through the `point` command of Sage, which uses the `scatter` command of matplotlib. So, the failure of `x=0` in log scale is from the scatter command in matplotlib.


---

Comment by ppurka created at 2013-02-03 05:19:08

Works for me (TM)


---

Comment by ppurka created at 2013-02-03 05:19:08

Changing status from new to needs_review.


---

Comment by ppurka created at 2013-02-03 05:19:18

Changing status from needs_review to positive_review.


---

Comment by jdemeyer created at 2013-02-03 19:19:39

Resolution: worksforme
