# Issue 15978: A missing "import" in DiGraph

Issue created by migration from Trac.

Original creator: ncohen

Original creation time: 2014-04-23 09:01:44


```
sage: Graph([(0,1),(0,1)],multiedges=False)
ValueError: Non-multigraph input dict has multiple edges (0,1)
sage: DiGraph([(0,1),(0,1)],multiedges=False)
...
NameError: global name 'choice' is not defined
```


The first message is much clearer `:-P`

Nathann


---

Comment by ncohen created at 2014-04-23 09:02:24

Changing status from new to needs_review.


---

Comment by ncohen created at 2014-04-23 09:03:00

New commits:


---

Comment by vdelecroix created at 2014-04-23 09:52:12

Changing status from needs_review to needs_work.


---

Comment by vdelecroix created at 2014-04-23 09:52:12

Could you instead replace

```
choice([v for v in data[u] if data[u].count(v) > 1])
```

with

```
(v for v in data[u] if data[u].count(v) > 1).next()
```

or anything similar. The function `choice` involves some randomness that is useless here.


---

Comment by ncohen created at 2014-04-23 12:51:36

But it's funny... And it has been there from the start, and there is the same in Graph !

Nathann


---

Comment by vdelecroix created at 2014-04-23 18:19:22

It is funny, but it was wrong and nobody noticed... so the simplest, the best. Especially in the code of a complicated constructor (~600 lines for the one in Graph). And as you mentioned, It would be better to remove the one in Graph as well ;-P

Vincent


---

Comment by ncohen created at 2014-04-23 18:24:45

For me the simplest is to add the missing line. If you want to solve it differently, add a commit. There is nothing tricky involved, you do not need me to write it.

Nathann


---

Comment by vdelecroix created at 2014-04-23 18:54:20

We now have

```
sage: Graph([(0,1),(0,1)], multiedges=False)
Traceback (most recent call last):
...
ValueError: Non-multigraph got several edges (0,1)
sage: DiGraph([(0,1),(0,1)], multiedges=False)
Traceback (most recent call last):
...
ValueError: Non-multidigraph got several edges (0,1)
```


Needs review.
----
New commits:


---

Comment by vdelecroix created at 2014-04-23 18:54:20

Changing keywords from "" to "graph, digraph, multiedges, error".


---

Comment by vdelecroix created at 2014-04-23 18:54:20

Changing status from needs_work to needs_review.


---

Comment by ncohen created at 2014-04-23 19:04:26

All tests pass, good to go !

Nathann


---

Comment by ncohen created at 2014-04-23 19:04:26

Changing status from needs_review to positive_review.


---

Comment by vdelecroix created at 2014-04-23 19:05:04

Thanks !


---

Comment by vbraun created at 2014-04-28 20:11:24

Reviewer name


---

Comment by vdelecroix created at 2014-04-28 20:46:35

Replying to [comment:10 vbraun]:
> Reviewer name

Sorry. Here it is.


---

Comment by vbraun created at 2014-04-30 08:12:31

Resolution: fixed
