# Issue 18361: reduce method of polynomial ideals gives incorrect results

Issue created by migration from https://trac.sagemath.org/ticket/18598

Original creator: lftabera

Original creation time: 2015-06-03 11:50:04

CC:  dimpase

The following fails


```
sage: K=PolynomialRing(QQ,'x,y,a0,a1',order=TermOrder('degrevlex',2)+TermOrder('degrevlex',2))
sage: x,y,a0,a1=K.gens()
sage: f = x**3+x**2*y
sage: m = Ideal(x**4,x**2*y,y**2)
sage: m.reduce(f) == f.reduce(m.groebner_basis())
False
sage: m.reduce(f)
x^3 + x^2*y
sage: f.reduce(m.groebner_basis())
x^3
```


The reduction should be `x^3`. Singular computes correctly the reduction, so the problem is in the Sage library.


---

Comment by lftabera created at 2018-06-30 07:25:43

Changing keywords from "" to "days94".


---

Comment by lftabera created at 2018-06-30 10:16:59

I am not able to debug this. For me, it seems that this is an error in libsingular and, probably, a duplicate of #12529


---

Comment by vdelecroix created at 2018-08-03 19:20:18

update milestone 8.3 -> 8.4


---

Comment by @mwageringel created at 2020-08-30 08:07:50

This works correctly in 9.2.beta10, possibly since #27508.


---

Comment by @mwageringel created at 2020-08-30 08:07:50

Changing status from new to needs_review.


---

Comment by dimpase created at 2020-08-30 18:53:21

indeed


---

Comment by dimpase created at 2020-08-30 18:53:21

Changing status from needs_review to positive_review.


---

Comment by slelievre created at 2020-10-11 17:06:57

Resolution: worksforme
