# Issue 19683: sage: matrix.ones(10).apply_map(lambda x:int(1)) raises an exception

Issue created by migration from https://trac.sagemath.org/ticket/19920

Original creator: ncohen

Original creation time: 2016-01-20 19:49:47

CC:  vdelecroix

This is a pretty simple bug report:


```
sage: matrix.ones(10).apply_map(lambda x:int(1))
TypeError: base_ring (=<type 'int'>) must be a ring
```


It looks a bit 'forced' when you specify 'int' directly, but it works without it from the inside of a .py file.


---

Comment by vdelecroix created at 2016-01-20 19:52:20

This works at least

```
sage: matrix.ones(10).apply_map(lambda x:int(1), R=ZZ)
[1 1 1 1 1 1 1 1 1 1]
[1 1 1 1 1 1 1 1 1 1]
[1 1 1 1 1 1 1 1 1 1]
[1 1 1 1 1 1 1 1 1 1]
[1 1 1 1 1 1 1 1 1 1]
[1 1 1 1 1 1 1 1 1 1]
[1 1 1 1 1 1 1 1 1 1]
[1 1 1 1 1 1 1 1 1 1]
[1 1 1 1 1 1 1 1 1 1]
[1 1 1 1 1 1 1 1 1 1]
```



---

Comment by ncohen created at 2016-01-20 19:53:52

Yepyep. Even without the 'R='. Clearly it is not a big problem, for me at least. I just thought it might be worth fixing. I am actually surprised that 'apply_map' seems to guess the ring differently from the matrix constructor, e.g. the following works:


```
sage: matrix([[int(1)]])
[1]
```


Nathann


---

Comment by vdelecroix created at 2016-01-20 20:10:10

New commits:


---

Comment by vdelecroix created at 2016-01-20 20:10:10

Changing status from new to needs_review.


---

Comment by ncohen created at 2016-01-21 06:56:53

Helloooooooooo !

Thanks for the branch. It seems to do the job well, though the patchbot reports several broken doctest.

And I will use the matrix constructor and apply_map a bit more carefully, now that I know that they create several copies of the data in the process of deducing the ring.

Nathann


---

Comment by ncohen created at 2016-01-21 06:57:02

Changing status from needs_review to needs_work.


---

Comment by git created at 2016-01-21 11:24:48

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by vdelecroix created at 2016-01-21 11:26:08

If you want to minimized preprocessing, you should construct the associated matrix space

```
sage: M = MatrixSpace(ZZ,4)
sage: M(range(16))
[ 0  1  2  3]
[ 4  5  6  7]
[ 8  9 10 11]
[12 13 14 15]
```



---

Comment by vdelecroix created at 2016-01-21 11:26:17

Changing status from needs_work to needs_review.


---

Comment by ncohen created at 2016-01-21 17:18:44

Changing status from needs_review to positive_review.


---

Comment by ncohen created at 2016-01-21 17:18:44

Works for me !

Thank you very much `:-)`

Nathann


---

Comment by vbraun created at 2016-01-24 12:52:44

Resolution: fixed
