# Issue 22230: hypergeometric 2F1 bug

Issue created by migration from https://trac.sagemath.org/ticket/22467

Original creator: rws

Original creation time: 2017-02-28 08:34:54

CC:  slelievre

The result of expansion of a `2F1` expression using `simplify_hypergeometric` differs when substituting `x` with a numeric versus computing the numeric directly:

```
sage: hypergeometric((-1/3,4/3),(7/3,),x)
hypergeometric((-1/3, 4/3), (7/3,), x)
sage: _.simplify_hypergeometric()
4/9*(-x + 1)^(2/3)*gen_legendre_P(1/3, -4/3, -2*x + 1)*gamma(1/3)/(-x)^(2/3)      # not verified
sage: _.subs(x==-5/11)
176/45*(5/11)^(1/3)*(2/11)^(2/3)*gen_legendre_P(1/3, -4/3, 21/11)*gamma(1/3)
sage: _.n(200)
-0.53941834251374840921300901563397867197519834837178347048562 + 0.93429997576840318754064074204329937894765008653252481028466*I
sage: hypergeometric((-1/3,4/3),(7/3,),-5/11)
hypergeometric((-1/3, 4/3), (7/3,), -5/11)
sage: _.n(200)     # verified by Alpha
1.0788366850274968184260180312679573439503966967435669409712
sage: (5/11)^(1/3)*(2/11)^(2/3)
(5/11)^(1/3)*(2/11)^(2/3)
sage: _.n(200)
0.24676523787226423377437176997086265498228252449900881429858
sage: gen_legendre_P(1/3, -4/3, 21/11)
gen_legendre_P(1/3, -4/3, 21/11)
sage: _.n(200)     # verified by Alpha
-0.20863099380558942774105138711985994226338270038962969500434 + 0.36135948130486860453162137841966370046727111778651381582091*I
```

Is the expansion wrong?


---

Comment by rws created at 2017-02-28 16:19:24

Changing status from new to needs_review.


---

Comment by rws created at 2017-02-28 16:19:24

User error. Assumptions given earlier interferred with `simplify_hypergemetric`.


---

Comment by rws created at 2017-02-28 16:19:40

Changing status from needs_review to positive_review.


---

Comment by rws created at 2017-02-28 16:29:21

Changing status from positive_review to needs_work.


---

Comment by rws created at 2017-02-28 16:29:21

Hijacking ticket to prevent waste. Quite a similar error, this time for real.


---

Comment by chapoton created at 2018-01-06 20:29:44

This is an issue in conversion from maxima:

```
sage: maxima('((1-(sqrt(5)-1)/(2*sqrt(5)))^(1/10)*assoc_legendre_p(-4/5,-1/5,1-(
....: sqrt(5)-1)/sqrt(5))*gamma(1/5))/(5*((sqrt(5)-1)/(2*sqrt(5)))^(1/10))')
((1-(sqrt(5)-1)/(2*sqrt(5)))^(1/10)*assoc_legendre_p(-4/5,-1/5,1-(sqrt(5)-1)/sqrt(5))*gamma(1/5))/(5*((sqrt(5)-1)/(2*sqrt(5)))^(1/10))
sage: bla=_
sage: bla.sage()
0
```



---

Comment by chapoton created at 2018-01-06 20:31:45

Probably boils down to 

```
sage: maxima('assoc_legendre_p(-4/5,-1/5,1)')
assoc_legendre_p(-4/5,-1/5,1)
sage: _.sage()
0
```

which in turn comes from

```
sage: gen_legendre_P(-4/5,-1/5,x)
0
```



---

Comment by rws created at 2018-01-07 07:17:32

mpmath returns `0.000000000000000` with

```
        import mpmath
        from sage.libs.mpmath.all import call as mpcall
        mpcall(mpmath.legenp, -0.8, -0.2, 1)
```

and Wolfram Alpha agrees with it but also agrees with the nonzero value for the 2F1 expression so the simplification by Maxima seems wrong.

On another note there is this in `Func_assoc_legendre_P._eval_special_values(self,n,m,x)`:

```
        if m > n:
            return ZZ(0)
```

However in Wikipedia that if |m|>l then P<sub>l</sub><sup>m</sup>=0, so the code seems wrong (missing the abs).


---

Comment by rws created at 2018-01-07 07:40:59

Confirmation from arb:

```
sage: CBF(1/10*sqrt(5)*(sqrt(5) - 1)).hypergeometric([1/5,4/5],[6/5])
[1.0429660590683 +/- 5.27e-14]
sage: CBF(1).legendre_P(-4/5,-1/5)
0
```



---

Comment by chapoton created at 2018-01-07 08:19:39

Maybe because Legendre polynomials can be extended to rational parameters either by 0 or by hypergeometric functions. What we see looks like a clash of extensions, no ?


---

Comment by rws created at 2018-01-07 12:05:29

No, the relevant extension is http://dlmf.nist.gov/14.3.E6 and it holds for x > 1 but the 2F1 argument here is 0.276 which makes x around 0.447, i.e. < 1. Agree?


---

Comment by slelievre created at 2021-11-26 23:33:13

Changing status from needs_work to needs_review.


---

Comment by slelievre created at 2021-11-26 23:33:13

Seems to have been fixed, maybe by #25034
(merged in Sage 9.3.rc5)?

In Sage 9.3 and above:

```
sage: a = hypergeometric((1/5, 4/5), (6/5,), 1/10*sqrt(5)*(sqrt(5) - 1))
sage: a.n()
1.04296605906833
sage: b = a.simplify_hypergeometric()
sage: b
2/5*5^(19/20)*(1/10)^(9/10)*(-1/10*sqrt(5)*(sqrt(5) - 1)
+ 1)^(1/10)*gamma(1/5)*gen_legendre_P(-4/5, -1/5,
-1/5*sqrt(5)*(sqrt(5) - 1) + 1)/(sqrt(5) - 1)^(1/10)
sage: b.n()
1.04296605906833
```



---

Comment by dimpase created at 2021-11-27 11:52:11

Changing status from needs_review to positive_review.


---

Comment by mkoeppe created at 2021-12-01 02:46:14

Resolution: invalid
