# Issue 31815: 5 failing doctests in src/sage/graphs

Issue created by migration from https://trac.sagemath.org/ticket/32052

Original creator: slabbe

Original creation time: 2021-06-24 12:00:27

On Ubuntu 18.04, with 9.4.beta3 and the following optional packages installed:


```
Using --optional=4ti2,build,ccache,cryptominisat,debian,dochtml,dot2tex,
e_antic,fricas,glucose,latte_int,lidia,normaliz,notedown,pandoc_attributes,
pip,pycosat,pynormaliz,rst2ipynb,sage,sage_numerical_backends_coin,
sage_spkg
```


the command


```
sage -tp src/sage/graphs/graph.py src/sage/graphs/generic_graph.py
```


gives


```
sage -t --long --random-seed=0 src/sage/graphs/graph.py
**********************************************************************
File "src/sage/graphs/graph.py", line 4236, in sage.graphs.graph.Graph.has_homomorphism_to
Failed example:
    g.has_homomorphism_to(graphs.CycleGraph(4)) is not False
Expected:
    False
Got:
    True
**********************************************************************
File "src/sage/graphs/graph.py", line 4631, in sage.graphs.graph.Graph.minor
Failed example:
    L = g.minor(graphs.CompleteGraph(3))
Expected:

    Traceback (most recent call last):
    ...
    ValueError: This graph has no minor isomorphic to H !
Got:
    <BLANKLINE>
**********************************************************************
File "src/sage/graphs/graph.py", line 5841, in sage.graphs.graph.Graph.topological_minor
Failed example:
    g.topological_minor(graphs.CycleGraph(3))
Expected:
    False
Got:
    Subgraph of (Subgraph of (RandomGNP(15,0.300000000000000))): Graph on 0 vertices
**********************************************************************
3 items had failures:
   1 of  10 in sage.graphs.graph.Graph.has_homomorphism_to
   1 of  14 in sage.graphs.graph.Graph.minor
   1 of   7 in sage.graphs.graph.Graph.topological_minor
    2 mcqd tests not run
    2 not tested tests not run
    13 python_igraph tests not run
    0 tests not run because we ran out of time
    [1216 tests, 3 failures, 21.32 s]

sage -t --long --random-seed=0 src/sage/graphs/generic_graph.py
**********************************************************************
File "src/sage/graphs/generic_graph.py", line 8879, in sage.graphs.generic_graph.GenericGraph.nowhere_zero_flow
Failed example:
    h = g.nowhere_zero_flow(k=3)
Expected:

    Traceback (most recent call last):
    ...
    EmptySetError: the problem has no feasible solution
Got:
    <BLANKLINE>
**********************************************************************
File "src/sage/graphs/generic_graph.py", line 9500, in sage.graphs.generic_graph.GenericGraph.disjoint_routed_paths
Failed example:
    p1,p2 = g.disjoint_routed_paths([((0, 0), (4, 4)), ((0, 4), (4, 0))])
Expected:

    Traceback (most recent call last):
    ...
    EmptySetError: the disjoint routed paths do not exist
Got:
    <BLANKLINE>
**********************************************************************
2 items had failures:
   1 of   5 in sage.graphs.generic_graph.GenericGraph.disjoint_routed_paths
   1 of  29 in sage.graphs.generic_graph.GenericGraph.nowhere_zero_flow
    17 bliss tests not run
    6 not tested tests not run
    39 python_igraph tests not run
    0 tests not run because we ran out of time
    [3535 tests, 2 failures, 37.33 s]
```



---

Comment by dcoudert created at 2021-07-01 17:43:23

I don't see these errors on macOS (I tried before installing abc, and before installing cplex). For instance, I get.

```
sage: g = graphs.CycleGraph(9)                                                                                                                     
sage: g.has_homomorphism_to(graphs.CycleGraph(4)) is not False                                                                                     
False
sage: g.has_homomorphism_to(graphs.CycleGraph(4), solver='glpk') is not False                                                                      
False
sage: g.has_homomorphism_to(graphs.CycleGraph(4), solver='cplex') is not False                                                                     
False
sage: g.has_homomorphism_to(graphs.CycleGraph(4), solver='Coin') is not False                                                                      
False
```

May be it's due to cbc/coin ?


---

Comment by slabbe created at 2021-07-02 10:49:42

Indeed, this is what I get:


```
sage: g = graphs.CycleGraph(9)                                                          
sage: g.has_homomorphism_to(graphs.CycleGraph(4))                                       
{1: 1, 2: 0, 3: 1, 4: 0, 5: 1, 6: 0, 7: 1}
sage: g.has_homomorphism_to(graphs.CycleGraph(4), solver='Coin')                        
{1: 1, 2: 0, 3: 1, 4: 0, 5: 1, 6: 0, 7: 1}
sage: g.has_homomorphism_to(graphs.CycleGraph(4), solver='glpk')                        
Long-step dual simplex will be used
False
```



---

Comment by slabbe created at 2021-07-02 10:54:41

In fact, this is a duplicate of #30635.

I suggest to close this ticket.


---

Comment by slabbe created at 2021-07-02 10:54:41

Changing status from new to needs_review.


---

Comment by dcoudert created at 2021-07-02 12:10:31

Changing status from needs_review to positive_review.


---

Comment by dcoudert created at 2021-07-02 12:10:31

I agree.


---

Comment by chapoton created at 2021-07-02 19:58:05

Resolution: duplicate
