# Issue 10087: numerical_integral fails for xonstant expressions

Issue created by migration from https://trac.sagemath.org/ticket/10088

Original creator: lftabera

Original creation time: 2010-10-06 14:22:45

Assignee: jason, jkantor

Keywords: numerical_integral

numerical_integral fails for constant expressions


```
sage: f = x
sage: g = x-1
sage: numerical_integral(f,-2,2)
(0.0, 4.4389290910485955e-14)
sage: numerical_integral(g,-2,2)
(-4.0, 5.550866604629029e-14)
sage: numerical_integral(f+g, -2, 2)
(-4.0, 9.4350890128471666e-14)
sage: numerical_integral(f-g, -2, 2)
---------------------------------------------------------------------------
ValueError                                Traceback (most recent call last)

/home/luisfe/Varios/quotes/intradia/<ipython console> in <module>()

/opt/SAGE/sage-4.5.2/local/lib/python2.6/site-packages/sage/gsl/integration.so in sage.gsl.integration.numerical_integral (sage/gsl/integration.c:1551)()

ValueError: Integrand has wrong number of parameters

sage: type(f-g)
<type 'sage.symbolic.expression.Expression'>
sage: f-g
1
```



---

Comment by dsm created at 2011-02-19 08:19:18

The patch simply reuses the existing constant-case line in the symbolic expression branch.


---

Comment by lftabera created at 2011-02-19 11:57:12

Is it ready for review? The patch looks right, I will check it.


---

Comment by dsm created at 2011-02-22 09:03:37

Changing status from new to needs_review.


---

Comment by dsm created at 2011-02-24 14:02:19

allow constant (i.e. variable-free) symbolic expressions in numerical_integral


---

Comment by lftabera created at 2011-02-26 12:34:08

Changing status from needs_review to positive_review.


---

Attachment

The patch solves the problem as expected.


---

Comment by jdemeyer created at 2011-03-17 19:22:50

Resolution: fixed
