# Issue 34065: incorrect computations in Singular ring of characteristic > 2^29

Issue created by migration from https://trac.sagemath.org/ticket/34302

Original creator: lorenz

Original creation time: 2022-08-08 04:26:22

Example (Sage 9.6):


```sage
sage: # correct
sage: F.<t> = GF((2^29-3, 2))
sage: R.<x> = PolynomialRing(F, implementation='singular')
sage: ~R(t)
(-t - 1)
```


```sage
sage: # incorrect
sage: F.<t> = GF((2^29+11, 2))
sage: R.<x> = PolynomialRing(F, implementation='singular')
sage: ~R(t)
0
```


Moreover, after running the incorrect example, the correct one becomes incorrect too, hinting at some kind of state corruption.


---

Comment by @DaveWitteMorris created at 2022-08-08 05:19:23

The [singular manual](https://www.singular.uni-kl.de/hannes/sing_411.htm) says "the characteristic of a prime field in the factory routines must be less than 536870912 (2<sup>29</sup>)".  So I think we should be throwing an error in this situation.
