# Issue 23113: Doctest: gamma() and log_gamma() return types

archive/issues_023113.json:
```json
{
    "body": "`gamma` and `log_gamma` don't return the input type. This should be the correct behaviour but actually `CC` elements are returned at the moment:\n\n```\nsage: gamma(CDF(1,1))\n0.49801566811835607 - 0.15494982830181067*I\nsage: type(_)\n<type 'sage.rings.complex_double.ComplexDoubleElement'>\nsage: gamma(CIF(1,1))\n0.49801566811835607? - 0.15494982830181068?*I\nsage: type(_)\n<type 'sage.rings.complex_interval.ComplexIntervalFieldElement'>\n\nsage: log_gamma(RDF(-2.5))\n-0.056243716497674054 - 9.42477796076938*I\nsage: type(_)\n<type 'sage.rings.complex_double.ComplexDoubleElement'>\nsage: log_gamma(RIF(-2.5))\n-0.056243716497674054? - 9.4247779607693794?*I\nsage: type(_)\n<type 'sage.rings.complex_interval.ComplexIntervalFieldElement'>\n```\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/23350\n\n",
    "created_at": "2017-07-02T07:23:53Z",
    "labels": [
        "symbolics",
        "major",
        "bug"
    ],
    "title": "Doctest: gamma() and log_gamma() return types",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/23113",
    "user": "rws"
}
```
`gamma` and `log_gamma` don't return the input type. This should be the correct behaviour but actually `CC` elements are returned at the moment:

```
sage: gamma(CDF(1,1))
0.49801566811835607 - 0.15494982830181067*I
sage: type(_)
<type 'sage.rings.complex_double.ComplexDoubleElement'>
sage: gamma(CIF(1,1))
0.49801566811835607? - 0.15494982830181068?*I
sage: type(_)
<type 'sage.rings.complex_interval.ComplexIntervalFieldElement'>

sage: log_gamma(RDF(-2.5))
-0.056243716497674054 - 9.42477796076938*I
sage: type(_)
<type 'sage.rings.complex_double.ComplexDoubleElement'>
sage: log_gamma(RIF(-2.5))
-0.056243716497674054? - 9.4247779607693794?*I
sage: type(_)
<type 'sage.rings.complex_interval.ComplexIntervalFieldElement'>
```


Issue created by migration from https://trac.sagemath.org/ticket/23350





---

archive/issue_comments_323319.json:
```json
{
    "body": "With `log_gamma` it seems we follow the RR convention of switching to complex for negative input. This means either this convention has to be changed or the point is moot.",
    "created_at": "2017-12-03T16:53:19Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23113",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23113#issuecomment-323319",
    "user": "rws"
}
```

With `log_gamma` it seems we follow the RR convention of switching to complex for negative input. This means either this convention has to be changed or the point is moot.



---

archive/issue_comments_323320.json:
```json
{
    "body": "Changing status from new to needs_review.",
    "created_at": "2017-12-03T16:53:19Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23113",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23113#issuecomment-323320",
    "user": "rws"
}
```

Changing status from new to needs_review.



---

archive/issue_comments_323321.json:
```json
{
    "body": "Changing status from needs_review to positive_review.",
    "created_at": "2017-12-03T16:53:34Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23113",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23113#issuecomment-323321",
    "user": "rws"
}
```

Changing status from needs_review to positive_review.



---

archive/issue_comments_323322.json:
```json
{
    "body": "Resolution: wontfix",
    "created_at": "2017-12-12T08:23:33Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23113",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23113#issuecomment-323322",
    "user": "embray"
}
```

Resolution: wontfix



---

archive/issue_comments_323323.json:
```json
{
    "body": "with which version of Sage was it? With Sage 8.0 I get:\n\n```\nsage: gamma(CIF(1,1))\n0.498015668118356 - 0.154949828301811*I\nsage: type(_)\n<type 'sage.rings.complex_number.ComplexNumber'>\n```\n\nthus I don't get `ComplexIntervalFieldElement` as in the description.",
    "created_at": "2017-12-12T14:01:00Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23113",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23113#issuecomment-323323",
    "user": "zimmerma"
}
```

with which version of Sage was it? With Sage 8.0 I get:

```
sage: gamma(CIF(1,1))
0.498015668118356 - 0.154949828301811*I
sage: type(_)
<type 'sage.rings.complex_number.ComplexNumber'>
```

thus I don't get `ComplexIntervalFieldElement` as in the description.



---

archive/issue_comments_323324.json:
```json
{
    "body": "With 8.1:\n\n```\nsage: gamma(CIF(1,1))\n0.49801566811835607? - 0.15494982830181068?*I\nsage: type(_)\n<type 'sage.rings.complex_interval.ComplexIntervalFieldElement'>\n```\n",
    "created_at": "2017-12-12T14:04:30Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23113",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23113#issuecomment-323324",
    "user": "rws"
}
```

With 8.1:

```
sage: gamma(CIF(1,1))
0.49801566811835607? - 0.15494982830181068?*I
sage: type(_)
<type 'sage.rings.complex_interval.ComplexIntervalFieldElement'>
```

