# Issue 11061: failing calculation of an integral

Issue created by migration from Trac.

Original creator: casamayou

Original creation time: 2011-04-21 16:21:26

Assignee: burcin

CC:  zimmerma

Keywords: integrate

In the following calculation, Sage4.6.2 returns the opposite of the right result :


```
sage: var('a t')
(a, t)
sage: assume(a>0)
sage: assume(x>0)
sage: f = integrate(log(1+a/(x * t)^2), t, 1, oo)
sage: f
(sqrt(a)*x*log((x^2 + a)/x^2) - 2*a*arctan(sqrt(a)/x))/(sqrt(a)*x)
sage: f.subs(x=1, a=7).n()
-4.32025625668262
```


For information, Sage 4.6 gives the right result :


```
sage: var('a t')
(a, t)
sage: assume(a>0)
sage: assume(x>0)
sage: f = integrate(log(1+a/(x * t)^2), t, 1, oo)
sage: f
pi*sqrt(a)/x - (x*log((x2 + a)/x2) + 2*sqrt(a)*arctan(x/sqrt(a)))/x
sage: f.subs(x=1, a=7).n()
4.32025625668262
```


For information, Maple9 gives this :

```
> assume(a>0): assume(x>0):
> f := int(ln(1+a/(x * t)^2), t=1..infinity):
> lprint(f);
(2*ln(x)*x-2*a^(1/2)*arctan(x/a^(1/2))-ln(x^2+a)*x+a^(1/2)*Pi)/x
> evalf(subs(x=1, a=7, f));
bytes used=4000512, alloc=3341724, time=0.13
                                4.320256257
```





---

Comment by kcrisman created at 2011-04-21 17:10:44

I can confirm this in Maxima 5.24.0:

```

Maxima 5.24.0 http://maxima.sourceforge.net
using Lisp SBCL 1.0.24
Distributed under the GNU Public License. See the file COPYING.
Dedicated to the memory of William Schelter.
The function bug_report() provides bug reporting information.
(%i1) assume(a>0);
(%o1)                               [a > 0]
(%i2) assume(x>0);
(%o2)                               [x > 0]
(%i3) integrate(log(1+a/(x*t)^2),t,1,inf); 
                                  2
                                 x  + a             sqrt(a)
                   sqrt(a) x log(------) - 2 a atan(-------)
                                    2                  x
                                   x
(%o3)              -----------------------------------------
                                   sqrt(a) x
```

Looks like a different branch of log is being used.  Also for comparison, here is what GSL says:

```
sage: numerical_integral(log(1+7/(x^2)),1,oo)
(4.3202562566855764, 2.2384237933839469e-07)
```

We should file something with the Maxima tracker.


---

Comment by kcrisman created at 2011-04-22 01:18:31

This is now [this bug report](https://sourceforge.net/tracker/?func=detail&aid=3291160&group_id=4933&atid=104933) at the Maxima tracker.


---

Comment by kcrisman created at 2011-06-08 03:28:48

Apparently this is fixed upstream now.


---

Comment by jen created at 2012-03-19 21:13:23

Checking against 5.0.beta9, this looks good:


```
sage: var('a t')
(a, t)
sage: assume(a>0)
sage: assume(x>0)
sage: f = integrate(log(1+a/(x * t)^2), t, 1, oo)
sage: f
(sqrt(a)*x*log((x^2 + a)/x^2) - 2*a*arctan(sqrt(a)/x))/(sqrt(a)*x)
sage: f.subs(x=1, a=7).n()
4.32025625668262
```



---

Comment by kcrisman created at 2012-03-20 00:06:48

Okay, so then all we need is a doctest referring to this ticket.


---

Comment by mjo created at 2012-04-10 01:21:54

The scientific notation change in the `abs_tol` above is unrelated, but I'm 99% sure I did that and it's a little embarrassing =)


---

Comment by mjo created at 2012-04-10 01:21:54

Changing status from new to needs_review.


---

Comment by zimmerma created at 2012-04-17 08:44:45

I give a positive review. Thank you Michael!

Paul


---

Comment by zimmerma created at 2012-04-17 08:44:45

Changing status from needs_review to positive_review.


---

Comment by jdemeyer created at 2012-04-27 12:47:44

Changing status from positive_review to needs_work.


---

Comment by jdemeyer created at 2012-04-27 12:47:44

The patch needs to be rebased to sage-5.0.beta14:

```
applying sage-trac_11233.patch
patching file sage/symbolic/integration/integral.py
Hunk #1 FAILED at 580
1 out of 1 hunks FAILED -- saving rejects to file sage/symbolic/integration/integral.py.rej
patch failed, unable to continue (try -v)
patch failed, rejects left in working dir
errors during apply, please fix and refresh sage-trac_11233.patch
```



---

Comment by zimmerma created at 2012-04-27 12:57:54

Michael, please can you rebase your patch?

Paul


---

Comment by mjo created at 2012-04-27 19:31:36

Rebased patch on 5.0.beta14


---

Attachment

Sure, done.


---

Comment by mjo created at 2012-04-27 19:32:16

Changing status from needs_work to needs_review.


---

Comment by zimmerma created at 2012-04-30 17:49:21

I only checked that the rebased patch applies cleanly to sage 5.0.beta10, and that the integral returns
the correct result, assuming the rest did not change.

Paul


---

Comment by zimmerma created at 2012-04-30 17:49:21

Changing status from needs_review to positive_review.


---

Comment by zimmerma created at 2012-04-30 17:50:09

oops, that should be "sage.5.0.beta14" above.

Paul


---

Comment by jdemeyer created at 2012-05-06 12:14:29

Resolution: fixed
