# Issue 30724: multiple bugs in NumberField element constructor

Issue created by migration from https://trac.sagemath.org/ticket/30961

Original creator: mmezzarobba

Original creation time: 2020-11-25 15:17:09

Lists of elements with arbitrary parents are accepted:

```
sage: x = SR.var('x')
sage: QQi = i.parent()
sage: QQi((x,x))
(I + 1)*x
```


However, some lists that arguably should be accepted for consistency are not:

```
sage: QQi("1")
1
sage: QQi(("1", "2"))
...
TypeError: can't multiply sequence by non-int of type 'sage.rings.number_field.number_field_element_quadratic.NumberFieldElement_gaussian'
```


Additionally, lists and vector inputs behave differently for no clear reason:

```
sage: QQi(RR(1))
1
sage: QQi((RR(1), RR(2)))
1.00000000000000 + 2.00000000000000*I
sage: _.parent()
Complex Field with 53 bits of precision
sage: QQi(vector((RR(1), RR(2))))
...
TypeError: unable to convert (1.00000000000000, 2.00000000000000) to Number Field in I with defining polynomial x^2 + 1 with I = 1*I
```



---

Comment by mmezzarobba created at 2020-11-25 15:25:48

New commits:


---

Comment by mmezzarobba created at 2020-11-25 15:25:48

Changing status from new to needs_review.


---

Comment by slelievre created at 2020-12-01 12:47:47

These are welcome fixes.


---

Comment by slelievre created at 2020-12-01 12:47:47

Changing status from needs_review to positive_review.


---

Comment by mmezzarobba created at 2020-12-01 13:18:18

merci !


---

Comment by vbraun created at 2020-12-06 12:49:24

Resolution: fixed
