# Issue 10640: SymmetricGroup function doesn't seem to do arbitrary sets

Issue created by migration from Trac.

Original creator: arattan

Original creation time: 2011-01-26 16:43:30

Assignee: sage-combinat

CC:  jdemeyer

Keywords: SymmetricGroup

The following doesn't seem right to me.  I tried this on sage 4.5.3 and 4.6.  My impression is that the SymmetricGroup function can take a list of distinct integers X as an argument and give the symmetric group S_X.  However, we can try the following.

sage: f=SymmetricGroup([1,2,4])
sage: for i in f:
....:     print i
....: 

()
(2,3)
(1,2)
(1,2,3)
(1,3,2)
(1,3)
sage: f[3]
(1,2,3)
sage: f[3](4)
4
sage: f[3](3)
1
sage: f.set()
(1, 2, 4)

Thus, it seems that f.set() returns that right support, but in fact the support for the group is 1,2,3.  This suggests to me that S_X = S_{1,2,3}.


---

Comment by mhansen created at 2011-01-26 16:52:12

This should be fixed by #10335


---

Comment by mhansen created at 2012-03-29 07:18:10

This can indeed be closed:


```

sage: f=SymmetricGroup([1,2,4])
sage: for i in f:        
....:     print i
....:     
()
(2,4)
(1,2)
(1,2,4)
(1,4,2)
(1,4)
sage: f[3] 
(1,2,4)
sage: f[3](4)
1
sage: f[3](3)
3
sage: f.set()
/opt/sage/local/bin/sage-ipython:1: DeprecationWarning: (Since Sage Version 4.7.1) set is deprecated. Please use domain instead.
  #!/usr/bin/env python
{1, 2, 4}
```



---

Comment by tscrim created at 2012-05-11 22:40:15

Verified results that this can be closed.


---

Comment by tscrim created at 2012-05-11 22:40:15

Changing status from new to needs_review.


---

Comment by tscrim created at 2012-05-11 22:40:37

Changing status from needs_review to positive_review.


---

Comment by jdemeyer created at 2012-05-13 20:19:59

To mark as ticket as needing to be closed, you should put the milestone to _sage-duplicate/invalid/wontfix_.


---

Comment by jdemeyer created at 2012-05-21 08:01:41

Resolution: duplicate
