# Issue 15334: Incorrect zero test of complex symbolic expressions

Issue created by migration from Trac.

Original creator: mmezzarobba

Original creation time: 2013-12-23 11:16:04

Yet another example where symbolic expressions are abusively considered equivalent, even though `simplify()` has become a bit more careful.


```
sage: var('a,x')
(a, x)
sage: assume(a, 'complex')
sage: assume(x, 'complex')
sage: expr = a^(4*x) - (a^4)^x
sage: expr.is_zero()
True
sage: expr(a=I, x=1/2)
-2
```



---

Comment by rws created at 2015-01-31 16:46:08

Changing status from new to needs_review.


---

Comment by rws created at 2015-01-31 16:46:08

Appears to having been fixed and also already included in Sage.


---

Comment by rws created at 2015-01-31 17:42:48

Changing status from needs_review to needs_work.


---

Comment by rws created at 2015-02-02 09:32:39

Changing status from needs_work to needs_review.


---

Comment by rws created at 2015-02-02 09:32:39

New commits:


---

Comment by kcrisman created at 2015-02-03 03:05:21

Changing status from needs_review to positive_review.


---

Comment by kcrisman created at 2015-02-03 03:05:21

Indeed, one doesn't have to do any assumption at all to get the 'false' now.

```
sage: sage: var('a,x')
(a, x)
sage: (a, x)
(a, x)
sage: sage: expr = a^(4*x) - (a^4)^x
sage: sage: expr.is_zero()
False
```


If you want to remove the second

```
+            sage: assume(a, 'complex')
+            sage: assume(x, 'complex')
```

and then the `forget()` which I think is all superfluous, that would be great, but it's fine this way too.


---

Comment by vbraun created at 2015-02-17 20:50:35

Resolution: fixed
