# Issue 13557: Segfault with Matrix_integer_2x2

Issue created by migration from Trac.

Original creator: robharron

Original creation time: 2012-11-26 20:16:01

Assignee: jason, was

Keywords: segfault, matrix_integer_2x2

The following code generates a segmentation fault:


```
sage: MS = sage.matrix.all.MatrixSpace(ZZ,2)
sage: M1 = sage.matrix.matrix_integer_2x2.Matrix_integer_2x2(MS, [1, 0, 0, 1], copy = True, coerce = True)
sage: M2 = Matrix(ZZ, 2, 2, [1, 0, 0, 1])
sage: M1 == M2
False
sage: M2 == M1
Unhandled SIGSEGV: ...
```

It generates a segfault for all other values of copy and coerce in the second line as well. Note however that the following code works perfectly fine:


```
sage: MS1 = sage.matrix.matrix_integer_2x2.MatrixSpace_ZZ_2x2()
sage: M1 = MS1([1, 0, 0, 1])
sage: MS2 = sage.matrix.all.MatrixSpace(ZZ, 2)
sage: M2 = MS2([1, 0, 0, 1])
sage: M1 == M2
True
sage: M2 == M1
True
```

One thing to point out is that the construction used in the segfault is that used by the code in arithgroup_element.py and congroup_pyx.pyx, so it may at least be worth to change those files to the non-disastrous construction.


---

Comment by jdemeyer created at 2015-03-17 12:35:18

Changing status from new to needs_review.


---

Comment by jdemeyer created at 2015-03-17 12:35:18

Obsolete since `Matrix_integer_2x2` no longer exists.


---

Comment by jdemeyer created at 2015-03-17 12:35:23

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2015-03-17 18:18:50

Resolution: fixed
