# Issue 30740: conversion of string to complex number with sage_eval should be avoided

Issue created by migration from https://trac.sagemath.org/ticket/30977

Original creator: edgarcosta

Original creation time: 2020-11-30 01:36:59

At the moment, a string is converted complex number with the aid of `sage_eval`,  however, if the precision of the field  is larger than the precision of the `RealLiteral` this leads to inconsistent results:

```
sage: R = ComplexField(57)
....: S = R._real_field()
....: S("-13.59658451496887") == R("-13.59658451496887").real()
True
sage: R("-13.59658451496887*I") ==  R("-13.59658451496887")*I
False
sage: R("-13.59658451496887*I") ==  R("0", "-13.59658451496887")
False
sage: R("0", "-13.59658451496887") == R("-13.59658451496887")*I
True
sage: R(-13.59658451496887*I) == R("-13.59658451496887*I")
True
sage: (-13.59658451496887*I).parent()
Complex Field with 54 bits of precision
```



---

Comment by mkoeppe created at 2021-02-13 20:51:01

Setting new milestone based on a cursory review of ticket status, priority, and last modification date.


---

Comment by @mwageringel created at 2022-05-10 20:25:17

I have added the comment from #32129 which was a duplicate of this ticket.
