# Issue 19847: residue: mathematically wrong output

Issue created by migration from https://trac.sagemath.org/ticket/20084

Original creator: behackl

Original creation time: 2016-02-18 21:53:45

CC:  rws cheuberg

The complex function `f(s) = 1/(1 - 2^(-s))` has poles of residue `1/log(2)` at `s = 2*k*pi*I/log(2)` for all integers `k`.

Currently sage recognize these poles just at `s=0`:


```
sage: f(s).residue(s==0)
1/log(2)
sage: f(s).residue(s==2*pi*I/log(2))
0
```


In essence, this happens because the `series`-method does not recognize the pole. The priority is critical because mathematically wrong output is produced.


---

Comment by behackl created at 2016-02-18 21:57:46

The most elegant solution would of course be the automatic simplification of expressions like `2^(something/log(2)) --> exp(something)`, such that

```
sage: 2^(2*pi*I/log(2))
1
```


However, I'm not sure if that can be achieved so easily.

A second suggestion would be something like

```diff
diff --git a/src/sage/symbolic/expression.pyx b/src/sage/symbolic/expression.pyx
index 3a5c864..175bcad 100644
--- a/src/sage/symbolic/expression.pyx
+++ b/src/sage/symbolic/expression.pyx
@@ -4076,7 +4076,7 @@ cdef class Expression(CommutativeRingElement):
             a = 0
         if a == infinity:
             return (-self.subs({x: 1/x}) / x**2).residue(x == 0)
-        return self.subs({x: x+a}).series(x == 0, 0).coefficient(x, -1)
+        return self.subs({x: x+a}).canonicalize_radical().series(x == 0, 0).coefficient(x, -1)
 
     def taylor(self, *args):
         r"""
```

where there are several ways to refine this approach: 

- introduce an additional keyword that could disable this additional simplification such that performance does not suffer necessarily,
- only try to simplify for complex arguments of `a`

and so on.

Thoughts?


---

Comment by behackl created at 2016-02-18 22:09:41

This is just the quick workaround from above.
----
New commits:


---

Comment by behackl created at 2016-02-18 22:09:41

Changing status from new to needs_info.


---

Comment by was created at 2016-02-19 02:26:08

Please add an example doctest to illustrate what you're fixing.


---

Comment by was created at 2016-02-19 02:26:08

Changing status from needs_info to needs_work.


---

Comment by git created at 2016-02-19 05:53:41

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by rws created at 2016-03-05 06:55:34

Is it ready for review?


---

Comment by mforets created at 2017-04-13 11:13:37

update from the future:


```
sage: (1/(1 - 2^-x)).residue(x == 2*pi*I/log(2))
1/log(2)
sage: version()
'SageMath version 7.6.beta6, Release Date: 2017-03-03'
```


some updates in `series` may affect that now it can recognize the pole without having to call `canonicalize_radical()`?


---

Comment by behackl created at 2017-04-13 14:12:12

Yes, I have faint memory of improving something with `series` itself some time ago; thanks for reminding me.

Actually, there are more problems with `residue`. Take, for example,


```
sage: (1/sqrt(x^2)).residue(x==0)
0
sage: (1/sqrt(x^2)).canonicalize_radical().residue(x==0)
1
```


(Note that this is, in some sense, a pathological example.)

The ideal fix in this case (IMHO) would be to throw an error that the residue could not be computed as the "correct" branch of the root could not be chosen automatically. I think that just applying `canonicalize_radical` before computing the residue just introduces more grief as the user looses all control over which branch is chosen.

In any case: the original problem reported with this ticket is solved, so this is probably just wontfix. Other opinions?


Replying to [comment:6 mforets]:
> update from the future:
> 
> {{{
> sage: (1/(1 - 2^-x)).residue(x == 2*pi*I/log(2))
> 1/log(2)
> sage: version()
> 'SageMath version 7.6.beta6, Release Date: 2017-03-03'
> }}}
> 
> some updates in `series` may affect that now it can recognize the pole without having to call `canonicalize_radical()`?


---

Comment by mforets created at 2017-04-17 17:21:12

Replying to [comment:7 behackl]:
> Yes, I have faint memory of improving something with `series` itself some time ago; thanks for reminding me.
> ...
> In any case: the original problem reported with this ticket is solved, so this is probably just wontfix. Other opinions?

cool. for what i've been told from other tickets, i suppose this one should should still provide the test (not wontfix): 


```
Check that :trac:`20084` is fixed::

    sage: (1/(1 - 2^-x)).residue(x == 2*pi*I/log(2))
    1/log(2)
```


> Actually, there are more problems with residue.
> ...
> (Note that this is, in some sense, a pathological example.)

yes. one could come up with other examples (e.g. examples involving log(z)). i agree that just applying `canonicalize_radical` is not a good idea for the reason you stated. but is there a simple way to identify these cases without much hurdle? does this belong to `series` method or is sth that can be done at the level of `residue`?


---

Comment by mforets created at 2017-05-05 17:24:34

`@`behackl : if you remove the `canonicalize_radical` keeping the test, i can review it! (or the other way round). 

wrt handling pathological examples, yes IMO it is a relevant future task, although as pointed out before i cannot help right now, since i'm not visualizing a workaround :/


---

Comment by chapoton created at 2017-05-18 19:19:39

Changing status from needs_work to positive_review.


---

Comment by chapoton created at 2017-05-18 19:19:39

looks good to me
----
New commits:


---

Comment by chapoton created at 2017-05-19 06:49:16

Changing priority from critical to major.


---

Comment by vbraun created at 2017-05-19 22:10:33

Resolution: fixed
