# Issue 21561: JH(22, [-1]).decomposition() raises ValueError

Issue created by migration from https://trac.sagemath.org/ticket/21798

Original creator: pbruin

Original creation time: 2016-11-02 10:39:11

CC:  mderickx


```
sage: JH(22, [-1]).decomposition()
Traceback (most recent call last):
...
ValueError: N (=22) should be a factor of the level                of this space (=11)
```



---

Comment by jdemeyer created at 2016-11-02 11:11:40

The funny                  spacing in the error message should also be fixed.


---

Comment by pbruin created at 2016-11-21 19:42:42

It seems the following is a more immediate example:

```
sage: ModularSymbols(GammaH(11, [-1]), 2).modular_symbols_of_level(22)
Traceback (most recent call last):
...
ValueError: N (=22) should be a factor of the level                of this space (=11)
```

This does work when replacing `GammaH(11, [-1])` by `Gamma1(11)` or `Gamma0(11)`.


---

Comment by pbruin created at 2016-11-22 07:03:51

The above error is apparently deliberate, according to the following comment in the method `sage.modular.modsym.ambient.ModularSymbolsAmbient_wtk_gamma_h.modular_symbols_of_level`:

```
# We deliberately don't allow N to be a multiple of the level here,
# because there are many possibilities for what H could be at the
# higher level (and we don't implement the degeneracy raising maps
# anyway)
```

A canonical choice for the `H` at higher level `N` is to take the inverse image of `H` in (*Z*/_N*_Z*)<sup>×</sup>.  However, we then still have to implement the degeneracy maps.  Doing this will require implementing the function `sage.modular.arithgroup.congroup.degeneracy_coset_representatives_gamma_h` and the method `sage.modular.modsym.ambient.ModularSymbolsAmbient_wtk_gamma_h._degeneracy_raising_matrix_1`.


---

Comment by pbruin created at 2016-11-22 10:23:46

After #21927, the error occurs slightly later on, and a `NotImplementedError` is raised instead of a `ValueError`.


---

Comment by pbruin created at 2016-12-20 08:33:34

Changing type from defect to enhancement.


---

Comment by pbruin created at 2016-12-20 10:09:19

A more immediate example:

```
sage: M = ModularSymbols(GammaH(22, [-1]), 2)
sage: N = ModularSymbols(GammaH(11, [-1]), 2)
sage: N.degeneracy_map(M, 1)
Traceback (most recent call last):
...
NotImplementedError:
```

