# Issue 22964: Hecke triangle group cusp form base ring

Issue created by migration from Trac.

Original creator: roed

Original creation time: 2017-06-09 17:00:23

CC:  jj


```
sage: from sage.modular.modform_hecketriangle.space import CuspForms
sage: MF = CuspForms(n=infinity, k=16)
sage: MF.category().base_ring()
Fraction Field of Univariate Polynomial Ring in d over Integer Ring
sage: MF.base_ring()
Integer Ring
```

The fact that these are different causes trouble:

```
sage: MF in MF.category()
False
```



---

Comment by roed created at 2017-06-09 17:00:54

Changing keywords from "" to "sd86.5".


---

Comment by roed created at 2017-06-09 22:23:33

New commits:


---

Comment by git created at 2017-06-09 22:38:15

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by roed created at 2017-06-09 22:48:12

Changing status from new to needs_review.


---

Comment by roed created at 2017-06-09 22:48:12

FYI, I ran tests and all passed.


---

Comment by saraedum created at 2017-06-09 23:27:51

Changing status from needs_review to positive_review.


---

Comment by jj created at 2017-06-10 10:42:08

Hi

I'm glad to see some interest in this. :-)

Just as a **side note** (I think the change is fine):

If we consider it as a commutative algebra over Z instead of Z[d] then one wouldn't be able to multiply by "d" in a commutative algebra sense.
This is relevant for normalization (e.g. differently normalized Eisenstein series wouldn't be related over multiplication by Z) and also for the relations between the polynomial ring in x,y,z over R[d] and the commutative algebra...

However that might be ok and in this case I assume it's mostly a practical change for the consistency of sage/category. Strictly speaking the base_ring should maybe also be R[d] and not R and we would need another name like "other_base_ring" for the previous base_ring (which is used in the construction logic e.g.). But if everything still works properly your solution is better :-).

''Also if necessary "d" could always be considered as e.g. an element of R.
Or one could just set "d"=1 and then remember to replace q by q/d in the end (and maybe add an appropriate power of d in front).''

Regards
Jonas

P.S. If there are questions about my implementation I offer my help. :-)


---

Comment by vbraun created at 2017-06-12 18:01:45

Resolution: fixed
