# Issue 25901: erroneous integral

archive/issues_025901.json:
```json
{
    "body": "Keywords: integral\n\nThe following computation is wrong (Sage 7.5.1):\n\n```\nsage: integral(arccos(cos(x)/(1+2*cos(x))),(x,0,pi/2))\n1/4*pi^2\n```\n\nIndeed, the actual value is 5/24*\\pi^2 .\n\nReference: Paul J. Nahin, \"Inside interesting integrals\", Springer, confirmed by a numerical computation with Maple.\n\nIssue created by migration from https://trac.sagemath.org/ticket/26138\n\n",
    "created_at": "2018-08-27T08:57:40Z",
    "labels": [
        "symbolics",
        "major",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-8.4",
    "title": "erroneous integral",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/25901",
    "user": "@MathieuCossard"
}
```
Keywords: integral

The following computation is wrong (Sage 7.5.1):

```
sage: integral(arccos(cos(x)/(1+2*cos(x))),(x,0,pi/2))
1/4*pi^2
```

Indeed, the actual value is 5/24*\pi^2 .

Reference: Paul J. Nahin, "Inside interesting integrals", Springer, confirmed by a numerical computation with Maple.

Issue created by migration from https://trac.sagemath.org/ticket/26138





---

archive/issue_comments_365481.json:
```json
{
    "body": "Which is also confirmed by `numerical_integral`:\n\n```\nsage: integral(arccos(cos(x)/(1+2*cos(x))),(x,0,pi/2))\n1/4*pi^2\nsage: n(_)\n2.46740110027234\nsage: numerical_integral(arccos(cos(x)/(1+2*cos(x))),0,pi/2)\n(2.056167583560283, 2.2828045937564967e-14)\nsage: n(5/24*pi^2)\n2.05616758356028\n```\n",
    "created_at": "2018-08-27T09:11:55Z",
    "issue": "https://github.com/sagemath/sagetest/issues/25901",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/25901#issuecomment-365481",
    "user": "slabbe"
}
```

Which is also confirmed by `numerical_integral`:

```
sage: integral(arccos(cos(x)/(1+2*cos(x))),(x,0,pi/2))
1/4*pi^2
sage: n(_)
2.46740110027234
sage: numerical_integral(arccos(cos(x)/(1+2*cos(x))),0,pi/2)
(2.056167583560283, 2.2828045937564967e-14)
sage: n(5/24*pi^2)
2.05616758356028
```




---

archive/issue_comments_365482.json:
```json
{
    "body": "Apparently, maxima returns a wrong primitive.\n\n```\nsage: f = arccos(cos(x)/(1+2*cos(x)))\nsage: g = f.integrate(x); g\n2*arccos((sin(x)^2/(cos(x) + 1)^2 - 1)/((2*(sin(x)^2/(cos(x) + 1)^2 - 1)/(sin(x)^2/(cos(x) + 1)^2 + 1) - 1)*(sin(x)^2/(cos(x) + 1)^2 + 1)))*arctan(sin(x)/(cos(x) + 1))\nsage: g.simplify_full()\n2*arccos(cos(x)/(2*cos(x) + 1))*arctan(sin(x)/(cos(x) + 1))\n```\n\n\n**EDIT**: But maxima itself does not return this answer:\n\n```\nmaxima.eval('integrate(arccos(cos(x)/(2*cos(x)+1)),x)')\n```\n",
    "created_at": "2019-06-22T18:52:17Z",
    "issue": "https://github.com/sagemath/sagetest/issues/25901",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/25901#issuecomment-365482",
    "user": "chapoton"
}
```

Apparently, maxima returns a wrong primitive.

```
sage: f = arccos(cos(x)/(1+2*cos(x)))
sage: g = f.integrate(x); g
2*arccos((sin(x)^2/(cos(x) + 1)^2 - 1)/((2*(sin(x)^2/(cos(x) + 1)^2 - 1)/(sin(x)^2/(cos(x) + 1)^2 + 1) - 1)*(sin(x)^2/(cos(x) + 1)^2 + 1)))*arctan(sin(x)/(cos(x) + 1))
sage: g.simplify_full()
2*arccos(cos(x)/(2*cos(x) + 1))*arctan(sin(x)/(cos(x) + 1))
```


**EDIT**: But maxima itself does not return this answer:

```
maxima.eval('integrate(arccos(cos(x)/(2*cos(x)+1)),x)')
```




---

archive/issue_comments_365483.json:
```json
{
    "body": "Maxima uses `acos`, as it turns out.  Anyway, the problem here somehow involves `domain:complex`, found in `sage/maxima_lib.py`:\n\n```\nMaxima 5.42.2 http://maxima.sourceforge.net\nusing Lisp ECL 16.1.2\nDistributed under the GNU Public License. See the file COPYING.\nDedicated to the memory of William Schelter.\nThe function bug_report() provides bug reporting information.\n(%i1) display2d:false;\n\n(%o1) false\n(%i2) domain:complex;\n\n(%o2) complex\n(%i3) integrate(acos(cos(x)/(2*cos(x)+1)),x);\n\n(%o3) 2*atan(sin(x)/(cos(x)+1))\n       *acos((1-sin(x)^2/(cos(x)+1)^2)/((sin(x)^2/(cos(x)+1)^2+1)\n                                       *((2*(1-sin(x)^2/(cos(x)+1)^2))\n                                        /(sin(x)^2/(cos(x)+1)^2+1)\n                                        +1)))\n```\n\n\nInterestingly, without that flag, the much-abused `abs_integrate` gave something different (no idea if it was right, of course):\n\n```\nMaxima 5.42.2 http://maxima.sourceforge.net\nusing Lisp ECL 16.1.2\nDistributed under the GNU Public License. See the file COPYING.\nDedicated to the memory of William Schelter.\nThe function bug_report() provides bug reporting information.\n(%i1) display2d:false;\n\n(%o1) false\n(%i2) integrate(acos(cos(x)/(2*cos(x)+1)),x);   \n\n(%o2) 'integrate(acos(cos(x)/(2*cos(x)+1)),x)\n(%i3) load(abs_integrate);\n\n(%o3) \"/Users/.../sage/local/share/maxima/5.42.2/share/contrib/integration/abs_integrate.mac\"\n(%i4) integrate(acos(cos(x)/(2*cos(x)+1)),x);\n\n(%o4) -(2*%pi*atan(sin(x)/(cos(x)+1))-%pi*x)/2\n```\n\nSee [Maxima bug report 3566](https://sourceforge.net/p/maxima/bugs/3566/).",
    "created_at": "2019-06-28T01:10:45Z",
    "issue": "https://github.com/sagemath/sagetest/issues/25901",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/25901#issuecomment-365483",
    "user": "kcrisman"
}
```

Maxima uses `acos`, as it turns out.  Anyway, the problem here somehow involves `domain:complex`, found in `sage/maxima_lib.py`:

```
Maxima 5.42.2 http://maxima.sourceforge.net
using Lisp ECL 16.1.2
Distributed under the GNU Public License. See the file COPYING.
Dedicated to the memory of William Schelter.
The function bug_report() provides bug reporting information.
(%i1) display2d:false;

(%o1) false
(%i2) domain:complex;

(%o2) complex
(%i3) integrate(acos(cos(x)/(2*cos(x)+1)),x);

(%o3) 2*atan(sin(x)/(cos(x)+1))
       *acos((1-sin(x)^2/(cos(x)+1)^2)/((sin(x)^2/(cos(x)+1)^2+1)
                                       *((2*(1-sin(x)^2/(cos(x)+1)^2))
                                        /(sin(x)^2/(cos(x)+1)^2+1)
                                        +1)))
```


Interestingly, without that flag, the much-abused `abs_integrate` gave something different (no idea if it was right, of course):

```
Maxima 5.42.2 http://maxima.sourceforge.net
using Lisp ECL 16.1.2
Distributed under the GNU Public License. See the file COPYING.
Dedicated to the memory of William Schelter.
The function bug_report() provides bug reporting information.
(%i1) display2d:false;

(%o1) false
(%i2) integrate(acos(cos(x)/(2*cos(x)+1)),x);   

(%o2) 'integrate(acos(cos(x)/(2*cos(x)+1)),x)
(%i3) load(abs_integrate);

(%o3) "/Users/.../sage/local/share/maxima/5.42.2/share/contrib/integration/abs_integrate.mac"
(%i4) integrate(acos(cos(x)/(2*cos(x)+1)),x);

(%o4) -(2*%pi*atan(sin(x)/(cos(x)+1))-%pi*x)/2
```

See [Maxima bug report 3566](https://sourceforge.net/p/maxima/bugs/3566/).
