# Issue 15910: abs for elements of number fields provided with a complex embedding ignores it

Issue created by migration from https://trac.sagemath.org/ticket/16147

Original creator: fwclarke

Original creation time: 2014-04-12 09:14:06


See [http://ask.sagemath.org/question/3967/qqextension-with-embedding-incorrect-modulus](http://ask.sagemath.org/question/3967/qqextension-with-embedding-incorrect-modulus)

```
sage: x = polygen(ZZ)
sage: f = x^3 - x - 1
sage: beta = f.complex_roots()[0]; beta
1.32471795724475
sage: K.<b> = NumberField(f, embedding=beta)
sage: b.abs()
0.868836961832709
sage: [r.abs() for r in f.complex_roots()]
[1.32471795724475, 0.868836961832709, 0.868836961832709]
```



---

Comment by vdelecroix created at 2014-06-29 12:48:50

I provided a simple fix... needs review!

Vincent
----
New commits:


---

Comment by vdelecroix created at 2014-06-29 12:48:50

Changing status from new to needs_review.


---

Comment by fwclarke created at 2014-06-29 19:37:12

Does the job very neatly: positive review.


---

Comment by fwclarke created at 2014-06-29 19:37:12

Changing status from needs_review to positive_review.


---

Comment by vdelecroix created at 2014-06-29 20:06:08

Replying to [comment:3 fwclarke]:
> Does the job very neatly: positive review.

Great! thanks!

When you finish the review, you might better fill the reviewer field with your name (otherwise the release manager has extra job to do). It should be filled with your full name. I did it for you anyway.

Vincent

PS: Actually, I thought that the default answer of .abs() could be an element of QQbar (whenever an embedding in QQbar is defined). That way we would have an exact algebraic number and not an approximation. But in order to do that, there is something to fix with embeddings:

```
sage: K.<cbrt2> = NumberField(x^3 - 2, embedding=1)
sage: QQbar.has_coerce_map_from(K)
False
```



---

Comment by vbraun created at 2014-06-30 16:33:52

Resolution: fixed
