# Issue 13554: Deprecate number field fractional ideal functionality that contradicts standard Sage conventions

archive/issues_013554.json:
```json
{
    "body": "Assignee: davidloeffler\n\nCC:  jpflori\n\nSage does not currently support orders in number fields or their ideals.  Part of the reason for that is that all ideals are in fact just fractional ideals.\n\n```\nsage: R.<x> = QQ[]\nsage: K.<a> = NumberField(x^2 - 2)\nsage: OK = K.maximal_order()\nsage: I = K.ideal(3)\nsage: I.ring() is K\nTrue\nsage: J = OK.ideal(3)\nsage: J.ring() is OK\nFalse\nsage: I == J\nTrue\n```\n\nI propose that `K.ideal(3)` should be replaced by `K.fractional_ideal(3)`, that `I.ring()` and `J.ring()` should both return `OK`: the ring for which this \"ideal\" is a module.  To get the number field out of `I` or `J` use the `number_field()` function instead.\n\nSince making such a change suddenly is frowned upon, this ticket deprecates the functions `ideal()` and `ring()` so that we can change their meaning in a future version of Sage.\n\nIssue created by migration from https://trac.sagemath.org/ticket/13758\n\n",
    "created_at": "2012-11-26T05:31:09Z",
    "labels": [
        "number fields",
        "major",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-6.4",
    "title": "Deprecate number field fractional ideal functionality that contradicts standard Sage conventions",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/13554",
    "user": "roed"
}
```
Assignee: davidloeffler

CC:  jpflori

Sage does not currently support orders in number fields or their ideals.  Part of the reason for that is that all ideals are in fact just fractional ideals.

```
sage: R.<x> = QQ[]
sage: K.<a> = NumberField(x^2 - 2)
sage: OK = K.maximal_order()
sage: I = K.ideal(3)
sage: I.ring() is K
True
sage: J = OK.ideal(3)
sage: J.ring() is OK
False
sage: I == J
True
```

I propose that `K.ideal(3)` should be replaced by `K.fractional_ideal(3)`, that `I.ring()` and `J.ring()` should both return `OK`: the ring for which this "ideal" is a module.  To get the number field out of `I` or `J` use the `number_field()` function instead.

Since making such a change suddenly is frowned upon, this ticket deprecates the functions `ideal()` and `ring()` so that we can change their meaning in a future version of Sage.

Issue created by migration from https://trac.sagemath.org/ticket/13758


