# Issue 13130: Vector space homomorphism does not return over padic field

Issue created by migration from https://trac.sagemath.org/ticket/13302

Original creator: saraedum

Original creation time: 2012-07-27 00:42:48

Assignee: jason, was

Keywords: matrix space, padics

The following code does not return in sage 5.1.rc1.


```
sage: V=Qp(3)^1
sage: V.hom([V.zero()])
```


The problem is, that the matrix constructor tries to unpack a padic zero which is an infinite list of zeros.


---

Comment by saraedum created at 2012-07-27 01:01:53

[not relevant anymore]


---

Comment by saraedum created at 2012-07-27 01:01:53

Changing status from new to needs_review.


---

Comment by saraedum created at 2012-07-27 02:32:03

Changing status from needs_review to needs_work.


---

Comment by saraedum created at 2012-07-27 02:32:03

[moved to description]


---

Comment by saraedum created at 2012-07-27 03:09:38

Changing keywords from "matrix space, padics" to "matrix space".


---

Comment by saraedum created at 2012-07-27 03:09:38

Changing component from linear algebra to padics.


---

Comment by saraedum created at 2012-07-27 03:13:57

I think that padics should probably not return iterators at all.

What should the iterator for `Qp(3).zero()` be â€” should it be infinite or empty? Should the iterator for `Zp(3)(3)` and `Qp(3)(3)` iterate over `[0,1]` or over `[1]`?

I believe that if one wants to iterate over the terms, then one should have to call `.list()` or similar explicitly.


---

Attachment


---

Comment by saraedum created at 2012-07-27 03:24:25

Changing status from needs_work to needs_review.


---

Comment by mderickx created at 2012-08-01 09:38:06

I think the real problem is that your example is missing some parentheses


```
sage: MatrixSpace(Qp(3),1)([[Qp(3).zero()]])
[0]
sage: MatrixSpace(Qp(3),1,1)([[Qp(3)(4/3)]])
[3^-1 + 1 + O(3^19)]
```


This causes the matrix constructor to look if it can unpack the element Qp(3).zero()] in the list [Qp(3).zero()] .

If you want it also to work with fewer parentheses I'd say that it's the fault of MatrixSpace.__call__ not checking if Qp(3).zero() is a ring element before just trying to unpack it.

Note that it's not only the p-adics that give rise to strange behaviour. You can also use polynomials:

```
sage: K.<x>=QQ[]
sage: MatrixSpace(K,2)([x+2,3*x+4])
[2 1]
[4 3]
```



---

Comment by saraedum created at 2012-08-01 12:36:29

Thanks for pointing this out Maarten.

I'll have a look if the check you propose can be done easily. Btw, the original problem I had was the following:

```
sage: K=Qp(3)
sage: V=K^1
sage: V.hom([V.zero()])
```


This hangs and there don't seem to be any parentheses missing, right?

So apparently the `hom` does too much unpacking along the way.

Anyway, I'll look into this and most probably split this ticket into two tickets, since I still think that padics should not be iterable.


---

Comment by saraedum created at 2012-08-01 12:36:29

Changing status from needs_review to needs_work.


---

Comment by mderickx created at 2012-08-01 13:10:29

hom is broken in even more ways. see the discussion (maybe monologue is more adequate) https://groups.google.com/forum/?fromgroups#!topic/sage-devel/UdHakJf5A5Q 

I created #13321 for this.


---

Comment by saraedum created at 2012-10-11 20:11:55

I created #13592 for the `__iter__` issue. This fixes the issue described here and #13321 takes care of `hom()`, so I believe this ticket can be closed now.


---

Comment by saraedum created at 2012-10-11 20:11:55

Changing status from needs_work to needs_review.


---

Comment by saraedum created at 2012-10-11 20:12:05

Changing status from needs_review to positive_review.


---

Comment by jdemeyer created at 2012-10-30 08:13:13

Resolution: duplicate
