# Issue 23727: f.subs(I=...) does not work

archive/issues_023727.json:
```json
{
    "body": "the `substitute` command does not work with `I`:\n\n```\nsage: f = sin(x*I)+I*x^2+cos(exp(I))\nsage: f.subs(I=0)\nI*x^2 + cos(e^I) + sin(I*x)\n```\n\nIssue created by migration from https://trac.sagemath.org/ticket/23964\n\n",
    "created_at": "2017-10-04T09:48:59Z",
    "labels": [
        "component: calculus",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-8.1",
    "title": "f.subs(I=...) does not work",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/23727",
    "user": "https://github.com/zimmermann6"
}
```
the `substitute` command does not work with `I`:

```
sage: f = sin(x*I)+I*x^2+cos(exp(I))
sage: f.subs(I=0)
I*x^2 + cos(e^I) + sin(I*x)
```

Issue created by migration from https://trac.sagemath.org/ticket/23964





---

archive/issue_comments_332024.json:
```json
{
    "body": "The documentation: `Substitute with keyword arguments (works only with symbols):`. For you `I` is a symbol but for Pynac it's numeric. Just use dictionary or relational syntax:\n\n```\nsage: f = sin(x*I)+I*x^2+cos(exp(I))\nsage: f\nI*x^2 + cos(e^I) + I*sinh(x)\nsage: f.subs({I:0})\nI*x^2 + cos(1) + I*sinh(x)\nsage: f.subs(I==0)\nI*x^2 + cos(1) + I*sinh(x)\n```\nAs you can see the `I` inside `cos(e^I)` is now replaced. I agree that the other `I`s not being replaced is a bug. The bug is independent of which numeric is to be substituted:\n\n```\nsage: f = sin(x*2)+2*x^2+cos(exp(2))\nsage: f\n2*x^2 + cos(e^2) + sin(2*x)\nsage: f.subs({2:0})\ncos(1) + sin(2*x) + 2\n```",
    "created_at": "2017-10-04T12:57:56Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23727",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23727#issuecomment-332024",
    "user": "https://github.com/rwst"
}
```

The documentation: `Substitute with keyword arguments (works only with symbols):`. For you `I` is a symbol but for Pynac it's numeric. Just use dictionary or relational syntax:

```
sage: f = sin(x*I)+I*x^2+cos(exp(I))
sage: f
I*x^2 + cos(e^I) + I*sinh(x)
sage: f.subs({I:0})
I*x^2 + cos(1) + I*sinh(x)
sage: f.subs(I==0)
I*x^2 + cos(1) + I*sinh(x)
```
As you can see the `I` inside `cos(e^I)` is now replaced. I agree that the other `I`s not being replaced is a bug. The bug is independent of which numeric is to be substituted:

```
sage: f = sin(x*2)+2*x^2+cos(exp(2))
sage: f
2*x^2 + cos(e^2) + sin(2*x)
sage: f.subs({2:0})
cos(1) + sin(2*x) + 2
```



---

archive/issue_comments_332025.json:
```json
{
    "body": "thank you. Should I open a new ticket for this bug? Or simply change the ticket description?",
    "created_at": "2017-10-04T13:10:24Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23727",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23727#issuecomment-332025",
    "user": "https://github.com/zimmermann6"
}
```

thank you. Should I open a new ticket for this bug? Or simply change the ticket description?



---

archive/issue_comments_332026.json:
```json
{
    "body": "Done. I think I will restrict the numerics that can be replaced (not `0` nor `1`).",
    "created_at": "2017-10-04T13:12:54Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23727",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23727#issuecomment-332026",
    "user": "https://github.com/rwst"
}
```

Done. I think I will restrict the numerics that can be replaced (not `0` nor `1`).



---

archive/issue_comments_332027.json:
```json
{
    "body": "btw it is strange that you get `I*sinh(x)` since with Sage 8.0 I get `sin(I*x)`, i.e., this term is unchanged.",
    "created_at": "2017-10-04T13:13:35Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23727",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23727#issuecomment-332027",
    "user": "https://github.com/zimmermann6"
}
```

btw it is strange that you get `I*sinh(x)` since with Sage 8.0 I get `sin(I*x)`, i.e., this term is unchanged.



---

archive/issue_comments_332028.json:
```json
{
    "body": "sorry we edited the ticket simultaneously and I discarded your edit in the title and maybe in the description. I've put the title back to `===` but I'm not sure about the description.",
    "created_at": "2017-10-04T13:16:26Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23727",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23727#issuecomment-332028",
    "user": "https://github.com/zimmermann6"
}
```

sorry we edited the ticket simultaneously and I discarded your edit in the title and maybe in the description. I've put the title back to `===` but I'm not sure about the description.



---

archive/issue_comments_332029.json:
```json
{
    "body": "Yeah that was an enhancement in a recent Pynac (#23820).",
    "created_at": "2017-10-04T13:19:03Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23727",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23727#issuecomment-332029",
    "user": "https://github.com/rwst"
}
```

Yeah that was an enhancement in a recent Pynac (#23820).



---

archive/issue_comments_332030.json:
```json
{
    "body": "Why should `(I*x).subs(I=0)` work? This `I` isn't a variable, it's a complex number. Would you expect `(2*x).subs({2:3})` to give `(3*x)`?",
    "created_at": "2017-10-04T13:33:18Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23727",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23727#issuecomment-332030",
    "user": "https://github.com/jdemeyer"
}
```

Why should `(I*x).subs(I=0)` work? This `I` isn't a variable, it's a complex number. Would you expect `(2*x).subs({2:3})` to give `(3*x)`?



---

archive/issue_comments_332031.json:
```json
{
    "body": "Well, `subs` was always about termwise substitution. Maxima does it too:\n\n```\n(%i3) subst(%i=y,%i*x);\n(%o3)                                 x y\n(%i4) subst(2=y,2*x);\n(%o4)                                 x y\n```",
    "created_at": "2017-10-04T14:11:31Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23727",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23727#issuecomment-332031",
    "user": "https://github.com/rwst"
}
```

Well, `subs` was always about termwise substitution. Maxima does it too:

```
(%i3) subst(%i=y,%i*x);
(%o3)                                 x y
(%i4) subst(2=y,2*x);
(%o4)                                 x y
```



---

archive/issue_comments_332032.json:
```json
{
    "body": "This will be available with pynac-0.7.18 and should be doctested here.",
    "created_at": "2018-03-09T16:17:57Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23727",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23727#issuecomment-332032",
    "user": "https://github.com/rwst"
}
```

This will be available with pynac-0.7.18 and should be doctested here.



---

archive/issue_comments_332033.json:
```json
{
    "body": "The original case works now, the minimal case `I*x` not, so there is an inconsistency to resolve.",
    "created_at": "2018-07-01T07:34:35Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23727",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23727#issuecomment-332033",
    "user": "https://github.com/rwst"
}
```

The original case works now, the minimal case `I*x` not, so there is an inconsistency to resolve.
