# Issue 25103: Problems with (complex) interval arithmetic

Issue created by migration from Trac.

Original creator: mgoerner

Original creation time: 2018-05-11 06:07:02

CC:  dunfield marc.culler@gmail.com

I found several problems with complex interval arithmetic:

1. It seems that it takes the dilog of the midpoint and then converts it back to intervals:


```
sage: dilog(CIF(RIF(4,4.1),RIF(4,4.1)))
-0.51510330456949305? + 4.2437340770848096?*I
```


2. It doesn't return intervals:


```
sage: arccosh(CIF(RIF(4,4.1),RIF(4,4.1)))
2.43852473711003 + 0.793017478264382*I

```


3. Hangs:


```
sage: 1 / CIF(RIF(-1,1),RIF(0))

```


1 should either return the right result or fail. 2 doesn't seem to bad until one does the following which seems like valid code and returns an interval, so the user thinks everything is ok:


```
sage: arccosh(CIF(RIF(4,4.1),RIF(4,4.1))).real() + RIF(3.4)
5.8385247371100296?
```



_A note in general:_ I do like the availability of interval arithmetic in sage a lot, but I think that sage should be conservative and never ever implicitly convert or coerce an interval to a floating point number. The only way to get a floating point number from an interval is by explicitly calling **.lower()**, **.upper()**, **.center()** (and related such as **endpoints()**)! In particular, operations such as adding an interval to a floating point number shouldn't be allowed - and adding to something exact like an integer or rational should return a valid interval.


---

Comment by dunfield created at 2018-05-11 16:51:10

The first one is also a problem with real intervals:


```
sage: dilog(RIF(4,4.1))
2.0475591955473647? - 4.3941986780846492?*I
sage: dilog(4.05)
2.04755919558654 - 4.39419867817374*I
```


The other two things work OK for real intervals:


```
sage: arccosh(RIF(4,4.1))
2.1?
sage: 1/RIF(-1, 1)
[-infinity .. +infinity]
```



---

Comment by jdemeyer created at 2018-05-11 21:11:04

Changing component from basic arithmetic to symbolics.


---

Comment by mgoerner created at 2018-05-21 04:49:59

I have a fix for issue 3 (where the division hangs) and opened a separate ticket #25414 for it.


---

Comment by mgoerner created at 2018-05-22 04:55:59

And some more:


```
sage: atan2(RIF(-1,1),RIF(-1))
3.141592653589794?
```


I also find this behavior

```
sage: atan2(RIF(1),RIF(1))
1/4*pi
```

troublesome because now the type of the result is dependent on the input values.


---

Comment by vdelecroix created at 2018-08-03 19:20:18

update milestone 8.3 -> 8.4
