# Issue 31995: Callable symbolic expressions do not check arity

Issue created by migration from https://trac.sagemath.org/ticket/32232

Original creator: mkoeppe

Original creation time: 2021-07-18 20:11:27

CC:  @davewittemorris kcrisman


```
sage: nullary = SR( 2^(8/9) - 2^(1/9) ).function()
sage: nullary                                                                                                                              
() |--> 2^(8/9) - 2^(1/9)
sage: nullary(x-1, 2)                                                                                                    
2^(8/9) - 2^(1/9)

sage: f(x) = 17                                                                                                                            
sage: f                                                                                                                                    
x |--> 17
sage: f()                                                                                                                                  
17
sage: f(17,18,19)                                                                                                                          
17
```


