# Issue 18734: make first call of gap3.execute work properly

Issue created by migration from Trac.

Original creator: saliola

Original creation time: 2015-07-30 22:19:41

CC:  stumpc5 nthiery

Keywords: gap3

As pointed out at #8906:

> Do you know why the first call of `gap3` doesn't appear to work properly?
> 
> {{{
> ┌────────────────────────────────────────────────────────────────────┐
> │ [SageMath](SageMath) Version 6.8.rc1, Release Date: 2015-07-22                 │
> │ Type "notebook()" for the browser-based notebook interface.        │
> │ Type "help()" for help.                                            │
> └────────────────────────────────────────────────────────────────────┘
> ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
> ┃ Warning: this is a prerelease version, and it may be unstable.     ┃
> ┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛
> sage: gap3
> Gap3
> sage: gap3.execute("1+1")
> ''
> sage: gap3.execute("1+1")
> '2'
> sage: 
> }}}

Note that running `gap3("1 + 1")` works correctly.

[Of course, one needs gap3 installed to see this error. Either install it using the SPKG at #8906, or install it on your system and make sure that `gap3` is in your $PATH.]


---

Comment by stumpc5 created at 2016-03-25 13:53:04

There are also the following, maybe related, issues

```
┌────────────────────────────────────────────────────────────────────┐
│ SageMath Version 7.1.beta6, Release Date: 2016-03-03               │
│ Type "notebook()" for the browser-based notebook interface.        │
│ Type "help()" for help.                                            │
└────────────────────────────────────────────────────────────────────┘
┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
┃ Warning: this is a prerelease version, and it may be unstable.     ┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛
sage:  
sage: gap3
Gap3
sage: gap3.execute("1+1")
''
sage: gap3.execute("1+1")
'2'
sage: 
sage: gap3.execute("1+1")
'2'
sage: gap3
Gap3
sage: gap3.eval('VERSION')[1:-1]
''
sage: gap3.eval('VERSION')[1:-1]
'lib: jm 12Mar2016, src: jm 28Feb2015, sys: usg gcc 64'
sage: gap3.execute("1+1")
'"lib: jm 12Mar2016, src: jm 28Feb2015, sys: usg gcc 64"'
sage: gap3.execute("1+1")
'2'
```



---

Comment by stumpc5 created at 2016-03-25 13:53:42

See also #20107 for a new attempt to make GAP3 an optional package.


---

Comment by stumpc5 created at 2017-06-06 20:51:52

Changing type from PLEASE CHANGE to defect.


---

Comment by stumpc5 created at 2017-06-06 20:51:52

Changing status from new to needs_review.


---

Comment by stumpc5 created at 2017-06-06 20:51:52

duplicate of #23142


---

Comment by nthiery created at 2017-06-06 21:00:17

For the record: I just checked that with #23142, the given examples work smoothly.
Hence positive review!


---

Comment by nthiery created at 2017-06-06 21:01:07

Changing status from needs_review to positive_review.


---

Comment by nthiery created at 2017-06-06 21:02:09

(i.e.: can be closed as duplicate)


---

Comment by jdemeyer created at 2017-06-14 11:54:18

Resolution: duplicate
