# Issue 12511: Inappropriate comparison of method

Issue created by migration from Trac.

Original creator: culler

Original creation time: 2012-03-17 16:37:40

Assignee: AlexGhitza

Keywords: rich comparison


```
sage: z = 3+4j
sage: z.real < 0
True

```

It is very easy to encounter this when importing working python scripts into Sage.  But it can be a bear to fix since there is no indication of any problem, other than wrong answers.

There is no meaningful sense in which the method z.real should be considered less than the number 0.  So this comparison should return NotImplemented.  In fact, I would suggest that every comparison between a method and any other object should return NotImplemented.


---

Comment by culler created at 2012-03-17 16:58:49

An even better solution would be to raise a TypeError, as would happen in Python 3.


---

Comment by tscrim created at 2012-05-09 20:32:30

This is a python issue:


```
sage: class bla: 
....:     def f(self): pass
....: 
sage: 
sage: x = bla()
sage: x.f < int(0)
False
```


I believe this should be fixed in python 3.0:
http://docs.python.org/release/3.0.1/whatsnew/3.0.html#ordering-comparisons


---

Comment by jakobkroeker created at 2015-08-25 17:50:00

fixed?


---

Comment by culler created at 2015-08-25 18:55:08

The original behavior still persists in sage 6.8, although the value of the comparison has been reversed:

sage: z = 3-4j
sage: z.imag > 0
True

Also, it is still true that the behavior is inherited from python.  In python 2.7.9 one has:

>>> class bla:
...   def f(self):
...     pass
... 
>>> x = bla()
>>> x.f > 0
True

Nonetheless, that does not make it a desirable behavior in Sage.

Anyway, as far as I can see, nothing has changed.
