# Issue 12477: Bug in initialisation of species

archive/issues_012477.json:
```json
{
    "body": "Assignee: sage-combinat\n\nCC:  sage-combinat @mantepse\n\nKeywords: Species\n\nThe following specification is valid:\n\n```\nsage: Set0  = species.SetSpecies()\nsage: Set1  = species.SetSpecies(min=1)\nsage: Set2  = species.SetSpecies(min=2)\nsage: Four = species.CombinatorialSpecies()\nsage: Four.define(Set2(Four) + Set1*Set0(Four))\n```\n\nHowever, the following code breaks\n\n```\nsage: Four.generating_series()[1]\n[...]\nValueError: generator already executing\n```\n\nStrangely enough, adding some seemingly unrelated instruction work\naround it::\n\n```\nsage: Set0  = species.SetSpecies()\nsage: Set1  = species.SetSpecies(min=1)\nsage: Set2  = species.SetSpecies(min=2)\n\nsage: Set2(Set1).generating_series()[1]\n0\n\nsage: Four = species.CombinatorialSpecies()\nsage: Four.define(Set2(Four) + Set1*Set0(Four))\nsage: Four.generating_series()[1]\n1\nsage: Four.generating_series()[4]\n52/3\nsage: Four.generating_series()\nx + 2*x^2 + 16/3*x^3 + 52/3*x^4 + O(x^5)\n```\n\n\nFlorent\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/12649\n\n",
    "created_at": "2012-03-09T21:11:59Z",
    "labels": [
        "component: combinatorics",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-9.8",
    "title": "Bug in initialisation of species",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/12477",
    "user": "https://github.com/hivert"
}
```
Assignee: sage-combinat

CC:  sage-combinat @mantepse

Keywords: Species

The following specification is valid:

```
sage: Set0  = species.SetSpecies()
sage: Set1  = species.SetSpecies(min=1)
sage: Set2  = species.SetSpecies(min=2)
sage: Four = species.CombinatorialSpecies()
sage: Four.define(Set2(Four) + Set1*Set0(Four))
```

However, the following code breaks

```
sage: Four.generating_series()[1]
[...]
ValueError: generator already executing
```

Strangely enough, adding some seemingly unrelated instruction work
around it::

```
sage: Set0  = species.SetSpecies()
sage: Set1  = species.SetSpecies(min=1)
sage: Set2  = species.SetSpecies(min=2)

sage: Set2(Set1).generating_series()[1]
0

sage: Four = species.CombinatorialSpecies()
sage: Four.define(Set2(Four) + Set1*Set0(Four))
sage: Four.generating_series()[1]
1
sage: Four.generating_series()[4]
52/3
sage: Four.generating_series()
x + 2*x^2 + 16/3*x^3 + 52/3*x^4 + O(x^5)
```


Florent


Issue created by migration from https://trac.sagemath.org/ticket/12649





---

archive/issue_comments_147465.json:
```json
{
    "body": "Here is a smaller code which triggers the problem:\n\n```\nZ     = species.SingletonSpecies()\nSet2  = species.SetSpecies(min=2)\nNMult   = species.CombinatorialSpecies()\nNMult.define(Set2(Z+NMult))\nNMult.generating_series()[0]\n```\n",
    "created_at": "2013-04-25T09:45:53Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12477",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12477#issuecomment-147465",
    "user": "https://github.com/hivert"
}
```

Here is a smaller code which triggers the problem:

```
Z     = species.SingletonSpecies()
Set2  = species.SetSpecies(min=2)
NMult   = species.CombinatorialSpecies()
NMult.define(Set2(Z+NMult))
NMult.generating_series()[0]
```




---

archive/issue_comments_147466.json:
```json
{
    "body": "Fixed in #15673.",
    "created_at": "2014-01-15T12:56:32Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12477",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12477#issuecomment-147466",
    "user": "https://github.com/mwhansen"
}
```

Fixed in #15673.



---

archive/issue_comments_147467.json:
```json
{
    "body": "will this be fixed by the recent refactoring ?\n\nmaybe check also other tickets with \"species\" keyword ?",
    "created_at": "2022-09-27T14:32:58Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12477",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12477#issuecomment-147467",
    "user": "https://github.com/fchapoton"
}
```

will this be fixed by the recent refactoring ?

maybe check also other tickets with "species" keyword ?



---

archive/issue_comments_147468.json:
```json
{
    "body": "Yes, this already works.  However, you have to be explicit about the valuation of `Four` now, because it cannot determine that it doesn't have valuation 0.\n\n(I admit I don't see right now whether it should be able to determine that the valuation is not 0 - do you?)\n\n\n```\nsage: Set0  = species.SetSpecies()\nsage: Set1  = species.SetSpecies(min=1)\nsage: Set2  = species.SetSpecies(min=2)\nsage: Four = species.CombinatorialSpecies(min=1)\nsage: Four.define(Set2(Four) + Set1*Set0(Four))\n\nsage: Four.generating_series()\nz + 2*z^2 + 16/3*z^3 + 52/3*z^4 + 944/15*z^5 + 11008/45*z^6 + 313664/315*z^7 + O(z^8)\n\nsage: Four.isotype_generating_series()\nz + 3*z^2 + 10*z^3 + 40*z^4 + 170*z^5 + 785*z^6 + 3770*z^7 + O(z^8)\nsage: Four.cycle_index_series()\np[1] + (2*p[1,1]+p[2]) + (16/3*p[1,1,1]+4*p[2,1]+2/3*p[3]) + (52/3*p[1,1,1,1]+16*p[2,1,1]+3*p[2,2]+8/3*p[3,1]+p[4]) + (944/15*p[1,1,1,1,1]+208/3*p[2,1,1,1]+20*p[2,2,1]+32/3*p[3,1,1]+8/3*p[3,2]+4*p[4,1]+2/5*p[5]) + (11008/45*p[1,1,1,1,1,1]+944/3*p[2,1,1,1,1]+120*p[2,2,1,1]+12*p[2,2,2]+416/9*p[3,1,1,1]+64/3*p[3,2,1]+14/9*p[3,3]+16*p[4,1,1]+6*p[4,2]+8/5*p[5,1]+p[6]) + (313664/315*p[1,1,1,1,1,1,1]+22016/15*p[2,1,1,1,1,1]+2096/3*p[2,2,1,1,1]+112*p[2,2,2,1]+1888/9*p[3,1,1,1,1]+416/3*p[3,2,1,1]+40/3*p[3,2,2]+88/9*p[3,3,1]+208/3*p[4,1,1,1]+40*p[4,2,1]+8/3*p[4,3]+32/5*p[5,1,1]+8/5*p[5,2]+4*p[6,1]+2/7*p[7]) + O^8\n```\n",
    "created_at": "2022-09-27T15:15:08Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12477",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12477#issuecomment-147468",
    "user": "https://github.com/mantepse"
}
```

Yes, this already works.  However, you have to be explicit about the valuation of `Four` now, because it cannot determine that it doesn't have valuation 0.

(I admit I don't see right now whether it should be able to determine that the valuation is not 0 - do you?)


```
sage: Set0  = species.SetSpecies()
sage: Set1  = species.SetSpecies(min=1)
sage: Set2  = species.SetSpecies(min=2)
sage: Four = species.CombinatorialSpecies(min=1)
sage: Four.define(Set2(Four) + Set1*Set0(Four))

sage: Four.generating_series()
z + 2*z^2 + 16/3*z^3 + 52/3*z^4 + 944/15*z^5 + 11008/45*z^6 + 313664/315*z^7 + O(z^8)

sage: Four.isotype_generating_series()
z + 3*z^2 + 10*z^3 + 40*z^4 + 170*z^5 + 785*z^6 + 3770*z^7 + O(z^8)
sage: Four.cycle_index_series()
p[1] + (2*p[1,1]+p[2]) + (16/3*p[1,1,1]+4*p[2,1]+2/3*p[3]) + (52/3*p[1,1,1,1]+16*p[2,1,1]+3*p[2,2]+8/3*p[3,1]+p[4]) + (944/15*p[1,1,1,1,1]+208/3*p[2,1,1,1]+20*p[2,2,1]+32/3*p[3,1,1]+8/3*p[3,2]+4*p[4,1]+2/5*p[5]) + (11008/45*p[1,1,1,1,1,1]+944/3*p[2,1,1,1,1]+120*p[2,2,1,1]+12*p[2,2,2]+416/9*p[3,1,1,1]+64/3*p[3,2,1]+14/9*p[3,3]+16*p[4,1,1]+6*p[4,2]+8/5*p[5,1]+p[6]) + (313664/315*p[1,1,1,1,1,1,1]+22016/15*p[2,1,1,1,1,1]+2096/3*p[2,2,1,1,1]+112*p[2,2,2,1]+1888/9*p[3,1,1,1,1]+416/3*p[3,2,1,1]+40/3*p[3,2,2]+88/9*p[3,3,1]+208/3*p[4,1,1,1]+40*p[4,2,1]+8/3*p[4,3]+32/5*p[5,1,1]+8/5*p[5,2]+4*p[6,1]+2/7*p[7]) + O^8
```




---

archive/issue_comments_147469.json:
```json
{
    "body": "Yes, I am eager to close all the other tickets.  However, I want #34552 to be in the develop branch first.",
    "created_at": "2022-09-27T15:18:02Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12477",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12477#issuecomment-147469",
    "user": "https://github.com/mantepse"
}
```

Yes, I am eager to close all the other tickets.  However, I want #34552 to be in the develop branch first.



---

archive/issue_comments_147470.json:
```json
{
    "body": "Hm, I think it should know that the valuation is greater than 0.  The valuation of `Set1 * Set0(Four)` is greater than zero, because the valuation of `Set1` is.\n\n`Set2` is not a polynomial (because it is not 'exact'), so `Set2.__call__` is only defined if its argument has valuation at least 1.  Thus we might as well assume that its valuation is at least 1.\n\nI'm not sure yet.",
    "created_at": "2022-09-27T15:24:48Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12477",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12477#issuecomment-147470",
    "user": "https://github.com/mantepse"
}
```

Hm, I think it should know that the valuation is greater than 0.  The valuation of `Set1 * Set0(Four)` is greater than zero, because the valuation of `Set1` is.

`Set2` is not a polynomial (because it is not 'exact'), so `Set2.__call__` is only defined if its argument has valuation at least 1.  Thus we might as well assume that its valuation is at least 1.

I'm not sure yet.



---

archive/issue_comments_147471.json:
```json
{
    "body": "Changing keywords from \"Species\" to \"Species, LazyPowerSeries\".",
    "created_at": "2022-09-27T15:29:57Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12477",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12477#issuecomment-147471",
    "user": "https://github.com/mantepse"
}
```

Changing keywords from "Species" to "Species, LazyPowerSeries".



---

archive/issue_comments_147472.json:
```json
{
    "body": "We actually thought about this situation (I forgot), and introduced a `check` parameter for `__call__`.  Of course, it is not passed by the species code.\n\nI am still not sure what the best solution might be.",
    "created_at": "2022-09-27T16:02:02Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12477",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12477#issuecomment-147472",
    "user": "https://github.com/mantepse"
}
```

We actually thought about this situation (I forgot), and introduced a `check` parameter for `__call__`.  Of course, it is not passed by the species code.

I am still not sure what the best solution might be.



---

archive/issue_comments_147473.json:
```json
{
    "body": "Changing status from new to needs_info.",
    "created_at": "2022-10-22T08:36:38Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12477",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12477#issuecomment-147473",
    "user": "https://github.com/mantepse"
}
```

Changing status from new to needs_info.
