# Issue 18383: Galois conjugates in universal cyclotomic field miss the previously existing parameter m

Issue created by migration from https://trac.sagemath.org/ticket/18620

Original creator: stumpc5

Original creation time: 2015-06-06 02:09:45

CC:  vdelecroix

It used to be possible to do

```
sage: a = E(6)
sage: a.galois_conjugates(12)
[-E(3)^2, -E(3), -E(3)^2, -E(3)]
```


This functionality has now disappeared in #18152 -- but it is needed to this functionality in the implementation of complex reflection groups in #11187.


---

Comment by vdelecroix created at 2015-06-06 11:49:41

Hello,

I did remove the argument on purpose. The Galois conjugates do not depend on anything: it is the orbit of the Galois group (of `QQbar` over `QQ`). The specifications you wrote

```
:param m: if given, it must be a multiple of :meth:`field_order`; the Galois
conjugates are then computed with respect to the cyclotomics of order ``m``
```

is a nonsense to me. The way you compute something should not change the result.

Moreover, what is used to do is to duplicate the output a certain number of times (in a very inefficient way)

```
sage: E(6).galois_conjugates(6)
[-E(3)^2, -E(3)]
sage: E(6).galois_conjugates(12)
[-E(3)^2, -E(3), -E(3)^2, -E(3)]
```


Why not using

```
sage: E(6).galois_conjugates() * 2
[-E(3)^2, -E(3), -E(3)^2, -E(3)]
```

if you want to duplicate the list?

Vincent


---

Comment by stumpc5 created at 2015-06-07 10:00:09

Hi,

you might be right in the sense that you will see the same elements multiple times or the same elements in a different order such as

```
sage: zeta.galois_conjugates(5)
[E(5), E(5)^2, E(5)^3, E(5)^4]
sage: zeta.galois_conjugates(10)
[E(5), E(5)^3, E(5)^2, E(5)^4]
sage: zeta.galois_conjugates(15)
[E(5), E(5)^2, E(5)^4, E(5)^2, E(5)^3, E(5), E(5)^3, E(5)^4]
```

You can argue that these elements live in the `UCF` so their Galois conjugates should be computed using `UCF/QQ`. But since every such element is contained in `CF(n)` for multiple `n`s, one can as well argue to compute it in one of those (recall that the Galois conjugates are defined over a field extension http://en.wikipedia.org/wiki/Conjugate_element_%28field_theory%29).

The orbit **as a set** does not depend on your choice above, but the order in which they come in the list depends on the field extension `CF(n)` you chose, and you might want to further use that ordering for something.

What I find more important is that you broke my code without providing a workaround. And I am also not a big fan of the rudeness or at least missing politeness that seems to become standard in [SageMath](SageMath) discussions.

Christian


---

Comment by vdelecroix created at 2015-06-07 10:27:51

Hello,

Replying to [comment:2 stumpc5]:
> What I find more important is that you broke my code without providing a workaround. And I am also not a big fan of the rudeness or at least missing politeness that seems to become standard in [SageMath](SageMath) discussions.

I am sorry if I was rude or missed politeness.

> you might be right in the sense that you will see the same elements multiple times or the same elements in a different order such as
> {{{
> sage: zeta.galois_conjugates(5)
> [E(5), E(5)^2, E(5)^3, E(5)^4]
> sage: zeta.galois_conjugates(10)
> [E(5), E(5)^3, E(5)^2, E(5)^4]
> sage: zeta.galois_conjugates(15)
> [E(5), E(5)^2, E(5)^4, E(5)^2, E(5)^3, E(5), E(5)^3, E(5)^4]
> }}}
> You can argue that these elements live in the `UCF` so their Galois conjugates should be computed using `UCF/QQ`. But since every such element is contained in `CF(n)` for multiple `n`s, one can as well argue to compute it in one of those (recall that the Galois conjugates are defined over a field extension http://en.wikipedia.org/wiki/Conjugate_element_%28field_theory%29).
>
> The orbit **as a set** does not depend on your choice above, but the order in which they come in the list depends on the field extension `CF(n)` you chose, and you might want to further use that ordering for something.

Here I do not agree with the terminology. I very much understand the difference between:
- computing the galois conjugates
- computing the orbit of the Galois group `Gal(CF(n)/QQ)` as a list `[g_0 x, g_1 x, ..., g_k x]`.
What your function was doing is the second item (and there is a very natural ordering of the Galois group).

Since you are mentioning wikipedia, you can read that the Galois conjugates are the root of the minimal polynomial. So there are as many as the degree of the minimal polynomial (which is just independent of any choice of `CF(n)`).

I understand now that this feature was useful and I am sorry if I removed it in an abrupt way. I can provide the branch if you wish (tell me). If you write it, please be much clearer on the specifications.

Vincent


---

Comment by vdelecroix created at 2015-06-07 10:39:39

Changing status from new to needs_review.


---

Comment by vdelecroix created at 2015-06-07 10:39:39

New commits:


---

Comment by stumpc5 created at 2015-06-07 11:02:28

Hi --

thanks for the quick fix! I usually don't remember all of Galois group theory off the top of my head, that's why I might not have given a clear description in the first place...

Christian


---

Comment by stumpc5 created at 2015-06-07 11:34:40

The patchbot is happy with it and so am I.


---

Comment by stumpc5 created at 2015-06-07 11:34:40

Changing status from needs_review to positive_review.


---

Comment by vdelecroix created at 2015-06-07 11:36:42

Cool!


---

Comment by vbraun created at 2015-06-08 20:28:44

Resolution: fixed
