# Issue 10705: Expectation of probability spaces is defined improperly

archive/issues_010705.json:
```json
{
    "body": "Assignee: weigandt\n\nKeywords: Probability, Expectation\n\nI'm not sure if anyone really maintains the file \n\nsage/local/lib/python2.6/site-packages/sage/probability/random_variable.py\n\nbut there's a definite problem with the way expectation is defined.\n\n\n```\nsage: X=frequency_distribution([1,1,1,2,2,2])\nsage: X.expectation()\n0.500000000000000\n```\n\n\nInstead of weighting values by probabilities the function sums the squares of the probabilities involved. It should be an easy fix, I\"ll try to put a patch up soon, if you're used to submitting patches and bored, you'll probably get to it before me.\n\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/10770\n\n",
    "created_at": "2011-02-10T21:28:25Z",
    "labels": [
        "component: misc",
        "minor",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-duplicate/invalid/wontfix",
    "title": "Expectation of probability spaces is defined improperly",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/10705",
    "user": "https://trac.sagemath.org/admin/accounts/users/weigandt"
}
```
Assignee: weigandt

Keywords: Probability, Expectation

I'm not sure if anyone really maintains the file 

sage/local/lib/python2.6/site-packages/sage/probability/random_variable.py

but there's a definite problem with the way expectation is defined.


```
sage: X=frequency_distribution([1,1,1,2,2,2])
sage: X.expectation()
0.500000000000000
```


Instead of weighting values by probabilities the function sums the squares of the probabilities involved. It should be an easy fix, I"ll try to put a patch up soon, if you're used to submitting patches and bored, you'll probably get to it before me.



Issue created by migration from https://trac.sagemath.org/ticket/10770





---

archive/issue_comments_112426.json:
```json
{
    "body": "I think I understand it a bit differently, but I'm not an expert in statistics.  For me, it's easier to understand if we use letters rather than numbers.\n\n\n```\nsage: X=frequency_distribution('AAAABBB')\nsage: X('A')\n0.500000000000000\n```\n\n\nSo the value of 'A' is 0.5.\n\n```\nsage: X.probability_space()('A')\n0.500000000000000\n```\n\nSo the probability of 'A' is also 0.5.  Thus summing up the products of the values (0.5 for each of 'A' and 'B') and the probabilities of (also 0.5 for each of 'A' and 'B') gives 0.5.\n\nI don't know if that's the natural way to do things, but I do see some of the reasoning behind the code.",
    "created_at": "2011-02-11T04:29:34Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10705",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10705#issuecomment-112426",
    "user": "https://github.com/jasongrout"
}
```

I think I understand it a bit differently, but I'm not an expert in statistics.  For me, it's easier to understand if we use letters rather than numbers.


```
sage: X=frequency_distribution('AAAABBB')
sage: X('A')
0.500000000000000
```


So the value of 'A' is 0.5.

```
sage: X.probability_space()('A')
0.500000000000000
```

So the probability of 'A' is also 0.5.  Thus summing up the products of the values (0.5 for each of 'A' and 'B') and the probabilities of (also 0.5 for each of 'A' and 'B') gives 0.5.

I don't know if that's the natural way to do things, but I do see some of the reasoning behind the code.



---

archive/issue_comments_112427.json:
```json
{
    "body": "Maybe this is what you intended?\n\n\n```\nsage: P=frequency_distribution([1,1,1,2,2,2])\nsage: P\nDiscrete probability space defined by {1: 0.500000000000000, 2: 0.500000000000000}\nsage: X=DiscreteRandomVariable(P, {1:1, 2:2})\nsage: X\nDiscrete random variable defined by {1: 1, 2: 2}\nsage: X.expectation()\n1.50000000000000\n```\n\n\nMaybe the confusion is that DiscreteProbabilitySpace inherits from DiscreteRandomVariable (and so inherits the expectation method from DiscreteRandomVariable)?  Again, I'm not a statistician, so I'm not sure what's natural.",
    "created_at": "2011-02-11T04:37:53Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10705",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10705#issuecomment-112427",
    "user": "https://github.com/jasongrout"
}
```

Maybe this is what you intended?


```
sage: P=frequency_distribution([1,1,1,2,2,2])
sage: P
Discrete probability space defined by {1: 0.500000000000000, 2: 0.500000000000000}
sage: X=DiscreteRandomVariable(P, {1:1, 2:2})
sage: X
Discrete random variable defined by {1: 1, 2: 2}
sage: X.expectation()
1.50000000000000
```


Maybe the confusion is that DiscreteProbabilitySpace inherits from DiscreteRandomVariable (and so inherits the expectation method from DiscreteRandomVariable)?  Again, I'm not a statistician, so I'm not sure what's natural.



---

archive/issue_comments_112428.json:
```json
{
    "body": "This is more clear, at least in my mind:\n\n```\nsage: S='AAABBB'\nsage: P=frequency_distribution(S)\nsage: P\nDiscrete probability space defined by {'A': 0.500000000000000, 'B': 0.500000000000000}\nsage: X=DiscreteRandomVariable(P, {'A':1, 'B':2})\nsage: X.expectation()\n1.50000000000000\n```\n\nThat says we want a probability space that calculates the frequency over the set 'AB' of the letters in the string 'AAABBB'.  So we first define the probability space.  Then we create a random variable by assigning the value 1 to 'A' and 2 to 'B'.  Then we can ask for the expectation of the random variable, which uses the probability space and our mapping of S to real numbers to correctly calculate the expectation.\n\nI guess the confusing thing before was that the value of 1 was the frequency of 1, not the actual number 1.",
    "created_at": "2011-02-11T04:41:21Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10705",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10705#issuecomment-112428",
    "user": "https://github.com/jasongrout"
}
```

This is more clear, at least in my mind:

```
sage: S='AAABBB'
sage: P=frequency_distribution(S)
sage: P
Discrete probability space defined by {'A': 0.500000000000000, 'B': 0.500000000000000}
sage: X=DiscreteRandomVariable(P, {'A':1, 'B':2})
sage: X.expectation()
1.50000000000000
```

That says we want a probability space that calculates the frequency over the set 'AB' of the letters in the string 'AAABBB'.  So we first define the probability space.  Then we create a random variable by assigning the value 1 to 'A' and 2 to 'B'.  Then we can ask for the expectation of the random variable, which uses the probability space and our mapping of S to real numbers to correctly calculate the expectation.

I guess the confusing thing before was that the value of 1 was the frequency of 1, not the actual number 1.



---

archive/issue_comments_112429.json:
```json
{
    "body": "Resolution: invalid",
    "created_at": "2011-02-11T05:46:42Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10705",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10705#issuecomment-112429",
    "user": "https://trac.sagemath.org/admin/accounts/users/weigandt"
}
```

Resolution: invalid



---

archive/issue_comments_112430.json:
```json
{
    "body": "Oh, oops! Sorry for being confused here. Maybe this could have better documentation, but I think there's already a ticket open for that. So I suppose this should be closed.\n\nThanks Jason for showing me what I was trying to do!",
    "created_at": "2011-02-11T05:46:42Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10705",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10705#issuecomment-112430",
    "user": "https://trac.sagemath.org/admin/accounts/users/weigandt"
}
```

Oh, oops! Sorry for being confused here. Maybe this could have better documentation, but I think there's already a ticket open for that. So I suppose this should be closed.

Thanks Jason for showing me what I was trying to do!



---

archive/issue_events_010810.json:
```json
{
    "actor": "weigandt",
    "created_at": "2011-02-11T05:46:42Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/10705",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/10705#event-10810"
}
```
