# Issue 23486: accept pari input in more parents

Issue created by migration from Trac.

Original creator: vdelecroix

Original creation time: 2017-08-26 03:01:06

CC:  jdemeyer jipilab

- vectors

```
sage: V = ZZ**3
sage: v = pari([1,2,3])
sage: V(v)
Traceback (most recent call last):
...
TypeError: can't initialize vector from nonzero non-list
```

  (note: in the above example `v.sage()` returns a list)
- matrices

```
sage: M = MatrixSpace(ZZ, 2)
sage: p = pari('[1, 2; 3, 4]')
sage: M(p)
Traceback (most recent call last):
...
TypeError: entries has the wrong length
```

  (note: in the above case `p.sage()` works perfectly)

The aim is to have the following construction supported

```
sage: K = CyclotomicField(10)
sage: z = K.gen()
sage: M = MatrixSpace(K, 2)
sage: m = M([1, z, 1-z, -2/3])
sage: p = m.__pari__()
sage: r = p^2 - 2*p + 3
sage: M(r)
Traceback (most recent call last):
...
TypeError: ... has unsupported PARI type t_MAT
```

  (in the above example `r.sage()` does fail with `NameError: name 'y' is not defined`)
