# Issue 16185: cancellation of two indefinite limits

archive/issues_016185.json:
```json
{
    "body": "CC:  jakobkroeker\n\nKeywords: symbolic, cancellation, limit, indefinite\n\nWe get\n\n```\nsage: limit(cos(x),x=oo) - limit(sin(x),x=oo)\n0\n```\n\n\nThis comes from the fact that the return value of each limit is a symbolic variable:\n\n```\nsage: limit(sin(x), x=oo)\nind\nsage: type(limit(sin(x), x=oo))\n<type 'sage.symbolic.expression.Expression'>\nsage: limit(sin(x), x=oo).variables()\n(ind,)\n```\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/16422\n\n",
    "created_at": "2014-06-01T10:58:50Z",
    "labels": [
        "symbolics",
        "major",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-6.4",
    "title": "cancellation of two indefinite limits",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/16185",
    "user": "dkrenn"
}
```
CC:  jakobkroeker

Keywords: symbolic, cancellation, limit, indefinite

We get

```
sage: limit(cos(x),x=oo) - limit(sin(x),x=oo)
0
```


This comes from the fact that the return value of each limit is a symbolic variable:

```
sage: limit(sin(x), x=oo)
ind
sage: type(limit(sin(x), x=oo))
<type 'sage.symbolic.expression.Expression'>
sage: limit(sin(x), x=oo).variables()
(ind,)
```


Issue created by migration from https://trac.sagemath.org/ticket/16422





---

archive/issue_comments_211334.json:
```json
{
    "body": "This is an upstream problem (in maxima). It seems \"ind\" isn't a special symbol there either:\n\n```\nMaxima 5.29.1 http://maxima.sourceforge.net\nusing Lisp ECL 12.12.1\n(%i3) limit(sin(x),x,inf)-limit(cos(x),x,inf);\n(%o3)                                  0\n```\n\nWe could intercept ind whenever it comes by (from limit) and raise an exception to limit the damage, but I imagine the bad simplifications could already happen internal to maxima.\n\nThis seems to happen with infinity as well, by the way:\n\n```\n(%i14) limit(1/x^2,x,0)-limit(1/x^4,x,0);\n(%o14)                                 0\n```\n\n\nSage catches those (when they happen in a way sage can see it happen), so perhaps we should recognize `ind` and a special value--leading to an exception if we can't do anything with it.",
    "created_at": "2014-06-01T19:53:59Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16185",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16185#issuecomment-211334",
    "user": "nbruin"
}
```

This is an upstream problem (in maxima). It seems "ind" isn't a special symbol there either:

```
Maxima 5.29.1 http://maxima.sourceforge.net
using Lisp ECL 12.12.1
(%i3) limit(sin(x),x,inf)-limit(cos(x),x,inf);
(%o3)                                  0
```

We could intercept ind whenever it comes by (from limit) and raise an exception to limit the damage, but I imagine the bad simplifications could already happen internal to maxima.

This seems to happen with infinity as well, by the way:

```
(%i14) limit(1/x^2,x,0)-limit(1/x^4,x,0);
(%o14)                                 0
```


Sage catches those (when they happen in a way sage can see it happen), so perhaps we should recognize `ind` and a special value--leading to an exception if we can't do anything with it.



---

archive/issue_comments_211335.json:
```json
{
    "body": "Still there in 6.6.",
    "created_at": "2015-04-16T20:09:52Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16185",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16185#issuecomment-211335",
    "user": "dkrenn"
}
```

Still there in 6.6.
