# Issue 21839: cmp -> richcmp for Polynomial

Issue created by migration from https://trac.sagemath.org/ticket/22076

Original creator: jdemeyer

Original creation time: 2016-12-19 12:25:10

CC:  chapoton




---

Comment by jdemeyer created at 2016-12-19 19:00:12

Changing status from new to needs_review.


---

Comment by jdemeyer created at 2016-12-19 19:00:12

New commits:


---

Comment by mmezzarobba created at 2016-12-20 13:54:25

Changing status from needs_review to needs_work.


---

Comment by mmezzarobba created at 2016-12-20 13:54:25

I think this is incorrect:

```
sage: Pol.<x> = RBF[]
sage: Pol(1/3) == Pol(1/3)
False
sage: x/3 == x/3
True
```

If I remember correctly, there were already bugs of this kind with polynomials, but this particular example shows a regression.


---

Comment by jdemeyer created at 2016-12-20 15:28:58

Right. This is due to

```
sage: RBF(1/3) == RBF(1/3)
False
sage: RBF(1/3) != RBF(1/3)
False
```



---

Comment by jdemeyer created at 2016-12-20 16:49:22

This shows a deeper issue with the use of `richcmp_not_equal` (which appears in several places). This specific issue with `RBF` is therefore not limited to polynomials.

Therefore, I would suggest to accept this ticket as-is and then work on improving every use of `richcmp_not_equal` on a follow-up ticket. Would that be acceptable?


---

Comment by mmezzarobba created at 2016-12-20 17:31:49

Replying to [comment:7 jdemeyer]:
> Therefore, I would suggest to accept this ticket as-is and then work on improving every use of `richcmp_not_equal` on a follow-up ticket. Would that be acceptable?

To me, yes.

If someone disagrees, please feel free to revert the ticket to `needs_work`.


---

Comment by mmezzarobba created at 2016-12-20 17:31:49

Changing status from needs_work to positive_review.


---

Comment by vbraun created at 2017-01-21 16:35:01

Resolution: fixed


---

Comment by jdemeyer created at 2017-06-01 09:29:41

Replying to [comment:5 mmezzarobba]:
> I think this is incorrect:
> {{{
> sage: Pol.<x> = RBF[]
> sage: Pol(1/3) == Pol(1/3)
> False
> sage: x/3 == x/3
> True
> }}}

This is now fixed in #22087.
