# Issue 12717: Make is_irreducible() for polymomials consistent across all fields

Issue created by migration from https://trac.sagemath.org/ticket/12889

Original creator: ppurka

Original creation time: 2012-04-30 06:56:57

Assignee: AlexGhitza

Keywords: is_irreducible

This is from a bug reported on [the Sage Notebook bugreports](https://spreadsheets.google.com/pub?key=pCwvGVwSMxTzT6E2xNdo5fA) on Google docs. It has a very simple fix that is needed only for consistency.

```
sage: R.<x> = PolynomialRing(GF(2)); (x-x).is_irreducible()
False
sage: R.<x> = PolynomialRing(GF(3)); (x-x).is_irreducible()
---------------------------------------------------------------------------
ValueError                                Traceback (most recent call last)

/home/punarbasu/<ipython console> in <module>()

/home/punarbasu/Installations/sage-5.0.beta2/local/lib/python2.7/site-packages/sage/rings/polynomial/polynomial_zmod_flint.so in sage.rings.polynomial.polynomial_zmod_flint.Polynomial_zmod_flint.is_irreducible (sage/rings/polynomial/polynomial_zmod_flint.c:14197)()

ValueError: must be nonzero
```



---

Attachment

Apply to devel/sage


---

Comment by ppurka created at 2012-04-30 07:00:46

Changing status from new to needs_review.


---

Comment by fwclarke created at 2012-04-30 08:19:21

Changing status from needs_review to needs_work.


---

Comment by fwclarke created at 2012-04-30 08:19:21

This fixes an incompatibility, but the wrong way round, in my opinion.  
Over most fields it's perfectly valid to ask if the zero polynomial is irreducible (and the answer is, of course, no):

```
sage: fields = [QQ, RR, Qp(7), QuadraticField(-3), GF(2), GF(2^200, 'g'), GF(3^10, 'g'), GF(1009^2, 'g')]
sage: [PolynomialRing(F, 'x')(0).is_irreducible() for F in fields]
[False, False, False, False, False, False, False, False]
```

This is just like

```
sage: ZZ(0).is_prime()
False
```



---

Comment by ppurka created at 2012-04-30 08:33:54

Ok. good. I will do the opposite then. Thanks for pointing this out. I should have checked fields other than GF(p).


---

Comment by ppurka created at 2012-04-30 14:27:31

Apply to devel/sage


---

Attachment

Added new patch which brings `GF(p)` in line with the rest of the functions. I checked in `devel/sage/sage/rings` for other codes and all of them return `False` for `0.is_irreducible()`. Used this grep:

```
...tal/devel/sage/sage/ringsÂ» grep 'def .*is_irreducible(' **/*.py*
integer.pyx:    def is_irreducible(self):
number_field/totallyreal_data.pyx:cdef int easy_is_irreducible(int *a, int n):
polynomial/polynomial_element.pyx:    def is_irreducible(self):
polynomial/polynomial_gf2x.pyx:    def is_irreducible(self):
polynomial/polynomial_rational_flint.pyx:    def is_irreducible(self): 
polynomial/polynomial_zmod_flint.pyx:    def is_irreducible(self):
polynomial/polynomial_zz_pex.pyx:    def is_irreducible(self, algorithm="fast_when_false", iter=1):
```



---

Comment by ppurka created at 2012-04-30 14:31:23

Changing status from needs_work to needs_review.


---

Comment by fwclarke created at 2012-05-02 07:48:14

Changing status from needs_review to positive_review.


---

Comment by fwclarke created at 2012-05-02 07:48:14

This solves the problem.  Positive review.


---

Comment by jdemeyer created at 2012-05-06 12:21:26

Resolution: fixed
