# Issue 19505: CyclotomicField.zeta() inconsistent with zeta_order() and docs

Issue created by migration from https://trac.sagemath.org/ticket/19742

Original creator: jdemeyer

Original creation time: 2015-12-18 13:03:58




---

Comment by jdemeyer created at 2015-12-18 15:50:01

Changing status from new to needs_review.


---

Comment by jdemeyer created at 2015-12-18 15:50:01

New commits:


---

Comment by saraedum created at 2015-12-20 20:03:48

Changing status from needs_review to positive_review.


---

Comment by fwclarke created at 2015-12-23 07:50:51

I don't think this is quite ready.

It would be reasonable to expect that `C.primitive_root_of_unity()` and `C.zeta()` gave the same answer.  But

```
sage: C = CyclotomicField(5)
sage: C.primitive_root_of_unity(), C.zeta()
(-zeta5, -zeta5^3)
```


The new error message

```
sage: C.zeta(4)
...
ValueError: 4 does not divide order of generator (10)
```

is somewhat misleading, since

```
sage: C.gen().multiplicative_order()
5
```

The error message for generic fields is better:

```
sage: K.<a> = NumberField(x^3 - 5)
sage: K.zeta(3)
...
ValueError: There are no 3rd roots of unity in self.
```

and negative arguments are handled differently:

```
sage: C.zeta(-2)
-1
sage: K.zeta(-2)
Traceback (most recent call last)
...
ValueError: n (=-2) must be positive
```

But there is incompatibility with generic fields, for which n=2 is the default (surely a mistake):

```
sage: K = NumberField(x^2 - x + 1, 'a')
sage: C = CyclotomicField(6)
sage: K.zeta(), C.zeta()
(-1, zeta6)
sage: C.is_isomorphic(K)
True
```



---

Comment by fwclarke created at 2015-12-23 07:50:51

Changing status from positive_review to needs_work.


---

Comment by jdemeyer created at 2015-12-23 08:02:31

Changing status from needs_work to positive_review.


---

Comment by jdemeyer created at 2015-12-23 08:02:31

The title of this ticket is not "fix all possible issues with `zeta()`". Open a new ticket if you want other things to be fixed.


---

Comment by jdemeyer created at 2015-12-23 08:09:16

Replying to [comment:5 fwclarke]:
> It would be reasonable to expect that `C.primitive_root_of_unity()` and `C.zeta()` gave the same answer.

Maybe reasonable, but there are good reasons why this is not the case:

1. `C.zeta()` is a very fast, almost trivial operation because it's specialized for cyclotomic fields.

2. `C.primitive_root_of_unity()` uses a computation in PARI. This must be so, in order to be consistent with other uses of the PARI unit group.

So neither making `zeta` an alias of `primitive_root_of_unity` nor making `primitive_root_of_unity` an alias of `zeta` looks like a good idea.


---

Comment by jdemeyer created at 2015-12-23 08:10:09

Replying to [comment:5 fwclarke]:
> The new error message
> {{{
> sage: C.zeta(4)
> ...
> ValueError: 4 does not divide order of generator (10)
> }}}
> is somewhat misleading

It's not a _new_ error message, only a rephrasing of the old message. But I see your point.


---

Comment by jdemeyer created at 2015-12-23 08:11:10

Feel free to open a new ticket to make the error messages consistent.


---

Comment by vbraun created at 2015-12-23 11:06:29

Resolution: fixed
