# Issue 10316: how to copy/paste InfinitePolynomialRings?

Issue created by migration from Trac.

Original creator: zimmerma

Original creation time: 2010-11-24 07:39:08

Assignee: burcin

CC:  mhansen simonking jdemeyer

when one creates an object with `InfinitePolynomialRing`:

```
sage: R.<a> = InfinitePolynomialRing(ZZ)
sage: f = a[0]+a[1]+a[2]
```

the variables are printed `a_i` instead of `a[i]`:

```
sage: f
a_2 + a_1 + a_0
```

and one cannot copy/paste the result of a computation:

```
sage: a_2 + a_1 + a_0 
---------------------------------------------------------------------------
NameError                                 Traceback (most recent call last)

/users/caramel/zimmerma/try/<ipython console> in <module>()

NameError: name 'a_2' is not defined
```

Is there a workaround?


---

Comment by kcrisman created at 2011-03-16 16:28:08

I don't know that there is.  

```
sage: sage.rings.polynomial.infinite_polynomial_ring??
```

has some very extensive documentation that clearly states what the representations are. 

This isn't the only place this happens in Sage:

```
sage: vector([1,2,3])
(1, 2, 3)
sage: (1, 2, 3) # this is a tuple, not a vector
(1, 2, 3)
sage: V = vector([1,2,3]); V
(1, 2, 3)
sage: v = (1, 2, 3)
sage: V.base_ring()
Integer Ring
sage: v.base_ring()
AttributeError: 'tuple' object has no attribute 'base_ring'
```

Ordinarily I would be more eager to try to resolve such conflicts, but anyone using an infinite polynomial ring probably knows what they are doing.  

I would just assign the result of the computation to a variable.  Otherwise I don't see much happening here.  I'm cc:ing the authors of this file in just to be sure, but probably this should be closed as 'wontfix'.

Also changing component, though 'rings' would be nice to have there as an option...


---

Comment by kcrisman created at 2011-03-16 16:28:08

Changing assignee from burcin to AlexGhitza.


---

Comment by kcrisman created at 2011-03-16 16:28:08

Changing component from calculus to basic arithmetic.


---

Comment by zimmerma created at 2011-03-16 16:37:08

Replying to [comment:1 kcrisman]:

contrary to your example, the problem is that you can't even copy/paste `a_2 + a_1 + a_0`
without defining at hand the corresponding variables, which then questions the usefulness of
`InfinitePolynomialRings`...

Paul


---

Comment by kcrisman created at 2011-03-16 17:55:07

> contrary to your example, the problem is that you can't even copy/paste `a_2 + a_1 + a_0`
> without defining at hand the corresponding variables, which then questions the usefulness of
> `InfinitePolynomialRings`...

Perhaps, but I'll leave answering that to the people who wrote it.   Presumably one uses it only in the form of putting `f` in some other computation, leaving the printed output just for viewing, not for computation.  

I'm just pointing out that there are other times where pasting the output of a command does not give the same thing as the output, and that it can't always be treated as a bug.  Matrices are another example where the string representation is not 'useful' in that way.  Whether it raises an error or not would depend on the context.  At the same time, I agree that it would be annoying in the context of (say) a finite polynomial ring, or the Symbolic 'ring'.


---

Comment by SimonKing created at 2011-03-16 21:08:29

Resolution: wontfix


---

Comment by SimonKing created at 2011-03-16 21:08:29

1. I see no reason whatsoever to expect that the string representation of any object should return the object by copy-and-paste. Just think of any element of a finite prime field: Its string representation will yield an integer by copy-and-paste - not a prime field element. Or just think of `ZZ`: Try to copy-and-paste its string representation...

This is why I resolve the ticket as wontfix.

2. There are two or three reasons why I decided to represent the elements of an infinite polynomial ring the way they are.
  (i) In the literature, the notation for the indices of variables is by subscript. Hence, Latex style, `_`.

  (ii) The arithmetic and, in particular, the Gröbner machinery, is based on finite polynomial rings. It is reasonable to have the same variable names both for the finite and the infinite polynomial ring. But `x[3]` is no valid variable name of a finite polynomial ring.

  (ii+1/2) I find `x_1` nicer to read than `x[1]`.

3. Here is your workaround:

```
sage: R.<a> = InfinitePolynomialRing(ZZ)
sage: f = a[0]+a[1]+a[2]
sage: f
a_2 + a_1 + a_0
sage: R('a_2 + a_1 + a_0')
a_2 + a_1 + a_0
sage: R('a_2 + a_1 + a_0')==f
True
```



---

Comment by SimonKing created at 2011-03-16 21:18:22

Replying to [comment:2 zimmerma]:
> Replying to [comment:1 kcrisman]:
> 
> contrary to your example, the problem is that you can't even copy/paste `a_2 + a_1 + a_0`
> without defining at hand the corresponding variables, which then questions the usefulness of
> `InfinitePolynomialRings`...

The purpose of `InfinitePolynomialRing` is certainly not to insert infinitely many identifiers into the global name space.
Its main purpose is not even to have a convenient way to create a countable set of variables and do arithmetic with it.

The main purpose is described in the documentation: Do computations related with finitely generated ideals in countably infinitely many variables that are set-wise invariant under permutation of the variables (ideal containment, etc). The background is the theory of symmetric Gröbner bases due to Aschenbrenner and Hillar.


---

Comment by kcrisman created at 2011-03-16 23:10:35

I think in general the release manager likes to do the official closing.  I'm cc:ing him, though, so that this gets recorded; there shouldn't be any objection to this.  Nice workaround, by the way - that is extremely natural.


---

Comment by SimonKing created at 2011-03-17 06:37:31

Replying to [comment:6 kcrisman]:
> I think in general the release manager likes to do the official closing.

Oops, sorry! 

I think there really should be the possibility to just _mark_ a ticket as "invalid" or "wontfix" or "duplicate", without actually _closing_ it. I mean, what else should I have done? Change it to "positive review"???


---

Comment by jdemeyer created at 2011-03-17 09:42:18

Replying to [comment:7 SimonKing]:
> I mean, what else should I have done? Change it to "positive review"???

Yes please.


---

Comment by jdemeyer created at 2011-03-17 09:45:54

To clarfiy: if you put a ticket to positive review with a milestone of sage-duplicate/invalid/wontfix, it will show up in [Tickets with positive review](http://trac.sagemath.org/sage_trac/report/11) and I will see that it needs to be closed.


---

Comment by SimonKing created at 2011-03-17 09:55:05

Replying to [comment:10 jdemeyer]:
> To clarfiy: if you put a ticket to positive review with a milestone of sage-duplicate/invalid/wontfix, it will show up in [Tickets with positive review](http://trac.sagemath.org/sage_trac/report/11) and I will see that it needs to be closed.

Thank you, that makes sense. I wasn't aware that duplicate etc. exists as milestone. Should I do so with this particular ticket as well, or shall I leave it closed now?


---

Comment by jdemeyer created at 2011-03-17 11:41:38

Now just leave it as it is.

I am also adding your name as Reviewer with the meaning of "it was Simon King who 'reviewed' the fact that this ticket should be closed".
