# Issue 31215: Problem with solution_dict in solve

Issue created by migration from https://trac.sagemath.org/ticket/31452

Original creator: @GMS103

Original creation time: 2021-03-04 06:46:52

CC:  chapoton

This is with

```
┌────────────────────────────────────────────────────────────────────┐
│ SageMath version 9.2, Release Date: 2020-10-24                     │
│ Using Python 3.8.5. Type "help()" for help.                        │
└────────────────────────────────────────────────────────────────────┘
```

All of these work as expected:

```                                                                                                                                            
sage: solve(x==3,x)                                                                                                                                            
sage: solve([x==3],x)                                                                                                                                          
sage: solve([x==3],[x])                                                                                                                                        
sage: solve(x==3,[x])                                                                                                                                          
sage: solve(x==3,x,solution_dict=True)                                                                                                                         
sage: solve([x==3],x,solution_dict=True)                                                                                                                       
```

So I wonder why these give an error:

```
sage: solve(x==3,[x],solution_dict=True)                                                                                                                     
sage: solve([x==3],[x],solution_dict=True)                                                                                                                     
[...]
TypeError: 'sage.symbolic.expression.Expression' object is not iterable
```

I am sure you have guessed:  I am trying to do this in a program where the number of equations and the number of variables are variable.

Is it necessary to test for the case where there is only one variable?
I hope not.


---

Comment by mkoeppe created at 2021-05-10 17:42:09

Moving to 9.4, as 9.3 has been released.


---

Comment by tscrim created at 2021-05-10 23:50:18

Changing status from new to needs_review.


---

Comment by tscrim created at 2021-05-10 23:50:18

Simple corner case. I also fix this while I am at it:

```sage
sage: solve([x==3], x, solution_dict=True, algorithm='sympy')                                             
[x == 3]
sage: solve([x==3, y==1], [x,y], solution_dict=True, algorithm='sympy')  # good
[{x: 3, y: 1}]
```

----
New commits:


---

Comment by tscrim created at 2021-05-13 02:30:48

Bot is morally green.


---

Comment by chapoton created at 2021-05-13 07:31:35

Changing status from needs_review to positive_review.


---

Comment by chapoton created at 2021-05-13 07:31:35

ok


---

Comment by tscrim created at 2021-05-13 08:13:18

Thank you!


---

Comment by @GMS103 created at 2021-05-13 12:04:08

Wonderful!

Thanks to all of you!


---

Comment by vbraun created at 2021-05-27 20:29:09

Resolution: fixed
