# Issue 32048: FractionField does not reduce fractions correctly over some coefficient rings

archive/issues_032048.json:
```json
{
    "body": "Keywords: polynomials, fraction fields\n\nFractions are note reduced when dividing two monomials in a fraction field over a polynomial ring with coefficients in `RR` or `CC`. Here is a very simple example, but the problem persists for multivariate rings as well:\n\n```\nsage: F = RR['x'].fraction_field()\nsage: F.inject_variables()\nDefining x\nsage: x/x        # this should be 1\nx/x\nsage: x.is_unit()\nTrue\nsage: ~x\n1.00000000000000/x\nsage: ~x * x     # this should be 1\nx/x\nsage: x/x == 1\nTrue\n```\n\nSame problem occurs with `CC`, `CDF`, `CIF`, `RDF`, `RIF`, `RBF`, etc.\n\nIssue created by migration from https://trac.sagemath.org/ticket/32285\n\n",
    "created_at": "2021-07-27T16:27:49Z",
    "labels": [
        "component: algebra",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-9.8",
    "title": "FractionField does not reduce fractions correctly over some coefficient rings",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/32048",
    "user": "https://github.com/saliola"
}
```
Keywords: polynomials, fraction fields

Fractions are note reduced when dividing two monomials in a fraction field over a polynomial ring with coefficients in `RR` or `CC`. Here is a very simple example, but the problem persists for multivariate rings as well:

```
sage: F = RR['x'].fraction_field()
sage: F.inject_variables()
Defining x
sage: x/x        # this should be 1
x/x
sage: x.is_unit()
True
sage: ~x
1.00000000000000/x
sage: ~x * x     # this should be 1
x/x
sage: x/x == 1
True
```

Same problem occurs with `CC`, `CDF`, `CIF`, `RDF`, `RIF`, `RBF`, etc.

Issue created by migration from https://trac.sagemath.org/ticket/32285


