# Issue 23384: Quotients of univariate polynomial rings over ZZ return mathematical incorrect answers

archive/issues_023384.json:
```json
{
    "body": "CC:  @slel\n\n\n```\nsage: R.<x> = ZZ[]\nsage: I = R.ideal([x,2]); I\nIdeal (x, 2) of Univariate Polynomial Ring in x over Integer Ring\nsage: S = R.quo(I)\nsage: S(x)\nxbar\nsage: S(x)==S(0)\nFalse\nsage: S(2)==S(2)\nTrue\nsage: S(2)==S(0)\nFalse\n```\n\n\nNote that if you create the quotient as a multivariate polynomial ring, then it works fine!\n\n\n```\nsage: R.<x> = PolynomialRing(ZZ,1)\nsage: I = R.ideal([x,2]); I\nIdeal (x, 2) of Multivariate Polynomial Ring in x over Integer Ring\nsage: S = R.quo(I)\nsage: S(x)==0\nTrue\nsage: S(2)==0\nTrue\n```\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/23621\n\n",
    "created_at": "2017-08-14T17:03:43Z",
    "labels": [
        "component: commutative algebra",
        "critical",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-9.8",
    "title": "Quotients of univariate polynomial rings over ZZ return mathematical incorrect answers",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/23384",
    "user": "https://github.com/koffie"
}
```
CC:  @slel


```
sage: R.<x> = ZZ[]
sage: I = R.ideal([x,2]); I
Ideal (x, 2) of Univariate Polynomial Ring in x over Integer Ring
sage: S = R.quo(I)
sage: S(x)
xbar
sage: S(x)==S(0)
False
sage: S(2)==S(2)
True
sage: S(2)==S(0)
False
```


Note that if you create the quotient as a multivariate polynomial ring, then it works fine!


```
sage: R.<x> = PolynomialRing(ZZ,1)
sage: I = R.ideal([x,2]); I
Ideal (x, 2) of Multivariate Polynomial Ring in x over Integer Ring
sage: S = R.quo(I)
sage: S(x)==0
True
sage: S(2)==0
True
```


Issue created by migration from https://trac.sagemath.org/ticket/23621





---

archive/issue_comments_326928.json:
```json
{
    "body": "The problem is that `I` is just a generic ideal and doesn't implement a `reduce` method.",
    "created_at": "2017-08-18T02:34:31Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23384",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23384#issuecomment-326928",
    "user": "https://github.com/roed314"
}
```

The problem is that `I` is just a generic ideal and doesn't implement a `reduce` method.



---

archive/issue_comments_326929.json:
```json
{
    "body": "To solve this, I think one needs to implement a new class for ideals in `ZZ['x']` and set `_ideal_class_` appropriately on `R`.  Of course, one can argue that the default behavior of the `reduce` method on a generic ideal should be to raise an error rather than just return the input unchanged.",
    "created_at": "2017-08-18T02:37:50Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23384",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23384#issuecomment-326929",
    "user": "https://github.com/roed314"
}
```

To solve this, I think one needs to implement a new class for ideals in `ZZ['x']` and set `_ideal_class_` appropriately on `R`.  Of course, one can argue that the default behavior of the `reduce` method on a generic ideal should be to raise an error rather than just return the input unchanged.



---

archive/issue_comments_326930.json:
```json
{
    "body": "Yeah I totally agree that it should raise an error, because this implementation does not satisfy the assumption on reduce in other parts of the code. For example this is an excerpt from `sage/rings/quotient_ring.py`.\n\n```\nThe only requirement is that the two-sided ideal `I`\nprovides a ``reduce`` method so that ``I.reduce(x)`` is the normal\nform of an element `x` with respect to `I` (i.e., we have\n``I.reduce(x) == I.reduce(y)`` if `x-y \\in I`, and\n``x - I.reduce(x) in I``). H\n```\n\nAnd I think that this is a logic requirement to put on the reduce method.",
    "created_at": "2017-08-31T08:18:31Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23384",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23384#issuecomment-326930",
    "user": "https://github.com/koffie"
}
```

Yeah I totally agree that it should raise an error, because this implementation does not satisfy the assumption on reduce in other parts of the code. For example this is an excerpt from `sage/rings/quotient_ring.py`.

```
The only requirement is that the two-sided ideal `I`
provides a ``reduce`` method so that ``I.reduce(x)`` is the normal
form of an element `x` with respect to `I` (i.e., we have
``I.reduce(x) == I.reduce(y)`` if `x-y \in I`, and
``x - I.reduce(x) in I``). H
```

And I think that this is a logic requirement to put on the reduce method.



---

archive/issue_comments_326931.json:
```json
{
    "body": "Ok there are quite a few doctest failures. If I just make it raise an error. Ironically the first failure is\n\n```\nsage: sage: MS = MatrixSpace(GF(5),2,2)\n....: sage: I = MS*[MS.0*MS.1,MS.2+MS.3]*MS\n....: sage: Q = MS.quo(I)\n....: sage: Q.0*Q.1   # indirect doctest\n....: \n---------------------------------------------------------------------------\nNotImplementedError                       Traceback (most recent call last)\n...\nNotImplementedError: reduce not implemented for Twosided Ideal \n(\n  [0 1]\n  [0 0],\n\n  [0 0]\n  [1 1]\n)\n of Full MatrixSpace of 2 by 2 dense matrices over Finite Field of size 5\n```\n\n\nwhich was added to test that #11068 is fixed, the ticket where the above text about \"The only requirement is that the two-sided ideal I...\" comes from.",
    "created_at": "2017-08-31T08:34:09Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23384",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23384#issuecomment-326931",
    "user": "https://github.com/koffie"
}
```

Ok there are quite a few doctest failures. If I just make it raise an error. Ironically the first failure is

```
sage: sage: MS = MatrixSpace(GF(5),2,2)
....: sage: I = MS*[MS.0*MS.1,MS.2+MS.3]*MS
....: sage: Q = MS.quo(I)
....: sage: Q.0*Q.1   # indirect doctest
....: 
---------------------------------------------------------------------------
NotImplementedError                       Traceback (most recent call last)
...
NotImplementedError: reduce not implemented for Twosided Ideal 
(
  [0 1]
  [0 0],

  [0 0]
  [1 1]
)
 of Full MatrixSpace of 2 by 2 dense matrices over Finite Field of size 5
```


which was added to test that #11068 is fixed, the ticket where the above text about "The only requirement is that the two-sided ideal I..." comes from.



---

archive/issue_comments_326932.json:
```json
{
    "body": "The second failure points at #13999 of which this ticket basically is a dupe.",
    "created_at": "2017-08-31T08:42:53Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23384",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23384#issuecomment-326932",
    "user": "https://github.com/koffie"
}
```

The second failure points at #13999 of which this ticket basically is a dupe.



---

archive/issue_comments_326933.json:
```json
{
    "body": "All failures will probably be fixed if these three tests pass\n\n```\nsage: MS = MatrixSpace(GF(5),2,2)\nsage: I = MS*[MS.0*MS.1,MS.2+MS.3]*MS\nsage: Q = MS.quo(I)\nsage: Q.0*Q.1   # indirect doctest\n[0 1]\n[0 0]\n```\n\n\n```\nsage: R.<x> = PolynomialRing(ZZ)\nsage: I = R.ideal([4 + 3*x + x^2, 1 + x^2])\nsage: S = R.quotient_ring(I);\nsage: TestSuite(S).run(skip=['_test_nonzero_equal', '_test_elements', '_test_zero'])\n```\n\n\n```\nsage: S = SteenrodAlgebra(2)\nsage: I = S*[S.0+S.1]*S\nsage: Q = S.quo(I)\nsage: Q.0\nSq(1)\n```\n\nI consider all three of them bugs, so this strengthens my believe that it is better to raise a NotImplementedError.",
    "created_at": "2017-08-31T08:59:47Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23384",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23384#issuecomment-326933",
    "user": "https://github.com/koffie"
}
```

All failures will probably be fixed if these three tests pass

```
sage: MS = MatrixSpace(GF(5),2,2)
sage: I = MS*[MS.0*MS.1,MS.2+MS.3]*MS
sage: Q = MS.quo(I)
sage: Q.0*Q.1   # indirect doctest
[0 1]
[0 0]
```


```
sage: R.<x> = PolynomialRing(ZZ)
sage: I = R.ideal([4 + 3*x + x^2, 1 + x^2])
sage: S = R.quotient_ring(I);
sage: TestSuite(S).run(skip=['_test_nonzero_equal', '_test_elements', '_test_zero'])
```


```
sage: S = SteenrodAlgebra(2)
sage: I = S*[S.0+S.1]*S
sage: Q = S.quo(I)
sage: Q.0
Sq(1)
```

I consider all three of them bugs, so this strengthens my believe that it is better to raise a NotImplementedError.



---

archive/issue_comments_326934.json:
```json
{
    "body": "I think that all the matrix space examples will not give any interesting doctest, since matrix rings over fields are simple and hence there are no two sided ideals. Although this means that the reduce function is very easy to implement! I don't know enough about Steenrod algebra's in order to create a meaningful reduce method.",
    "created_at": "2017-09-02T04:07:49Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23384",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23384#issuecomment-326934",
    "user": "https://github.com/koffie"
}
```

I think that all the matrix space examples will not give any interesting doctest, since matrix rings over fields are simple and hence there are no two sided ideals. Although this means that the reduce function is very easy to implement! I don't know enough about Steenrod algebra's in order to create a meaningful reduce method.



---

archive/issue_comments_326935.json:
```json
{
    "body": "Changing keywords from \"\" to \"ideal\".",
    "created_at": "2021-12-07T16:03:20Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23384",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23384#issuecomment-326935",
    "user": "https://github.com/slel"
}
```

Changing keywords from "" to "ideal".
