# Issue 22156: sage_input for SR

archive/issues_022156.json:
```json
{
    "body": "CC:  @vbraun @rwst\n\n\n```\nsage: var('x')\nx\nsage: sage_input(x)\nValueError: Can't convert x to sage_input form\n```\n\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/22393\n\n",
    "created_at": "2017-02-20T02:03:05Z",
    "labels": [
        "component: symbolics"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-7.6",
    "title": "sage_input for SR",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/22156",
    "user": "https://github.com/mkoeppe"
}
```
CC:  @vbraun @rwst


```
sage: var('x')
x
sage: sage_input(x)
ValueError: Can't convert x to sage_input form
```



Issue created by migration from https://trac.sagemath.org/ticket/22393





---

archive/issue_comments_307461.json:
```json
{
    "body": "I fear this is not enough for wilder symbolic expressions:\n\n\n```\nsage: a = SR(Zmod(4)(5))\nsage: a\n1\nsage: a.parent()\nSymbolic Ring\nsage: a*6\n2\nsage: SR(repr(a)) * 6\n6\n```\n",
    "created_at": "2017-04-20T02:46:25Z",
    "issue": "https://github.com/sagemath/sagetest/issues/22156",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/22156#issuecomment-307461",
    "user": "https://trac.sagemath.org/admin/accounts/users/tmonteil"
}
```

I fear this is not enough for wilder symbolic expressions:


```
sage: a = SR(Zmod(4)(5))
sage: a
1
sage: a.parent()
Symbolic Ring
sage: a*6
2
sage: SR(repr(a)) * 6
6
```

