# Issue 33090: variable name '@c' is not alphanumeric

archive/issues_033090.json:
```json
{
    "body": "CC:  @slel\n\nKeywords: singular\n\nMultivariate polynomial rings over `QQbar`\nwith a variable named `c` have problems.\n\nBoth of the following\n\n```\nsage: A.<a, c> = QQbar[]\nsage: factor(a)\n\nsage: A.<c> = PolynomialRing(QQbar, 1)\nsage: factor(c)\n```\ncause this value error:\n\n```\nValueError: variable name '@c' is not alphanumeric\n```\n\nNo such problem with univariate polynomial rings\nor multivariate ones with other variable names:\n\n```\nsage: A.<a> = QQbar[]\nsage: factor(a)\na\nsage: A.<c> = QQbar[]\nsage: factor(c)\nc\nsage: A.<a, b> = QQbar[]\nsage: factor(a)\na\n```\nMultivariate polynomial rings over `QQ`,\neven using variable name `c`, are fine too:\n\n```\nsage: A.<a, c> = QQ[]\nsage: factor(a)\na\nsage: A.<c> = PolynomialRing(QQ, 1)\nsage: factor(c)\nc\n```\n\n---\n\nInitial report by Anne Vaugon:\n\n```\nsage: A.<a, b, c, x, y, S> = QQbar[]\nsage: p = (a - x)^2 + y^2 - b^2\nsage: q = x^2 + y^2 - c^2\nsage: r = a * y - 2 * S\nsage: r1 = p.resultant(q, x)\nsage: r2 = r.resultant(r1, y)\nsage: factor(r2 - a^2 * 16 * S^2)\nTraceback (most recent call last):\n...\nValueError: variable name '@c' is not alphanumeric\n```\n\nIssue created by migration from https://trac.sagemath.org/ticket/33327\n\n",
    "created_at": "2022-02-12T13:58:14Z",
    "labels": [
        "component: interfaces",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-9.8",
    "title": "variable name '@c' is not alphanumeric",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/33090",
    "user": "https://github.com/mezzarobba"
}
```
CC:  @slel

Keywords: singular

Multivariate polynomial rings over `QQbar`
with a variable named `c` have problems.

Both of the following

```
sage: A.<a, c> = QQbar[]
sage: factor(a)

sage: A.<c> = PolynomialRing(QQbar, 1)
sage: factor(c)
```
cause this value error:

```
ValueError: variable name '@c' is not alphanumeric
```

No such problem with univariate polynomial rings
or multivariate ones with other variable names:

```
sage: A.<a> = QQbar[]
sage: factor(a)
a
sage: A.<c> = QQbar[]
sage: factor(c)
c
sage: A.<a, b> = QQbar[]
sage: factor(a)
a
```
Multivariate polynomial rings over `QQ`,
even using variable name `c`, are fine too:

```
sage: A.<a, c> = QQ[]
sage: factor(a)
a
sage: A.<c> = PolynomialRing(QQ, 1)
sage: factor(c)
c
```

---

Initial report by Anne Vaugon:

```
sage: A.<a, b, c, x, y, S> = QQbar[]
sage: p = (a - x)^2 + y^2 - b^2
sage: q = x^2 + y^2 - c^2
sage: r = a * y - 2 * S
sage: r1 = p.resultant(q, x)
sage: r2 = r.resultant(r1, y)
sage: factor(r2 - a^2 * 16 * S^2)
Traceback (most recent call last):
...
ValueError: variable name '@c' is not alphanumeric
```

Issue created by migration from https://trac.sagemath.org/ticket/33327





---

archive/issue_comments_471201.json:
```json
{
    "body": "Changing type from PLEASE CHANGE to defect.",
    "created_at": "2022-02-12T13:58:31Z",
    "issue": "https://github.com/sagemath/sagetest/issues/33090",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/33090#issuecomment-471201",
    "user": "https://github.com/mezzarobba"
}
```

Changing type from PLEASE CHANGE to defect.



---

archive/issue_comments_471202.json:
```json
{
    "body": "Here is a minimal example:\n\n```\nsage: A.<a,c> = QQbar[]\nsage: factor(a^2)\n    ...\nValueError: variable name '@c' is not alphanumeric\n```\nI reproduced the error all the way back to 9.1 (on `CoCalc`), which is as far as I could go, so this is not a new bug.\n\nInterestingly, there seems to be something special about the variable name `c`, because there is no error if we use a different letter (or, at least, some other letters):\n\n```\nsage: A.<a,b> = QQbar[]\nsage: factor(a^2)\na^2\n```\nSo changing `c` to a different variable name seems to be a workaround (in 9.5 on `CoCalc`, at least):\n\n```\nsage: A.<a,b,c1,x,y,S> = QQbar[]\n....: p = (a-x)**2+y**2-b**2\n....: q = x**2 + y**2 - c1**2\n....: r = a*y-2*S\n....: r1 = p.resultant(q,x)\n....: r2 = r.resultant(r1,y)\n....: factor(r2-a**2*16*S**2)\n(a - b - c1) * (a - b + c1) * (a + b - c1) * (a + b + c1) * a^2\n```",
    "created_at": "2022-02-13T06:07:01Z",
    "issue": "https://github.com/sagemath/sagetest/issues/33090",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/33090#issuecomment-471202",
    "user": "https://github.com/DaveWitteMorris"
}
```

Here is a minimal example:

```
sage: A.<a,c> = QQbar[]
sage: factor(a^2)
    ...
ValueError: variable name '@c' is not alphanumeric
```
I reproduced the error all the way back to 9.1 (on `CoCalc`), which is as far as I could go, so this is not a new bug.

Interestingly, there seems to be something special about the variable name `c`, because there is no error if we use a different letter (or, at least, some other letters):

```
sage: A.<a,b> = QQbar[]
sage: factor(a^2)
a^2
```
So changing `c` to a different variable name seems to be a workaround (in 9.5 on `CoCalc`, at least):

```
sage: A.<a,b,c1,x,y,S> = QQbar[]
....: p = (a-x)**2+y**2-b**2
....: q = x**2 + y**2 - c1**2
....: r = a*y-2*S
....: r1 = p.resultant(q,x)
....: r2 = r.resultant(r1,y)
....: factor(r2-a**2*16*S**2)
(a - b - c1) * (a - b + c1) * (a + b - c1) * (a + b + c1) * a^2
```



---

archive/issue_comments_471203.json:
```json
{
    "body": "Correction: that \"minimal\" example isn't actually minimal, because replacing `a^2` with `a` still gives the error.\n\n```\nsage: A.<a,c> = QQbar[]\nsage: factor(a)\n    ...\nValueError: variable name '@c' is not alphanumeric\n```",
    "created_at": "2022-02-13T08:45:27Z",
    "issue": "https://github.com/sagemath/sagetest/issues/33090",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/33090#issuecomment-471203",
    "user": "https://github.com/DaveWitteMorris"
}
```

Correction: that "minimal" example isn't actually minimal, because replacing `a^2` with `a` still gives the error.

```
sage: A.<a,c> = QQbar[]
sage: factor(a)
    ...
ValueError: variable name '@c' is not alphanumeric
```



---

archive/issue_events_087949.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-05-03T15:17:06Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/33090",
    "milestone": "sage-9.7",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/33090#event-87949"
}
```



---

archive/issue_comments_471204.json:
```json
{
    "body": "An even smaller reproducer:\n\n```\nsage: A.<c> = PolynomialRing(QQbar, 1)\nsage: factor(c)\nTraceback (most recent call last):\n...\nValueError: variable name '@c' is not alphanumeric\n```",
    "created_at": "2022-05-16T13:47:38Z",
    "issue": "https://github.com/sagemath/sagetest/issues/33090",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/33090#issuecomment-471204",
    "user": "https://github.com/slel"
}
```

An even smaller reproducer:

```
sage: A.<c> = PolynomialRing(QQbar, 1)
sage: factor(c)
Traceback (most recent call last):
...
ValueError: variable name '@c' is not alphanumeric
```



---

archive/issue_comments_471205.json:
```json
{
    "body": "I think it happens at\n[interfaces/singular.py/1607](https://github.com/sagemath/sagetrac-mirror/blob/master/src/sage/interfaces/singular.py?id=d3204606ecb5b0e462cc755a9b1d287a6cdf2784#n1607)\nIn the traceback that leads to the error, we have:\n\n```\ndebug> p singular.eval('basering')\nipdb> p singular.eval('basering')\n// coefficients: QQ(@c)\n// number of vars : 1\n//        block   1 : ordering dp\n//                  : names    c\n//        block   2 : ordering C'\n```\nso the variable does seem to have the *name* c, but somehow it prints as ``@`c`. So unless there is some strange encoding happening on the sage side when this ring is created, it's probably some singular escape mechanism because ... perhaps c has a special meaning in singular?\n\nI think what happens is that ``@`` is a singular escape mechanism for duplicate names. Note the following in singular:\n\n```\n> ring r = 0,(c), dp; r;\n// ** redefining r (ring r = 0,(c), dp; r;)\n// coefficients: QQ\n// number of vars : 1\n//        block   1 : ordering dp\n//                  : names    c\n//        block   2 : ordering C\n> ring r = 0,(c,c), dp; r;\n// ** name conflict var(1) and var(2): `c`, rename to `@c`in >>ring r = 0,(c,c), dp; r;<<\nin STDIN:14\n// ** redefining r (ring r = 0,(c,c), dp; r;)\n// coefficients: QQ\n// number of vars : 2\n//        block   1 : ordering dp\n//                  : names    c @c\n//        block   2 : ordering C\n```\n\nNote how the repeated c has grown an ``@``?\n\nIn the ring that seems to happen in this example, the *coefficients* are `QQ(`@`c)` and then we have a polynomial ring in `c` over it. So I suspect the real problem is in the sage code, where a function field in `c` is made, which then later forces singular to escape one of the variables when the ring `QQ(c)[c]` gets created.\n\nSo I suspect that in the factoring code over QQbar, there will be a hardcoded `c` somewhere.",
    "created_at": "2022-05-16T16:16:30Z",
    "issue": "https://github.com/sagemath/sagetest/issues/33090",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/33090#issuecomment-471205",
    "user": "https://github.com/nbruin"
}
```

I think it happens at
[interfaces/singular.py/1607](https://github.com/sagemath/sagetrac-mirror/blob/master/src/sage/interfaces/singular.py?id=d3204606ecb5b0e462cc755a9b1d287a6cdf2784#n1607)
In the traceback that leads to the error, we have:

```
debug> p singular.eval('basering')
ipdb> p singular.eval('basering')
// coefficients: QQ(@c)
// number of vars : 1
//        block   1 : ordering dp
//                  : names    c
//        block   2 : ordering C'
```
so the variable does seem to have the *name* c, but somehow it prints as ``@`c`. So unless there is some strange encoding happening on the sage side when this ring is created, it's probably some singular escape mechanism because ... perhaps c has a special meaning in singular?

I think what happens is that ``@`` is a singular escape mechanism for duplicate names. Note the following in singular:

```
> ring r = 0,(c), dp; r;
// ** redefining r (ring r = 0,(c), dp; r;)
// coefficients: QQ
// number of vars : 1
//        block   1 : ordering dp
//                  : names    c
//        block   2 : ordering C
> ring r = 0,(c,c), dp; r;
// ** name conflict var(1) and var(2): `c`, rename to `@c`in >>ring r = 0,(c,c), dp; r;<<
in STDIN:14
// ** redefining r (ring r = 0,(c,c), dp; r;)
// coefficients: QQ
// number of vars : 2
//        block   1 : ordering dp
//                  : names    c @c
//        block   2 : ordering C
```

Note how the repeated c has grown an ``@``?

In the ring that seems to happen in this example, the *coefficients* are `QQ(`@`c)` and then we have a polynomial ring in `c` over it. So I suspect the real problem is in the sage code, where a function field in `c` is made, which then later forces singular to escape one of the variables when the ring `QQ(c)[c]` gets created.

So I suspect that in the factoring code over QQbar, there will be a hardcoded `c` somewhere.



---

archive/issue_comments_471206.json:
```json
{
    "body": "Unfortunately, the problem is the absfact singular library itself:\n\n```\n> LIB \"absfact.lib\";\n// ** loaded /usr/local/sage/sage-git/local/bin/../share/singular/LIB/absfact.lib (4.1.2.0,Feb_2019)\n> ring R = (0), (c), lp;\n> poly p = c^2+1;\n> def S = absFactorize(p);\n\n// 'absFactorize' created a ring, in which a list absolute_factors (the\n// absolute factors) is stored.\n// To access the list of absolute factors, type (if the name S was assigned\n// to the return value):\n//        setring(S); absolute_factors;\n  \n> setring(S);\n> absolute_factors;\n[1]:\n   _[1]=1\n   _[2]=c+(-@c)\n[2]:\n   1,1\n[3]:\n   _[1]=(@c)\n   _[2]=(@c^2+1)\n[4]:\n   2\n> S;\n// coefficients: QQ(@c)\n// number of vars : 1\n//        block   1 : ordering lp\n//                  : names    c\n//        block   2 : ordering C\n\n```\nso apparently, it chooses the name \"c\" for the algebraic element it thinks it needs to make an extension where the polynomial fully factors. To compare:\n\n```\n> ring R = (0), (x,y), lp;\n// ** redefining R (ring R = (0), (x,y), lp;)\n> poly p = x^2+y^2;\n> def S = absFactorize(p);\n// ** redefining S (def S = absFactorize(p);)\n\n// 'absFactorize' created a ring, in which a list absolute_factors (the\n// absolute factors) is stored.\n// To access the list of absolute factors, type (if the name S was assigned\n// to the return value):\n//        setring(S); absolute_factors;\n  \n> setring(S);\n> absolute_factors;\n[1]:\n   _[1]=1\n   _[2]=(a)*x-y\n[2]:\n   1,1\n[3]:\n   _[1]=(a)\n   _[2]=(a2+1)\n[4]:\n   2\n```\n[note that here `a` is chosen as name!]\n\nand\n\n```\n> ring R = (0), (a,b), lp;\n// ** redefining R (ring R = (0), (a,b), lp;)\n> poly p = a^2+b^2;\n> def S= absFactorize(p);\n// ** redefining S (def S= absFactorize(p);)\n\n// 'absFactorize' created a ring, in which a list absolute_factors (the\n// absolute factors) is stored.\n// To access the list of absolute factors, type (if the name S was assigned\n// to the return value):\n//        setring(S); absolute_factors;\n  \n> setring(S);\n> absolute_factors;\n[1]:\n   _[1]=1\n   _[2]=(c)*a-b\n[2]:\n   1,1\n[3]:\n   _[1]=(c)\n   _[2]=(c2+1)\n[4]:\n   2\n```\n[it seems to avoid the clash here by going to `c`]\n\nThen, if we step up to `ring = (0), (a,b,c), lp;` it indeed cops out with ``@`c` as name for the algebraic element. So for now it seems ``@`c` might just be filtered for and substituted with `__SAGE_CRAZY_ALGEBRAIC_ELEMENT_NAME_` or something like that.",
    "created_at": "2022-05-16T20:37:04Z",
    "issue": "https://github.com/sagemath/sagetest/issues/33090",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/33090#issuecomment-471206",
    "user": "https://github.com/nbruin"
}
```

Unfortunately, the problem is the absfact singular library itself:

```
> LIB "absfact.lib";
// ** loaded /usr/local/sage/sage-git/local/bin/../share/singular/LIB/absfact.lib (4.1.2.0,Feb_2019)
> ring R = (0), (c), lp;
> poly p = c^2+1;
> def S = absFactorize(p);

// 'absFactorize' created a ring, in which a list absolute_factors (the
// absolute factors) is stored.
// To access the list of absolute factors, type (if the name S was assigned
// to the return value):
//        setring(S); absolute_factors;
  
> setring(S);
> absolute_factors;
[1]:
   _[1]=1
   _[2]=c+(-@c)
[2]:
   1,1
[3]:
   _[1]=(@c)
   _[2]=(@c^2+1)
[4]:
   2
> S;
// coefficients: QQ(@c)
// number of vars : 1
//        block   1 : ordering lp
//                  : names    c
//        block   2 : ordering C

```
so apparently, it chooses the name "c" for the algebraic element it thinks it needs to make an extension where the polynomial fully factors. To compare:

```
> ring R = (0), (x,y), lp;
// ** redefining R (ring R = (0), (x,y), lp;)
> poly p = x^2+y^2;
> def S = absFactorize(p);
// ** redefining S (def S = absFactorize(p);)

// 'absFactorize' created a ring, in which a list absolute_factors (the
// absolute factors) is stored.
// To access the list of absolute factors, type (if the name S was assigned
// to the return value):
//        setring(S); absolute_factors;
  
> setring(S);
> absolute_factors;
[1]:
   _[1]=1
   _[2]=(a)*x-y
[2]:
   1,1
[3]:
   _[1]=(a)
   _[2]=(a2+1)
[4]:
   2
```
[note that here `a` is chosen as name!]

and

```
> ring R = (0), (a,b), lp;
// ** redefining R (ring R = (0), (a,b), lp;)
> poly p = a^2+b^2;
> def S= absFactorize(p);
// ** redefining S (def S= absFactorize(p);)

// 'absFactorize' created a ring, in which a list absolute_factors (the
// absolute factors) is stored.
// To access the list of absolute factors, type (if the name S was assigned
// to the return value):
//        setring(S); absolute_factors;
  
> setring(S);
> absolute_factors;
[1]:
   _[1]=1
   _[2]=(c)*a-b
[2]:
   1,1
[3]:
   _[1]=(c)
   _[2]=(c2+1)
[4]:
   2
```
[it seems to avoid the clash here by going to `c`]

Then, if we step up to `ring = (0), (a,b,c), lp;` it indeed cops out with ``@`c` as name for the algebraic element. So for now it seems ``@`c` might just be filtered for and substituted with `__SAGE_CRAZY_ALGEBRAIC_ELEMENT_NAME_` or something like that.



---

archive/issue_events_087950.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-09-19T18:58:47Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/33090",
    "milestone": "sage-9.7",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/33090#event-87950"
}
```



---

archive/issue_events_087951.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-09-19T18:58:47Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/33090",
    "milestone": "sage-9.8",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/33090#event-87951"
}
```
