# Issue 22434: Bug with definite integral

Issue created by migration from https://trac.sagemath.org/ticket/22671

Original creator: rws

Original creation time: 2017-03-22 07:35:44

CC:  slelievre


```
This works:
sage: ((1+x)^(1/3)/(1-x)).integrate(x,2.,3.,hold=True)
integrate(-(x + 1)^(1/3)/(x - 1), x, 2.00000000000000, 3.00000000000000)
sage: _.n()
-1.045820326411141
sage: ((1+x)^(1/3)/(1-x)).integrate(x,2.,3.)
sqrt(3)*2^(1/3)*arctan(sqrt(3)*(0.5291336839893998*2^(2/3) + 0.3333333333333333)) - sqrt(3)*2^(1/3)*arctan(sqrt(3)*(0.48074985676913606*2^(2/3) + 0.3333333333333333)) + 1/2*2^(1/3)*log(1.0*2^(2/3) + 1.5874010519681994*2^(1/3) + 2.519842099789746) - 1/2*2^(1/3)*log(1.0*2^(2/3) + 1.4422495703074083*2^(1/3) + 2.080083823051904) - 2^(1/3)*log(-1.0*2^(1/3) + 1.5874010519681994) + 2^(1/3)*log(-1.0*2^(1/3) + 1.4422495703074083) - 0.4354544449823736
sage: _.n()
-1.04582032641114

But not this:
sage: ((1+x)^(1/5)/(1-x)).integrate(x,2.,3.,hold=True)
integrate(-(x + 1)^(1/5)/(x - 1), x, 2.00000000000000, 3.00000000000000)
sage: _.n()
-0.8870832386197556
sage: ((1+x)^(1/5)/(1-x)).nintegral(x,2.,3.)
(-0.8870832386197555, 9.84860236274705e-15, 21, 0)
sage: ex=((1+x)^(1/5)/(1-x)).integrate(x,2.,3.)
sage: ex.n()
-0.933985822519866 - 0.0743323693052679*I
```



---

Comment by chapoton created at 2021-12-21 10:50:22

Changing keywords from "" to "integral".


---

Comment by chapoton created at 2022-02-24 15:52:02

This may be an issue with the maxima result

```
sage: B = G.integrate(x, 2., 3., algorithm="mathematica_free")
sage: B.n()
-0.887083000000000
sage: B = G.integrate(x, 2., 3., algorithm="giac")
sage: B.n()
-0.887083238620000
```



---

Comment by slelievre created at 2022-02-25 09:00:14

Perhaps the integration engine

- uses a dedicated "real cube root" function in one case
- lacks a "real fifth root" function for the other case
