# Issue 13367: Matrix Entries Can Be Callable Objects not tested

archive/issues_013367.json:
```json
{
    "body": "Assignee: tbd\n\nIn the documentation, http://www.sagemath.org/doc/reference/sage/matrix/constructor.html,\n\nit states that matrices can pass in callable objects, though there is no example or test of this here.  Is there documentation at least showing a test of this functionality?  If not, it probably should be added, if not for the end user, at least to ensure it doesn't break.\n\nIn the meanwhile, any tip on getting a matrix like:\n\n['apple', 'frog']\n[[3,2]   , 3      ]\n\nIssue created by migration from https://trac.sagemath.org/ticket/13571\n\n",
    "created_at": "2012-10-05T02:53:22Z",
    "labels": [],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-duplicate/invalid/wontfix",
    "title": "Matrix Entries Can Be Callable Objects not tested",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/13367",
    "user": "https://trac.sagemath.org/admin/accounts/users/startakovsky"
}
```
Assignee: tbd

In the documentation, http://www.sagemath.org/doc/reference/sage/matrix/constructor.html,

it states that matrices can pass in callable objects, though there is no example or test of this here.  Is there documentation at least showing a test of this functionality?  If not, it probably should be added, if not for the end user, at least to ensure it doesn't break.

In the meanwhile, any tip on getting a matrix like:

['apple', 'frog']
[[3,2]   , 3      ]

Issue created by migration from https://trac.sagemath.org/ticket/13571





---

archive/issue_comments_164037.json:
```json
{
    "body": "Changing type from PLEASE CHANGE to defect.",
    "created_at": "2012-10-05T02:59:06Z",
    "issue": "https://github.com/sagemath/sagetest/issues/13367",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/13367#issuecomment-164037",
    "user": "https://trac.sagemath.org/admin/accounts/users/startakovsky"
}
```

Changing type from PLEASE CHANGE to defect.



---

archive/issue_comments_164038.json:
```json
{
    "body": "Changing priority from major to minor.",
    "created_at": "2012-10-05T02:59:06Z",
    "issue": "https://github.com/sagemath/sagetest/issues/13367",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/13367#issuecomment-164038",
    "user": "https://trac.sagemath.org/admin/accounts/users/startakovsky"
}
```

Changing priority from major to minor.



---

archive/issue_events_037786.json:
```json
{
    "actor": "https://github.com/mwhansen",
    "created_at": "2012-10-06T15:19:39Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/13367",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/13367#event-37786"
}
```



---

archive/issue_comments_164039.json:
```json
{
    "body": "Resolution: invalid",
    "created_at": "2012-10-06T15:19:39Z",
    "issue": "https://github.com/sagemath/sagetest/issues/13367",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/13367#issuecomment-164039",
    "user": "https://github.com/mwhansen"
}
```

Resolution: invalid



---

archive/issue_comments_164040.json:
```json
{
    "body": "It gives examples of passing in a callable object:\n\n```\n\nsage: m = matrix(QQ, 3, 3, lambda i, j: i+j); m\n[0 1 2]\n[1 2 3]\n[2 3 4]\nsage: m = matrix(3, lambda i,j: i-j); m\n[ 0 -1 -2]\n[ 1  0 -1]\n[ 2  1  0]\nsage: matrix(QQ,2,3,lambda x, y: x+y)\n[0 1 2]\n[1 2 3]\nsage: matrix(QQ,3,2,lambda x, y: x+y)\n[0 1]\n[1 2]\n[2 3]\n```\n\nIt is impossible to get a **matrix** like \n\n```\n['apple', 'frog']\n[[3,2]  , 3     ]\n```\nsince a matrix requires that the entries be elements of a ring (so things like multiplication and addition are defined).  You could either use a list of lists or a numpy array like\n\n```\nsage: import numpy as np\nsage: a = np.array([['apple', 'frog'],[[3,2], 3]], dtype=object); a\narray([[apple, frog],\n       [[3, 2], 3]], dtype=object)\nsage: a[1,0]\n[3, 2]\nsage: a.transpose()\narray([[apple, [3, 2]],\n       [frog, 3]], dtype=object)\n```",
    "created_at": "2012-10-06T15:19:39Z",
    "issue": "https://github.com/sagemath/sagetest/issues/13367",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/13367#issuecomment-164040",
    "user": "https://github.com/mwhansen"
}
```

It gives examples of passing in a callable object:

```

sage: m = matrix(QQ, 3, 3, lambda i, j: i+j); m
[0 1 2]
[1 2 3]
[2 3 4]
sage: m = matrix(3, lambda i,j: i-j); m
[ 0 -1 -2]
[ 1  0 -1]
[ 2  1  0]
sage: matrix(QQ,2,3,lambda x, y: x+y)
[0 1 2]
[1 2 3]
sage: matrix(QQ,3,2,lambda x, y: x+y)
[0 1]
[1 2]
[2 3]
```

It is impossible to get a **matrix** like 

```
['apple', 'frog']
[[3,2]  , 3     ]
```
since a matrix requires that the entries be elements of a ring (so things like multiplication and addition are defined).  You could either use a list of lists or a numpy array like

```
sage: import numpy as np
sage: a = np.array([['apple', 'frog'],[[3,2], 3]], dtype=object); a
array([[apple, frog],
       [[3, 2], 3]], dtype=object)
sage: a[1,0]
[3, 2]
sage: a.transpose()
array([[apple, [3, 2]],
       [frog, 3]], dtype=object)
```



---

archive/issue_events_037787.json:
```json
{
    "actor": "https://github.com/mwhansen",
    "created_at": "2012-10-06T15:19:51Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/13367",
    "milestone": "sage-duplicate/invalid/wontfix",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/13367#event-37787"
}
```
