# Issue 18029: Conversion between Sage and libgap polynomials

archive/issues_018029.json:
```json
{
    "body": "CC:  vbraun jipilab\n\nCurrently sage is not able to convert back polynomials from libgap\n\n```\nsage: libgap.MinimalPolynomial(QQ, libgap.eval(\"E(3)\"))\nx_1^2+x_1+1\nsage: p = libgap.MinimalPolynomial(QQ, libgap.eval(\"E(3)\"))\nsage: p.sage()\nTraceback (most recent call last):\n...\nNotImplementedError: cannot construct equivalent Sage object\n```\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/18266\n\n",
    "created_at": "2015-04-21T12:46:26Z",
    "labels": [
        "interfaces",
        "major",
        "enhancement"
    ],
    "title": "Conversion between Sage and libgap polynomials",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/18029",
    "user": "vdelecroix"
}
```
CC:  vbraun jipilab

Currently sage is not able to convert back polynomials from libgap

```
sage: libgap.MinimalPolynomial(QQ, libgap.eval("E(3)"))
x_1^2+x_1+1
sage: p = libgap.MinimalPolynomial(QQ, libgap.eval("E(3)"))
sage: p.sage()
Traceback (most recent call last):
...
NotImplementedError: cannot construct equivalent Sage object
```


Issue created by migration from https://trac.sagemath.org/ticket/18266





---

archive/issue_comments_242645.json:
```json
{
    "body": "New commits:",
    "created_at": "2016-07-13T20:17:45Z",
    "issue": "https://github.com/sagemath/sagetest/issues/18029",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/18029#issuecomment-242645",
    "user": "vdelecroix"
}
```

New commits:



---

archive/issue_comments_242646.json:
```json
{
    "body": "Changing status from new to needs_review.",
    "created_at": "2016-07-13T20:24:29Z",
    "issue": "https://github.com/sagemath/sagetest/issues/18029",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/18029#issuecomment-242646",
    "user": "vdelecroix"
}
```

Changing status from new to needs_review.



---

archive/issue_comments_242647.json:
```json
{
    "body": "It looks good except for `_coerce_map_from_`. I don't think it is a good idea to have `libgap` have a coerce map from everything; there are many algebras that (lib)gap almost certainly has no idea about (e.g., Jordan algebras).",
    "created_at": "2016-07-18T04:59:29Z",
    "issue": "https://github.com/sagemath/sagetest/issues/18029",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/18029#issuecomment-242647",
    "user": "tscrim"
}
```

It looks good except for `_coerce_map_from_`. I don't think it is a good idea to have `libgap` have a coerce map from everything; there are many algebras that (lib)gap almost certainly has no idea about (e.g., Jordan algebras).



---

archive/issue_comments_242648.json:
```json
{
    "body": "- coercion between interfaces objects and Sage objects should be one way. So if for a given ring there is a coercion `Sage -> GAP` then it should be the case for every ring that GAP understands.\n\n- The solution I used is precisely what is done with PARI/GP (see for instance the `PariInstance` class in `/sage/libs/pari/pari_instance.pyx`)\n\n- Implementing the function `_coerce_map_from_` would be a useless pain\n\n- *\"interface objects\"* are only intended for people having a knowledge of the underlying software\n\nNow, if for some specific `GAP` object you want to lift it back to Sage then you can either use conversion (i.e. `MyParent(my_interface_object)`) or use the `.sage()` method\n\n```\nsage: pari(13).sage()\n13\nsage: parent(_)\nInteger Ring\nsage: gap(13).sage()\n13\nsage: parent(_)\nInteger Ring\nsage: libgap(13).sage()\n13\nsage: parent(_)\nInteger Ring\n```\n",
    "created_at": "2016-07-22T19:57:15Z",
    "issue": "https://github.com/sagemath/sagetest/issues/18029",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/18029#issuecomment-242648",
    "user": "vdelecroix"
}
```

- coercion between interfaces objects and Sage objects should be one way. So if for a given ring there is a coercion `Sage -> GAP` then it should be the case for every ring that GAP understands.

- The solution I used is precisely what is done with PARI/GP (see for instance the `PariInstance` class in `/sage/libs/pari/pari_instance.pyx`)

- Implementing the function `_coerce_map_from_` would be a useless pain

- *"interface objects"* are only intended for people having a knowledge of the underlying software

Now, if for some specific `GAP` object you want to lift it back to Sage then you can either use conversion (i.e. `MyParent(my_interface_object)`) or use the `.sage()` method

```
sage: pari(13).sage()
13
sage: parent(_)
Integer Ring
sage: gap(13).sage()
13
sage: parent(_)
Integer Ring
sage: libgap(13).sage()
13
sage: parent(_)
Integer Ring
```




---

archive/issue_comments_242649.json:
```json
{
    "body": "The problem with unlimited coercion maps is that we get a bad (IMO incorrect) error message (this is on `develop`):\n\n```sage\nsage: cat = Algebras(QQ).WithBasis().FiniteDimensional()\nsage: C = CombinatorialFreeModule(QQ, ['x','y','z'], category=cat)\nsage: J1 = JordanAlgebra(C, names=['a','b','c'])\nsage: J1.an_element() + gap(2)\n---------------------------------------------------------------------------\nTypeError                                 Traceback (most recent call last)\n...\nTypeError: unsupported operand parent(s) for '+': 'Jordan algebra of Free module generated by {'x', 'y', 'z'} over Rational Field' and 'Gap'\nsage: J1.an_element() + pari(2)\n---------------------------------------------------------------------------\nPariError                                 Traceback (most recent call last)\n...\nPariError: incorrect type in gtos [integer expected] (t_POL)\n```\n\nThere should be a conversion, but I think a coercion is far too strong.\nPerhaps we should ask sage-devel?",
    "created_at": "2016-07-23T00:50:14Z",
    "issue": "https://github.com/sagemath/sagetest/issues/18029",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/18029#issuecomment-242649",
    "user": "tscrim"
}
```

The problem with unlimited coercion maps is that we get a bad (IMO incorrect) error message (this is on `develop`):

```sage
sage: cat = Algebras(QQ).WithBasis().FiniteDimensional()
sage: C = CombinatorialFreeModule(QQ, ['x','y','z'], category=cat)
sage: J1 = JordanAlgebra(C, names=['a','b','c'])
sage: J1.an_element() + gap(2)
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)
...
TypeError: unsupported operand parent(s) for '+': 'Jordan algebra of Free module generated by {'x', 'y', 'z'} over Rational Field' and 'Gap'
sage: J1.an_element() + pari(2)
---------------------------------------------------------------------------
PariError                                 Traceback (most recent call last)
...
PariError: incorrect type in gtos [integer expected] (t_POL)
```

There should be a conversion, but I think a coercion is far too strong.
Perhaps we should ask sage-devel?



---

archive/issue_comments_242650.json:
```json
{
    "body": "It is a good idea to discuss what should we do concerning coercion and external softwares/libraries.\n\nConcerning this ticket, it is very handy that the coercion always go from Sage to third party interfaces\n\n```\nsage: x = polygen(ZZ)\nsage: p = x^3 + 2*x + 1\nsage: p(pari(2))\n13\nsage: type(_)\n<type 'sage.libs.pari.gen.gen'>\n```\n\n\nMaking explicit the subset of Sage parents that can actually be represented in a given interface might indeed be much better. But certainly harder to write and maintain. The way I choose is the lazy one. The error messages you mentioned are wrong but should never appear if you restrict to \"pure Sage functions\". If desirable for pari/gap, I guess that implementing it belongs to another ticket.",
    "created_at": "2016-07-23T01:19:12Z",
    "issue": "https://github.com/sagemath/sagetest/issues/18029",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/18029#issuecomment-242650",
    "user": "vdelecroix"
}
```

It is a good idea to discuss what should we do concerning coercion and external softwares/libraries.

Concerning this ticket, it is very handy that the coercion always go from Sage to third party interfaces

```
sage: x = polygen(ZZ)
sage: p = x^3 + 2*x + 1
sage: p(pari(2))
13
sage: type(_)
<type 'sage.libs.pari.gen.gen'>
```


Making explicit the subset of Sage parents that can actually be represented in a given interface might indeed be much better. But certainly harder to write and maintain. The way I choose is the lazy one. The error messages you mentioned are wrong but should never appear if you restrict to "pure Sage functions". If desirable for pari/gap, I guess that implementing it belongs to another ticket.



---

archive/issue_comments_242651.json:
```json
{
    "body": "And this is not the only wrong thing with interfaces. The default implementation of conversion between Sage and the interfaces etc relies on string representations and global variables... which is of course unreliable\n\n```\nsage: R = PolynomialRing(ZZ,('x','y','z'))\nsage: p = 3*R.0*R.1 + R.2^3\nsage: pari(p).sage()\nTraceback (most recent call last):\n...\nNameError: name 'y' is not defined\n```\n\nor\n\n```\nsage: pari(ZZ).sage()\n<built-in function IntegerRing>\nsage: pari(RR)\nRealFieldwith53bitsofprecision\nsage: pari(RR).sage()\nTraceback (most recent call last):\n...\nNameError: name 'RealFieldwith53bitsofprecision' is not defined\n```\n",
    "created_at": "2016-07-23T02:07:18Z",
    "issue": "https://github.com/sagemath/sagetest/issues/18029",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/18029#issuecomment-242651",
    "user": "vdelecroix"
}
```

And this is not the only wrong thing with interfaces. The default implementation of conversion between Sage and the interfaces etc relies on string representations and global variables... which is of course unreliable

```
sage: R = PolynomialRing(ZZ,('x','y','z'))
sage: p = 3*R.0*R.1 + R.2^3
sage: pari(p).sage()
Traceback (most recent call last):
...
NameError: name 'y' is not defined
```

or

```
sage: pari(ZZ).sage()
<built-in function IntegerRing>
sage: pari(RR)
RealFieldwith53bitsofprecision
sage: pari(RR).sage()
Traceback (most recent call last):
...
NameError: name 'RealFieldwith53bitsofprecision' is not defined
```




---

archive/issue_comments_242652.json:
```json
{
    "body": "Well, since we already do a catch-all coercion for `pari` and we got no response from sage-devel, I can tolerate the current state of the coercion.",
    "created_at": "2016-08-14T13:11:39Z",
    "issue": "https://github.com/sagemath/sagetest/issues/18029",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/18029#issuecomment-242652",
    "user": "tscrim"
}
```

Well, since we already do a catch-all coercion for `pari` and we got no response from sage-devel, I can tolerate the current state of the coercion.



---

archive/issue_comments_242653.json:
```json
{
    "body": "Changing status from needs_review to positive_review.",
    "created_at": "2016-08-14T13:11:39Z",
    "issue": "https://github.com/sagemath/sagetest/issues/18029",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/18029#issuecomment-242653",
    "user": "tscrim"
}
```

Changing status from needs_review to positive_review.



---

archive/issue_comments_242654.json:
```json
{
    "body": "Resolution: fixed",
    "created_at": "2016-08-15T18:27:16Z",
    "issue": "https://github.com/sagemath/sagetest/issues/18029",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/18029#issuecomment-242654",
    "user": "vbraun"
}
```

Resolution: fixed
