# Issue 19761: missing operator in symbolic series

archive/issues_019761.json:
```json
{
    "body": "```\nsage: (x+1).series(x,2)\n1 + 1*x\nsage: (x+1).series(x,2).operator() is None\nTrue\nsage: (x+1).series(x,2).operands()\n[1, x]\n```\nRelated (maybe a consequence) is \n\n```\nsage: (x+1).series(x,2) - 1\n(1 + 1*x) - 1\nsage: ((x+1).series(x,2) - 1).simplify()\n...\nValueError: The name \"1\" is not a valid Python identifier.\n```\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/19998\n\n",
    "created_at": "2016-02-01T12:00:53Z",
    "labels": [
        "component: symbolics",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-7.4",
    "title": "missing operator in symbolic series",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/19761",
    "user": "https://github.com/dkrenn"
}
```
```
sage: (x+1).series(x,2)
1 + 1*x
sage: (x+1).series(x,2).operator() is None
True
sage: (x+1).series(x,2).operands()
[1, x]
```
Related (maybe a consequence) is 

```
sage: (x+1).series(x,2) - 1
(1 + 1*x) - 1
sage: ((x+1).series(x,2) - 1).simplify()
...
ValueError: The name "1" is not a valid Python identifier.
```


Issue created by migration from https://trac.sagemath.org/ticket/19998





---

archive/issue_comments_271297.json:
```json
{
    "body": "It is both a consequence of the special status series have in GiNaC. As to the latter, the documentation notes you need to apply series again for getting results:\n\n```\nsage: (x+1).series(x,2)\n1 + 1*x\nsage: _-1\n(1 + 1*x) - 1\nsage: _.series(x,2)\n1*x\n```",
    "created_at": "2016-02-05T09:16:32Z",
    "issue": "https://github.com/sagemath/sagetest/issues/19761",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/19761#issuecomment-271297",
    "user": "https://github.com/rwst"
}
```

It is both a consequence of the special status series have in GiNaC. As to the latter, the documentation notes you need to apply series again for getting results:

```
sage: (x+1).series(x,2)
1 + 1*x
sage: _-1
(1 + 1*x) - 1
sage: _.series(x,2)
1*x
```



---

archive/issue_events_054521.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2016-08-03T08:01:42Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/19761",
    "milestone": "sage-7.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/19761#event-54521"
}
```



---

archive/issue_comments_271298.json:
```json
{
    "body": "The best way to give users what they want---apart from always automatically applying the series operator---would be to apply it in `simplify()` if the expression has a series, i.e., `((x+1).series(x,2) - 1).simplify()` should give `1*x` instead of an exception. This means that the operator to-be-applied should have as precision the min of all operators precisions in the expression.",
    "created_at": "2016-08-03T08:01:42Z",
    "issue": "https://github.com/sagemath/sagetest/issues/19761",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/19761#issuecomment-271298",
    "user": "https://github.com/rwst"
}
```

The best way to give users what they want---apart from always automatically applying the series operator---would be to apply it in `simplify()` if the expression has a series, i.e., `((x+1).series(x,2) - 1).simplify()` should give `1*x` instead of an exception. This means that the operator to-be-applied should have as precision the min of all operators precisions in the expression.
