# Issue 11418: Integrating the sgn() function can produce incorrect results

archive/issues_011418.json:
```json
{
    "body": "Assignee: burcin\n\nCC:  nbruin chapoton\n\nActual result:\n\n\n```\nsage: integrate(x * sgn(x^2 - 1/4), x, -1, 0)\n1/2\n```\n\n\nSince the argument to sgn() has only one root, -1/2, on (-1, 0), there are only two subintervals on which sgn() can have different values. In particular,\n\n\n```\nsage: sgn(x^2 - 1/4)(x = -0.75)\n1\n\nsage: sgn(x^2 - 1/4)(x = -0.25)\n-1\n```\n\n\nNow, the original, actual result should be equivalent to the sum of the following:\n\n\n```\nsage: integrate(x, x, -1, -0.5)\n-0.375\n\nsage: integrate(-x, x, -0.5, 0)\n0.125\n```\n\n\nSo, something went wrong during the initial integration.\n\nIssue created by migration from https://trac.sagemath.org/ticket/11590\n\n",
    "created_at": "2011-07-12T20:05:19Z",
    "labels": [
        "calculus",
        "major"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-9.3",
    "title": "Integrating the sgn() function can produce incorrect results",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/11418",
    "user": "mjo"
}
```
Assignee: burcin

CC:  nbruin chapoton

Actual result:


```
sage: integrate(x * sgn(x^2 - 1/4), x, -1, 0)
1/2
```


Since the argument to sgn() has only one root, -1/2, on (-1, 0), there are only two subintervals on which sgn() can have different values. In particular,


```
sage: sgn(x^2 - 1/4)(x = -0.75)
1

sage: sgn(x^2 - 1/4)(x = -0.25)
-1
```


Now, the original, actual result should be equivalent to the sum of the following:


```
sage: integrate(x, x, -1, -0.5)
-0.375

sage: integrate(-x, x, -0.5, 0)
0.125
```


So, something went wrong during the initial integration.

Issue created by migration from https://trac.sagemath.org/ticket/11590





---

archive/issue_comments_127200.json:
```json
{
    "body": "Changing type from PLEASE CHANGE to defect.",
    "created_at": "2011-07-13T00:27:01Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11418",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11418#issuecomment-127200",
    "user": "mjo"
}
```

Changing type from PLEASE CHANGE to defect.



---

archive/issue_comments_127201.json:
```json
{
    "body": "This appears to be in Maxima, and is reported at [their bug tracker](https://sourceforge.net/tracker/?func=detail&aid=3382358&group_id=4933&atid=104933).\n\n\n```\n\n(%i11) integrate(x*signum(x^2-1/4),x,-1,0);\n                                       1\n(%o11)                                 -\n                                       2\n(%i15) integrate(x*signum(x^2-1/4),x);\n                                   ! 2   1!\n                                   !x  - -!\n                                   !     4!\n(%o15)                             --------\n                                      2\n```\n",
    "created_at": "2011-07-29T18:30:49Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11418",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11418#issuecomment-127201",
    "user": "kcrisman"
}
```

This appears to be in Maxima, and is reported at [their bug tracker](https://sourceforge.net/tracker/?func=detail&aid=3382358&group_id=4933&atid=104933).


```

(%i11) integrate(x*signum(x^2-1/4),x,-1,0);
                                       1
(%o11)                                 -
                                       2
(%i15) integrate(x*signum(x^2-1/4),x);
                                   ! 2   1!
                                   !x  - -!
                                   !     4!
(%o15)                             --------
                                      2
```




---

archive/issue_comments_127202.json:
```json
{
    "body": "Even with #11483, this isn't working right.  It should, though - see Barton's post at the Maxima ticket:\n\n```\nBy the way:\n\n(%i4) load(abs_integrate)$\n\nCorrect antiderivative:\n\n(%i5) 'integrate(x*signum(x^2-1/4),x);\n(%o5) abs(x^2-1/4)/2\n\nCorrect definite integral\n\n(%i6) 'integrate(x*signum(x^2-1/4),x,-1,0);\n(%o6) -1/4\n```\n\nso I'm not sure why this is still returning the \"wrong\" thing.  Probably something about the integration code...",
    "created_at": "2012-01-28T02:50:59Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11418",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11418#issuecomment-127202",
    "user": "kcrisman"
}
```

Even with #11483, this isn't working right.  It should, though - see Barton's post at the Maxima ticket:

```
By the way:

(%i4) load(abs_integrate)$

Correct antiderivative:

(%i5) 'integrate(x*signum(x^2-1/4),x);
(%o5) abs(x^2-1/4)/2

Correct definite integral

(%i6) 'integrate(x*signum(x^2-1/4),x,-1,0);
(%o6) -1/4
```

so I'm not sure why this is still returning the "wrong" thing.  Probably something about the integration code...



---

archive/issue_comments_127203.json:
```json
{
    "body": "I'm stumped on this one. We get the correct antiderivative:\n\n\n```\nsage: integrate(x*sgn(x^2-1/4),x)     \n1/2*abs(x^2 - 1/4)\n```\n\n\nAnd ECL gives us the right answer, so it's not an environment setting:\n\n\n```\nsage: from sage.interfaces.maxima_lib import ecl_eval\nsage: ecl_eval(\"#$'integrate(x*signum(x^2-1/4),x,-1,0);$\")                           \n<ECL: ((RAT SIMP) -1 4)>\n```\n\n\nBut going through `maxima_eval` is still trouble:\n\n\n```\nsage: integrate(x*sgn(x^2-1/4),x,-1,0)                                            \n1/2\nsage: from sage.interfaces.maxima_lib import maxima_eval\nsage: a = '($INTEGRATE ((MTIMES SIMP) $X ((%SIGNUM SIMP) ((MPLUS SIMP) ((RAT SIMP) (- 1) 4) ((MEXPT SIMP) $X 2))) ) $X -1 0)'\nsage: maxima_eval(a)\n<ECL: ((RAT SIMP) 1 2)>\n```\n",
    "created_at": "2012-01-30T20:37:37Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11418",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11418#issuecomment-127203",
    "user": "mjo"
}
```

I'm stumped on this one. We get the correct antiderivative:


```
sage: integrate(x*sgn(x^2-1/4),x)     
1/2*abs(x^2 - 1/4)
```


And ECL gives us the right answer, so it's not an environment setting:


```
sage: from sage.interfaces.maxima_lib import ecl_eval
sage: ecl_eval("#$'integrate(x*signum(x^2-1/4),x,-1,0);$")                           
<ECL: ((RAT SIMP) -1 4)>
```


But going through `maxima_eval` is still trouble:


```
sage: integrate(x*sgn(x^2-1/4),x,-1,0)                                            
1/2
sage: from sage.interfaces.maxima_lib import maxima_eval
sage: a = '($INTEGRATE ((MTIMES SIMP) $X ((%SIGNUM SIMP) ((MPLUS SIMP) ((RAT SIMP) (- 1) 4) ((MEXPT SIMP) $X 2))) ) $X -1 0)'
sage: maxima_eval(a)
<ECL: ((RAT SIMP) 1 2)>
```




---

archive/issue_comments_127204.json:
```json
{
    "body": "Well, I'm glad it wasn't just me!    \n\nCould it be that because we get an answer without `abs_integrate` it just returns the 'regular' answer?  But I don't recall the integrate code doing that, I think once we turn on `abs_integrate` it should just 'be on'...",
    "created_at": "2012-01-30T20:41:59Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11418",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11418#issuecomment-127204",
    "user": "kcrisman"
}
```

Well, I'm glad it wasn't just me!    

Could it be that because we get an answer without `abs_integrate` it just returns the 'regular' answer?  But I don't recall the integrate code doing that, I think once we turn on `abs_integrate` it should just 'be on'...



---

archive/issue_comments_127205.json:
```json
{
    "body": "Replying to [comment:5 kcrisman]:\n> Well, I'm glad it wasn't just me!    \n> \n> Could it be that because we get an answer without `abs_integrate` it just returns the 'regular' answer?  But I don't recall the integrate code doing that, I think once we turn on `abs_integrate` it should just 'be on'...\n\nIt's possible. The abs_integrate code looks like it defines extra definite integration methods, and then loops through them until `'integrate` is gone from the expression. Within maxima, the extra methods obviously get tried first, because we get the right answer. But I suppose something in the ECL integration could be trying the default definite integration first.",
    "created_at": "2012-01-30T21:23:15Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11418",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11418#issuecomment-127205",
    "user": "mjo"
}
```

Replying to [comment:5 kcrisman]:
> Well, I'm glad it wasn't just me!    
> 
> Could it be that because we get an answer without `abs_integrate` it just returns the 'regular' answer?  But I don't recall the integrate code doing that, I think once we turn on `abs_integrate` it should just 'be on'...

It's possible. The abs_integrate code looks like it defines extra definite integration methods, and then loops through them until `'integrate` is gone from the expression. Within maxima, the extra methods obviously get tried first, because we get the right answer. But I suppose something in the ECL integration could be trying the default definite integration first.



---

archive/issue_comments_127206.json:
```json
{
    "body": "Something else is weird here. In standalone maxima-5.26, we don't get back the wrong answer. But through sage, **without** abs_integrate, we get `1/2`:\n\n\n```\nsage: integrate(x * sgn(x^2 - 1/4), x, -1, 0) \n1/2\nsage: maxima.console()\n;;; Loading #P\"/home/mjo/src/sage-5.0.beta1/local/lib/ecl/sb-bsd-sockets.fas\"\n;;; Loading #P\"/home/mjo/src/sage-5.0.beta1/local/lib/ecl/sockets.fas\"\n;;; Loading #P\"/home/mjo/src/sage-5.0.beta1/local/lib/ecl/defsystem.fas\"\n;;; Loading #P\"/home/mjo/src/sage-5.0.beta1/local/lib/ecl/cmp.fas\"\nMaxima 5.26.0 http://maxima.sourceforge.net\nusing Lisp ECL 11.1.1\nDistributed under the GNU Public License. See the file COPYING.\nDedicated to the memory of William Schelter.\nThe function bug_report() provides bug reporting information.\n(%i1) display2d:false;\n\n(%o1) false\n(%i2) 'integrate(x*signum(x^2-1/4),x);\n\n(%o2) 'integrate(x*signum(x^2-1/4),x)\n(%i3) 'integrate(x*signum(x^2-1/4),x,-1,0);\n\n(%o3) 'integrate(x*signum(x^2-1/4),x,-1,0)\n```\n\n\nIntriguing!",
    "created_at": "2012-01-31T01:14:11Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11418",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11418#issuecomment-127206",
    "user": "mjo"
}
```

Something else is weird here. In standalone maxima-5.26, we don't get back the wrong answer. But through sage, **without** abs_integrate, we get `1/2`:


```
sage: integrate(x * sgn(x^2 - 1/4), x, -1, 0) 
1/2
sage: maxima.console()
;;; Loading #P"/home/mjo/src/sage-5.0.beta1/local/lib/ecl/sb-bsd-sockets.fas"
;;; Loading #P"/home/mjo/src/sage-5.0.beta1/local/lib/ecl/sockets.fas"
;;; Loading #P"/home/mjo/src/sage-5.0.beta1/local/lib/ecl/defsystem.fas"
;;; Loading #P"/home/mjo/src/sage-5.0.beta1/local/lib/ecl/cmp.fas"
Maxima 5.26.0 http://maxima.sourceforge.net
using Lisp ECL 11.1.1
Distributed under the GNU Public License. See the file COPYING.
Dedicated to the memory of William Schelter.
The function bug_report() provides bug reporting information.
(%i1) display2d:false;

(%o1) false
(%i2) 'integrate(x*signum(x^2-1/4),x);

(%o2) 'integrate(x*signum(x^2-1/4),x)
(%i3) 'integrate(x*signum(x^2-1/4),x,-1,0);

(%o3) 'integrate(x*signum(x^2-1/4),x,-1,0)
```


Intriguing!



---

archive/issue_comments_127207.json:
```json
{
    "body": "Some random observations that may or may not be relevant. First, let's separate the \"Reader\" (parser) and the \"Evaluator\".\n\n```\nsage: from sage.libs.ecl import *\nsage: I1=EclObject(\"#$integrate(x*signum(x^2-1/4),x,-1,0);$\").cadr().cdr().car() \nsage: I2=EclObject(\"#$'integrate(x*signum(x^2-1/4),x,-1,0);$\").cadr().cdr().car()\nsage: I1\n<ECL: (($INTEGRATE)\n ((MTIMES) $X\n  ((%SIGNUM) ((MPLUS) ((MEXPT) $X 2) ((MMINUS) ((MQUOTIENT) 1 4)))))\n $X ((MMINUS) 1) 0)>\nsage: I2\n<ECL: ((%INTEGRATE)\n ((MTIMES) $X\n  ((%SIGNUM) ((MPLUS) ((MEXPT) $X 2) ((MMINUS) ((MQUOTIENT) 1 4)))))\n $X ((MMINUS) 1) 0)>\n```\n\nNote the subtle difference between `$INTEGRATE` (function) `%INTEGRATE` (inert integral form). Sage's `sr_integral` produces the `$INTEGRATE` expression, so the two alternatives tested are *not* equivalent. I suspect those trigger different code-paths. You could try changing\n\n```\ninterfaces/maxima_lib.py:205:max_integrate=EclObject(\"$INTEGRATE\")\n```\n\nto `max_integrate=EclObject(\"%INTEGRATE\")` instead and see if that solves more than it messes up.\n\nSlightly less likely to make a difference: If you look at the full expression resulting for `EclObject(\"#$1+2$\")`, you'll notice an `MEVAL*`, whereas maxima_eval is defined with `MEVAL`. I've never worked out which one is the proper one to use. So, you should test all combinations (these skip setting up the proper maxima-error-catching environment):\n\n```\nsage: EclObject([\"meval*\",[\"quote\", I1]]).eval()\nsage: EclObject([\"meval*\",[\"quote\", I2]]).eval()\nsage: EclObject([\"meval\",[\"quote\", I1]]).eval()\nsage: EclObject([\"meval\",[\"quote\", I2]]).eval()\n```\n",
    "created_at": "2012-01-31T21:29:55Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11418",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11418#issuecomment-127207",
    "user": "nbruin"
}
```

Some random observations that may or may not be relevant. First, let's separate the "Reader" (parser) and the "Evaluator".

```
sage: from sage.libs.ecl import *
sage: I1=EclObject("#$integrate(x*signum(x^2-1/4),x,-1,0);$").cadr().cdr().car() 
sage: I2=EclObject("#$'integrate(x*signum(x^2-1/4),x,-1,0);$").cadr().cdr().car()
sage: I1
<ECL: (($INTEGRATE)
 ((MTIMES) $X
  ((%SIGNUM) ((MPLUS) ((MEXPT) $X 2) ((MMINUS) ((MQUOTIENT) 1 4)))))
 $X ((MMINUS) 1) 0)>
sage: I2
<ECL: ((%INTEGRATE)
 ((MTIMES) $X
  ((%SIGNUM) ((MPLUS) ((MEXPT) $X 2) ((MMINUS) ((MQUOTIENT) 1 4)))))
 $X ((MMINUS) 1) 0)>
```

Note the subtle difference between `$INTEGRATE` (function) `%INTEGRATE` (inert integral form). Sage's `sr_integral` produces the `$INTEGRATE` expression, so the two alternatives tested are *not* equivalent. I suspect those trigger different code-paths. You could try changing

```
interfaces/maxima_lib.py:205:max_integrate=EclObject("$INTEGRATE")
```

to `max_integrate=EclObject("%INTEGRATE")` instead and see if that solves more than it messes up.

Slightly less likely to make a difference: If you look at the full expression resulting for `EclObject("#$1+2$")`, you'll notice an `MEVAL*`, whereas maxima_eval is defined with `MEVAL`. I've never worked out which one is the proper one to use. So, you should test all combinations (these skip setting up the proper maxima-error-catching environment):

```
sage: EclObject(["meval*",["quote", I1]]).eval()
sage: EclObject(["meval*",["quote", I2]]).eval()
sage: EclObject(["meval",["quote", I1]]).eval()
sage: EclObject(["meval",["quote", I2]]).eval()
```




---

archive/issue_comments_127208.json:
```json
{
    "body": "I took a much stupider approach, but I did essentially try replacing `$INTEGRATE` with `%INTEGRATE`. Once I discovered the `(#$$)` syntax, I tried replacing the call to `maxima_eval` in `sr_integral` with a simple string substitution. It causes more problems than it solves, I think.\n\nIf I replace `meval` with `meval*` in a few places, I'm able to break some additional things but not fix any =)\n\nI guess the Right Thing to do would be to go read the maxima source...",
    "created_at": "2012-01-31T23:48:07Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11418",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11418#issuecomment-127208",
    "user": "mjo"
}
```

I took a much stupider approach, but I did essentially try replacing `$INTEGRATE` with `%INTEGRATE`. Once I discovered the `(#$$)` syntax, I tried replacing the call to `maxima_eval` in `sr_integral` with a simple string substitution. It causes more problems than it solves, I think.

If I replace `meval` with `meval*` in a few places, I'm able to break some additional things but not fix any =)

I guess the Right Thing to do would be to go read the maxima source...



---

archive/issue_comments_127209.json:
```json
{
    "body": "Replying to [comment:9 mjo]:\n>  I tried replacing the call to `maxima_eval` in `sr_integral` with a simple string substitution. It causes more problems than it solves, I think.\n\nYes, that would make things much worse (not to mention a major step back in other ways). The `sr_integral` interface tries to avoid string-based conversion, but maxima_lib in general is still capable of it in a much better way than crafting your own string-mangling based on `#$...$`. For instance:\n\n```\nsage.calculus.calculus.maxima(sage.calculus.calculus.dummy_integrate(x * sgn(x^2 - 1/4), x, -1, 0))\n```\n\nshould work and compares nicely to the pexpect-based\n\n```\nmaxima(sage.calculus.calculus.dummy_integrate(x * sgn(x^2 - 1/4), x, -1, 0))\n```\n\n\nYou should really try the commands I suggested earlier to see where the problem is, though (no changes to the source required!). I don't have ready access to a sage build with the right patches, but you obviously do. Even on a clearly insufficiently patched sage I observe different behaviour:\n\n```\nsage: maxima_eval(I1)\n<ECL: ((RAT SIMP) 1 2)>\nsage: maxima_eval(I2)\nRuntimeError: ECL says: Error executing code in Maxima: first: empty argument.\n```\n",
    "created_at": "2012-02-01T01:06:36Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11418",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11418#issuecomment-127209",
    "user": "nbruin"
}
```

Replying to [comment:9 mjo]:
>  I tried replacing the call to `maxima_eval` in `sr_integral` with a simple string substitution. It causes more problems than it solves, I think.

Yes, that would make things much worse (not to mention a major step back in other ways). The `sr_integral` interface tries to avoid string-based conversion, but maxima_lib in general is still capable of it in a much better way than crafting your own string-mangling based on `#$...$`. For instance:

```
sage.calculus.calculus.maxima(sage.calculus.calculus.dummy_integrate(x * sgn(x^2 - 1/4), x, -1, 0))
```

should work and compares nicely to the pexpect-based

```
maxima(sage.calculus.calculus.dummy_integrate(x * sgn(x^2 - 1/4), x, -1, 0))
```


You should really try the commands I suggested earlier to see where the problem is, though (no changes to the source required!). I don't have ready access to a sage build with the right patches, but you obviously do. Even on a clearly insufficiently patched sage I observe different behaviour:

```
sage: maxima_eval(I1)
<ECL: ((RAT SIMP) 1 2)>
sage: maxima_eval(I2)
RuntimeError: ECL says: Error executing code in Maxima: first: empty argument.
```




---

archive/issue_comments_127210.json:
```json
{
    "body": "Sorry, I should have been more clear: I did try everything you suggested. Replacing `$INTEGRATE` with `%INTEGRATE` causes the same test failures in maxima_lib.py that I got when I swapped out the whole thing for string substitution. It does fix this *particular* answer, though.\n\nHere's a session with just the abs_integrate patch applied, maxima-5.26. I left the error at the top intact, for whatever reason it doesn't work at all until after I've integrated something.\n\n\n```\nsage: from sage.libs.ecl import *                                               \nsage: I1=EclObject(\"#$integrate(x*signum(x^2-1/4),x,-1,0);$\").cadr().cdr().car()\n---------------------------------------------------------------------------\nTypeError                                 Traceback (most recent call last)\n\n/home/mjo/src/sage-5.0.beta1/devel/sage-devel/<ipython console> in <module>()\n\n/home/mjo/src/sage-5.0.beta1/local/lib/python2.7/site-packages/sage/libs/ecl.so in sage.libs.ecl.EclObject.cadr (sage/libs/ecl.c:5528)()\n\nTypeError: cadr can only be applied to a cons\nsage: integrate(x*sgn(x^2-1/4),x,-1,0)                                          \n1/2\nsage: I1=EclObject(\"#$integrate(x*signum(x^2-1/4),x,-1,0);$\").cadr().cdr().car()\nsage: I2=EclObject(\"#$'integrate(x*signum(x^2-1/4),x,-1,0);$\").cadr().cdr().car()\nsage: I1\n<ECL: (($INTEGRATE)\n ((MTIMES) $X\n  ((%SIGNUM) ((MPLUS) ((MEXPT) $X 2) ((MMINUS) ((MQUOTIENT) 1 4)))))\n $X ((MMINUS) 1) 0)>\nsage: I2\n<ECL: ((%INTEGRATE)\n ((MTIMES) $X\n  ((%SIGNUM) ((MPLUS) ((MEXPT) $X 2) ((MMINUS) ((MQUOTIENT) 1 4)))))\n $X ((MMINUS) 1) 0)>\nsage: EclObject([\"meval*\",[\"quote\", I1]]).eval()\n<ECL: ((RAT SIMP) 1 2)>\nsage: EclObject([\"meval*\",[\"quote\", I2]]).eval()\n<ECL: ((RAT SIMP) -1 4)>\nsage: EclObject([\"meval\",[\"quote\", I1]]).eval()\n<ECL: ((RAT SIMP) 1 2)>\nsage: EclObject([\"meval\",[\"quote\", I2]]).eval()\n<ECL: ((RAT SIMP) -1 4)>\n```\n\n\nAnd here's a session with `$INTEGRATE` switched to `%INTEGRATE`:\n\n\n```\nsage: from sage.libs.ecl import *                                                \nsage: I1=EclObject(\"#$integrate(x*signum(x^2-1/4),x,-1,0);$\").cadr().cdr().car()\n---------------------------------------------------------------------------\nTypeError                                 Traceback (most recent call last)\n\n/home/mjo/src/sage-5.0.beta1/devel/sage-devel/<ipython console> in <module>()\n\n/home/mjo/src/sage-5.0.beta1/local/lib/python2.7/site-packages/sage/libs/ecl.so in sage.libs.ecl.EclObject.cadr (sage/libs/ecl.c:5528)()\n\nTypeError: cadr can only be applied to a cons\nsage: integrate(x*sgn(x^2-1/4),x,-1,0)                                           \n-1/4\nsage: I1=EclObject(\"#$integrate(x*signum(x^2-1/4),x,-1,0);$\").cadr().cdr().car() \nsage: I2=EclObject(\"#$'integrate(x*signum(x^2-1/4),x,-1,0);$\").cadr().cdr().car()\nsage: I1\n<ECL: (($INTEGRATE)\n ((MTIMES) $X\n  ((%SIGNUM) ((MPLUS) ((MEXPT) $X 2) ((MMINUS) ((MQUOTIENT) 1 4)))))\n $X ((MMINUS) 1) 0)>\nsage: I2\n<ECL: ((%INTEGRATE)\n ((MTIMES) $X\n  ((%SIGNUM) ((MPLUS) ((MEXPT) $X 2) ((MMINUS) ((MQUOTIENT) 1 4)))))\n $X ((MMINUS) 1) 0)>\nsage: EclObject([\"meval*\",[\"quote\", I1]]).eval()                                 \n<ECL: ((RAT SIMP) 1 2)>\nsage: EclObject([\"meval*\",[\"quote\", I2]]).eval()                                 \n<ECL: ((RAT SIMP) -1 4)>\nsage: EclObject([\"meval\",[\"quote\", I1]]).eval()                                  \n<ECL: ((RAT SIMP) 1 2)>\nsage: EclObject([\"meval\",[\"quote\", I2]]).eval()                                  \n<ECL: ((RAT SIMP) -1 4)>\n```\n\n\nThe same thing, except the original integration actually works. Problem is, other tests start to fail with `%INTEGRATE`. Here's an example:\n\n\n```\n$ sage -t sage/interfaces/maxima_lib.py\nsage -t  \"devel/sage-devel/sage/interfaces/maxima_lib.py\"   \n**********************************************************************\nFile \"/home/mjo/src/sage-5.0.beta1/devel/sage-devel/sage/interfaces/maxima_lib.py\", line 661:\n    sage: integral(x^n,x)\nExpected:\n    Traceback (most recent call last):\n    ...\n    ValueError: Computation failed since Maxima requested additional\n    constraints; using the 'assume' command before integral evaluation\n    *may* help (example of legal syntax is 'assume(n+1>0)',\n    see `assume?` for more details)\n    Is  n+1  zero or nonzero?\nGot:\n    x^(n + 1)/(n + 1)\n**********************************************************************\nFile \"/home/mjo/src/sage-5.0.beta1/devel/sage-devel/sage/interfaces/maxima_lib.py\", line 685:\n    sage: integrate(sgn(x) - sgn(1-x), x)\nExpected:\n    abs(x - 1) + abs(x)\nGot:\n    (x - 1)*sgn(x - 1) + x*sgn(x)\n**********************************************************************\nFile \"/home/mjo/src/sage-5.0.beta1/devel/sage-devel/sage/interfaces/maxima_lib.py\", line 700:\n    sage: integrate(cos(x + abs(x)), x)\nExpected:\n    1/4*(sgn(x) + 1)*sin(2*x) - 1/2*x*sgn(x) + 1/2*x\nGot:\n    -1/4*(2*x - sin(2*x))*sgn(x) + 1/2*x + 1/4*sin(2*x)\n**********************************************************************\nFile \"/home/mjo/src/sage-5.0.beta1/devel/sage-devel/sage/interfaces/maxima_lib.py\", line 711:\n    sage: integral(abs(cos(x))*sin(x),(x,pi/2,pi))\nExpected:\n    1/2\nGot:\n    -1/2\n```\n",
    "created_at": "2012-02-01T01:29:28Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11418",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11418#issuecomment-127210",
    "user": "mjo"
}
```

Sorry, I should have been more clear: I did try everything you suggested. Replacing `$INTEGRATE` with `%INTEGRATE` causes the same test failures in maxima_lib.py that I got when I swapped out the whole thing for string substitution. It does fix this *particular* answer, though.

Here's a session with just the abs_integrate patch applied, maxima-5.26. I left the error at the top intact, for whatever reason it doesn't work at all until after I've integrated something.


```
sage: from sage.libs.ecl import *                                               
sage: I1=EclObject("#$integrate(x*signum(x^2-1/4),x,-1,0);$").cadr().cdr().car()
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)

/home/mjo/src/sage-5.0.beta1/devel/sage-devel/<ipython console> in <module>()

/home/mjo/src/sage-5.0.beta1/local/lib/python2.7/site-packages/sage/libs/ecl.so in sage.libs.ecl.EclObject.cadr (sage/libs/ecl.c:5528)()

TypeError: cadr can only be applied to a cons
sage: integrate(x*sgn(x^2-1/4),x,-1,0)                                          
1/2
sage: I1=EclObject("#$integrate(x*signum(x^2-1/4),x,-1,0);$").cadr().cdr().car()
sage: I2=EclObject("#$'integrate(x*signum(x^2-1/4),x,-1,0);$").cadr().cdr().car()
sage: I1
<ECL: (($INTEGRATE)
 ((MTIMES) $X
  ((%SIGNUM) ((MPLUS) ((MEXPT) $X 2) ((MMINUS) ((MQUOTIENT) 1 4)))))
 $X ((MMINUS) 1) 0)>
sage: I2
<ECL: ((%INTEGRATE)
 ((MTIMES) $X
  ((%SIGNUM) ((MPLUS) ((MEXPT) $X 2) ((MMINUS) ((MQUOTIENT) 1 4)))))
 $X ((MMINUS) 1) 0)>
sage: EclObject(["meval*",["quote", I1]]).eval()
<ECL: ((RAT SIMP) 1 2)>
sage: EclObject(["meval*",["quote", I2]]).eval()
<ECL: ((RAT SIMP) -1 4)>
sage: EclObject(["meval",["quote", I1]]).eval()
<ECL: ((RAT SIMP) 1 2)>
sage: EclObject(["meval",["quote", I2]]).eval()
<ECL: ((RAT SIMP) -1 4)>
```


And here's a session with `$INTEGRATE` switched to `%INTEGRATE`:


```
sage: from sage.libs.ecl import *                                                
sage: I1=EclObject("#$integrate(x*signum(x^2-1/4),x,-1,0);$").cadr().cdr().car()
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)

/home/mjo/src/sage-5.0.beta1/devel/sage-devel/<ipython console> in <module>()

/home/mjo/src/sage-5.0.beta1/local/lib/python2.7/site-packages/sage/libs/ecl.so in sage.libs.ecl.EclObject.cadr (sage/libs/ecl.c:5528)()

TypeError: cadr can only be applied to a cons
sage: integrate(x*sgn(x^2-1/4),x,-1,0)                                           
-1/4
sage: I1=EclObject("#$integrate(x*signum(x^2-1/4),x,-1,0);$").cadr().cdr().car() 
sage: I2=EclObject("#$'integrate(x*signum(x^2-1/4),x,-1,0);$").cadr().cdr().car()
sage: I1
<ECL: (($INTEGRATE)
 ((MTIMES) $X
  ((%SIGNUM) ((MPLUS) ((MEXPT) $X 2) ((MMINUS) ((MQUOTIENT) 1 4)))))
 $X ((MMINUS) 1) 0)>
sage: I2
<ECL: ((%INTEGRATE)
 ((MTIMES) $X
  ((%SIGNUM) ((MPLUS) ((MEXPT) $X 2) ((MMINUS) ((MQUOTIENT) 1 4)))))
 $X ((MMINUS) 1) 0)>
sage: EclObject(["meval*",["quote", I1]]).eval()                                 
<ECL: ((RAT SIMP) 1 2)>
sage: EclObject(["meval*",["quote", I2]]).eval()                                 
<ECL: ((RAT SIMP) -1 4)>
sage: EclObject(["meval",["quote", I1]]).eval()                                  
<ECL: ((RAT SIMP) 1 2)>
sage: EclObject(["meval",["quote", I2]]).eval()                                  
<ECL: ((RAT SIMP) -1 4)>
```


The same thing, except the original integration actually works. Problem is, other tests start to fail with `%INTEGRATE`. Here's an example:


```
$ sage -t sage/interfaces/maxima_lib.py
sage -t  "devel/sage-devel/sage/interfaces/maxima_lib.py"   
**********************************************************************
File "/home/mjo/src/sage-5.0.beta1/devel/sage-devel/sage/interfaces/maxima_lib.py", line 661:
    sage: integral(x^n,x)
Expected:
    Traceback (most recent call last):
    ...
    ValueError: Computation failed since Maxima requested additional
    constraints; using the 'assume' command before integral evaluation
    *may* help (example of legal syntax is 'assume(n+1>0)',
    see `assume?` for more details)
    Is  n+1  zero or nonzero?
Got:
    x^(n + 1)/(n + 1)
**********************************************************************
File "/home/mjo/src/sage-5.0.beta1/devel/sage-devel/sage/interfaces/maxima_lib.py", line 685:
    sage: integrate(sgn(x) - sgn(1-x), x)
Expected:
    abs(x - 1) + abs(x)
Got:
    (x - 1)*sgn(x - 1) + x*sgn(x)
**********************************************************************
File "/home/mjo/src/sage-5.0.beta1/devel/sage-devel/sage/interfaces/maxima_lib.py", line 700:
    sage: integrate(cos(x + abs(x)), x)
Expected:
    1/4*(sgn(x) + 1)*sin(2*x) - 1/2*x*sgn(x) + 1/2*x
Got:
    -1/4*(2*x - sin(2*x))*sgn(x) + 1/2*x + 1/4*sin(2*x)
**********************************************************************
File "/home/mjo/src/sage-5.0.beta1/devel/sage-devel/sage/interfaces/maxima_lib.py", line 711:
    sage: integral(abs(cos(x))*sin(x),(x,pi/2,pi))
Expected:
    1/2
Got:
    -1/2
```




---

archive/issue_comments_127211.json:
```json
{
    "body": "Replying to [comment:11 mjo]:\n> I left the error at the top intact, for whatever reason it doesn't work at all until after I've integrated something.\n\n```\nsage: from sage.libs.ecl import *\n```\n\nThis doesn't load maxima inside ecl yet, but once you evaluate an integral, maxima is loaded and the `#$...$` macro works. Sorry about that.",
    "created_at": "2012-02-01T01:59:44Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11418",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11418#issuecomment-127211",
    "user": "nbruin"
}
```

Replying to [comment:11 mjo]:
> I left the error at the top intact, for whatever reason it doesn't work at all until after I've integrated something.

```
sage: from sage.libs.ecl import *
```

This doesn't load maxima inside ecl yet, but once you evaluate an integral, maxima is loaded and the `#$...$` macro works. Sorry about that.



---

archive/issue_comments_127212.json:
```json
{
    "body": "Replying to [comment:3 kcrisman]:\n> Even with #11483, this isn't working right.  It should, though - see Barton's post at the Maxima ticket:\n> {{{\n> By the way:\n> \n> (%i4) load(abs_integrate)$\n> \n> Correct antiderivative:\n> \n> (%i5) 'integrate(x*signum(x^2-1/4),x);\n> (%o5) abs(x^2-1/4)/2\n> \n> Correct definite integral\n> \n> (%i6) 'integrate(x*signum(x^2-1/4),x,-1,0);\n> (%o6) -1/4\n> }}}\n> so I'm not sure why this is still returning the \"wrong\" thing.\nDid you try it with `integrate` rather than `'integrate`? Given what we've seen elsewhere in this ticket, I suspect it still gives the wrong answer. In sage, we are interfacing with `integrate`. If that is still broken, then the bug is not fixed as far as sage is concerned.\n\nIf maxima's position is that we should use a different integration routine (i.e., `'integrate`) then we need a heuristic on when to use what routine ... isn't it maxima's job to figure this out?",
    "created_at": "2012-02-01T02:06:40Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11418",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11418#issuecomment-127212",
    "user": "nbruin"
}
```

Replying to [comment:3 kcrisman]:
> Even with #11483, this isn't working right.  It should, though - see Barton's post at the Maxima ticket:
> {{{
> By the way:
> 
> (%i4) load(abs_integrate)$
> 
> Correct antiderivative:
> 
> (%i5) 'integrate(x*signum(x^2-1/4),x);
> (%o5) abs(x^2-1/4)/2
> 
> Correct definite integral
> 
> (%i6) 'integrate(x*signum(x^2-1/4),x,-1,0);
> (%o6) -1/4
> }}}
> so I'm not sure why this is still returning the "wrong" thing.
Did you try it with `integrate` rather than `'integrate`? Given what we've seen elsewhere in this ticket, I suspect it still gives the wrong answer. In sage, we are interfacing with `integrate`. If that is still broken, then the bug is not fixed as far as sage is concerned.

If maxima's position is that we should use a different integration routine (i.e., `'integrate`) then we need a heuristic on when to use what routine ... isn't it maxima's job to figure this out?



---

archive/issue_comments_127213.json:
```json
{
    "body": "> Did you try it with `integrate` rather than `'integrate`? \n\n```\n(%i5) display2d:false;\n\n(%o5) false\n(%i6) integrate(x*signum(x^2-1/4),x,-1,0);\n\n(%o6) 1/2\n(%i7) 'integrate(x*signum(x^2-1/4),x,-1,0);\n\n(%o7) -1/4\n```\n\nNote that this was just Barton Willis (Maxima dev) example.\n> Given what we've seen elsewhere in this ticket, I suspect it still gives the wrong answer. In sage, we are interfacing with `integrate`. If that is still broken, then the bug is not fixed as far as sage is concerned.\nI don't think they claimed it was fixed. \n> If maxima's position is that we should use a different integration routine (i.e., `'integrate`) then we need a heuristic on when to use what routine ... isn't it maxima's job to figure this out?\nYes, I am a little stumped on this.  I thought that the apostrophe just meant \"don't evaluate nounform\", but apparently I was mistaken.    I just reported this example on the Maxima ticket, but I wouldn't hold my breath waiting for it, since there *is* a way to get it to work correctly there.",
    "created_at": "2012-02-01T02:28:03Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11418",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11418#issuecomment-127213",
    "user": "kcrisman"
}
```

> Did you try it with `integrate` rather than `'integrate`? 

```
(%i5) display2d:false;

(%o5) false
(%i6) integrate(x*signum(x^2-1/4),x,-1,0);

(%o6) 1/2
(%i7) 'integrate(x*signum(x^2-1/4),x,-1,0);

(%o7) -1/4
```

Note that this was just Barton Willis (Maxima dev) example.
> Given what we've seen elsewhere in this ticket, I suspect it still gives the wrong answer. In sage, we are interfacing with `integrate`. If that is still broken, then the bug is not fixed as far as sage is concerned.
I don't think they claimed it was fixed. 
> If maxima's position is that we should use a different integration routine (i.e., `'integrate`) then we need a heuristic on when to use what routine ... isn't it maxima's job to figure this out?
Yes, I am a little stumped on this.  I thought that the apostrophe just meant "don't evaluate nounform", but apparently I was mistaken.    I just reported this example on the Maxima ticket, but I wouldn't hold my breath waiting for it, since there *is* a way to get it to work correctly there.



---

archive/issue_comments_127214.json:
```json
{
    "body": "See also #12731.",
    "created_at": "2014-12-08T15:00:45Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11418",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11418#issuecomment-127214",
    "user": "kcrisman"
}
```

See also #12731.



---

archive/issue_comments_127215.json:
```json
{
    "body": "FYI fixed in Maxima by commit 5a300aa, which I have cherry-picked to branch-5_38.\n\nRelated bug reports:\nhttps://sourceforge.net/p/maxima/bugs/2242\nhttps://sourceforge.net/p/maxima/bugs/3123",
    "created_at": "2016-04-14T20:49:53Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11418",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11418#issuecomment-127215",
    "user": "robert_dodier"
}
```

FYI fixed in Maxima by commit 5a300aa, which I have cherry-picked to branch-5_38.

Related bug reports:
https://sourceforge.net/p/maxima/bugs/2242
https://sourceforge.net/p/maxima/bugs/3123



---

archive/issue_comments_127216.json:
```json
{
    "body": "This now works in 8.9.b7. We need to add the doctest\n\n```\nsage: integrate(x * sgn(x^2 - 1/4), x, -1, 0)\n-1/4\n```\n",
    "created_at": "2019-08-26T19:07:20Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11418",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11418#issuecomment-127216",
    "user": "chapoton"
}
```

This now works in 8.9.b7. We need to add the doctest

```
sage: integrate(x * sgn(x^2 - 1/4), x, -1, 0)
-1/4
```




---

archive/issue_comments_127217.json:
```json
{
    "body": "New commits:",
    "created_at": "2020-12-18T15:00:29Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11418",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11418#issuecomment-127217",
    "user": "mjo"
}
```

New commits:



---

archive/issue_comments_127218.json:
```json
{
    "body": "Changing status from new to needs_review.",
    "created_at": "2020-12-18T15:00:29Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11418",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11418#issuecomment-127218",
    "user": "mjo"
}
```

Changing status from new to needs_review.



---

archive/issue_comments_127219.json:
```json
{
    "body": "ok, this is now handled by giac..",
    "created_at": "2020-12-19T20:16:15Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11418",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11418#issuecomment-127219",
    "user": "chapoton"
}
```

ok, this is now handled by giac..



---

archive/issue_comments_127220.json:
```json
{
    "body": "Changing status from needs_review to positive_review.",
    "created_at": "2020-12-19T20:16:15Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11418",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11418#issuecomment-127220",
    "user": "chapoton"
}
```

Changing status from needs_review to positive_review.



---

archive/issue_comments_127221.json:
```json
{
    "body": "Resolution: fixed",
    "created_at": "2020-12-27T00:23:33Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11418",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11418#issuecomment-127221",
    "user": "vbraun"
}
```

Resolution: fixed
