# Issue 15733: j_invariant_qexp won't allow substitution

Issue created by migration from https://trac.sagemath.org/ticket/15970

Original creator: katestange

Original creation time: 2014-03-18 04:21:35

Keywords: j-invariant, laurent series, q-expansion, substitution


```
jq = j_invariant_qexp(10) 
jqsub = jq.substitute(q = e^(-2*pi))
```

This used to work (Sage 4.8).  It ought to return an approximation to 1728 (this is useful behaviour...). E.g.


```
n(jqsub)

1727.99999999999
```

But now it raises...


```
ValueError: Can only substitute elements of positive valuation
```



---

Comment by fwclarke created at 2014-03-19 12:13:32

The change was made in #3979.  Until Sage 5.4, substitution into power series was incorrectly implemented in many ways.  In particular, it was possible to substitute a non-zero scalar into a series only specified up to a given precision, but this cannot make sense. 

In your case, 

```
sage: jq = j_invariant_qexp(10)
sage: jq.truncate(10)(exp(-2*pi)).n(100)
1727.9999999999882175423506871
```

gives the answer you want.  But its meaning depends on assuming (correctly) that the infinitely many unspecified terms can be ignored (to within 10<sup>-10</sup>).  

In general, writing, say,

```
f = x + x^2 + O(x^3)
```

tells us nothing about how `f(2)` should be defined, or whether `6` might be a reasonable approximation.


---

Comment by katestange created at 2014-03-20 02:51:21

Thanks, that clears things up for me.  Probably I should have gone to the discussion list before opening a ticket (if so, I apologize).  But before we close the ticket, can we clarify what way the user should accomplish the intended calculation?  How can one approximate the j-invariant for various tau in the upper half plane?  This is something Sage ought to allow someone to do, in some fashion, so if isn't possible, then maybe this ticket should be changed to a requested feature.  But if this discussion ought to be carried out elsewhere (like ask.sagemath.org), please let me know.


---

Comment by fwclarke created at 2014-03-20 09:03:38

Replying to [comment:2 katestange]:
> But before we close the ticket, can we clarify what way the user should accomplish the intended calculation?  How can one approximate the j-invariant for various tau in the upper half plane?

For numerical computations, `elliptic_j` will do:

```
sage: elliptic_j(I)
1728.00000000000
```

and the precision can be increased as in

```
sage: elliptic_j(sqrt(-1).n(128))
1728.0000000000000000000000000000000000
```

or

```
sage: tau = (1 + sqrt(-163))/2
sage: elliptic_j(tau.n(100))
-2.6253741264076799999999999999e17 + 1.3012822400356849057448214481e-12*I
sage: (-elliptic_j(tau.n(100)).real().round())^(1/3)
640320
```



---

Comment by katestange created at 2014-03-20 15:09:34

Thank you!


---

Comment by AlexGhitza created at 2014-04-24 22:23:12

Changing status from new to needs_review.


---

Comment by AlexGhitza created at 2014-04-24 22:23:12

I added a link to `elliptic_j` in the docstring for `j_invariant_qexp`.
----
New commits:


---

Comment by nbruin created at 2014-04-25 06:13:39

Replying to [comment:2 katestange]:
> How can one approximate the j-invariant for various tau in the upper half plane?  This is something Sage ought to allow someone to do, in some fashion, so if isn't possible, then maybe this ticket should be changed to a requested feature.

The request is of course a reasonable one. Sometimes all you have is a finite approximation, and evaluating that will be the best you'll get. The trick is to get rid of the `O(..)` term, which you can do with `truncate`:

```
sage: jq = j_invariant_qexp(10)
sage: jq.truncate(100)(e^(-2*pi)).n()
1727.99999999999
```



---

Comment by pbruin created at 2014-05-02 13:04:41

Looks good, just a small reviewer patch to add markup to symbols and a variable name.


---

Comment by pbruin created at 2014-05-02 13:04:41

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2014-05-13 07:58:36

Resolution: fixed
