# Issue 20868: abs for number field element

Issue created by migration from Trac.

Original creator: vdelecroix

Original creation time: 2016-07-27 14:11:10

CC:  mkoeppe

For a number field element `a`, `abs(a)` currently returns a floating point real number

```
sage: K.<cbrt2> = NumberField(x^3 - 2, 'a', embedding=1.26)
sage: abs(cbrt2)
1.25992104989487
sage: parent(_)
Real Field with 53 bits of precision
```

If a coercion embedding is defined with value in `RR`, the absolute value can be defined internally as it is the case for `AA`

```
sage: abs(AA(2).sqrt() - AA(2))
0.5857864376269049?
```

We propose to change the behavior for embedded number fields. Namely make `abs` an internal operation.

As a (minor) consequence of the current behavior, the inequalities from `sage.geometry.polyhedron.representation.Inequality` gets badly displayed

```
sage: K.<cbrt2> = NumberField(x^3 - 2, 'a', embedding=1.26)
sage: P = Polyhedron(vertices=[(1,1,cbrt2),(cbrt2,1,1)])
sage: P.inequalities()
(An inequality (-cbrt2^2 - cbrt2 - 1, 0, 0) x + 4.84732210186307 >= 0,
 An inequality (cbrt2^2 + cbrt2 + 1, 0, 0) x - 3.84732210186307 >= 0)
```



---

Comment by git created at 2016-08-03 22:08:24

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by mkoeppe created at 2016-08-03 22:10:18

Changing status from new to needs_review.


---

Comment by vdelecroix created at 2016-08-03 22:13:04

It is weird to have `abs(a)` and `a.abs()` behaving differently, don't you think?


---

Comment by mkoeppe created at 2016-08-03 22:21:24

OK, I'll change `a.abs()` too.


---

Comment by mkoeppe created at 2016-08-03 22:27:37

By the way, should perhaps the print representation of a number field indicate whether it's embedded or not?


---

Comment by vdelecroix created at 2016-08-03 22:36:24

That's indeed an issue. But it is hard to solve since you are interested at the same time in both the algebraic expression and the embedded value.

More generally, instead of having if/else in many methods I think that a better solution would be to have a dedicated class for real embedded element (whose semantic would be to follow standard method of real numbers, possibly having methods like `.cos()`, `.exp()` and such). But that is another question that will not be solved by the ticket.


---

Comment by mkoeppe created at 2016-08-03 22:42:38

Replying to [comment:8 vdelecroix]:
> That's indeed an issue. But it is hard to solve since you are interested at the same time in both the algebraic expression and the embedded value.

True, but I meant the print representation of the field itself (the parent), not an element.


---

Comment by vdelecroix created at 2016-08-03 22:44:35

Replying to [comment:9 mkoeppe]:
> Replying to [comment:8 vdelecroix]:
> > That's indeed an issue. But it is hard to solve since you are interested at the same time in both the algebraic expression and the embedded value.
> 
> True, but I meant the print representation of the field itself (the parent), not an element.

+1. Put me in cc if you open a ticket.


---

Comment by git created at 2016-08-03 22:59:35

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by mkoeppe created at 2016-08-03 23:13:25

Replying to [comment:10 vdelecroix]:
> Replying to [comment:9 mkoeppe]:
> > Replying to [comment:8 vdelecroix]:
> > > That's indeed an issue. But it is hard to solve since you are interested at the same time in both the algebraic expression and the embedded value.
> > 
> > True, but I meant the print representation of the field itself (the parent), not an element.
> 
> +1. Put me in cc if you open a ticket.

See #21161.


---

Comment by mkoeppe created at 2016-08-03 23:14:01

Replying to [comment:6 mkoeppe]:
> OK, I'll change `a.abs()` too.
Done.


---

Comment by vdelecroix created at 2016-08-03 23:22:33

This is missing indentation

```
Check that for fields with real coercion embeddings, absolute
values are in the same field (:trac:`21105`)::

sage: x = polygen(ZZ)      <---- test should be indented
```



---

Comment by git created at 2016-08-03 23:26:07

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by vdelecroix created at 2016-08-05 17:38:08

After

```
            sage: x = polygen(ZZ)
            sage: f = x^3 - x - 1
            sage: K.<b> = NumberField(f, embedding=1.3)
            sage: b.abs()
            b
```

  you should also test the output with arguments (both `i` and `prec`).


---

Comment by git created at 2016-08-05 18:12:56

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by mkoeppe created at 2016-08-05 18:13:43

Replying to [comment:17 vdelecroix]:
>  you should also test the output with arguments (both `i` and `prec`).

Done. 
I've also changed what happens when `prec` is provided. I think it makes more sense now.


---

Comment by vdelecroix created at 2016-08-05 20:50:41

If `prec=None` and there is no real embedded, I would actually return an element of `AA` (the real algebraic field). But it becomes beyond the scope of the ticket... (and breaks even more the previous behavior).


---

Comment by mkoeppe created at 2016-08-05 21:22:44

Yes, I guess that would make sense; but I agree it's too much for this ticket.

By the way, why does it use complex fields instead of real fields for the result?


---

Comment by vdelecroix created at 2016-08-05 21:25:15

It does not: the method uses complex field for the embedding. But the result of `.abs()` on a complex number is real

```
sage: CC(0,1).abs().parent()
Real Field with 53 bits of precision
```



---

Comment by git created at 2016-08-05 21:32:33

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by mkoeppe created at 2016-08-05 21:34:03

Replying to [comment:22 vdelecroix]:
> It does not: the method uses complex field for the embedding. But the result of `.abs()` on a complex number is real

Ah, thanks. I've reworded the docstring to clarify.


---

Comment by vdelecroix created at 2016-08-05 22:09:11

I don't understand this sentence from the doc of `abs`

```
If ``prec`` is ``None`` or 53, then the complex double field is
used; otherwise the arbitrary precision (but slow) complex
field is used.  The result is in the corresponding real field.
```

The "complex double field" refers to I guess "CDF" but which is actually not used! I would rather remove that sentence and explain that the default precision is `53`.


---

Comment by git created at 2016-08-05 22:22:36

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by mkoeppe created at 2016-08-05 22:23:08

Replying to [comment:25 vdelecroix]:
> I don't understand this sentence from the doc of `abs`
> {{{
> If ``prec`` is ``None`` or 53, then the complex double field is
> used; otherwise the arbitrary precision (but slow) complex
> field is used.  The result is in the corresponding real field.
> }}}
> The "complex double field" refers to I guess "CDF" but which is actually not used! I would rather remove that sentence and explain that the default precision is `53`.
Thanks for catching this.


---

Comment by vdelecroix created at 2016-08-05 22:28:37

Thanks for the fix!


---

Comment by vdelecroix created at 2016-08-05 22:28:37

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2016-08-07 20:01:07

Resolution: fixed
