# Issue 17731: Wrong integral of exp(x^3) from 1 to 2.

Issue created by migration from https://trac.sagemath.org/ticket/17968

Original creator: tmonteil

Original creation time: 2015-03-16 23:08:22

CC:  kcrisman mforets

The following was reported on [this ask question](http://ask.sagemath.org/question/26212/how-to-evaluate-int_12-ex3-dx/):


```
sage: f(x) = exp(x^3)
sage: f.integrate(x, 1, 2)
-1/3*gamma(1/3, -1) + 1/3*gamma(1/3, -8)
sage: f.integrate(x, 1, 2).n()
-138.557717219510 - 238.442320120796*I
```


`numerical_integral` and `sympy` seem to agree on the result:


```
sage: numerical_integral(f,1,2)
(275.5109837633117, 3.0587863771115628e-12)
```




```
sage: import sympy
sage: f = f._sympy_()
sage: g = f.integrate() ; g
exp(-I*pi/3)*gamma(1/3)*lowergamma(1/3, x**3*exp_polar(I*pi))/(9*gamma(4/3))
sage: h = g.subs(x,2) - g.subs(x,1)
sage: h.n()
275.510983763312 - 1.68744844960818e-21*I
```





---

Comment by kcrisman created at 2015-03-17 01:16:12

Usually such problems are due to our conversions with such special functions, but apparently this time it might be Maxima's integration that is wrong:

```
(%i5) display2d: false;

(%o5) false
(%i6) integrate(exp(x^3),x,1,2);

(%o6) (gamma_incomplete(1/3,-8)-gamma_incomplete(1/3,-1))/3
(%i7) %, numer; 

(%o7) 0.3333333333333333*(-715.7985328820091*%i-413.2664756449672)
```

which seems to be the same issue as we have.  Possibly related is #17328 or #11164.  W|A gives the same antiderivative but for the definite integral uses the exponential integral E sub 2/3 of -1 and -8, which implies to me some kind of branch cut thing as usual.


---

Comment by mforets created at 2017-03-19 09:29:54

This seems to be fixed by now:


```
sage: version()
SageMath version 7.5, Release Date: 2017-01-11
sage: integrate(exp(x^3), (x, 1, 2))
-1/3*(-1)^(2/3)*gamma(1/3, -1) + 1/3*(-1)^(2/3)*gamma(1/3, -8)
sage: integrate(exp(x^3), (x, 1, 2)).n()
275.510983763312 - 7.21644966006352e-14*I
```


should this ticket be closed?


---

Comment by tmonteil created at 2017-03-19 09:44:25

Replying to [comment:2 mforets]:
> This seems to be fixed by now:
> 
> {{{
> sage: version()
> [SageMath](SageMath) version 7.5, Release Date: 2017-01-11
> sage: integrate(exp(x^3), (x, 1, 2))
> -1/3*(-1)^(2/3)*gamma(1/3, -1) + 1/3*(-1)^(2/3)*gamma(1/3, -8)
> sage: integrate(exp(x^3), (x, 1, 2)).n()
> 275.510983763312 - 7.21644966006352e-14*I
> }}}
> 
> should this ticket be closed?

Certainly not. We should add a doctest (with a pointer to this ticket) to ensure that the issue will not reappear.


---

Comment by mforets created at 2017-03-19 12:39:27

Replying to [comment:4 tmonteil]:
> Replying to [comment:2 mforets]:
> > This seems to be fixed by now:
> > 
> > {{{
> > sage: version()
> > [SageMath](SageMath) version 7.5, Release Date: 2017-01-11
> > sage: integrate(exp(x^3), (x, 1, 2))
> > -1/3*(-1)^(2/3)*gamma(1/3, -1) + 1/3*(-1)^(2/3)*gamma(1/3, -8)
> > sage: integrate(exp(x^3), (x, 1, 2)).n()
> > 275.510983763312 - 7.21644966006352e-14*I
> > }}}
> > 
> > should this ticket be closed?
> 
> Certainly not. We should add a doctest (with a pointer to this ticket) to ensure that the issue will not reappear.

got it! 

i copied the doctest which is just a couple of lines above ("Check that 11737 is fixed::..."). the difference is that the numerical noise in the imag part of the integral of `exp(x^3)` did not "magically vanish" by setting `prec=54`, as it is the case for the integral in the 11737 test. hence, i took the `real_part()`.
----
New commits:


---

Comment by mforets created at 2017-03-20 18:02:07

Changing status from new to needs_review.


---

Comment by kcrisman created at 2017-06-28 15:30:54

Apparently doesn't apply for some reason.


---

Comment by git created at 2017-06-28 17:28:10

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by mforets created at 2017-06-28 17:29:32

OK, i've merged with the most recent beta and solved a conflict in `integral.py`, maybe that was the reason, we'll see..


---

Comment by tscrim created at 2017-06-29 12:43:17

This is not really a bug:

```
        sage: N(integrate(exp(x^3), (x, 1, 2)))    # known bug (non-zero imag part)
        275.510983763312
```

Instead, it is more of an issue with the numerics from the indefinite integral:

```
sage: integral(exp(x^3), x)
-1/3*x*gamma(1/3, -x^3)/(-x^3)^(1/3)
```


Also author name.


---

Comment by tscrim created at 2017-06-29 12:43:17

Changing status from needs_review to needs_work.


---

Comment by git created at 2017-06-29 17:07:34

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by mforets created at 2017-06-29 17:14:21

Changing status from needs_work to needs_review.


---

Comment by mforets created at 2017-06-29 17:14:21

`@`travis: yes, you're right, i've changed it.


---

Comment by tscrim created at 2017-06-29 23:35:42

LGTM.


---

Comment by tscrim created at 2017-06-29 23:35:42

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2017-07-26 22:13:41

Resolution: fixed
