# Issue 23486: accept pari input in more parents

archive/issues_023486.json:
```json
{
    "body": "CC:  @jdemeyer @jplab\n\n- vectors\n\n```\nsage: V = ZZ**3\nsage: v = pari([1,2,3])\nsage: V(v)\nTraceback (most recent call last):\n...\nTypeError: can't initialize vector from nonzero non-list\n```\n  (note: in the above example `v.sage()` returns a list)\n- matrices\n\n```\nsage: M = MatrixSpace(ZZ, 2)\nsage: p = pari('[1, 2; 3, 4]')\nsage: M(p)\nTraceback (most recent call last):\n...\nTypeError: entries has the wrong length\n```\n  (note: in the above case `p.sage()` works perfectly)\n\nThe aim is to have the following construction supported\n\n```\nsage: K = CyclotomicField(10)\nsage: z = K.gen()\nsage: M = MatrixSpace(K, 2)\nsage: m = M([1, z, 1-z, -2/3])\nsage: p = m.__pari__()\nsage: r = p^2 - 2*p + 3\nsage: M(r)\nTraceback (most recent call last):\n...\nTypeError: ... has unsupported PARI type t_MAT\n```\n  (in the above example `r.sage()` does fail with `NameError: name 'y' is not defined`)\n\nIssue created by migration from https://trac.sagemath.org/ticket/23723\n\n",
    "created_at": "2017-08-26T03:01:06Z",
    "labels": [
        "component: interfaces"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-8.1",
    "title": "accept pari input in more parents",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/23486",
    "user": "https://github.com/videlec"
}
```
CC:  @jdemeyer @jplab

- vectors

```
sage: V = ZZ**3
sage: v = pari([1,2,3])
sage: V(v)
Traceback (most recent call last):
...
TypeError: can't initialize vector from nonzero non-list
```
  (note: in the above example `v.sage()` returns a list)
- matrices

```
sage: M = MatrixSpace(ZZ, 2)
sage: p = pari('[1, 2; 3, 4]')
sage: M(p)
Traceback (most recent call last):
...
TypeError: entries has the wrong length
```
  (note: in the above case `p.sage()` works perfectly)

The aim is to have the following construction supported

```
sage: K = CyclotomicField(10)
sage: z = K.gen()
sage: M = MatrixSpace(K, 2)
sage: m = M([1, z, 1-z, -2/3])
sage: p = m.__pari__()
sage: r = p^2 - 2*p + 3
sage: M(r)
Traceback (most recent call last):
...
TypeError: ... has unsupported PARI type t_MAT
```
  (in the above example `r.sage()` does fail with `NameError: name 'y' is not defined`)

Issue created by migration from https://trac.sagemath.org/ticket/23723


