# Issue 27970: Derivative of piecewise function returns junk

Issue created by migration from https://trac.sagemath.org/ticket/28207

Original creator: rburing

Original creation time: 2019-07-16 19:08:47

CC:  tscrim slelievre @kliem

Keywords: piecewise,derivative,diff

Reported in [Ask SageMath question #47169](https://ask.sagemath.org/question/47169/plotting-derivative-of-bump-function/), we can't differentiate the bump function:


```
sage: f(x) = piecewise([((-oo, -1), 0), ((-1, 1), exp(-1/(1 - x^2))), ((1, oo), 0)])
sage: f.diff()
x |--> (0, 0, 0)*D[0]piecewise(x|-->0 on (-oo, -1), x|-->e^(1/(x^2 - 1)) on (-1, 1), x|-->0 on (1, +oo); x) + D[1]piecewise(x|-->0 on (-oo, -1), x|-->e^(1/(x^2 - 1)) on (-1, 1), x|-->0 on (1, +oo); x)
sage: f.diff()(0)
(0, 0, 0)*e^(-1) + e^(-1)
sage: f.diff()(0) in RR
False
```


That's not right...


---

Comment by embray created at 2019-12-30 14:48:17

Ticket retargeted after milestone closed


---

Comment by mkoeppe created at 2020-04-14 19:41:51

Batch modifying tickets that will likely not be ready for 9.1, based on a review of the ticket title, branch/review status, and last modification date.


---

Comment by mkoeppe created at 2021-02-13 20:51:01

Setting new milestone based on a cursory review of ticket status, priority, and last modification date.


---

Comment by chapoton created at 2021-10-19 16:25:33

Changing status from new to needs_review.


---

Comment by chapoton created at 2021-10-19 16:25:33

here is a tentative ; certainly better than before, but not perfect
----
New commits:


---

Comment by tscrim created at 2021-10-20 04:04:15

What would you say is missing from making it perfect?


---

Comment by chapoton created at 2021-10-20 06:54:33

derivative wrt y is not working, giving the same result as wrt x...


---

Comment by tscrim created at 2021-10-20 07:02:35

Could we add a short explanation and doctest showing this behavior (and perhaps with the desired output)?


---

Comment by git created at 2021-10-20 11:40:18

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by chapoton created at 2021-10-20 11:41:10

This is still very ugly. One should try to fix that, but experts are lacking..


---

Comment by tscrim created at 2021-10-20 23:51:35

I am not sure these should actually count as bugs as the behavior is consistent with what other symbolic functions do:

```
sage: y = SR.var('y')
sage: f(x) = x*y + x + y
sage: type(f)
<class 'sage.symbolic.expression.Expression'>
sage: f
x |--> x*y + x + y

sage: f.derivative(x)
x |--> y + 1
sage: f.derivative(y)
x |--> x + 1
```

What would you expect the output to be?


---

Comment by chapoton created at 2021-10-21 07:04:34

I have written the expected output in the doctests. The actual behaviour, with the branch, is to raise an Error.


---

Comment by tscrim created at 2021-10-21 07:27:34

Changing status from needs_review to positive_review.


---

Comment by tscrim created at 2021-10-21 07:27:34

Ah, sorry, I misunderstood. Thank you. LGTM.


---

Comment by chapoton created at 2021-10-21 07:47:08

I would have hoped that someone step in to fix that..

Here is the traceback:

```
sage: y = SR.var('y')
sage: h = piecewise([((-1,1),x**2*y)])
sage: h.derivative(x)
---------------------------------------------------------------------------
ValueError                                Traceback (most recent call last)
<ipython-input-6-efc8c30bd882> in <module>
----> 1 h.derivative(x)

~/sage/local/lib/python3.8/site-packages/sage/symbolic/expression.pyx in sage.symbolic.expression.Expression.derivative (build/cythonized/sage/symbolic/expression.cpp:54561)()
   4574             ValueError: No differentiation variable specified.
   4575         """
-> 4576         return multi_derivative(self, args)
   4577 
   4578     diff = differentiate = derivative

~/sage/local/lib/python3.8/site-packages/sage/misc/derivative.pyx in sage.misc.derivative.multi_derivative (build/cythonized/sage/misc/derivative.c:3218)()
    220 
    221     for arg in derivative_parse(args):
--> 222         F = F._derivative(arg)
    223     return F
    224 

~/sage/local/lib/python3.8/site-packages/sage/symbolic/expression.pyx in sage.symbolic.expression.Expression._derivative (build/cythonized/sage/symbolic/expression.cpp:55084)()
   4646         sig_on()
   4647         try:
-> 4648             x = self._gobj.diff(ex_to_symbol(symbol._gobj), deg)
   4649         finally:
   4650             sig_off()

~/sage/local/lib/python3.8/site-packages/sage/functions/piecewise.py in _tderivative_(self, parameters, variable, *args, **kwds)
    312             piecewise(x|-->0 on (-oo, -1), x|-->-2*x*e^(1/(x^2 - 1))/(x^2 - 1)^2 on (-1, 1), x|-->0 on (1, +oo); x)
    313         """
--> 314         return piecewise([(domain, func.derivative(*args))
    315                           for domain, func in parameters],
    316                          var=variable)

~/sage/local/lib/python3.8/site-packages/sage/functions/piecewise.py in <listcomp>(.0)
    312             piecewise(x|-->0 on (-oo, -1), x|-->-2*x*e^(1/(x^2 - 1))/(x^2 - 1)^2 on (-1, 1), x|-->0 on (1, +oo); x)
    313         """
--> 314         return piecewise([(domain, func.derivative(*args))
    315                           for domain, func in parameters],
    316                          var=variable)

~/sage/local/lib/python3.8/site-packages/sage/symbolic/expression.pyx in sage.symbolic.expression.Expression.derivative (build/cythonized/sage/symbolic/expression.cpp:54561)()
   4574             ValueError: No differentiation variable specified.
   4575         """
-> 4576         return multi_derivative(self, args)
   4577 
   4578     diff = differentiate = derivative

~/sage/local/lib/python3.8/site-packages/sage/misc/derivative.pyx in sage.misc.derivative.multi_derivative (build/cythonized/sage/misc/derivative.c:3114)()
    217     if not args:
    218         # fast version where no arguments supplied
--> 219         return F._derivative()
    220 
    221     for arg in derivative_parse(args):

~/sage/local/lib/python3.8/site-packages/sage/symbolic/expression.pyx in sage.symbolic.expression.Expression._derivative (build/cythonized/sage/symbolic/expression.cpp:54909)()
   4636                 return self.gradient()
   4637             else:
-> 4638                 raise ValueError("No differentiation variable specified.")
   4639         if not isinstance(deg, (int, long, sage.rings.integer.Integer)) \
   4640                 or deg < 1:

ValueError: No differentiation variable specified.
```



---

Comment by tscrim created at 2021-10-21 11:16:35

I will try to dig a little deeper soon.


---

Comment by vbraun created at 2021-10-24 18:39:17

Resolution: fixed
