# Issue 31494: CRT for polynomials mod n

archive/issues_031494.json:
```json
{
    "body": "I implemented this for #31548 but ended up not using it, so I made this ticket.\n\n```\nsage: moduli = [4, 9, 25, 49]\nsage: N = prod(moduli)\nsage: S.<x> = Zmod(N)[]\nsage: polys = [Zmod(m)['x']([sqrt(m)] + [0]*(sqrt(m)-1) + [1]) for m in moduli]\nsage: f = polys[0].crt(*polys[1:])\n27000*x^7 + 15876*x^5 + 34300*x^3 + 11025*x^2 + 40530\nsage: all(g == f.change_ring(Zmod(m)) for (g, m) in zip(polys, moduli))\nTrue\n```\n\nThe interface should probably also support CRT in `k[x]` and specifying polynomial moduli.\n\nIssue created by migration from https://trac.sagemath.org/ticket/31731\n\n",
    "created_at": "2021-04-26T18:08:57Z",
    "labels": [
        "component: number theory"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-9.8",
    "title": "CRT for polynomials mod n",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/31494",
    "user": "https://github.com/roed314"
}
```
I implemented this for #31548 but ended up not using it, so I made this ticket.

```
sage: moduli = [4, 9, 25, 49]
sage: N = prod(moduli)
sage: S.<x> = Zmod(N)[]
sage: polys = [Zmod(m)['x']([sqrt(m)] + [0]*(sqrt(m)-1) + [1]) for m in moduli]
sage: f = polys[0].crt(*polys[1:])
27000*x^7 + 15876*x^5 + 34300*x^3 + 11025*x^2 + 40530
sage: all(g == f.change_ring(Zmod(m)) for (g, m) in zip(polys, moduli))
True
```

The interface should probably also support CRT in `k[x]` and specifying polynomial moduli.

Issue created by migration from https://trac.sagemath.org/ticket/31731


