# Issue 13128: slice and __getitem__ do not work over unramified extensions of padics

Issue created by migration from Trac.

Original creator: saraedum

Original creation time: 2012-07-26 17:10:11

Assignee: roed

There are some strange results when indexing into an element of an unramified extension.

In the following example, I think it would make more sense to return an element in the residue field:

```
sage: K=Qp(3,5)
sage: R.<a> = K[]
sage: L.<a> = K.extension(a^2+a-1)
sage: a[0]
[0, 1]
```


Slices do not work at all currently:

```
sage: a[0:2]
TypeError
```



---

Comment by saraedum created at 2012-07-26 17:56:04

The attached file (which has an extra 3 in the filename, sorry) fixes this.

To be consistent, indexing gives elements in the residue field. Mathematically, this seems to make sense, but is this really what one wants?

I'm running all doctests now to see if this breaks anything.


---

Comment by saraedum created at 2012-07-26 18:14:08

The doctests worked, so I'm setting this to needs review.


---

Comment by saraedum created at 2012-07-26 18:14:08

Changing status from new to needs_review.


---

Comment by roed created at 2012-10-24 06:53:31

Changing status from needs_review to needs_info.


---

Attachment

I don't think that giving elements of the residue field is what we want, though I agree that the current behavior for unramified extensions is silly.  I would like to be able to have 

```
sage: K.<a> = Qq(7^2, 20)
sage: z = K.random_element()
sage: z == sum([z[i] * 7^i for i in range(20)])
True
```

without having to lift from the residue field.

Of course, sometimes you want to get at the coefficient of `a` in `z`, or the coefficient of `a` in `z[0]`.  Here's an idea.  For matrices, we have the following::


```
sage: M = matrix(ZZ,4,4,range(16))
sage: M[0]
(0, 1, 2, 3)
sage: M[0,0]
0
sage: M[0,:]
[0 1 2 3]
sage: M[:,0]
[ 0]
[ 4]
[ 8]
[12]
sage: M[1:3,1:4]
[ 5  6  7]
[ 9 10 11]
```


What if we used a similar tuple indexing scheme for p-adic elements?  For example:


```
sage: K.<a> = Qq(5^4,5)
sage: z = K.random_element(); z
a^3*5^-2 + (3*a^3 + 3*a^2)*5^-1 + (3*a^3 + a^2 + 3*a) + 4*a^3*5 + (4*a + 2)*5^2 + O(5^3)
sage: z[0]
3*a^3 + a^2 + 3*a + O(5^3)
sage: z[2]
4*a + 2 + O(5)
sage: z[2].parent()
Unramified Extension of 5-adic Field with capped relative precision 5 in a defined by (1 + O(5^5))*x^4 + (O(5^5))*x^3 + (4 + O(5^5))*x^2 + (4 + O(5^5))*x + (2 + O(5^5))
sage: z[0,0]
O(5^3)
sage: z[0,0].parent()
5-adic Field with capped relative precision 5
sage: z[2,0]
2 + O(5)
sage: z[2,1]
4 + O(5)
sage: z[:-1]
a^3*5^-2 + O(5^-1)
sage: z[:1]
a^3*5^-2 + (3*a^3 + 3*a^2)*5^-1 + (3*a^3 + a^2 + 3*a) + O(5)
sage: z[:] == z[:,:] == z
True
sage: all([z[i,:] == z[i] for i in range(-3,2)])
True
sage: z[:,0]
2*5^2 + O(5^3)
sage: z[:,0].parent()
5-adic Field with capped relative precision 5
sage: z[:,1]
3 + 4*5^2 + O(5^3)
sage: z[:,2]
3*5^-1 + 1 + O(5^3)
sage: z[:,3]
5^-2 + 3*5^-1 + 3 + 4*5 + O(5^3)
sage: sum([a^j * z[:,j] for j in range(4)]) == z
True
sage: z[-1:2,1:3]
3*a^2*5^-1 + (a^2 + 3*a) + O(5^2)
```

The parent of z[i], z[i,T] and z[S,T] (for integer i and slices S,T) would be the unramified extension; the parent of z[i,j] and z[S,j] would be the ground field (or ring).  Negative indices would never be considered as counting backward from a length, even for ring elements.

What do you think?


---

Comment by saraedum created at 2014-06-25 16:58:48

Changing status from needs_info to needs_work.


---

Comment by saraedum created at 2014-06-25 16:58:48

Let's think about this again once #14304 has been merged.


---

Comment by saraedum created at 2016-11-29 07:47:09

Changing status from needs_work to needs_info.


---

Comment by saraedum created at 2016-11-29 07:47:09

I like your proposal. Let's discuss this at one of the IRC sessions.
