# Issue 26512: Cannot plot factorial

Issue created by migration from Trac.

Original creator: pelegm

Original creation time: 2018-11-23 19:42:49

CC:  mmezzarobba slelievre tmonteil vdelecroix

Keywords: plot,factorial,gamma,float

Trying to plot the factorial function:

```python
sage: factorial(x).plot()
```

raises an uninformative error:

```pytb
Traceback (most recent call last):
  File "<ipython-input-157-d07fdfec6413>", line 1, in <module>
    factorial(x).plot()
  File "sage/symbolic/expression.pyx", line 12043, in sage.symbolic.expression.Expression.plot (build/cythonized/sage/symbolic/expression.cpp:68741)
    return plot(f, *args, **kwds)
  File "/sage/local/lib/python2.7/site-packages/sage/misc/decorators.py", line 567, in wrapper
    return func(*args, **options)
  File "/sage/local/lib/python2.7/site-packages/sage/plot/plot.py", line 1957, in plot
    G = _plot(funcs, (xmin, xmax), **kwds)
  File "/sage/local/lib/python2.7/site-packages/sage/plot/plot.py", line 2267, in _plot
    randomize)
  File "/sage/local/lib/python2.7/site-packages/sage/plot/plot.py", line 3867, in generate_plot_points
    data[i] = (float(xi), float(f(xi)))
  File "sage/ext/interpreters/wrapper_py.pyx", line 80, in sage.ext.interpreters.wrapper_py.Wrapper_py.__call__ (build/cythonized/sage/ext/interpreters/wrapper_py.c:2192)
    raise
  File "sage/ext/interpreters/wrapper_py.pyx", line 72, in sage.ext.interpreters.wrapper_py.Wrapper_py.__call__ (build/cythonized/sage/ext/interpreters/wrapper_py.c:2126)
    return interp_py((<PyTupleObject*>args).ob_item
  File "sage/symbolic/function.pyx", line 998, in sage.symbolic.function.BuiltinFunction.__call__ (build/cythonized/sage/symbolic/function.cpp:11923)
    res = super(BuiltinFunction, self).__call__(
  File "sage/symbolic/function.pyx", line 489, in sage.symbolic.function.Function.__call__ (build/cythonized/sage/symbolic/function.cpp:6894)
    res = g_function_eval1(self._serial,
  File "/sage/local/lib/python2.7/site-packages/sage/functions/other.py", line 1430, in _eval_
    return (x + 1).gamma()
AttributeError: 'float' object has no attribute 'gamma'
```


It may be ok that sage will refuse to plot it (well, it is not continuous as is), but then the error message should prboably be informative.


---

Comment by git created at 2018-12-19 06:19:32

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by @durgeshra created at 2018-12-19 07:04:59

Replying to [comment:1 gh-durgeshra]:

Example:

```
sage: factorial(x).plot()
---------------------------------------------------------------------------
ArithmeticError                           Traceback (most recent call last)
<ipython-input-1-d07fdfec6413> in <module>()
----> 1 factorial(x).plot()

/home/durgesh/Downloads/sage-8.4/local/lib/python2.7/site-packages/sage/symbolic/expression.pyx in sage.symbolic.expression.Expression.plot (build/cythonized/sage/symbolic/expression.cpp:63513)()
> 12067             except NotImplementedError:

/home/durgesh/Downloads/sage-8.4/local/lib/python2.7/site-packages/sage/misc/decorators.pyc in wrapper(*args, **kwds)
--> 567             return func(*args, **options)

/home/durgesh/Downloads/sage-8.4/local/lib/python2.7/site-packages/sage/plot/plot.py in plot(funcs, *args, **kwds)
-> 1956             G = _plot(funcs, (xmin, xmax), **kwds)

/home/durgesh/Downloads/sage-8.4/local/lib/python2.7/site-packages/sage/plot/plot.py in _plot(funcs, xrange, parametric, polar, fill, label, randomize, **options)
-> 2266                                     randomize)

/home/durgesh/Downloads/sage-8.4/local/lib/python2.7/site-packages/sage/plot/plot.py in generate_plot_points(f, xrange, plot_points, adaptive_tolerance, adaptive_recursion, randomize, initial_points)
-> 3731         raise ArithmeticError("The function cannot be plotted.")

ArithmeticError: The function cannot be plotted.
```

(raises arithmetic error)


```
sage: (x).plot()
Launched png viewer for Graphics object consisting of 1 graphics primitive
```

(plots correctly)


---

Comment by @durgeshra created at 2018-12-19 07:04:59

Changing status from new to needs_review.


---

Comment by nbruin created at 2018-12-19 07:20:17

Don't mask errors. By putting a whole statement in a bare "try/except" you make it very hard to debug the code, because *any* error that gets raised will now be masked by "ArithmeticError". 

Note that `gamma(x+1).plot()` works just fine, so what `factorial(x).plot()` tries to do could just be fine. If you absolutely think this example needs to perform better then the way that `factorial` tries to evaluate numerical arguments should probably be adjusted.

Here you can see that the original error message is much more informative than what you suggest on this ticket: it actually tells what is going wrong and allows someone to come up with a fix. Carpeting over this very useful error message with a generic, uninformative `function cannot be plotted` is not an improvement at all.


---

Comment by @durgeshra created at 2018-12-19 07:25:18

Replying to [comment:4 nbruin]:
> Don't mask errors. By putting a whole statement in a bare "try/except" you make it very hard to debug the code, because *any* error that gets raised will now be masked by "ArithmeticError". 
> 
> Note that `gamma(x+1).plot()` works just fine, so what `factorial(x).plot()` tries to do could just be fine. If you absolutely think this example needs to perform better then the way that `factorial` tries to evaluate numerical arguments should probably be adjusted.
> 
> Here you can see that the original error message is much more informative than what you suggest on this ticket: it actually tells what is going wrong and allows someone to come up with a fix. Carpeting over this very useful error message with a generic, uninformative `function cannot be plotted` is not an improvement at all.

So what should `factorial(x).plot()` return? Should it make a plot like the gamma function?


---

Comment by slelievre created at 2020-02-20 18:31:41

Changing keywords from "plot,factorial,gamma,float" to "plot, factorial, gamma, float".


---

Comment by slelievre created at 2020-02-20 18:31:41

The `factorial` function used to accept a Python float
as an argument, but no longer does. It might have to do
with the refactoring in #25421. Compare the following.

In Sage 8.2:

```
sage: version()
'SageMath version 8.2, Release Date: 2018-05-05'
sage: factorial(1.2)
1.10180249087971
sage: factorial(1.2r)
1.1018024908797128
```


In Sage 8.3:

```
sage: version()
'SageMath version 8.3, Release Date: 2018-08-03'
sage: factorial(1.2)
1.10180249087971
sage: factorial(1.2r)
Traceback (most recent call last)
...
AttributeError: 'float' object has no attribute 'gamma'
```


The problem manifests itself when plotting because when
plotting a symbolic function Sage feeds it Python floats.


---

Comment by vdelecroix created at 2020-02-20 21:07:36

New commits:


---

Comment by slelievre created at 2020-02-21 00:05:27

I like this try/except solution! Positive review from me if the patchbots are happy.


---

Comment by slelievre created at 2020-02-21 09:01:53

Note: a similar problem for `sqrt` was reported at

- https://groups.google.com/d/topic/cocalc/rblsUHwBXQc/discussion


---

Comment by vdelecroix created at 2020-02-21 09:33:46

Replying to [comment:11 slelievre]:
> Note: a similar problem for `sqrt` was reported at
> 
> - https://groups.google.com/d/topic/cocalc/rblsUHwBXQc/discussion

What do you mean exactly? The following is with 9.1.beta4

```
sage: sqrt(float(1.3))
1.140175425099138
sage: type(sqrt(float(1.3)))
<class 'float'>
```



---

Comment by chapoton created at 2020-02-21 17:06:52

Replying to [comment:12 vdelecroix]:
> Replying to [comment:11 slelievre]:
> > Note: a similar problem for `sqrt` was reported at
> > 
> > - https://groups.google.com/d/topic/cocalc/rblsUHwBXQc/discussion
> 
> What do you mean exactly? The following is with 9.1.beta4
> {{{
> sage: sqrt(float(1.3))
> 1.140175425099138
> sage: type(sqrt(float(1.3)))
> <class 'float'>
> }}}

This was a call to `.sqrt()` that floats do not have.


---

Comment by slelievre created at 2020-02-21 17:23:31

See #29232 for that other problem, sorry for the noise here.


---

Comment by was created at 2020-02-21 17:41:34

This looks good to me.


---

Comment by was created at 2020-02-21 17:41:34

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2020-02-22 18:24:36

On 32-bit

```
**********************************************************************
File "src/sage/functions/other.py", line 1471, in sage.functions.other.Function_factorial._eval_
Failed example:
    factorial(float(3.2))
Expected:
    7.756689535793181
Got:
    7.756689535793178
**********************************************************************
1 item had failures:
   1 of  11 in sage.functions.other.Function_factorial._eval_
    [448 tests, 1 failure, 26.12 s]
----------------------------------------------------------------------
sage -t --long src/sage/functions/other.py  # 1 doctest failed
----------------------------------------------------------------------
```



---

Comment by vbraun created at 2020-02-22 18:24:36

Changing status from positive_review to needs_work.


---

Comment by vdelecroix created at 2020-02-22 20:50:26

Turns out that 32 bits is much more accurate!

```
sage: RealBallField(64)("4.2").gamma()                                                                    
[7.7566895357931776 +/- 5.95e-17]
```



---

Comment by git created at 2020-02-22 21:02:19

Branch pushed to git repo; I updated commit sha1. This was a forced push. New commits:


---

Comment by vdelecroix created at 2020-02-22 21:02:58

Changing status from needs_work to needs_review.


---

Comment by slelievre created at 2020-02-23 14:35:43

Changing status from needs_review to positive_review.


---

Comment by slelievre created at 2020-02-23 14:35:43

Thanks! Positive review.


---

Comment by vbraun created at 2020-02-25 19:51:11

Resolution: fixed
