# Issue 17578: cannot turn off plot warnings with verbose()

Issue created by migration from https://trac.sagemath.org/ticket/17815

Original creator: rws

Original creation time: 2015-02-20 09:16:28

CC:  chapoton tscrim

What use is `sage.misc.misc.verbose("WARNING:...` in `plot.py` when no possible verbosity level will turn off the output?

```
sage: verbose(level=-1)
verbose -1 (<module>) 
5.786
sage: plot(sqrt(x),(x,-1,3))
verbose 0 (2691: plot.py, generate_plot_points) WARNING: When plotting, failed to evaluate function at 51 points.
verbose 0 (2691: plot.py, generate_plot_points) Last error message: 'math domain error'
```



---

Comment by rws created at 2015-03-22 14:14:09

Wrong command! It should be `set_verbose(-1)`.


---

Comment by rws created at 2015-03-22 14:14:27

Changing status from new to needs_review.


---

Comment by rws created at 2015-03-22 14:14:41

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2015-03-22 22:57:02

Changing status from positive_review to needs_work.


---

Comment by vbraun created at 2015-03-22 22:57:02

I suggest to repurpose the ticket, see new description. The old description follows:

What use is `sage.misc.misc.verbose("WARNING:...` in `plot.py` when no possible verbosity level will turn off the output?

```
sage: verbose(level=-1)
verbose -1 (<module>) 
5.786
sage: plot(sqrt(x),(x,-1,3))
verbose 0 (2691: plot.py, generate_plot_points) WARNING: When plotting, failed to evaluate function at 51 points.
verbose 0 (2691: plot.py, generate_plot_points) Last error message: 'math domain error'
```



---

Comment by dkrenn created at 2016-08-30 11:59:53

See also #21349.
