# Issue 12068: Multivariate powerseries with symbolic coefficients issues

archive/issues_012068.json:
```json
{
    "body": "Assignee: @malb\n\nCC:  @nilesjohnson\n\nKeywords: multivariate power series\n\nMultivariate powerseries over SR seem to work, but coercion does not. For example, the coercion from ZZ to QQ works fine:\n\n```\nsage: T.<a,b> = PowerSeriesRing(ZZ,2)\nsage: f = 1 + a + b + a*b + T.O(5)\nsage: 1/2 * f\n1/2 + 1/2*a + 1/2*b + 1/2*a*b + O(a, b)^5\n```\n\nbut the same thing fails with SR:\n\n```\nsage: exp(2) * f\n---------------------------------------------------------------------------\nTypeError                                 Traceback (most recent call last)\n\n/home/vbraun/opt/sage-4.8.alpha4/devel/sage-main/sage/schemes/generic/<ipython console> in <module>()\n\n/home/vbraun/opt/sage-4.8.alpha4/local/lib/python2.6/site-packages/sage/structure/element.so in sage.structure.element.RingElement.__mul__ (sage/structure/element.c:12158)()\n\n/home/vbraun/opt/sage-4.8.alpha4/local/lib/python2.6/site-packages/sage/structure/coerce.so in sage.structure.coerce.CoercionModel_cache_maps.bin_op (sage/structure/coerce.c:7467)()\n\nTypeError: unsupported operand parent(s) for '*': 'Symbolic Ring' and 'Multivariate Power Series Ring in a, b over Integer Ring'\n```\n\nAlso, manually changing the base ring brings out the background polynomial variable:\n\n```\nsage: f.change_ring(SR)\n(Tbg*a*b + a + b)*Tbg + 1 + O(a, b)^5\n```\n\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/12240\n\n",
    "created_at": "2011-12-31T12:56:58Z",
    "labels": [
        "component: commutative algebra",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-6.4",
    "title": "Multivariate powerseries with symbolic coefficients issues",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/12068",
    "user": "https://github.com/vbraun"
}
```
Assignee: @malb

CC:  @nilesjohnson

Keywords: multivariate power series

Multivariate powerseries over SR seem to work, but coercion does not. For example, the coercion from ZZ to QQ works fine:

```
sage: T.<a,b> = PowerSeriesRing(ZZ,2)
sage: f = 1 + a + b + a*b + T.O(5)
sage: 1/2 * f
1/2 + 1/2*a + 1/2*b + 1/2*a*b + O(a, b)^5
```

but the same thing fails with SR:

```
sage: exp(2) * f
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)

/home/vbraun/opt/sage-4.8.alpha4/devel/sage-main/sage/schemes/generic/<ipython console> in <module>()

/home/vbraun/opt/sage-4.8.alpha4/local/lib/python2.6/site-packages/sage/structure/element.so in sage.structure.element.RingElement.__mul__ (sage/structure/element.c:12158)()

/home/vbraun/opt/sage-4.8.alpha4/local/lib/python2.6/site-packages/sage/structure/coerce.so in sage.structure.coerce.CoercionModel_cache_maps.bin_op (sage/structure/coerce.c:7467)()

TypeError: unsupported operand parent(s) for '*': 'Symbolic Ring' and 'Multivariate Power Series Ring in a, b over Integer Ring'
```

Also, manually changing the base ring brings out the background polynomial variable:

```
sage: f.change_ring(SR)
(Tbg*a*b + a + b)*Tbg + 1 + O(a, b)^5
```



Issue created by migration from https://trac.sagemath.org/ticket/12240


