# Issue 30465: givaro + libsingular leads to segfault

Issue created by migration from https://trac.sagemath.org/ticket/30702

Original creator: tmonteil

Original creation time: 2020-10-03 14:42:33

CC:  cpernet roed slelievre

When a finite field uses `givaro` as a backend, it is possible to deal with polynomial rings in a single variable, but dealing with multivariate polynomial ring (`libsingular`) leads to segfaults.

Here is an example:


```
sage: F = GF(3, impl='givaro')
sage: F
Finite Field of size 3
sage: type(F)                                                                                                                                                                                                
<class 'sage.rings.finite_rings.finite_field_givaro.FiniteField_givaro_with_category'>


sage: R.<a0> = PolynomialRing(F)
sage: type(R)
<class 'sage.rings.polynomial.polynomial_ring.PolynomialRing_dense_finite_field_with_category'>                                                                                                                                                                           
sage: F(R(2))
2

sage: R.<a0,a1> = PolynomialRing(F)
sage: type(R)
<class 'sage.rings.polynomial.multi_polynomial_libsingular.MPolynomialRing_libsingular'>
sage: F(R(2))
....
Segmentation fault
```


Not sure who to blame though.

This example was reported on [this ask question](https://ask.sagemath.org/question/53696/crash-with-polynomial-over-givaro-finite-field/)


---

Comment by slelievre created at 2021-03-25 01:16:00

Changing component from number theory to finite rings.


---

Comment by mkoeppe created at 2021-05-10 17:42:09

Moving to 9.4, as 9.3 has been released.
