# Issue 27127: cannot multiply multivariate polynomial ring and vector

Issue created by migration from https://trac.sagemath.org/ticket/27364

Original creator: dkrenn

Original creation time: 2019-02-26 14:14:17

CC:  tscrim yzh @kliem


```
sage: R = PolynomialRing(QQ, 't', 1); t = R.gen()
sage: (t/2) * vector([1,2])
```

results in a

```
TypeError: unsupported operand parent(s) for *: 'Multivariate Polynomial Ring in t over Rational Field' and 'Ambient free module of rank 2 over the principal ideal domain Integer Ring'
```


Interestingly, for a "true" univariate polynomial ring it works:

```
sage: (t/2) * vector([1,2])
(1/2*t, t)
```



---

Comment by dkrenn created at 2019-02-28 12:39:18

Changing status from new to needs_info.


---

Comment by dkrenn created at 2019-02-28 12:39:18

Current fix indeed fixes the problem but introduces new problems:

```
sage: R = PolynomialRing(ZZ, 'x', 500)
sage: S = PolynomialRing(GF(5), 'x', 200)
sage: R.gen(0) + S.gen(0)
```

The last line takes a second or so without patch, but ages (I've
interrupted after two minutes) with the change above. RunSnakeRun says
that most of the time is spent in

```
method '_coerce_' of 'sage.structure.parent_old.Parent'
```

This is also not what we'd like. So what should we do now?
----
New commits:


---

Comment by embray created at 2019-03-25 10:56:15

Ticket retargeted after milestone closed (if you don't believe this ticket is appropriate for the Sage 8.8 release please retarget manually)


---

Comment by git created at 2019-03-28 13:57:30

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by dkrenn created at 2019-03-28 13:58:14

Changing status from needs_info to needs_review.


---

Comment by dkrenn created at 2019-03-28 13:59:49

Replying to [comment:5 dkrenn]:
> RunSnakeRun says
> that most of the time is spent in
> {{{
> method '_coerce_' of 'sage.structure.parent_old.Parent'
> }}}
> This is also not what we'd like. So what should we do now?

The current branch patches `__call__` so that `_coerce_` is not called that often. #25558 might change everything, but this seems somehow more out of reach.


---

Comment by vdelecroix created at 2019-04-18 20:23:53


```
+            #from sage.structure.element import parent
+            #print(self, '__call__')
+            #print('    ', x, parent(x))
```



---

Comment by vdelecroix created at 2019-04-18 20:24:54

As far as I understand, zero and one are already cached from `sage/rings/rings.py`

```
sage: R = QQ['x','y']
sage: R.zero() is R.zero()
True
sage: R.one() is R.one()
True
```



---

Comment by vdelecroix created at 2019-04-18 20:25:14

Changing status from needs_review to needs_work.


---

Comment by embray created at 2019-06-14 14:50:27

Tickets still needing working or clarification should be moved to the next release milestone at the soonest (please feel free to revert if you think the ticket is close to being resolved).


---

Comment by embray created at 2019-12-30 14:48:17

Ticket retargeted after milestone closed


---

Comment by mkoeppe created at 2020-04-14 19:41:51

Batch modifying tickets that will likely not be ready for 9.1, based on a review of the ticket title, branch/review status, and last modification date.


---

Comment by mkoeppe created at 2021-02-13 20:51:01

Setting new milestone based on a cursory review of ticket status, priority, and last modification date.


---

Comment by mkoeppe created at 2021-04-13 17:25:30

Clean merge with current develop
----
New commits:


---

Comment by git created at 2021-04-13 17:29:22

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by mkoeppe created at 2021-04-13 18:01:21

Changing status from needs_work to needs_review.


---

Comment by mkoeppe created at 2021-04-13 18:01:21

Replying to [comment:11 vdelecroix]:
> As far as I understand, zero and one are already cached from `sage/rings/rings.py`
> {{{
> sage: R = QQ['x','y']
> sage: R.zero() is R.zero()
> True
> sage: R.one() is R.one()
> True
> }}}

Nevertheless, this code for caching 0 and 1 does make things a bit faster.
On my machine, `%time R.gen(0) + S.gen(0)` gives 9.6 s, but taking out the caching it's 12.6 s.


---

Comment by vdelecroix created at 2021-04-15 07:41:57

Changing status from needs_review to needs_work.


---

Comment by vdelecroix created at 2021-04-15 07:41:57

There are several doctest failures. Among them we see that the pushout **wrongly** changes some `Univariate` to `Multivariate`.

```
File "src/sage/categories/pushout.py", line 3772, in sage.categories.pushout.pushout
Failed example:
    pushout(ZZ['x,y,z'], Frac(ZZ['x'])['y'])
Expected:
    Multivariate Polynomial Ring in y, z over Fraction Field of Univariate Polynomial Ring in x over Integer Ring
Got:
    Multivariate Polynomial Ring in y, z over Fraction Field of Multivariate Polynomial Ring in x over Integer Ring
```

Above the action of `ZZ[x,y,z]` on `ZZ(x)[y]` is `ZZ(x)[y,z]` in both situations. However, I think that the `ZZ(x)` **must not** change. It would be good to test this pushout with `ZZ(x)` in different forms
- univariate `PolynomialRing(ZZ, 'x')`
- univariate NTL `PolynomialRing(ZZ, 'x', implementation='NTL')`
- multivariate `PolynomialRing(ZZ, ['x'], 1))`.

In this second example it is unclear what is best.

```
File "src/sage/categories/pushout.py", line 3778, in sage.categories.pushout.pushout
Failed example:
    pushout(QQ['x,y'], ZZ[['x']])
Expected:
    Univariate Polynomial Ring in y over Power Series Ring in x over Rational Field
Got:
    Multivariate Polynomial Ring in y over Power Series Ring in x over Rational Field
```

The action of `QQ[x,y]` on `ZZ[This is the Trac macro *x* that was inherited from the migration](https://trac.sagemath.org/wiki/WikiMacros#x-macro)` does correctly produce `QQ[y][This is the Trac macro *x* that was inherited from the migration](https://trac.sagemath.org/wiki/WikiMacros#x-macro)` in both situations. Since `QQ[x,y] -> QQ[y]` drops a variable it is unclear to me if there is a best answer.


---

Comment by vdelecroix created at 2021-04-15 07:50:06

Related: it is desirable that the string representation of multivariate polynomial rings make visible the implementation. Currently we have

```
sage: PolynomialRing(ZZ, ['x', 'y'], 2, implementation='generic')
Multivariate Polynomial Ring in x, y over Integer Ring
sage: PolynomialRing(ZZ, ['x', 'y'], 2, implementation='singular')
Multivariate Polynomial Ring in x, y over Integer Ring
```

But it would be better as

```
sage: PolynomialRing(ZZ, ['x', 'y'], 2, implementation='generic')
Multivariate Polynomial Ring in x, y over Integer Ring (using generic implementation)
sage: PolynomialRing(ZZ, ['x', 'y'], 2, implementation='singular')
Multivariate Polynomial Ring in x, y over Integer Ring
```

Ideally (as for univariate polynomials and matrices) the default implementation would show nothing.


---

Comment by vdelecroix created at 2021-04-15 07:51:53

The construction functor should take into account the implementation. Please fix and add the doctest

```
sage: TT = PolynomialRing(QQ, 't', 2, implementation='generic')
sage: F, R = TT.construction()
sage: F(R) is TT  # bug: returns False
True
```



---

Comment by vdelecroix created at 2021-04-15 07:55:30

The construction is similarly broken on univariate polynomials

```
sage: T = PolynomialRing(ZZ, 'x')
sage: F, R = T.construction()
sage: F(R) is T
True
sage: T = PolynomialRing(ZZ, 'x', implementation='NTL')
sage: F, R = T.construction()
sage: F(R) is T  # bug: returns False
True
```



---

Comment by mkoeppe created at 2021-04-15 15:30:10

#31668 is adding lots of these tests via the `_test_construction` method.


---

Comment by vdelecroix created at 2021-04-15 15:32:25

Replying to [comment:29 mkoeppe]:
> #31668 is adding lots of these tests via the `_test_construction` method.

nice!


---

Comment by mkoeppe created at 2021-07-19 00:44:56

Setting a new milestone for this ticket based on a cursory review.
