# Issue 27018: conversion in multivariate polynomial ring fails

Issue created by migration from https://trac.sagemath.org/ticket/27255

Original creator: dkrenn

Original creation time: 2019-02-11 17:00:45

Trying to "group" the coefficients like

```
sage: P.<a, b, n> = QQ[]
sage: N = PolynomialRing(QQ, 'n')
sage: AB = PolynomialRing(N, 'a, b')
sage: AB(a*n + a*n^2)
```

fails with 

```
TypeError: not a constant polynomial
```

but the result should be

```
(n + n^2)*a
```


As an interesting side note, the Laurent polynomial ring can do it:

```
sage: L = LaurentPolynomialRing(QQ, 'a, b, n')
sage: LN = LaurentPolynomialRing(QQ, 'n')
sage: LAB = LaurentPolynomialRing(LN, 'a, b')
sage: LAB(L(a*n + a*n^2))
(n + n^2)*a
```


The Laurent polynomial ring can do this since #21855. And #22333 is about reusing this code, so there is a good chance that #22333 fixes this as well.


---

Comment by dkrenn created at 2019-02-11 17:00:54

Changing type from PLEASE CHANGE to defect.


---

Comment by jdemeyer created at 2019-02-11 22:06:45

This might be fixed by #25558 (which is work in progress).


---

Comment by embray created at 2019-03-25 10:56:15

Ticket retargeted after milestone closed (if you don't believe this ticket is appropriate for the Sage 8.8 release please retarget manually)


---

Comment by embray created at 2019-06-14 14:54:19

As the Sage-8.8 release milestone is pending, we should delete the sage-8.8 milestone for tickets that are not actively being worked on or that still require significant work to move forward.  If you feel that this ticket should be included in the next Sage release at the soonest please set its milestone to the next release milestone (sage-8.9).
