# Issue 24097: sympy symbol -> SR drops assumptions

archive/issues_024097.json:
```json
{
    "body": "CC:  rws\n\nIt is possible to add assumptions on sympy symbols:\n\n```\nsage: from sympy import Symbol\nsage: n = Symbol(\"n\", integer=True)\n```\n\n\nHowever, these are lost when converting to `SR`:\n\n```\ndef _sympysage_symbol(self):\n    \"\"\"\n    EXAMPLES::\n\n        sage: from sympy import Symbol\n        sage: assert x._sympy_() == Symbol('x')\n        sage: assert x == Symbol('x')._sage_()\n    \"\"\"\n    from sage.symbolic.ring import SR\n    return SR.var(self.name)\n```\n\n\nThis is the indirect cause for the different results below (based on a doctest in `src/sage/tests/french_book/recequadiff.py`):\n\n```\nsage: n = Symbol(\"n\", integer=True)\nsage: from sympy import Symbol, rsolve_hyper\nsage: rsolve_hyper([-2,1], 2^(n+2), n)\n2**n*C0 + 2**(n + 2)*(C0 + n/2)\nsage: rsolve_hyper([-2,1], 2^(2+n), n)\n2**n*C0 - 2**(n + 2)\n```\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/24334\n\n",
    "created_at": "2017-12-07T09:58:34Z",
    "labels": [
        "symbolics",
        "major",
        "bug"
    ],
    "title": "sympy symbol -> SR drops assumptions",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/24097",
    "user": "jdemeyer"
}
```
CC:  rws

It is possible to add assumptions on sympy symbols:

```
sage: from sympy import Symbol
sage: n = Symbol("n", integer=True)
```


However, these are lost when converting to `SR`:

```
def _sympysage_symbol(self):
    """
    EXAMPLES::

        sage: from sympy import Symbol
        sage: assert x._sympy_() == Symbol('x')
        sage: assert x == Symbol('x')._sage_()
    """
    from sage.symbolic.ring import SR
    return SR.var(self.name)
```


This is the indirect cause for the different results below (based on a doctest in `src/sage/tests/french_book/recequadiff.py`):

```
sage: n = Symbol("n", integer=True)
sage: from sympy import Symbol, rsolve_hyper
sage: rsolve_hyper([-2,1], 2^(n+2), n)
2**n*C0 + 2**(n + 2)*(C0 + n/2)
sage: rsolve_hyper([-2,1], 2^(2+n), n)
2**n*C0 - 2**(n + 2)
```


Issue created by migration from https://trac.sagemath.org/ticket/24334


