# Issue 23394: conversion of multivariate polynomial (over a number field) back to its base ring fails

Issue created by migration from https://trac.sagemath.org/ticket/23631

Original creator: dkrenn

Original creation time: 2017-08-17 13:14:45

CC:  tscrim


```
sage: K.<s, t> = QQ.extension([x^2-2, x^2-3])
sage: R.<y, z> = K[]
sage: D.<d, e> = R[]
sage: R(D(y))
```

fails with `TypeError: not a constant polynomial`


```
sage: K.<s, t> = QQ.extension([x^2-2, x^2-3])
sage: R = PolynomialRing(K, 'xG_0, xG_1, xH_0')
sage: D.<d, e> = R[]
sage: R(D(R.0))
```

fails with `TypeError: unable to convert 'xG_0' to a rational`


---

Comment by dkrenn created at 2017-08-17 13:15:46

Maybe the same / a similar issue as #23629, but from the outside behavior it looks different; thus a new ticket.
