# Issue 12981: Power series ideals don't implement reduce

Issue created by migration from Trac.

Original creator: roed

Original creation time: 2012-06-22 19:05:42

Assignee: malb


```
sage: Q.<q> = QQ[[]]
sage: F = Q.fraction_field()
sage: S.<s> = F[[]]
sage: I = S.ideal(s^2 - q)
sage: I.reduce(s^2)
s^2
sage: I.reduce(q)
q
sage: T.<sb> = S.quotient(I)
sage: T(q) == T(s)^2
False
```


The current implemention of reduce in #12053 might need to be modified to work better in the power series case.
