# Issue 23143: graphics documentation obscure

Issue created by migration from Trac.

Original creator: vdelecroix

Original creation time: 2017-07-06 12:06:55

CC:  mforets

The one line description of `text` refers to arguments `(x,y)` that do not appear in the signature

```
sage: text?
Signature:      text(*args, **kwds)
Docstring:     
   Returns a 2D text graphics object at the point (x,y).

   Type "text.options" for a dictionary of options for 2D text.
...
```

Idem for ``point2d`` (that even refers to ``size``)

```
Signature:      point2d(*args, **kwds)
Docstring:     
   A point of size "size" defined by point = (x,y).
...
```

The first examples of line2d are completely useless

```
Signature:      line2d(*args, **kwds)
Docstring:     
   Create the line through the given list of points.
...
EXAMPLES:

   A line with no points or one point:

      sage: line([])      #returns an empty plot
      Graphics object consisting of 0 graphics primitives
      sage: import numpy; line(numpy.array([]))
      Graphics object consisting of 0 graphics primitives
      sage: line([(1,1)])
      Graphics object consisting of 1 graphics primitive
```

