# Issue 15118: representation of CIF-element plus SR-element

Issue created by migration from Trac.

Original creator: dkrenn

Original creation time: 2013-11-05 12:34:38

Keywords: SR, CIF, representation

We have

```
sage: x+CIF(RIF(-2,2), 0)
x
```

and

```
sage: x + CIF(RIF(-2,2),RIF(-2,2))
x
```

which are wrong representation strings. Anyhow, the result themselves are correct since, for example, we have

```
sage: z = (x+CIF(RIF(-2,2),RIF(-2,2)))
sage: z - x
0.?e1 + 0.?e1*I
```


In contrast, the following things work:

```
sage: x+RIF(-2,2)
x + 0.?e1
sage: x+CIF(RIF(3.14,3.15), RIF(3.14, 3.15))
x + 3.15? + 3.15?*I
sage: CIF(RIF(-2,2),RIF(-2,2))
0.?e1 + 0.?e1*I
sage: x+CIF(RIF(3.14,3.15), 0)
x + 3.15?
```



---

Comment by dkrenn created at 2015-04-16 20:47:39

Changing keywords from "SR, CIF, representation" to "SR, CIF, representation, sd67".


---

Comment by dkrenn created at 2015-04-16 20:47:39

Changing status from new to needs_review.


---

Comment by dkrenn created at 2015-04-16 20:47:39

Seems to be fixed (tested in 6.6). Added doctest.
----
New commits:


---

Comment by dkrenn created at 2015-04-16 21:17:23

Changing keywords from "SR, CIF, representation, sd67" to "SR, CIF, representation, sd67, beginner".


---

Comment by rws created at 2015-05-09 08:13:22

Changing status from needs_review to positive_review.


---

Comment by rws created at 2015-05-09 08:13:22

Is fine, thanks.


---

Comment by vbraun created at 2015-05-09 23:03:17

Resolution: fixed
