# Issue 11449: Preparser could accomodate multiline input and continuation lines

Issue created by migration from https://trac.sagemath.org/ticket/11621

Original creator: rbeezer

Original creation time: 2011-07-24 18:44:26

Assignee: was

CC:  leif

It would be an improvement to have the preparser recognize when an input line follows Python conventions for multiline input via Python's rules for continuation lines and mechanisms for indicating continuation lines in doctests, etc (namely "..." and perhaps soon "....:").  If you paste the following into a command-line session:


```
T(r, t) = [r^2,
...        t^2]
```


the result is:


```
sage: T(r, t) = [r^2,
------------------------------------------------------------
   File "<ipython console>", line 1
     __tmp__=var("r,t"); T = symbolic_expression([r**Integer(2),).function(r,t)
                                                                ^
SyntaxError: invalid syntax

sage: ...        t^2]
------------------------------------------------------------
   File "<ipython console>", line 1
     ...        t**Integer(2)]
     ^
SyntaxError: invalid syntax
```


Some discussion at

http://groups.google.com/group/sage-devel/browse_thread/thread/81a3cce1ebfefd0e

See related #10458.


---

Comment by jason created at 2011-08-02 17:32:48

Notice also this inconsistency dealing with multiline statements starting with comments, caused by an early-abort statement in the preparser:


```
sage: preparse("""x^2\n# test\nx^2""")
'x**Integer(2)\n# test\nx**Integer(2)'
sage: preparse("""# test\nx^2""")
'# test\nx^2'
```


Note that if the string starts with a comment, everything is ignored  after the comment.  However, if the statement does not start with a comment, things are preparsed even after the comment.


---

Comment by slelievre created at 2021-03-22 11:57:46

Replying to [comment:2 jason]:
>  Notice also this inconsistency dealing with multiline statements starting with comments, caused by an early-abort statement in the preparser:
> 
> {{{
> sage: preparse("""x^2\n# test\nx^2""")
> 'x**Integer(2)\n# test\nx**Integer(2)'
> sage: preparse("""# test\nx^2""")
> '# test\nx^2'
> }}}
> 
> Note that if the string starts with a comment, everything is ignored  after the comment.  However, if the statement does not start with a comment, things are preparsed even after the comment.

That particular aspect is fixed by #31043.

Sage still chokes on pasted or typed input such as

```
T(r, t) = [r^2,
           t^2]
```

or

```
sage: T(r, t) = [r^2,
....:            t^2]
```

or

```
sage: sage: T(r, t) = [r^2,
....: ....:            t^2]
```

while it correctly handles:

```
sage: sage: sage: sage: 1 + 1
```

