# Issue 27364: Customizing simplifications in symbolic calculus on manifolds

archive/issues_027364.json:
```json
{
    "body": "CC:  tscrim\n\nKeywords: simplification, symbolic, manifolds\n\nCurrently the end user has no direct control of the simplification algorithm used in coordinate calculus on manifolds. For instance, if the manifold is real and the coordinate calculus method is Sage's default symbolic engine (SR), the simplifying function is\n[simplify_chain_real](http://doc.sagemath.org/html/en/reference/manifolds/sage/manifolds/utilities.html#sage.manifolds.utilities.simplify_chain_real). This function is quite exhaustive (similar to `simplify_full()`) but since it is invoked at each elementary step of a calculation, the computation can be quite slow. In some cases, it would be desirable to use a lighter simplifying function. See for instance [this ask.sagemath question](https://ask.sagemath.org/question/45959/grad-at-glacial-speed/).\n\nThis ticket proposes some interface for passing any user-defined simplifying function. As an example, let us perform the addition of two scalar fields on a 2-dimensional real smooth manifold:\n\n```\nsage: M = Manifold(2, 'M')\nsage: X.<x,y> = M.chart()\nsage: f = M.scalar_field(cos(x)^2)\nsage: g = M.scalar_field(sin(x)^2)\nsage: s = f + g\n```\n\nThanks to the use of `simplify_chain_real` in the `_add_` operator, the result is automatically simplified:\n\n```\nsage: s.display()\nM --> R\n(x, y) |--> 1\n```\n\nWith the code indroduce in this ticket, one can replace `simplify_chain_real` by any function, for instance Sage's `simplify`:\n\n```\nsage: M.set_simplify_function(simplify)\nsage: s = f + g\nsage: s.display()\nM --> R\n(x, y) |--> cos(x)^2 + sin(x)^2\n```\n\nAs we can see, the capabilities of `simplify` are quite limited! Let us replace it by a user-defined function:\n\n```\nsage: def simpl(expr):\n....:     return expr.simplify_trig()\n....: \nsage: M.set_simplify_function(simpl)\nsage: s = f + g\nsage: s.display()\nM --> R\n(x, y) |--> 1\n```\n\n\nFor more flexibility, it is possible to provide a different simplifying function for each chart on the manifold, via\n\n```\nsage: X.calculcus_method().set_simplify_function(simpl)\n```\n\n\nBesides, this ticket improves the documentation and functionalities of the class\n[CalculusMethod](http://doc.sagemath.org/html/en/reference/manifolds/sage/manifolds/calculus_method.html), which governs the various symbolic backends available on manifolds (SR and SymPy at the moment).\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/27601\n\n",
    "created_at": "2019-04-03T21:19:01Z",
    "labels": [
        "geometry",
        "major",
        "enhancement"
    ],
    "title": "Customizing simplifications in symbolic calculus on manifolds",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/27364",
    "user": "egourgoulhon"
}
```
CC:  tscrim

Keywords: simplification, symbolic, manifolds

Currently the end user has no direct control of the simplification algorithm used in coordinate calculus on manifolds. For instance, if the manifold is real and the coordinate calculus method is Sage's default symbolic engine (SR), the simplifying function is
[simplify_chain_real](http://doc.sagemath.org/html/en/reference/manifolds/sage/manifolds/utilities.html#sage.manifolds.utilities.simplify_chain_real). This function is quite exhaustive (similar to `simplify_full()`) but since it is invoked at each elementary step of a calculation, the computation can be quite slow. In some cases, it would be desirable to use a lighter simplifying function. See for instance [this ask.sagemath question](https://ask.sagemath.org/question/45959/grad-at-glacial-speed/).

This ticket proposes some interface for passing any user-defined simplifying function. As an example, let us perform the addition of two scalar fields on a 2-dimensional real smooth manifold:

```
sage: M = Manifold(2, 'M')
sage: X.<x,y> = M.chart()
sage: f = M.scalar_field(cos(x)^2)
sage: g = M.scalar_field(sin(x)^2)
sage: s = f + g
```

Thanks to the use of `simplify_chain_real` in the `_add_` operator, the result is automatically simplified:

```
sage: s.display()
M --> R
(x, y) |--> 1
```

With the code indroduce in this ticket, one can replace `simplify_chain_real` by any function, for instance Sage's `simplify`:

```
sage: M.set_simplify_function(simplify)
sage: s = f + g
sage: s.display()
M --> R
(x, y) |--> cos(x)^2 + sin(x)^2
```

As we can see, the capabilities of `simplify` are quite limited! Let us replace it by a user-defined function:

```
sage: def simpl(expr):
....:     return expr.simplify_trig()
....: 
sage: M.set_simplify_function(simpl)
sage: s = f + g
sage: s.display()
M --> R
(x, y) |--> 1
```


For more flexibility, it is possible to provide a different simplifying function for each chart on the manifold, via

```
sage: X.calculcus_method().set_simplify_function(simpl)
```


Besides, this ticket improves the documentation and functionalities of the class
[CalculusMethod](http://doc.sagemath.org/html/en/reference/manifolds/sage/manifolds/calculus_method.html), which governs the various symbolic backends available on manifolds (SR and SymPy at the moment).


Issue created by migration from https://trac.sagemath.org/ticket/27601





---

archive/issue_comments_385815.json:
```json
{
    "body": "New commits:",
    "created_at": "2019-04-03T21:20:12Z",
    "issue": "https://github.com/sagemath/sagetest/issues/27364",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/27364#issuecomment-385815",
    "user": "egourgoulhon"
}
```

New commits:



---

archive/issue_comments_385816.json:
```json
{
    "body": "Changing status from new to needs_review.",
    "created_at": "2019-04-03T21:23:04Z",
    "issue": "https://github.com/sagemath/sagetest/issues/27364",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/27364#issuecomment-385816",
    "user": "egourgoulhon"
}
```

Changing status from new to needs_review.



---

archive/issue_comments_385817.json:
```json
{
    "body": "LGTM.",
    "created_at": "2019-04-04T02:07:39Z",
    "issue": "https://github.com/sagemath/sagetest/issues/27364",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/27364#issuecomment-385817",
    "user": "tscrim"
}
```

LGTM.



---

archive/issue_comments_385818.json:
```json
{
    "body": "Changing status from needs_review to positive_review.",
    "created_at": "2019-04-04T02:07:39Z",
    "issue": "https://github.com/sagemath/sagetest/issues/27364",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/27364#issuecomment-385818",
    "user": "tscrim"
}
```

Changing status from needs_review to positive_review.



---

archive/issue_comments_385819.json:
```json
{
    "body": "Thank you for the review!",
    "created_at": "2019-04-04T08:34:17Z",
    "issue": "https://github.com/sagemath/sagetest/issues/27364",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/27364#issuecomment-385819",
    "user": "egourgoulhon"
}
```

Thank you for the review!



---

archive/issue_comments_385820.json:
```json
{
    "body": "Resolution: fixed",
    "created_at": "2019-04-05T20:51:33Z",
    "issue": "https://github.com/sagemath/sagetest/issues/27364",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/27364#issuecomment-385820",
    "user": "vbraun"
}
```

Resolution: fixed
