# Issue 11701: Cannot compute p-adic absolute value of zero

Issue created by migration from Trac.

Original creator: jdemeyer

Original creation time: 2011-09-29 17:03:38

Assignee: roed


```
sage: Qp(7)(0).abs()
---------------------------------------------------------------------------
NotImplementedError                       Traceback (most recent call last)

/usr/local/src/sage-4.7.2.alpha2/<ipython console> in <module>()

/usr/local/src/sage-4.7.2.alpha2/local/lib/python2.6/site-packages/sage/rings/padics/padic_base_generic_element.so in sage.rings.padics.padic_base_generic_element.pAdicBaseGenericElement.abs (sage/rings/padics/padic_base_generic_element.c:2727)()

/usr/local/src/sage-4.7.2.alpha2/local/lib/python2.6/site-packages/sage/rings/padics/padic_base_generic_element.so in sage.rings.padics.padic_base_generic_element.pAdicBaseGenericElement.abs (sage/rings/padics/padic_base_generic_element.c:2580)()

/usr/local/src/sage-4.7.2.alpha2/local/lib/python2.6/site-packages/sage/rings/integer.so in sage.rings.integer.Integer.__pow__ (sage/rings/integer.c:12552)()

/usr/local/src/sage-4.7.2.alpha2/local/lib/python2.6/site-packages/sage/structure/element.so in sage.structure.element.RingElement.__pow__ (sage/structure/element.c:12576)()

/usr/local/src/sage-4.7.2.alpha2/local/lib/python2.6/site-packages/sage/structure/element.so in sage.structure.element.generic_power_c (sage/structure/element.c:22607)()

NotImplementedError: non-integral exponents not supported
```



---

Comment by jdemeyer created at 2011-09-29 19:37:42

Changing priority from major to minor.


---

Comment by jdemeyer created at 2011-09-29 19:37:42

Changing status from new to needs_review.


---

Comment by mstreng created at 2011-09-30 19:10:02


```
sage: L.<a> = Qp(5).ext(x^2-5)
sage: L(5).abs()
0.200000000000000
sage: L(5).abs(prec=100)
0.20000000000000000000000000000
sage: L(5).abs(prec=0)
1/25
sage: L(5).abs(prec=False)
1/25
```

(yes, I deliberately tried to break it because I didn't understand the code at first)

Also: (why) is the code for pAdicExtElement a copy of the code for pAdicGenericElement? Why not remove the abs function for extension elements and move its examples to the generic one?


---

Comment by jdemeyer created at 2011-10-04 12:10:15

Replying to [comment:2 mstreng]:
> {{{
> sage: L.<a> = Qp(5).ext(x^2-5)
> sage: L(5).abs()
> 0.200000000000000
> sage: L(5).abs(prec=100)
> 0.20000000000000000000000000000
> sage: L(5).abs(prec=0)
> 1/25
> sage: L(5).abs(prec=False)
> 1/25
> }}}
> (yes, I deliberately tried to break it because I didn't understand the code at first)
I changed `if prec is None` to `if not prec`.  Do you prefer this?

> Also: (why) is the code for pAdicExtElement a copy of the code for pAdicGenericElement? Why not remove the abs function for extension elements and move its examples to the generic one?
Done, moved all code to `padic_generic_element.pyx`


---

Attachment


---

Comment by mstreng created at 2011-10-05 15:43:26

Changing status from needs_review to positive_review.


---

Comment by jdemeyer created at 2011-10-06 11:40:44

Resolution: fixed
