# Issue 16955: Update Laguerre poly to add errors

Issue created by migration from https://trac.sagemath.org/ticket/17192

Original creator: kcrisman

Original creation time: 2014-10-22 00:22:44

Keywords: beginner

These accept bad input without warning - the docs are right, apparently, but [don't protect against user error very well](http://ask.sagemath.org/question/24563/a-bug-in-laguerre-l/).
  As in that report, 
> laguerre(-1,1) returns 0 in Sage but returns exp(1) in Maple and Mathematica.


---

Comment by kcrisman created at 2014-10-22 00:23:18

Probably other things in sage/functions/orthogonal_polys.py could use similar upgrades.


---

Comment by captaintrunky created at 2014-10-28 18:51:24

Changing status from new to needs_review.


---

Comment by captaintrunky created at 2014-10-28 18:51:24

New commits:


---

Comment by rws created at 2014-11-07 16:40:25

You disallow Legendre `P(n,m,x)` with negative `n`, but this is too restrictive, see

```
sage: pari.pollegendre(-3,x)
3/2*x^2 - 1/2
```

the implementation in ticket #17151, and http://dlmf.nist.gov/14.9#E3


---

Comment by rws created at 2014-11-07 16:47:24

Replying to [comment:4 rws]:
> the implementation in ticket #17151
oops, make that #16813.


---

Comment by captaintrunky created at 2014-11-08 14:55:27

Replying to [comment:4 rws]:
> You disallow Legendre `P(n,m,x)` with negative `n`, but this is too restrictive, see
> {{{
> sage: pari.pollegendre(-3,x)
> 3/2*x^2 - 1/2
> }}}
> the implementation in ticket #17151, and http://dlmf.nist.gov/14.9#E3

Does it mean that docs are inconsistent for these functions: legendre_P, legendre_Q, gen_legendre_P, gen_Legendre_Q? All of them have the  constraint:


```
Returns the generalized (or associated) Legendre function of the second kind for integers `n>-1`, `m>-1`.
```

or something similar.


---

Comment by rws created at 2014-11-08 15:04:48

That too. It also means that implementing the more general solution makes the Legendre part of your ticket obsolete. I also want encourage people to review #16813.


---

Comment by captaintrunky created at 2014-11-08 15:21:27

Replying to [comment:7 rws]:
> That too. It also means that implementing the more general solution makes the Legendre part of your ticket obsolete. I also want encourage people to review #16813.

Ok, then I just recover original state for these functions.


---

Comment by git created at 2014-11-08 20:50:34

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by rws created at 2014-11-09 09:56:58

BTW, even Laguerre polynomials can have extensions with negative or noninteger `n`, for example mpmath's numeric implementation: https://mpmath.googlecode.com/svn/trunk/doc/build/functions/orthogonal.html#laguerre-polynomials
I'm using this function in #17151 and so the restriction will fall there as well. You can experiment with what mpmath returns like this in Sage, as long as #17151 is not included:

```
sage: from mpmath import laguerre as lag
sage: lag(1/2,0,1)
mpf('0.42519582689040547')
sage: lag(-1,0,1)
mpf('0.0')
sage: lag(-1+I,0,1)
mpc(real='2.224699152616044', imag='-2.1127345594510065')
sage: lag(1,I,1)
mpc(real='6.3272150395398353e-23', imag='1.0')
```



---

Comment by captaintrunky created at 2014-11-10 19:04:40

Replying to [comment:10 rws]:
> BTW, even Laguerre polynomials can have extensions with negative or noninteger `n`, for example mpmath's numeric implementation: https://mpmath.googlecode.com/svn/trunk/doc/build/functions/orthogonal.html#laguerre-polynomials
> I'm using this function in #17151 and so the restriction will fall there as well. You can experiment with what mpmath returns like this in Sage, as long as #17151 is not included:
> {{{
> sage: from mpmath import laguerre as lag
> sage: lag(1/2,0,1)
> mpf('0.42519582689040547')
> sage: lag(-1,0,1)
> mpf('0.0')
> sage: lag(-1+I,0,1)
> mpc(real='2.224699152616044', imag='-2.1127345594510065')
> sage: lag(1,I,1)
> mpc(real='6.3272150395398353e-23', imag='1.0')
> }}}
I've played with it a little bit. As far as I understand, there is no way to use negative or non-integer `n` with a current implementation. My question is, is it worth it to support it in this particular code? There is some activity on the general solution already, so probably there is no point in doing such modifications?


---

Comment by rws created at 2014-11-10 19:45:58

What I can say is, our two proposals cause mutual merge conflict, but since no one knows which will be reviewed and included first, there is no good plan. It may take a few weeks until I am free to review your ticket.


---

Comment by rws created at 2014-11-24 16:40:15

Changing keywords from "beginner" to "beginner, special, functions".


---

Comment by rws created at 2014-11-24 17:38:32

Changing status from needs_review to positive_review.


---

Comment by rws created at 2014-11-24 17:38:32

I removed some lines that prevented the doc being built. The code passes `make ptestlong` and is straightforward, so it's positive review.
----
New commits:


---

Comment by vbraun created at 2014-11-25 11:25:55

Resolution: fixed
