# Issue 11029: QuotientRing elements are not callable

Issue created by migration from https://trac.sagemath.org/ticket/11199

Original creator: vbraun

Original creation time: 2011-04-14 15:56:23

Assignee: AlexGhitza

CC:  novoselt

It would be convenient if quotient ring elements would be callable like polynomials. This is currently not the case:

```
sage: R.<x,y> = QQ[]
sage: I = R.ideal(x)
sage: Q = R.quotient_ring(I)
sage: Q
Quotient of Multivariate Polynomial Ring in x, y over Rational Field by the ideal (x)
sage: Q.inject_variables()
Defining xbar, ybar
sage: p = xbar + ybar
sage: p(1,1)
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)

/home/vbraun/opt/sage-4.7.alpha4/devel/sage-main/<ipython console> in <module>()

TypeError: 'QuotientRingElement' object is not callable
```


The attached patch implements this functionality by handing the argument through to the lift. 

Arguably, it should check that the result does not depend on the presentation. Pro: catches errors; Con: potentially slow, ideal membership test necessary if arguments are polynomials.


---

Comment by vbraun created at 2011-04-14 16:01:49

Initial patch


---

Attachment


---

Comment by vbraun created at 2011-04-14 16:02:19

Changing status from new to needs_review.


---

Comment by jhpalmieri created at 2011-07-24 21:42:51

Evaluating an element of a quotient ring doesn't make mathematical sense in general, only if it makes sense to evaluate the lift: if you're taking a quotient of a group algebra or the p-adics, what does it mean to evaluate an element of it?  I'm attaching a new patch which adds a comment about this to the docstring; is this enough warning?

I'm happy with the original patch as far as it goes, and I'm almost ready to give it a positive review, but I'd like to hear opinions about the issue I raised.


---

Comment by jhpalmieri created at 2011-07-24 21:42:51

Changing status from needs_review to needs_info.


---

Comment by jhpalmieri created at 2011-07-24 21:43:15

for reference only; difference beteen initial patch and jhp patch


---

Attachment

apply this one


---

Attachment

Even with the extra warning in the docstring, users could very easily be misled.
For to make the evaluation independent of the lift it is necessary
for the ideal defining the quotient to annihilate the argument.

I think it would be sensible to have a parameter 'check' with default True, and a 
clause like:

```
if check and any(g(args) !=0 for g in f.parent().defining_ideal().gens()):
    raise ValueError, "argument not in the zero set of the ideal"
```

That way an unthinking user is not going to be caught out, while someone who 
knows what they're doing can speed things up by setting 'check=False'.
