# Issue 10160: AlgebraicNumber comparisons wrong/fail

Issue created by migration from https://trac.sagemath.org/ticket/10161

Original creator: vbraun

Original creation time: 2010-10-23 20:26:12

Assignee: was

CC:  tornaria

Comparing `AlgebraicNumber` with `Integer` or `Rational` can lead to unexpected results:

```
sage: x = Integer(1)
sage: y = Rational(1,1)
sage: z = AlgebraicNumber(1)
sage: ( x==y, y==z, x==y )    # so far, so good
(True, True, True)
sage: ( set([x,y]), set([x,z]), set([y,z]) )   # what?
(set([1]), set([1, 1]), set([1, 1]))
sage: for i in (x,y,z):
....:         for j in (x,y,z):
....:             print i._cmp_(j)   # i think this is the culprit
....: 
0
0
1
1
0
1
---------------------------------------------------------------------------
NotImplementedError                       Traceback (most recent call last)

/home/vbraun/Sage/patches/<ipython console> in <module>()

/home/vbraun/Sage/sage/local/lib/python2.6/site-packages/sage/structure/element.so in sage.structure.element.Element._cmp_ (sage/structure/element.c:5842)()

/home/vbraun/Sage/sage/local/lib/python2.6/site-packages/sage/structure/element.so in sage.structure.element.Element._cmp_c_impl (sage/structure/element.c:7336)()

NotImplementedError: BUG: sort algorithm for elements of 'Integer Ring' not implemented
```



---

Comment by spice created at 2011-03-23 19:06:43

Now with segfaults! Retested on Sage 4.6.2; got some strange inconsistencies with ._cmp_() on Integer vs. Rational, and a segfault when trying to compare either to a AlgebraicNumber:

```
sage: x = Integer(1)
sage: y = Rational(1,1)
sage: z = AlgebraicNumber(1)
sage: (x==y, x==z, y==z)
(True, True, True)
sage: (x._cmp_(y), y._cmp_(x))
(0, 1)
sage: x._cmp_(z)

------------------------------------------------------------
Unhandled SIGSEGV: A segmentation fault occurred in Sage.
This probably occurred because a *compiled* component
of Sage has a bug in it (typically accessing invalid memory)
and is not properly wrapped with sig_on(), sig_off().
You might want to run Sage under gdb with 'sage -gdb' to debug this.
Sage will now terminate (sorry).
------------------------------------------------------------
```



---

Comment by mhansen created at 2013-07-24 16:18:13

The issue is actually:


```
sage: map(hash, (x,y,z))
[1, 1, -3730706066237751940]
```


If two things have the same hash and compare equal, then they are the same as far as dictionaries are concerned:


```
sage: d = {}
sage: d[x] = x
sage: d[y] = y
sage: len(d)
1
sage: id(y)
110133424
sage: id(d[x])
110133424
```


One fix would be to change the hash of rational numbers.  Although, I think their hash function was designed to be consistent with the integers.


---

Comment by mkoeppe created at 2020-05-02 05:54:34

Still the same with 9.1.rc2


---

Comment by mkoeppe created at 2021-05-10 17:42:09

Moving to 9.4, as 9.3 has been released.
