# Issue 29540: xgcd correct for padic polynomials

Issue created by migration from https://trac.sagemath.org/ticket/29777

Original creator: @EnderWannabe

Original creation time: 2020-06-01 16:15:12

CC:  bhutz paulfili saraedum roed

Keywords: gsoc20

Ticket #13439 states that xgcd is incorrect for padic polynomials. However, it appears that the issues in #13439 have been solved:


```
sage: R.<x> = Qp(3,3)[]
sage: f = 3*x + 7
sage: g = 5*x + 9
sage: f.xgcd(f*g)[0].is_one()
False


sage: R.<x> = Qp(3)[]
sage: f = 490473657*x + 257392844/729
sage: g = 225227399/59049*x - 8669753175
sage: f.xgcd(f*g)[0].is_one()
False
```


Testing on 100,000 random polynomials gives the same results if the gcd is computed over QQ or Qp(5), see attached.

We therefore remove the warning.


---

Attachment


---

Comment by chapoton created at 2020-06-01 19:10:58

if it's ready, you need to change the status to "needs review" and to fill the Authors field (above here) to your full name
----
New commits:


---

Comment by @EnderWannabe created at 2020-06-01 19:13:42

Changing status from new to needs_review.


---

Comment by roed created at 2020-06-01 19:18:21

I would check that the precision behavior works as expected, and make sure that it works over `Zp` not just `Qp`.


---

Comment by git created at 2020-06-02 23:22:08

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by @EnderWannabe created at 2020-06-02 23:23:16

Replying to [comment:4 roed]:
> I would check that the precision behavior works as expected, and make sure that it works over `Zp` not just `Qp`.

Precision behavior works as expect, however low precision computations break over `Zp`:


```
sage: R.<x> = Zp(3,1)[]
sage: f = 3*x + 7
sage: g = 2*x + 3
sage: f.gcd(f*g).is_one()
True
```


To fix this, we pass to Qp to do the computation and then clear denominators. This is done in the _xgcd_univariate_polynomial function under pAdicRingGeneric. Incidentally, this also implements xgcd for pAdic rings.

Also, the old gcd function in polynomial_padic_capped_relative_dense is removed, as it is no longer needed.


---

Comment by bhutz created at 2020-06-16 16:14:15

Changing status from needs_review to needs_work.


---

Comment by bhutz created at 2020-06-16 16:14:15

I've been running of few of the examples in 13439 to see if those work now. For the most part I'm getting the correct answers. However, this seems weird


```
sage: R.<t> = ZpCA(7,20)[]
sage: (t^3).gcd( t^5 )
(1 + O(7^20))*t^3 + O(7^20)*t^2 + O(7^20)*t + O(7^20)
```



```
sage: R.<t> = Zp(7,20)[]
sage: (t^3).gcd( t^5 )
(1 + O(7^20))*t^3
```



A few other minor things

- you need INPUT and OUTPUT blocks

- why do you need args and kwds   (also note the standard spelling of kwds)

- you can use self instead of arg[0]

- first line description of function should end in a period.


---

Comment by git created at 2020-06-17 19:13:27

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by @EnderWannabe created at 2020-06-17 19:14:15

Replying to [comment:8 bhutz]:
>However, this seems weird
> 
> {{{
> sage: R.<t> = ZpCA(7,20)[]
> sage: (t^3).gcd( t^5 )
> (1 + O(7<sup>20))*t</sup>3 + O(7<sup>20)*t</sup>2 + O(7^20)*t + O(7^20)
> }}}

Apparently that is t^3:


```
sage: (t^3).gcd( t^5 ) == t^3
True
```


> - you need INPUT and OUTPUT blocks

Done!

> - why do you need args and kwds   (also note the standard spelling of kwds)

Removed!

> - first line description of function should end in a period.

Done!


---

Comment by @EnderWannabe created at 2020-06-19 19:46:44

Changing status from needs_work to needs_review.


---

Comment by bhutz created at 2020-06-22 18:57:53

Changing status from needs_review to needs_work.


---

Comment by bhutz created at 2020-06-22 18:57:53

I've pushed a branch with two minor doc fixes. However, I'm getting some doctest errors


```
File "src/sage/rings/padics/generic_nodes.py", line 776, in sage.rings.padics.generic_nodes.pAdicRingGeneric._xgcd_univariate_polynomial
Failed example:
    f.xgcd(f*g)
Expected:
    ((3 + O(3^4))*x + 1 + 2*3 + O(3^3), 0, 1 + O(3^3))
Got:
    ((3 + O(3^4))*x + 1 + 2*3 + O(3^3), 1 + O(3^3), 0)
```



```
File "src/sage/rings/padics/generic_nodes.py", line 782, in sage.rings.padics.generic_nodes.pAdicRingGeneric._xgcd_univariate_polynomial
Failed example:
    f.xgcd(f*g)
Expected:
    ((3^9 + O(3^29))*x + 2 + 2*3 + 3^2 + 2*3^5 + 3^6 + 3^7 + 3^8 + 3^10 + 3^11 + 2*3^13 + 3^14 + 3^16 + 2*3^19 + O(3^20), 0, 1 + 2*3^2 + 3^4 + 2*3^5 + 3^6 + 3^7 + 2*3^8 + 2*3^10 + 2*3^12 + 3^13 + 3^14 + 3^15 + 2*3^17 + 3^18 + O(3^20))
Got:
    ((3^9 + O(3^29))*x + 2 + 2*3 + 3^2 + 2*3^5 + 3^6 + 3^7 + 3^8 + 3^10 + 3^11 + 2*3^13 + 3^14 + 3^16 + 2*3^19 + O(3^20),
     1 + 2*3^2 + 3^4 + 2*3^5 + 3^6 + 3^7 + 2*3^8 + 2*3^10 + 2*3^12 + 3^13 + 3^14 + 3^15 + 2*3^17 + 3^18 + O(3^20),
     0)
```

----
New commits:


---

Comment by @EnderWannabe created at 2020-06-26 20:25:06

As saraedum has kindly pointed out, xgcd is still broken. So, we change the scope of the ticket to implementing the (broken) xgcd for padic rings, and re add the warning.
----
New commits:


---

Comment by @EnderWannabe created at 2020-07-01 18:40:34

Changing status from needs_work to needs_review.


---

Comment by bhutz created at 2020-07-08 17:41:26

Changing status from needs_review to needs_work.


---

Comment by bhutz created at 2020-07-08 17:41:26

Functionality wise, this ticket is fine with the adjusted scope.

I'm marking it as needs-works just to have you update the title/description to match the new scope.


---

Comment by @EnderWannabe created at 2020-07-13 20:52:46

Changing status from needs_work to needs_review.


---

Comment by bhutz created at 2020-07-14 18:22:58

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2020-07-28 22:31:49

Resolution: fixed
