# Issue 16564: not all sympy function results get translated to Sage

Issue created by migration from https://trac.sagemath.org/ticket/16801

Original creator: rws

Original creation time: 2014-08-12 09:27:02

Keywords: _sage_, integrate, mpmath


```
sage: integrate(1/(x^3 *(a+b*x)^(1/3)), x, algorithm='sympy')
...
AttributeError: 'gamma' object has no attribute '_sage_'
```



---

Comment by rws created at 2014-08-12 12:32:28

Changing status from new to needs_review.


---

Comment by rws created at 2014-08-12 12:32:28

Duplicate of #15057 which however misses `gamma`.


---

Comment by rws created at 2014-08-12 13:15:07

Not quite. It appears to be the other direction that's missing.


---

Comment by rws created at 2014-08-12 13:15:07

Changing status from needs_review to needs_work.


---

Comment by rws created at 2014-08-12 13:49:24

I think this naturally needs a general solution that uses the `conversions` dictionary given with every special function in Sage.


---

Comment by rws created at 2016-08-06 07:10:21

`gamma` is now converted from Sympy, the original case however takes very long to doctest. Is there a faster case that returns something with `gamma` in Sympy?

Also, additionally now, `polygamma` does not convert, as in `integrate(psi(x), x, algorithm='sympy')`.


---

Comment by rws created at 2016-08-06 07:10:21

Changing keywords from "_sage_, integrate, mpmath" to "_sage_, integrate, sympy".


---

Comment by rws created at 2017-10-18 07:27:50

Changing status from needs_work to needs_review.


---

Comment by rws created at 2017-10-18 07:27:50

Last 10 new commits:


---

Comment by jdemeyer created at 2017-10-18 20:32:05

Changing status from needs_review to needs_work.


---

Comment by jdemeyer created at 2017-10-18 20:32:05

Could you add at least one _direct_ doctest of the function `_sympysage_polygamma`?


---

Comment by rws created at 2017-10-19 05:47:46

Since there is no pressing need for it, please open another ticket.


---

Comment by rws created at 2017-10-19 05:47:46

Changing status from needs_work to needs_review.


---

Comment by mforets created at 2017-10-19 13:51:24

Changing status from needs_review to positive_review.


---

Comment by mforets created at 2017-10-19 13:51:24

LGTM.



all the following more direct tests work. i can add one, but don't know where exactly.


```
sage: f = 25/12 + psi(5, hold=true); f
psi(5) + 25/12
sage: f._sympy_()
-EulerGamma + 25/6
sage: f.unhold()
-euler_gamma + 25/6
sage: from sympy import Symbol, polygamma as pg
sage: bool(pg(1, x)._sage_().subs(x=1) + 1/6*pi^2 == 0)
True
```



---

Comment by mforets created at 2017-10-19 14:02:50

perhaps in the module's docstring of `interfaces/sympy.py`, to add those and maybe other examples, so that they also show up in the htmldoc.


---

Comment by rws created at 2017-10-19 14:25:55

Thanks. Please go ahead.


---

Comment by mforets created at 2017-10-26 09:36:55

Replying to [comment:12 rws]:
> Thanks. Please go ahead.

ok, this is now #24112.


---

Comment by vbraun created at 2017-11-04 23:23:44

Resolution: fixed
