# Issue 15798: RealLazyField element comparison breaks on OSX

Issue created by migration from Trac.

Original creator: rws

Original creation time: 2014-03-31 16:48:21

This is from #13125, (comment 22):

...it seems to fail only when comparing to zero (OSX 10.7.5):

```
sage: filter(lambda x: RLF(x) < -oo, range(-10,10))
[0]
sage: filter(lambda x: RLF(float(x)/3) < -oo, range(-10,10))
[0]
```

while on Linux I get:

```
sage: filter(lambda x: RLF(x) < -oo, range(-10,10))
[]
sage: filter(lambda x: RLF(float(x)/3) < -oo, range(-10,10))
[]
```




---

Comment by mkoeppe created at 2016-08-15 19:49:57

This seems to work fine with 7.4.beta0 on Mac OS X 10.11.5.


---

Comment by dimpase created at 2017-04-05 19:53:20

this is OK on FreeBSD 11.0 with clang 3.8, I get the same answers (`[]`) as on Linux.


---

Comment by chapoton created at 2017-04-05 19:56:33

It seems that we can close this one


---

Comment by chapoton created at 2017-04-05 19:56:33

Changing status from new to needs_review.


---

Comment by dimpase created at 2017-04-05 20:13:46

Well, a test on OSX is certainly needed 1st.


---

Comment by jhpalmieri created at 2017-04-05 21:12:01

Works for me on OS X 10.11.6, Sage 8.0.beta0.


---

Comment by dimpase created at 2017-04-05 21:14:03

Changing status from needs_review to positive_review.


---

Comment by embray created at 2017-07-13 07:54:31

Resolution: wontfix


---

Comment by embray created at 2017-07-13 07:54:31

Closing tickets in the sage-duplicate/invalid/wontfix module with positive_review (i.e. someone has confirmed they should be closed).
