# Issue 14416: adaptive numerical approximation

Issue created by migration from Trac.

Original creator: vdelecroix

Original creation time: 2013-05-20 13:35:37

Assignee: vdelecroix

Keywords: numerical_approx

It would be nice to have an adaptive algorithm for numerical evaluation of expression and number field elements. This would avoid the following behavior

```
sage: a = (106*pi - 333) / (355 - 113*pi)
sage: a.n(digits=5)
Traceback (most recent call last)
...
ValueError: power::eval(): division by zero
sage: a.n(digits=6)
289.000
sage: a.n(digits=7)
289.0000
sage: a.n(digits=8)
293.65079
sage: a.n(digits=9)
292.772502
sage: a.n(digits=10)
292.6277805
sage: a.n(digits=11)
292.63234726
```

where we can not rely on the last digits.

See the discussion on [this sage-devel thread](http://groups.google.com/group/sage-devel/browse_thread/thread/68f93e986287f1e2)
