# Issue 25918: conversion of string 'r' in fraction field

Issue created by migration from https://trac.sagemath.org/ticket/26155

Original creator: dkrenn

Original creation time: 2018-08-29 11:28:17

CC:  jdemeyer

With #26150 the code

```
sage: QQ['x'].fraction_field()('r')
```

gives the error

```
ValueError: invalid literal for int() with base 10: "Error in dput(length(sage2)) : object 'sage2' not foun"
```

as the string `'r'` is interpreted as

```
sage: sage_eval('r', QQ['x'].fraction_field().gens_dict_recursive())
R Interpreter
```

(the above is what happens in L.607 in fraction_field.py).

Before the fix #26150 the error was

```
TypeError: unable to convert '[1] 0' to a rational
```

and this change causes the failing doctest in #26150 (see #26150#comment:5) somewhere in the coercion model, where it is tried to create `'r'` in the above fraction field.



---

Comment by jdemeyer created at 2018-08-29 11:36:42

I think the best solution would be to have a `globals` argument to `sage_eval` (defaulting to `sage.all.__dict__`) which could be set to `{}` for this specific `sage_eval` call.


---

Comment by dkrenn created at 2018-08-29 12:19:16

Replying to [comment:2 jdemeyer]:
> I think the best solution would be to have a `globals` argument to `sage_eval` (defaulting to `sage.all.__dict__`) which could be set to `{}` for this specific `sage_eval` call.

This sounds like a good solution. However, I was wondering why this is not an issue everywhere else (as I suppose that the coercion model passes a variable name like `'r'` to element constructor from time to time).


---

Comment by jdemeyer created at 2018-08-29 12:21:40

Replying to [comment:3 dkrenn]:
> However, I was wondering why this is not an issue everywhere else

I don't know, but I think that using `sage_eval()` in a constructor is rare.


---

Comment by dkrenn created at 2018-08-30 07:44:28

Replying to [comment:2 jdemeyer]:
> I think the best solution would be to have a `globals` argument to `sage_eval` (defaulting to `sage.all.__dict__`) which could be set to `{}` for this specific `sage_eval` call.

Done (code pushed to this ticket), but this seems also not the correct solution:

```
sage: F = QQ['x,y'].fraction_field()
sage: sage_eval('1 + x/y', locals=F.gens_dict_recursive())
(x + y)/y
sage: sage_eval('1 + x/y', locals=F.gens_dict_recursive(), globals={})
Traceback (most recent call last)
...
NameError: name 'Integer' is not defined
```

----
New commits:
