# Issue 22532: tensor_product fails when one of the matrices has 0 rows or columns

Issue created by migration from Trac.

Original creator: jwiltshiregordon

Original creation time: 2017-04-06 16:28:59

CC:  chapoton vdelecroix

Keywords: block_matrix, tensor_product

Here is a small example of the error


```
m1 = matrix(QQ, 1, 0, [])
m2 = matrix(QQ, 2, 2, [1, 2, 3, 4])
print m1.tensor_product(m2)
```


Of course, the correct tensor product of these two matrices should be given by


```
matrix(QQ, 2, 0, [])
```


It could be that the problem is coming from the block matrix structure.


---

Comment by tscrim created at 2017-04-24 00:19:06

Changing status from new to needs_review.


---

Comment by tscrim created at 2017-04-24 00:19:06

I decided to just special case the `tensor_product` call to handle these cases.


---

Comment by git created at 2017-04-24 00:19:22

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by tscrim created at 2017-05-21 02:17:24

Green patchbot.


---

Comment by vdelecroix created at 2017-06-03 17:32:42

Isn't it a problem with `block_matrix`

```
sage: block_matrix(0, 2, [])
Traceback (most recent call last):
...
ValueError: invalid nrows/ncols passed to block_matrix
```

EDIT: no! since `block_matrix` has no way to understand the size of the matrices in the empty list!

Note that the following does work

```
sage: block_matrix(2, 2, [[matrix(0,2), matrix(0,2)], [matrix(0,2), matrix(0,2)]])
[]
sage: parent(_)
Full MatrixSpace of 0 by 4 dense matrices over Integer Ring
```



---

Comment by tscrim created at 2017-06-03 21:19:27

Replying to [comment:4 vdelecroix]:
> Note that the following does work
> {{{
> sage: block_matrix(2, 2, [[matrix(0,2), matrix(0,2)], [matrix(0,2), matrix(0,2)]])
> []
> sage: parent(_)
> Full MatrixSpace of 0 by 4 dense matrices over Integer Ring
> }}}

That should also work as those arguments are:

```
    -  ``nrows`` - the number of block rows

    -  ``ncols`` - the number of block cols
```

IMO, changing it so that it goes through that construction seems like overkill in trying to follow the definition exactly rather than equivalent code.


---

Comment by vdelecroix created at 2017-06-04 07:07:34

With your patch it looks like the resulting matrix will always be defined over `QQ`. You would better use `self.matrix_space`.


---

Comment by git created at 2017-06-04 08:13:40

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by tscrim created at 2017-06-04 08:15:47

Replying to [comment:6 vdelecroix]:
> With your patch it looks like the resulting matrix will always be defined over `QQ`. You would better use `self.matrix_space`.

That was really bad of me. Initially I should have used the base ring. However, I like the `self.matrix_space()` approach. I thought about having it return the `.zero()` element, but then I realized that having it sometimes return an immutable matrix could cause confusion.


---

Comment by vdelecroix created at 2017-06-05 19:49:24

Replying to [comment:8 tscrim]:
> Replying to [comment:6 vdelecroix]:
> > With your patch it looks like the resulting matrix will always be defined over `QQ`. You would better use `self.matrix_space`.
> 
> That was really bad of me. Initially I should have used the base ring. However, I like the `self.matrix_space()` approach. I thought about having it return the `.zero()` element, but then I realized that having it sometimes return an immutable matrix could cause confusion.

Can still use `.zero().__copy__()`.


---

Comment by vdelecroix created at 2017-06-05 19:50:43

And note that the empty list is not even needed

```
sage: MatrixSpace(QQ, 3, 4)()
[0 0 0 0]
[0 0 0 0]
[0 0 0 0]
```



---

Comment by vdelecroix created at 2017-06-05 19:51:37

There is no need to import `matrix` anymore. And you would better import `block_matrix` only if it is needed.


---

Comment by vdelecroix created at 2017-06-05 19:54:41

And it would be good to have a check for parent of the result (not only dimensions)

```
sage: m1 = MatrixSpace(GF(5), 3, 2).an_element()
sage: m2 = MatrixSpace(GF(5), 0, 4).an_element()
sage: m1.tensor_product(m2).parent()
WHOIAM?
```



---

Comment by vdelecroix created at 2017-06-05 19:54:59

Changing status from needs_review to needs_work.


---

Comment by git created at 2017-06-05 23:49:50

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by tscrim created at 2017-06-05 23:50:00

Somewhat surprising, it is faster to pass nothing than to make a copy:

```
sage: MS = MatrixSpace(QQ, 4, 3)
sage: %timeit MS.zero().__copy__()
The slowest run took 18.18 times longer than the fastest. This could mean that an intermediate result is being cached.
100000 loops, best of 3: 5.32 µs per loop
sage: %timeit MS()
The slowest run took 25.40 times longer than the fastest. This could mean that an intermediate result is being cached.
1000000 loops, best of 3: 1.27 µs per loop
```

I've also taken case of comment:12 and comment:13.


---

Comment by tscrim created at 2017-06-05 23:50:00

Changing status from needs_work to needs_review.


---

Comment by vdelecroix created at 2017-06-06 08:23:04

It is not the copy that takes time. I think that `.zero()` would better be cached.

```
sage: MS = MatrixSpace(QQ, 4, 3)
sage: %timeit MS.zero()
100000 loops, best of 3: 4.13 µs per loop
sage: z = MS.zero()
sage: %timeit z.__copy__()
1000000 loops, best of 3: 788 ns per loop
sage: %timeit MS()
1000000 loops, best of 3: 1.07 µs per loop
```



---

Comment by vdelecroix created at 2017-06-06 10:46:38

Changing status from needs_review to positive_review.


---

Comment by git created at 2017-06-06 11:02:11

Branch pushed to git repo; I updated commit sha1 and set ticket back to needs_review. New commits:


---

Comment by git created at 2017-06-06 11:02:11

Changing status from positive_review to needs_review.


---

Comment by tscrim created at 2017-06-06 11:05:47

So `zero()` is cached, but ``@`cached_method` does not optimize for aliases that well:

```
sage: MS = MatrixSpace(QQ, 4, 3)
sage: %timeit MS.zero_matrix()
The slowest run took 1624.29 times longer than the fastest. This could mean that an intermediate result is being cached.
10000000 loops, best of 3: 61.6 ns per loop
sage: %timeit MS.zero()
The slowest run took 10.05 times longer than the fastest. This could mean that an intermediate result is being cached.
100000 loops, best of 3: 4.58 µs per loop
```

So I converted to use `MS.zero_matrix().__copy__()`, which ends up being the same path that `MS()` uses, but is more direct.

I'm allowing myself a change back to positive review since it is essentially a trivial change and tests pass.


---

Comment by tscrim created at 2017-06-06 11:05:47

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2017-06-09 18:37:56

Resolution: fixed
