# Issue 22103: Coefficient of an AsymptoticExpansion

Issue created by migration from https://trac.sagemath.org/ticket/22340

Original creator: cheuberg

Original creation time: 2017-02-10 10:56:58

CC:  dkrenn behackl

The following would be convenient:

```
sage: R.<m, n> = AsymptoticRing("m^QQ*n^QQ", ZZ)
sage: ae = 1 + 42/n + 2/n/m + O(n^-2)
sage: ae.monomial_coefficient(1/n)
42
```

The choice of the method name `monomial_coefficient` is motivated by the homonymous [method](http://doc.sagemath.org/html/en/reference/polynomial_rings/sage/rings/polynomial/multi_polynomial_element.html#sage.rings.polynomial.multi_polynomial_element.MPolynomial_polydict.monomial_coefficient) of multivariate polynomial rings.


---

Comment by cheuberg created at 2017-02-10 11:26:07

Changing status from new to needs_review.


---

Comment by cheuberg created at 2017-02-10 11:26:07

New commits:


---

Comment by dkrenn created at 2017-02-10 17:55:07

Looks good; I only have very small things to discuss:

1.

```
+        - ``monomial`` -- a monomial element which can be converted
+          into the parent of this element.
```

What about rephrasing this to the following, so that the technical term "parent" is avoided

```
a monomial element which can be converted into the asymptotic ring of this element
```


2. Remove period after "element." above (convention in [SageMath](SageMath); not used in the asymptotic_ring file much...).

3.

```
+            raise ValueError("non-exact monomial")
+            raise ValueError("not a monomial")
```

Within the asymptotic ring module usually error messages include the element (in the above, the monimial), i.e. 

```
raise ValueError('non-exact monimal {}'.format(monomial))
raise ValueError('{} not a monomial'.format(monomial))
```

(Maybe inserting "is" in the latter, but not sure.)


---

Comment by dkrenn created at 2017-02-10 18:09:00

4. The method in the multivariate polynomial ring returns `0` if the monomial is not in the polynomial. Here a `KeyError` will be raised. If there is no reason against `0`, I think the behavior should coincide.


---

Comment by dkrenn created at 2017-02-10 18:11:59

5. FYI, the following (undocumented) feature of a polynomial is present:

```
sage: P.<x,y> = ZZ[]
sage: a=(1+2*x*y+3*x^2)
sage: a[x*y]
2
sage: a[x^2]
3
```

So maybe `__getitem__` should have this behavior as well...


---

Comment by git created at 2017-02-11 15:13:37

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by cheuberg created at 2017-02-11 15:16:19

1.-4. done
5. I am not convinced: If this is not a documented and tested behaviour of polynomial rings, I am slightly hesitant to introduce this here. I am not against the concept, but IMHO it should be done in the polynomial ring first (and not on this ticket).


---

Comment by dkrenn created at 2017-02-11 15:48:24

Replying to [comment:7 cheuberg]:
> 1.-4. done

Thank you.

> 5. I am not convinced: If this is not a documented and tested behaviour of polynomial rings, I am slightly hesitant to introduce this here. I am not against the concept, but IMHO it should be done in the polynomial ring first (and not on this ticket).

Fine for me not to do this now.

Patch LGTM; positive_review modulo non-finished patchbot


---

Comment by dkrenn created at 2017-02-13 05:51:17

Two patchbot tested this ticket now; each timed out on a single, but different doctest, and these tests are not related to this ticket. Thus I set it to positive review


---

Comment by dkrenn created at 2017-02-13 05:51:17

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2017-02-16 22:28:43

Resolution: fixed
