# Issue 19031: MPComplexField should be a commutative ring and it is not!

Issue created by migration from Trac.

Original creator: hmonien

Original creation time: 2015-09-22 10:32:46

CC:  jdemeyer

Keywords: MPCComplexField

Even though


```
sage: MPC = MPComplexField(128)
sage MPC.is_commutative()
True
```


MPC is not in commutative rings:


```
sage: MPC = MPComplexField(128)

sage: P.<x> = PolynomialRing(ZZ, 'x')
sage: p = x^3-5*x+1

sage: p.change_ring(MPC)
```


gives  an error 



```
TypeError: Base ring Complex Field with 128 bits of precision must be a commutative ring.
```

