# Issue 12982: Bug on Sage simple server

Issue created by migration from Trac.

Original creator: ares

Original creation time: 2012-06-23 00:33:23

Assignee: Ares Rib√≥

CC:  jason

_We have the following problems:_


nb = test_notebook(passwd, secure=False, address='localhost', port=port, verbose=True) 
bash-3.2$ sage


----------------------------------------------------------------------


| Sage Version 5.0.1, Release Date: 2012-06-10                       |

| Type notebook() for the GUI, and license() for information.        |

----------------------------------------------------------------------


Loading Sage library. Current Mercurial branch is: d6.2 


sage: from sage.server.misc import find_next_available_port 


sage: port = find_next_available_port(9000, verbose=False) 


sage: from sagenb.notebook.notebook_object import test_notebook 


sage: passwd = str(randint(1,1<<128)) 


sage: nb = test_notebook(passwd, secure=False, address='localhost', port=port, verbose=True) 


--------------------------------------------------------------------------- 

 
TypeError                                 Traceback (most recent call last) 


/Applications/sage/<ipython console> in <module>()

TypeError: test_notebook() got an unexpected keyword argument 'address'

''This is the first error. It seems that `address` is not currently (in 5.0.1) a valid option.
Must update the docs.
''










sage: nb = test_notebook(passwd, secure=False, port=port, verbose=True) 

Notebook started.

sage: import urllib, re

sage: def get_url(url): h = urllib.urlopen(url); data = h.read(); h.close(); return data

....: 

sage: sleep(1)

sage: login_page = get_url('http://localhost:%s/simple/login?username=admin&password=%s' % (port, 

passwd))

sage: print login_page

{

"session": "fcee333f07d53c13a46f65b9c4a15473"

}

___S_A_G_E___


sage: session = re.match(r'.*"session": "([^"]*)"', login_page, re.DOTALL).groups()[0]

sage: sleep(0.5)

sage: print get_url('http://localhost:%s/simple/compute?session=%s&code=2*2&timeout=60' % (port, 

session))

{

"status": "done",

"files": [],

"cell_id": 2

}

___S_A_G_E___

4
''
Just repeating this command 3 times,  it gets stuck.''


---

Comment by kcrisman created at 2012-07-07 02:26:08

If I'm not mistaken, the Sage simple server is more or less deprecated.  The [Sage cell server](https://github.com/sagemath/sagecell/) seems to be along the lines of replacing it.  Jason, is that correct?


---

Comment by jason created at 2012-07-07 02:47:12

It does not work with the new notebook, and no one has volunteered to fix it yet.  Pull requests are welcome, of course.  The Sage Cell Server does do (most of) the things you'd want the simple server to do.


---

Comment by kcrisman created at 2012-07-07 03:47:54

I guess what I'm wondering is whether this ticket should be closed.  It sounds like you're saying that this could be fixed, just that no one has volunteered yet.


---

Comment by jason created at 2012-07-07 04:01:04

My best guess is that the current simple server code is dead and will need to be rewritten from scratch to be useful again.


---

Comment by kcrisman created at 2013-06-14 17:08:48

Changing status from new to needs_review.


---

Comment by kcrisman created at 2013-06-14 17:09:33

Changing status from needs_review to positive_review.


---

Comment by kcrisman created at 2013-06-14 18:36:37

Note that #11409 would remove this completely.


---

Comment by kcrisman created at 2013-06-14 18:36:37

Changing status from positive_review to needs_info.


---

Comment by knsam created at 2014-08-14 19:20:26

As a part of Sage Days 60, I was just going through these ticket lists to see if there were easy ones: 

Isn't this ticket a wont-fix/invalid kind ticket?


---

Comment by kcrisman created at 2014-08-15 05:11:10

Changing status from needs_info to positive_review.


---

Comment by vbraun created at 2014-08-20 20:36:27

Resolution: fixed
