# Issue 31200: Factorization in ZZ[x][y] gives wrong unit

Issue created by migration from https://trac.sagemath.org/ticket/31437

Original creator: @emo916math

Original creation time: 2021-02-27 18:32:15

Keywords: polynomials, factor

Viewing x<sup>3</sup> as a polynomial in ZZ[x][y], its factorization should be x<sup>3</sup> with a unit of 1, but Sage places x<sup>3</sup> in the unit:


```python
sage: R.<x> = PolynomialRing(ZZ) 
....: S.<y> = PolynomialRing(R) 
....: p = S(x^3); 
....: factor(p).unit()                                                          
x^3
sage: dict(factor(p))
{}
```


Using ZZ[x,y] gives the right answers:

```python
sage: S.<x,y> = PolynomialRing(ZZ) 
....: p = S(x^3); 
....: factor(p).unit()
1
sage: dict(factor(p))                                                           
{x: 3}
```


Running Sage 9.0 on Linux Mint 20.1 Ulyssa.


---

Comment by mkoeppe created at 2021-05-10 17:42:09

Moving to 9.4, as 9.3 has been released.
