# Issue 10034: Create hold context

Issue created by migration from Trac.

Original creator: kcrisman

Original creation time: 2010-09-29 19:08:24

Assignee: burcin

CC:  burcin eviatarbach

Now that Pynac will support 'hold' of symbolic expressions, like

```
sage: tan(pi/12,hold=True)
tan(1/12*pi)
```

we might want a 'context' for this.


---

Comment by jason created at 2010-09-30 02:06:07

Can you give a code sample of what you mean?


---

Comment by kcrisman created at 2010-09-30 02:35:42

Replying to [comment:1 jason]:
> Can you give a code sample of what you mean?
No, because this is really a followup to another ticket.  I'll cc: Burcin in, though he probably already gets it given the component.  I imagine something like

```
sage: context('hold') # or whatever the usual syntax is for such things - Sage doesn't have any yet
sage: a = tan(pi/12)
sage: a
tan(pi/12)
```

as opposed to evaluating it.


---

Comment by burcin created at 2010-10-01 14:54:53

I was thinking of something like:

```
sage: with hold:
....:     t = tan(pi/2)
....:
sage: t
tan(pi/12)
sage: tan(pi/12)
-sqrt(3) + 2
```



---

Comment by jason created at 2010-10-01 15:01:42

That would be awesome!


---

Comment by jpflori created at 2010-10-05 09:40:46

Replying to [comment:4 jason]:
> That would be awesome!
But with such a construction it is not obvious how to simplify 't' without going through Maxima as suggested in [#10034](http://trac.sagemath.org/search/opensearch?q=ticket%3A10034)



```
sage: with hold: 
....:     t = tan(pi/2) 
....: 
sage: t tan(pi/12) 
sage: t.eval() #or t.unhold() or whatever 
-sqrt(3) + 2
```



---

Comment by kcrisman created at 2011-09-08 00:55:26

#11776 seems to be asking for something very similar.


---

Comment by kcrisman created at 2014-03-13 15:11:30

An interesting use case for this showed up at [this tex.SX question](http://tex.stackexchange.com/questions/136514/).


---

Comment by rws created at 2014-12-25 09:31:55

Replying to [comment:5 jpflori]:
> Replying to [comment:4 jason]:
> > That would be awesome!
> But with such a construction it is not obvious how to simplify 't' without going through Maxima as suggested in [#10034](http://trac.sagemath.org/search/opensearch?q=ticket%3A10034)
> 
> 
> {{{
> sage: with hold: 
> ....:     t = tan(pi/2) 
> ....: 
> sage: t tan(pi/12) 
> sage: t.eval() #or t.unhold() or whatever 
> -sqrt(3) + 2
> }}}
You are going through Maxima because the `simplify...` functions do this. So improve these by replacing Maxima. It has nothing to do with the question of a global hold context.


---

Comment by rws created at 2015-06-24 08:01:02

See https://github.com/pynac/pynac/issues/76


---

Comment by rws created at 2015-06-24 12:32:02

Changing priority from minor to major.


---

Comment by rws created at 2017-08-30 06:28:29

The construction would look like:

```
sage: class hold_class:
....:     def __enter__(self): print('entered')
....:     def __exit__(self, *args): print('exited')
....:     
sage: hold = hold_class()
sage: with hold:
....:     x^2
....:     
entered
x^2
exited
```



---

Comment by rws created at 2017-08-30 06:33:55

So we can actually use a global state (e.g. a boolean hold state inside Pynac) and via the Python `with` ensure that it is always set locally.


---

Comment by rws created at 2017-08-31 07:55:46

New commits:


---

Comment by kcrisman created at 2017-08-31 16:47:11

Ordinarily I'd just say *well done* and leave it at that.  But what to do with the "old" hold stuff?  Keep, deprecate, side-by-side - should we transform old examples into this one, not, leave that to another ticket that may or may not get attention ... I assume you have thoughts on this so this is just for the purposes of hearing them, I don't have a strong opinion other than that a decision would have to be made, this patch alone wouldn't suffice.  THANK YOU for this.


---

Comment by rws created at 2017-09-01 06:15:14

I think the best strategy is to keep the old functionality but replace doctests in tutorials and introductory docstrings (another ticket). As there will be more such contexts a syntax for multiple settings like `with context(hold, eval_fp, simplify):` seems best.

Please review this whenever pynac-0.7.11 is merged.


---

Comment by rws created at 2017-09-01 06:19:31

Or even `with context(x > 0, simplify):`


---

Comment by rws created at 2017-09-01 06:32:56

Note however that the Python directive `with` interactively acts on its content all at once. That is,

```
sage: with hold:
....:     sin(0)
....:     cos(0)
....:     
sin(0)
cos(0)
```

Maybe we should provide `start()/stop()` so people can do

```
sage: mycontext1 = context(...)
sage: mycontext2 = context(...)
sage: with mycontext1:
........
sage: mycontext2.start()
...
sage: mycontext2.stop()
```



---

Comment by git created at 2017-09-01 06:58:03

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by rws created at 2017-09-23 05:53:25

Changing status from new to needs_review.


---

Comment by charpent created at 2017-10-25 19:31:56

On top of 8.1beta9 + #24026 + #23990 + #23923 + #24088 + their dependencies running on Debian Testing on core i7 + 16 GB RAM, passes `ptestlong` with no error whatsoever.

==>`positive_review`


---

Comment by charpent created at 2017-10-25 19:31:56

Changing status from needs_review to positive_review.


---

Comment by rws created at 2017-10-26 06:22:16

Thanks.


---

Comment by vbraun created at 2017-10-29 10:32:19

Resolution: fixed
