# Issue 25385: SymmetricGroup should accept libgap permutations

Issue created by migration from Trac.

Original creator: vdelecroix

Original creation time: 2018-06-20 17:22:28

works with gap

```
sage: SymmetricGroup(3)(gap("(1,3)"))
(1,3)
```

fails with libgap

```
sage: SymmetricGroup(3)(libgap.eval("(1,3)"))
Traceback (most recent call last):
...
TypeError: 'sage.libs.gap.element.GapElement_Permutation' object is not iterable
```

Though we have

```
sage: libgap.eval("(1,3)").sage()
(1,3)
sage: parent(_)
Symmetric group of order 3! as a permutation group
```



---

Comment by embray created at 2021-02-16 13:25:52

Changing status from new to needs_review.


---

Comment by embray created at 2021-02-16 13:25:52

This is fixed by #31404, though this ticket should remain open until/unless that one is merged:


```
sage: SymmetricGroup(3)(libgap.eval("(1,3)"))                                                                                                                                                    
(1,3)
sage: parent(_)                                                                                                                                                                                  
Symmetric group of order 3! as a permutation group
```



---

Comment by embray created at 2021-02-16 13:29:40

Actually this example is currently fixed in Sage, at least as far back as 9.1--I didn't check further.  It was probably fixed by #18267.


---

Comment by embray created at 2021-02-16 13:29:40

Resolution: worksforme
