# Issue 12054: rational a finite word

archive/issues_012054.json:
```json
{
    "body": "Assignee: sage-combinat\n\nCC:  vdelecroix slabbe\n\nUpgrade exponent of a FiniteWord_class to calculate rational exponents.\n\nNow:\n\n```\nsage: Word('1231').exponent()\n1\n```\n\n\nExpected:\n\n```\nsage: Word('1231').exponent()\n4/3\n```\n\n\nThe goal\n\n```\nsage: Word('1231').exponent()\n4/3\nsage: Word('1231').exponent(integer=True)\n1\n```\n\n\n\nAlso, upgrade (deprecate, review, and/or change name) the method primitive() to be in accordance with the terminology used in literature (the word is usually called the period instead of the primitive)\n\n```\nsage: Word('1231').exponent()\n4/3\nsage: Word('1231').period()\nword: 123\n```\n\n\nUpgrade influenced methods (primitive_length(), ...).\n\nIssue created by migration from https://trac.sagemath.org/ticket/12226\n\n",
    "created_at": "2011-12-23T10:57:52Z",
    "labels": [
        "combinatorics",
        "minor",
        "enhancement"
    ],
    "title": "rational a finite word",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/12054",
    "user": "sstarosta"
}
```
Assignee: sage-combinat

CC:  vdelecroix slabbe

Upgrade exponent of a FiniteWord_class to calculate rational exponents.

Now:

```
sage: Word('1231').exponent()
1
```


Expected:

```
sage: Word('1231').exponent()
4/3
```


The goal

```
sage: Word('1231').exponent()
4/3
sage: Word('1231').exponent(integer=True)
1
```



Also, upgrade (deprecate, review, and/or change name) the method primitive() to be in accordance with the terminology used in literature (the word is usually called the period instead of the primitive)

```
sage: Word('1231').exponent()
4/3
sage: Word('1231').period()
word: 123
```


Upgrade influenced methods (primitive_length(), ...).

Issue created by migration from https://trac.sagemath.org/ticket/12226





---

archive/issue_comments_139787.json:
```json
{
    "body": "Changing assignee from sage-combinat to sstarosta.",
    "created_at": "2011-12-23T10:58:41Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12054",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12054#issuecomment-139787",
    "user": "sstarosta"
}
```

Changing assignee from sage-combinat to sstarosta.



---

archive/issue_comments_139788.json:
```json
{
    "body": "Should not period be an integer?\n\n... I already had the idea of making `period` an alias of `minimal_period`:\n\n\n```\nsage: Word('1231').minimal_period()\n3\n```\n\n\nWhat do you think?",
    "created_at": "2012-01-09T16:41:19Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12054",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12054#issuecomment-139788",
    "user": "slabbe"
}
```

Should not period be an integer?

... I already had the idea of making `period` an alias of `minimal_period`:


```
sage: Word('1231').minimal_period()
3
```


What do you think?



---

archive/issue_comments_139789.json:
```json
{
    "body": "Replying to [comment:2 slabbe]:\n> Should not period be an integer?\n\nYou are right, I found both versions in the literature (integer in Lothaire, word for instance in http://www.springerlink.com/content/t59071u33573168v/ )\n\nWhen hearing period without context, I think an integer is expected. Although a word is definitely more useful in papers and you have the integer by taking just the length of the word.\n\nIs something like that stupid?\n\n```\nsage: Word('1231').period(word=True)\nword: 123\nsage: Word('1231').period()\n3\n```\n\n\n\n\n> What do you think?\n\nI think an alias is not necessary. There is no other period, and anyone looking for that notion will use \"period\" anyway.",
    "created_at": "2012-01-09T20:58:29Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12054",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12054#issuecomment-139789",
    "user": "sstarosta"
}
```

Replying to [comment:2 slabbe]:
> Should not period be an integer?

You are right, I found both versions in the literature (integer in Lothaire, word for instance in http://www.springerlink.com/content/t59071u33573168v/ )

When hearing period without context, I think an integer is expected. Although a word is definitely more useful in papers and you have the integer by taking just the length of the word.

Is something like that stupid?

```
sage: Word('1231').period(word=True)
word: 123
sage: Word('1231').period()
3
```




> What do you think?

I think an alias is not necessary. There is no other period, and anyone looking for that notion will use "period" anyway.



---

archive/issue_comments_139790.json:
```json
{
    "body": "> I think an alias is not necessary. There is no other period, and anyone looking for that notion will use \"period\" anyway.\n\nIf 3 is a period, than 6, 9, 12 are period as well. But I agree that 3 is *the* period. \n\nI would rather suggest the following :\n\n\n```\nsage: Word('1231').period_word()\nword: 123\nsage: Word('1231').period()\n3\n```\n",
    "created_at": "2012-01-10T19:42:02Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12054",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12054#issuecomment-139790",
    "user": "slabbe"
}
```

> I think an alias is not necessary. There is no other period, and anyone looking for that notion will use "period" anyway.

If 3 is a period, than 6, 9, 12 are period as well. But I agree that 3 is *the* period. 

I would rather suggest the following :


```
sage: Word('1231').period_word()
word: 123
sage: Word('1231').period()
3
```




---

archive/issue_comments_139791.json:
```json
{
    "body": "> The goal\n> {{{\n> sage: Word('1231').exponent()\n> 4/3\n> sage: Word('1231').exponent(integer=True)\n> 1\n> }}}\n\nI would prefer the argument to speak about the use or not of the fraction :\n\n\n```\nsage: Word('1231').exponent() # default\n1\nsage: Word('1231').exponent(allow_fraction=True)\n4/3\n```\n\n\nor \n\n\n```\nsage: Word('1231').exponent(allow_fraction=False)\n1\nsage: Word('1231').exponent() # default\n4/3\n```\n",
    "created_at": "2012-01-10T19:46:35Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12054",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12054#issuecomment-139791",
    "user": "slabbe"
}
```

> The goal
> {{{
> sage: Word('1231').exponent()
> 4/3
> sage: Word('1231').exponent(integer=True)
> 1
> }}}

I would prefer the argument to speak about the use or not of the fraction :


```
sage: Word('1231').exponent() # default
1
sage: Word('1231').exponent(allow_fraction=True)
4/3
```


or 


```
sage: Word('1231').exponent(allow_fraction=False)
1
sage: Word('1231').exponent() # default
4/3
```

