# Issue 10627: deal with BooleanMonomialMonoid in polynomial sequences

Issue created by migration from https://trac.sagemath.org/ticket/10680

Original creator: malb

Original creation time: 2011-01-24 10:14:01

Assignee: malb

CC:  msoos bouillaguet

Reported by Mate Soos:


```python
sage: B.<a,b,c,d> = BooleanPolynomialRing()
sage: F0 = PolynomialSequence(map(lambda f: f.lm(),[a,b,c,d]))
sage: F0
[a, b, c, d]
sage: parent(F0[0])
MonomialMonoid of Boolean PolynomialRing in a, b, c, d
sage: type(parent(F0[0]))
<class 'sage.rings.polynomial.pbori.BooleanMonomialMonoid'>
sage: F0.groebner_basis()
AttributeError: 'BooleanMonomialMonoid' object has no attribute 'ideal'
```


In this case the matching ring should be used.


---

Comment by tmonteil created at 2017-07-13 22:12:21

This defect fixed itself with the time. Let me just add a corresponding doctest to avoid future regression.
----
New commits:


---

Comment by tmonteil created at 2017-07-13 22:12:21

Changing status from new to needs_review.


---

Comment by tscrim created at 2017-07-13 23:48:38

Changing status from needs_review to positive_review.


---

Comment by tscrim created at 2017-07-13 23:48:38

LGTM.


---

Comment by vbraun created at 2017-07-26 22:13:47

Resolution: fixed
