# Issue 24725: Gen * AA

Issue created by migration from Trac.

Original creator: vdelecroix

Original creation time: 2018-03-13 11:35:14


```
sage: pari(-1) * AA(2)
-2
sage: pari(-1) * AA(2).sqrt()
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)
<ipython-input-21-b14927ebe1c8> in <module>()
----> 1 pari(-Integer(1)) * AA(Integer(2)).sqrt()

TypeError: unsupported operand type(s) for *: 'cypari2.gen.Gen' and 'AlgebraicReal'

```



---

Comment by jdemeyer created at 2018-03-13 14:28:49

What do you expect the answer to be? A PARI number field element?


---

Comment by vdelecroix created at 2018-03-13 15:03:14

Indeed, I did not realize that the object we got was a Gen and not an element of AA

```
sage: pari(-1) * AA(2)
-2
sage: type(_)
<type 'cypari2.gen.Gen'>
```

