# Issue 24725: Gen * AA

archive/issues_024725.json:
```json
{
    "body": "\n```\nsage: pari(-1) * AA(2)\n-2\nsage: pari(-1) * AA(2).sqrt()\n---------------------------------------------------------------------------\nTypeError                                 Traceback (most recent call last)\n<ipython-input-21-b14927ebe1c8> in <module>()\n----> 1 pari(-Integer(1)) * AA(Integer(2)).sqrt()\n\nTypeError: unsupported operand type(s) for *: 'cypari2.gen.Gen' and 'AlgebraicReal'\n\n```\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/24962\n\n",
    "created_at": "2018-03-13T11:35:14Z",
    "labels": [
        "number theory",
        "major",
        "bug"
    ],
    "title": "Gen * AA",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/24725",
    "user": "vdelecroix"
}
```

```
sage: pari(-1) * AA(2)
-2
sage: pari(-1) * AA(2).sqrt()
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)
<ipython-input-21-b14927ebe1c8> in <module>()
----> 1 pari(-Integer(1)) * AA(Integer(2)).sqrt()

TypeError: unsupported operand type(s) for *: 'cypari2.gen.Gen' and 'AlgebraicReal'

```


Issue created by migration from https://trac.sagemath.org/ticket/24962





---

archive/issue_comments_347078.json:
```json
{
    "body": "What do you expect the answer to be? A PARI number field element?",
    "created_at": "2018-03-13T14:28:49Z",
    "issue": "https://github.com/sagemath/sagetest/issues/24725",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/24725#issuecomment-347078",
    "user": "jdemeyer"
}
```

What do you expect the answer to be? A PARI number field element?



---

archive/issue_comments_347079.json:
```json
{
    "body": "Indeed, I did not realize that the object we got was a Gen and not an element of AA\n\n```\nsage: pari(-1) * AA(2)\n-2\nsage: type(_)\n<type 'cypari2.gen.Gen'>\n```\n",
    "created_at": "2018-03-13T15:03:14Z",
    "issue": "https://github.com/sagemath/sagetest/issues/24725",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/24725#issuecomment-347079",
    "user": "vdelecroix"
}
```

Indeed, I did not realize that the object we got was a Gen and not an element of AA

```
sage: pari(-1) * AA(2)
-2
sage: type(_)
<type 'cypari2.gen.Gen'>
```

