# Issue 29841: Check for duplicate hyperplanes in arrangements over any base ring

Issue created by migration from https://trac.sagemath.org/ticket/30078

Original creator: nailuj

Original creation time: 2020-07-06 13:51:08

CC:  jipilab

Keywords: HyperplaneArrangements

A hyperplane arrangement is supposed to be checked for duplicate hyperplanes.
This works well in `QQ`:


```
sage: H1.<x,y> = HyperplaneArrangements(base_ring=QQ)
sage: A = H1([1,1,0],[2,2,0], warn_duplicates=True)
/usr/local/sagemath/dev/local/lib/python3.7/site-packages/sage/geometry/hyperplane_arrangement/arrangement.py:3352: UserWarning: Input contained 2 hyperplanes, but only 1 are distinct.
  warn('Input contained {0} hyperplanes, but only {1} are distinct.'.format(n, len(hyperplanes)))
sage: A
Arrangement <x + 1>

sage: A.n_regions()
2
```


In other base rings, this check can fail, resulting in false statements about the arrangement:


```
sage: R = QQ[sqrt(2)]
sage: H2.<x,y> = HyperplaneArrangements(base_ring=R)
sage: B = H2([1,1,0],[2,2,0], warn_duplicates=True)
sage: B
Arrangement <x + 1 | 2*x + 2>

sage: B.n_regions()
3
```



---

Comment by nailuj created at 2020-07-06 13:57:28

Changing status from new to needs_info.


---

Comment by nailuj created at 2020-07-06 13:57:28

The error can be tracked down to the `primitive` method for hyperplanes:
It is supposed to rescale linear multiples of hyperplane directions to a canonical "primitive" one.
This is currently not properly implied for every `base_ring`, as it uses `gcd` and `lcm` which for some base rings are just one regardless of the arguments.

Furthermore, the method currently uses `x.denom()` and `x.numer()` instead of `x.denominator()` and `x.numerator()`, two aliases which are only defined for `QQ`.

One solution would be to normalize the hyperplane equations instead of working with `gcd` and `lcm`. But this gives "ugly" equations, contrary to what the `primitive` method is meant to provide.


---

Comment by mkoeppe created at 2020-07-06 19:55:07

New commits:


---

Comment by mkoeppe created at 2021-03-15 22:07:04

Setting new milestone based on a cursory review of ticket status, priority, and last modification date.


---

Comment by mkoeppe created at 2021-07-19 00:44:56

Setting a new milestone for this ticket based on a cursory review.


---

Comment by mkoeppe created at 2021-12-18 19:53:12

Stalled in `needs_review` or `needs_info`; likely won't make it into Sage 9.5.


---

Comment by git created at 2022-03-16 17:03:45

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by nailuj created at 2022-03-16 17:19:56

I kept the existing procedure of `primitive()` for `QQ` (using `numerator`, `denominator`, `gcd` and `lcm`) and introduced a new one for other base rings: The linear expression is scaled such that the first nonzero entry of the normal vector is one or negative one (as before, depending on the original sign and whether the option `signed` is set).

This seems to be compatible with all examples provided in the classes concerned, pass all the existing doctests in the hyperplane_arrangements folder and solve the problem of this ticket. It should also solve ticket #30749. I included suitable tests in the code.

Note however that this does change the coefficients by which hyperplanes are stored in an arrangement not based on `QQ`. This could break user code whenever it relies on a specific scaling of the linear expression. I would argue that fixing the mathematically incorrect statements yielded by the current implementation outweighs this inconvenience.


---

Comment by nailuj created at 2022-03-16 17:19:56

Changing status from needs_info to needs_review.


---

Comment by mkoeppe created at 2022-03-17 16:06:53


```
+        from sage.rings.all import QQ
```

Please use a more specific import, see https://doc.sagemath.org/html/en/developer/packaging_sage_library.html#module-level-runtime-dependencies


---

Comment by mkoeppe created at 2022-03-17 16:07:21

Likewise here:

```
+            from sage.arith.all import lcm, gcd
```



---

Comment by mkoeppe created at 2022-03-17 16:10:47

Also, it would be good if you could rewrite these doctests so that they do not go through `SR`.

```
+        Check that :trac:`30078` is fixed::
+
+            sage: R = QQ[sqrt(2)]
```



---

Comment by mkoeppe created at 2022-03-17 16:11:44

(This is for modularization purposes, see #32432)


---

Comment by mkoeppe created at 2022-03-17 16:14:07

Also the list brackets can be omitted here:

```
+            d = lcm([x.denominator() for x in coeffs])
+            n = gcd([x.numerator() for x in coeffs])
```



---

Comment by mkoeppe created at 2022-03-17 16:18:31

Also `./sage -tox -e pycodestyle src/sage/geometry/hyperplane_arrangement/hyperplane.py` complains about style, some of the warnings are on the code changed in the ticket


---

Comment by mkoeppe created at 2022-03-17 16:18:54

Changing status from needs_review to needs_work.


---

Comment by git created at 2022-03-18 19:04:54

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by git created at 2022-03-18 19:27:31

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by nailuj created at 2022-03-18 19:45:37

Thanks for the helpful suggestions!


Replying to [comment:12 mkoeppe]:
> Also, it would be good if you could rewrite these doctests so that they do not go through `SR`.
> {{{
> +        Check that :trac:`30078` is fixed::
> +
> +            sage: R = QQ[sqrt(2)]
> }}}

I am not really sure about what goes through `SR` and what doesn’t. For the tests to be meaningful, the base ring would have to contain some non-rationals. I replaced `QQ[sqrt(2)]` by `AA`. Is that fine?


---

Comment by nailuj created at 2022-03-18 19:45:37

Changing status from needs_work to needs_review.


---

Comment by mkoeppe created at 2022-03-18 20:00:49


```
sage: ((1+sqrt(5))/2).parent()
Symbolic Ring
sage: ((1+AA(5).sqrt())/2).parent()
Algebraic Real Field
```



---

Comment by mkoeppe created at 2022-03-18 20:03:54

and instead of `QQ[sqrt(2)]` you can write 

```
sage: QuadraticField(2)
Number Field in a with defining polynomial x^2 - 2 with a = 1.414213562373095?
```



---

Comment by git created at 2022-03-18 20:19:46

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by nailuj created at 2022-03-18 20:20:36

Replying to [comment:21 mkoeppe]:
> and instead of `QQ[sqrt(2)]` you can write 
> {{{
> sage: QuadraticField(2)
> Number Field in a with defining polynomial x^2 - 2 with a = 1.414213562373095?
> }}}

Thanks, I didn’t know that!


---

Comment by mkoeppe created at 2022-03-18 20:40:08


```
+            sage: R = QuadraticField(2)
+            sage: H.<x,y> = HyperplaneArrangements(base_ring=R)
+            sage: B = H([1,1,0], [2,2,0], [sqrt(2),sqrt(2),0])
```

Make that `R.<sqrt2> = QuadraticField(2)` and use `sqrt2` instead of `sqrt(2)`


---

Comment by git created at 2022-03-18 20:49:21

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by nailuj created at 2022-03-18 20:56:49

Replying to [comment:24 mkoeppe]:
> {{{
> +            sage: R = QuadraticField(2)
> +            sage: H.<x,y> = HyperplaneArrangements(base_ring=R)
> +            sage: B = H([1,1,0], [2,2,0], [sqrt(2),sqrt(2),0])
> }}}
> Make that `R.<sqrt2> = QuadraticField(2)` and use `sqrt2` instead of `sqrt(2)`

Oh, I see. When sqrt(2) is used, it will initially be a symbolic expression and turned into an element of `R` later, which can be avoided by explicitly using the element of the quadratic field, correct?


---

Comment by mkoeppe created at 2022-03-18 20:58:08

That's right.


---

Comment by mkoeppe created at 2022-03-18 22:25:26

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2022-03-21 23:34:47

Resolution: fixed
