# Issue 19761: missing operator in symbolic series

Issue created by migration from https://trac.sagemath.org/ticket/19998

Original creator: dkrenn

Original creation time: 2016-02-01 12:00:53


```
sage: (x+1).series(x,2)
1 + 1*x
sage: (x+1).series(x,2).operator() is None
True
sage: (x+1).series(x,2).operands()
[1, x]
```

Related (maybe a consequence) is 

```
sage: (x+1).series(x,2) - 1
(1 + 1*x) - 1
sage: ((x+1).series(x,2) - 1).simplify()
...
ValueError: The name "1" is not a valid Python identifier.
```




---

Comment by rws created at 2016-02-05 09:16:32

It is both a consequence of the special status series have in GiNaC. As to the latter, the documentation notes you need to apply series again for getting results:

```
sage: (x+1).series(x,2)
1 + 1*x
sage: _-1
(1 + 1*x) - 1
sage: _.series(x,2)
1*x
```



---

Comment by rws created at 2016-08-03 08:01:42

The best way to give users what they want---apart from always automatically applying the series operator---would be to apply it in `simplify()` if the expression has a series, i.e., `((x+1).series(x,2) - 1).simplify()` should give `1*x` instead of an exception. This means that the operator to-be-applied should have as precision the min of all operators precisions in the expression.
