# Issue 21660: Fix __div__ for multivariate polynomials in K[X][Y]

Issue created by migration from Trac.

Original creator: nborie

Original creation time: 2016-11-18 19:46:02

Polynomial Rings in any number of variables are able to symplify fraction in which the denominator divides the numerator. The following example shows e Newton divided difference (which contains a division but is always a polynomial, it works)

```
sage: K.<x1,x2,x3,x4> = PolynomialRing(QQ, 4)
sage: P = x1^3*x2 - 8*x2*x3*x4^2; P
x1^3*x2 - 8*x2*x3*x4^2
sage: Q = P.parent((P - P(x1,x3,x2,x4))/(x2-x3)); Q
x1^3
sage: Q.parent()
Multivariate Polynomial Ring in x1, x2, x3, x4 over Rational Field
```

Such symplification are not possible in K[X][Y] (it stay ok in K[X,Y]).

```
sage: K.<x> = PolynomialRing(QQ, 1)
sage: L.<y> = PolynomialRing(K, 1)
sage: y/y
y/y
sage: L(y/y)
Traceback (most recent call last):

TypeError: unable to coerce since the denominator is not 1
sage: y.divides(y)
Traceback (most recent call last):

TypeError: no conversion of this ring to a Singular ring defined
sage: y/y == 1
True
sage: y/y - 1
0
sage: (y/y).reduce()
Traceback (most recent call last):

ArithmeticError: unable to reduce because gcd algorithm doesn't work on input
```

