# Issue 20094: MIPVariable misreports its dimension (always 1)

Issue created by migration from Trac.

Original creator: mkoeppe

Original creation time: 2016-03-30 23:14:39

CC:  dimpase vdelecroix jdemeyer yzh

Keywords: lp


```
sage: p = MixedIntegerLinearProgram(solver="glpk")
sage: bar = p.new_variable(name="bar")
sage: bar
MIPVariable of dimension 1
sage: bar[0]
x_0
sage: bar
MIPVariable of dimension 1
sage: bar[1]
x_1
sage: bar
MIPVariable of dimension 1
sage: p.solve()
0.0
sage: bar.values()
[x_0, x_1]
sage: p.get
p.get_backend                 p.get_min                     p.get_relative_objective_gap  
p.get_max                     p.get_objective_value         p.get_values                  
sage: p.get_values(bar)
{0: 0.0, 1: 0.0}
}}} 

I think the print method should also print some useful information, such as the name of the variable.


---

Comment by mkoeppe created at 2016-04-03 07:03:02

Changing type from defect to enhancement.


---

Comment by yzh created at 2021-05-13 15:05:42

Changing status from new to needs_review.


---

Comment by yzh created at 2021-05-13 15:05:42

New commits:


---

Comment by mkoeppe created at 2021-05-13 20:07:52

It should be "0 real components" (plural)


---

Comment by git created at 2021-05-13 20:54:01

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by mkoeppe created at 2021-05-13 22:30:59

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2021-06-06 13:19:38

Resolution: fixed
