# Issue 31995: Callable symbolic expressions do not check arity

archive/issues_031995.json:
```json
{
    "body": "CC:  @davewittemorris @kcrisman\n\n\n```\nsage: nullary = SR( 2^(8/9) - 2^(1/9) ).function()\nsage: nullary                                                                                                                              \n() |--> 2^(8/9) - 2^(1/9)\nsage: nullary(x-1, 2)                                                                                                    \n2^(8/9) - 2^(1/9)\n\nsage: f(x) = 17                                                                                                                            \nsage: f                                                                                                                                    \nx |--> 17\nsage: f()                                                                                                                                  \n17\nsage: f(17,18,19)                                                                                                                          \n17\n```\n\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/32232\n\n",
    "created_at": "2021-07-18T20:11:27Z",
    "labels": [
        "symbolics",
        "major",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-9.8",
    "title": "Callable symbolic expressions do not check arity",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/31995",
    "user": "@mkoeppe"
}
```
CC:  @davewittemorris @kcrisman


```
sage: nullary = SR( 2^(8/9) - 2^(1/9) ).function()
sage: nullary                                                                                                                              
() |--> 2^(8/9) - 2^(1/9)
sage: nullary(x-1, 2)                                                                                                    
2^(8/9) - 2^(1/9)

sage: f(x) = 17                                                                                                                            
sage: f                                                                                                                                    
x |--> 17
sage: f()                                                                                                                                  
17
sage: f(17,18,19)                                                                                                                          
17
```



Issue created by migration from https://trac.sagemath.org/ticket/32232


