# Issue 19669: dilog(RR) should return an element of RR

Issue created by migration from https://trac.sagemath.org/ticket/19906

Original creator: zimmerma

Original creation time: 2016-01-18 09:53:39

in Sage 6.10:

```
sage: dilog(-1.0)
-1/12*pi^2
sage: dilog(1)
1/6*pi^2
sage: dilog(0.5)
1/12*pi^2 - 1/2*log(2)^2
```

we should not get symbolic output with floating-point input.


---

Comment by rws created at 2016-12-05 08:55:17

Changing status from new to needs_review.


---

Comment by rws created at 2016-12-05 08:55:17

This is fixed in Pynac git master. This ticket has doctests but they depend on a pynac-0.7.2 upgade.
----
New commits:


---

Comment by vdelecroix created at 2016-12-19 08:28:49

You need to set your name in the Authors field.


---

Comment by vdelecroix created at 2016-12-19 08:31:11

Could you be more careful and actually check the parent of the output? In other words something like

```
sage: y = dilog( RealField(13)(1.0))
sage: assert parent(y) is RealField(13)
sage: y = dilog( RealField(100)(1.0))
sage: assert parent(y) is RealField(100)
```

I don't know to which extent this function is available on intervals, balls and complexes but they should be tested as well with various precision.


---

Comment by rws created at 2016-12-19 16:20:34

Changing status from needs_review to needs_work.


---

Comment by rws created at 2017-04-26 07:21:26

Note also

```
sage: polylog(3,RBF(1.1))      # there is a polylog RBF member!
1.37625299668538 - 0.0142691615444952*I
sage: dilog(RBF(1.1))
1.96199910130557 - 0.299425760685590*I
```

----
New commits:


---

Comment by zimmerma created at 2017-04-26 07:32:46

For me, the last commit 4f451a4 fixes the issue raised in comment [comment:6].
We could proceed and give a positive review. (The case of intervals, balls and complexes can be dealt with in a different ticket.)

Paul


---

Comment by rws created at 2017-04-26 07:58:11

Replying to [comment:10 zimmerma]:
> For me, the last commit 4f451a4 fixes the issue raised in comment [comment:6].
> We could proceed and give a positive review. (The case of intervals, balls and complexes can be dealt with in a different ticket.)

No, actually the given doctest fails (that's why I didn't set needs review). But the notion that `dilog(RealField(13)(1.0))` should return anything real I commented on in #18386#comment:8. More obviously, demanding that `dilog(RealField(13)(1.1))` should have `RealField(13)` as parent is a red herring because the result just is complex.

However, there are still issues with `polylog` (and thus `dilog`) , I just reopened https://github.com/pynac/pynac/issues/219 to fix them. I believe #18386 is more fitting to be the ticket to add a doctest once it's fixed so I propose to make this a duplicate. As you seem to be of similar attitude I take the liberty to set positive all at once.


---

Comment by rws created at 2017-04-26 07:58:11

Changing status from needs_work to positive_review.


---

Comment by zimmerma created at 2017-04-26 08:08:57

since the initial issue in the description of this ticket is now fixed (here with Sage 7.6):

```
sage: dilog(-1.0)
-0.822467033424113
sage: dilog(0.5)
0.582240526465012
```

I would simply add those two tests in the doctests, maybe with one test checking the parent:

```
sage: y = dilog(RealField(13)(0.5))
sage: parent(y)
Real Field with 13 bits of precision
```

and indeed defer to #18386 the other issues (branch point, complex values).


---

Comment by embray created at 2017-07-13 07:54:31

Resolution: wontfix


---

Comment by embray created at 2017-07-13 07:54:31

Closing tickets in the sage-duplicate/invalid/wontfix module with positive_review (i.e. someone has confirmed they should be closed).
