# Issue 18149: polylog quirks

Issue created by migration from Trac.

Original creator: rws

Original creation time: 2015-05-09 08:51:04

CC:  fbissey

Keywords: pynac special

The `polylog` function (from Pynac) treats `1.0` like `1` and does not immediately `evalf` with some numeric arguments. 

```
sage: polylog(2,1)
1/6*pi^2
sage: polylog(2.,1)
1.64493406684823
sage: polylog(2,1.0)
1/6*pi^2
sage: polylog(2,0.9)
polylog(2, 0.900000000000000)

```



---

Comment by paulmasson created at 2016-07-23 20:54:04

Changing status from new to needs_review.


---

Comment by paulmasson created at 2016-07-28 01:06:59

Changing status from needs_review to needs_work.


---

Comment by paulmasson created at 2016-07-28 01:06:59

Ralf, there was a typo in the description of #21034 pointing to #18368 rather than this ticket.

I'm finding this behavior odd:


```
sage: polylog(2,.9999999999999999)
1.64493406684822
sage: polylog(2,1.)
NaN - NaN*I
```


This doesn't look fixed upstream to me: `evalf` needs to return a numeric value.

The doctest in `functions/log.py` captures the current behavior, but needs to be updated before this ticket can be closed.


---

Comment by rws created at 2016-07-28 13:08:41

Polylog has a branch point/discontinuity at arguments (2,1). Anyway, we're just taking what arb is giving us:

```
sage: RBF=ComplexBallField(53)
sage: RBF(1.5).polylog(RBF(2.5))
[2.27833425640 +/- 2.25e-12] + [-0.61016023975 +/- 3.09e-12]*I
sage: RBF(.99999999).polylog(RBF(2.))
[1.6449338726414 +/- 9.23e-14] + [+/- 2.46e-13]*I
sage: RBF(1.).polylog(RBF(2.))
nan + nan*I
sage: RBF(1.00000001).polylog(RBF(2.))
[1.644934261055 +/- 1.08e-13] + [-3.1416e-8 +/- 3.19e-13]*I
sage: polylog(2,1)
1/6*pi^2
```

This is very sensible because if you need the exact value say so, and if you need an inexact value to 53 (or any) digits the result cannot be given in that precision so it's NaN. I'll concede that, similar to #19439 it may be desired to return the symbolic NaN.


---

Comment by rws created at 2016-11-06 15:09:46

Changing status from needs_work to needs_review.


---

Comment by rws created at 2016-11-06 15:09:46

Replying to [comment:6 paulmasson]:
> I'm finding this behavior odd:
> 
> {{{
> sage: polylog(2,1.)
> NaN - NaN*I
> }}}
> 
> This doesn't look fixed upstream to me: `evalf` needs to return a numeric value.

Evalf does return a numeric value, too:

```
sage: polylog(2,1.0).n()
NaN - NaN*I
sage: type(_)
<type 'sage.rings.complex_number.ComplexNumber'>
```

so, together with my previous answer I think this ticket can be closed.


---

Comment by rws created at 2017-04-18 07:08:54

Changing status from needs_review to needs_work.


---

Comment by rws created at 2017-04-18 07:08:54

That was badly mistyped and misinterpreted by me, so back to the issue.


---

Comment by rws created at 2017-04-26 07:27:15

Note also

```
sage: polylog(3,RBF(1.1))      # there is a polylog RBF member!
1.37625299668538 - 0.0142691615444952*I
sage: dilog(RBF(1.1))
1.96199910130557 - 0.299425760685590*I
```



---

Comment by rws created at 2017-05-04 07:39:31

I believe this is fixed in Pynac master. The tests now also include ball field elements and all open issues from #19906.
----
New commits:


---

Comment by rws created at 2017-05-10 07:13:28

Changing status from needs_work to needs_review.


---

Comment by rws created at 2017-05-10 07:13:28

New commits:


---

Comment by rws created at 2017-05-25 06:20:20

Changing status from needs_review to needs_work.


---

Comment by rws created at 2017-05-25 06:20:20

Fails tests with reduced precision.


---

Comment by git created at 2017-05-25 06:21:55

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by rws created at 2017-05-25 15:26:09

We depend on #23077 and pynac-0.7.8 for improved handling of complex floats.


---

Comment by rws created at 2017-06-23 05:56:46

Now that all dependencies are merged, let the patchbots test it and please review.


---

Comment by rws created at 2017-06-23 05:56:46

Changing status from needs_work to needs_review.


---

Comment by jhpalmieri created at 2017-08-01 23:06:49

See #23565 for some changes to the behavior of polylog. Are those changes improvements?


---

Comment by dimpase created at 2017-08-02 12:24:19

The biggest mystery here to me is how pynac is being able to use arb...


---

Comment by dimpase created at 2017-08-02 13:49:17

the doctests added here, with correct (no `NaN`s!) outputs, are being added to #23565


---

Comment by dimpase created at 2017-08-02 13:49:17

Changing status from needs_review to positive_review.


---

Comment by rws created at 2017-08-02 15:48:07

Replying to [comment:23 dimpase]:
> The biggest mystery here to me is how pynac is being able to use arb...

Pynac calls Sage's arb interface via the Python C API.


---

Comment by dimpase created at 2017-08-02 15:55:21

Replying to [comment:25 rws]:
> Replying to [comment:23 dimpase]:
> > The biggest mystery here to me is how pynac is being able to use arb...
> 
> Pynac calls Sage's arb interface via the Python C API.

I see, thanks, this explains why libpynac is not linked to libarb, contrary to what one would expect.


---

Comment by fbissey created at 2017-08-23 02:06:30

Just rebasing. Nothing changed.
----
New commits:


---

Comment by vbraun created at 2017-10-05 06:55:59

Resolution: fixed
