# Issue 20198: factorisation of polynomials over integers has wrong parent

Issue created by migration from https://trac.sagemath.org/ticket/20435

Original creator: chapoton

Original creation time: 2016-04-13 11:30:56

CC:  tscrim jdemeyer


```
sage: x,y=polygen(ZZ,'x,y')
sage: p=x**2-y**2
sage: p.parent()
Multivariate Polynomial Ring in x, y over Integer Ring
sage: factor(p)
(x - y) * (x + y)
sage: factor(p)[0][0].parent()
Multivariate Polynomial Ring in x, y over Multivariate Polynomial Ring in x, y over Integer Ring
```



---

Comment by chapoton created at 2016-04-14 07:11:06

Changing priority from major to critical.


---

Comment by chapoton created at 2016-04-14 07:11:06

Changing keywords from "" to "factor, polynomial, parent".


---

Comment by chapoton created at 2016-04-15 07:50:32

caused by the line

```
+                FF = [(f[0].change_ring(self._parent), f[1]) for f in F]
```

in #17840


---

Comment by chapoton created at 2016-04-15 07:56:08

New commits:


---

Comment by chapoton created at 2016-04-15 07:56:08

Changing status from new to needs_review.


---

Comment by git created at 2016-04-15 08:01:24

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by bruno created at 2016-04-15 09:15:33

Sorry for that! The correction looks good to me.

P.S.: I suspected that using `f[0].change_ring(self._parent.base_ring())` would have been faster than the conversion `self._parent(f[0])` but it appears not to be the case!


---

Comment by bruno created at 2016-04-15 09:15:33

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2016-04-16 10:26:04

Resolution: fixed
