# Issue 14644: Inconsistencies with FreeAlgebra

Issue created by migration from https://trac.sagemath.org/ticket/14848

Original creator: ppurka

Original creation time: 2013-07-02 06:17:08

Assignee: AlexGhitza

CC:  nthiery

This ticket is "inspired" by [this ask.sagemath question](http://ask.sagemath.org/question/2760/products-in-a-free-algebra).

1. First, there should be an easy way to get the variables out of an expression in FreeAlgebra. Compare with the output of polynomial ring.

```
sage: F.<x,y>=FreeAlgebra(ZZ)  
sage: g=4+3*x^7*y^10*x^13
sage: g.variables()            # <------------   Need this
sage: h=g._FreeAlgebraElement__monomial_coefficients # This is what we need to do currently
sage: h.items()[1][0]._element_list     # and do more post processing on the output.
[(0, 7), (1, 10), (0, 13)]

# Compare with polynomial ring
sage: F.<x,y> = PolynomialRing(ZZ)
sage: g=4+3*x^7*y^10*x^13
sage: g.variables()
(x, y)
sage: g=4+3*x^7
sage: g.variables()
(x,)
```

2. The element `x<sup>7*y</sup>10*x^13` does not belong to the `FreeAlgebra` class once it is extracted from the expression. It belongs to `FreeMonoid`. I think the parent of it should be the same even after we extract it.

```
sage: F.<x,y>=FreeAlgebra(ZZ)  
sage: g=4+3*x^7*y^10*x^13
sage: h=g._FreeAlgebraElement__monomial_coefficients
sage: h
{1: 4, x^7*y^10*x^13: 3}
sage: hh = h.items()[1][0]; hh
x^7*y^10*x^13
sage: hh.parent()
Free monoid on 2 generators (x, y)
```



---

Comment by broken_symlink created at 2013-07-02 12:18:03

In regards to my question on ask.sagemath, what I would have really liked was if elements supported indexing. So for example, g[0] should return 4. g[1] should return 3*x<sup>7*y</sup>10*x^13 and then g[1][0] should return 3 i guess, g[1][1] should return x^7 and so on. After that, it would be nice to have a way to iterate over 4+3*x<sup>7*y</sup>10*x^13. Maybe we would need len() for that? Has there ever been any talk about implementing something like this?


---

Comment by ppurka created at 2013-07-02 12:27:15

I think this kind of indexing has never been discussed or implemented. There could be several reasons, one of the foremost being that the order in which you enter the expression is not preserved.

```
sage: F.<x,y>=FreeAlgebra(ZZ)
sage: g = x^5 * y^4 + 3
sage: g
3 + x^5*y^4
```



---

Comment by sam created at 2013-09-06 20:50:00

elements support iteration, but not indexing, which is appropriate because as ppurka said there is no real ordering on the expressions.


```
sage: F.<x,y> = FreeAlgebra(ZZ)
sage: g = x^5 * y^4 + 3
sage: for m in g:
....:     print m
....: 
(3, 1)
(1, x^5*y^4)
sage: list(g)
[(3, 1), (1, x^5*y^4)]
```


all works fine.


---

Comment by ppurka created at 2013-10-12 07:55:19

Changing status from new to needs_review.


---

Comment by ppurka created at 2013-10-12 07:55:19

Marking as invalid.


---

Comment by ppurka created at 2013-10-12 07:56:45

Changing status from needs_review to needs_work.


---

Comment by ppurka created at 2013-10-12 07:56:45

Oh. Sorry. I forgot that the original questions were very different from the discussion that ensued.


---

Comment by nbruin created at 2013-10-12 15:16:01

Regarding point 1: Accessing underscore methods is bound to make your life hard: the underscore marks that these are methods/attributes for internal use. The interface is via iteration and using that one can easily accomplish the task:

```
sage: tuple({n[0] for m in g for n in m[1]})
(y, x)
```

(i.e., iterate over the terms making up the algebra element, extract the monomial and iterate over that to extract the variables that occur in them).

Whether this needs to be wrapped in a method: The operation isn't very natural: The parent will naturally tell you which variables CAN occur in in algebra elements. Are the ones that don't have all those variables really so special that there needs to be a method to query about that?

For polynomials, the same argument holds, but there it was probably added because some beginners will tend to think of polynomials in terms of SR, where the variables occurring is really a property of the expression and not really of SR.

Concerning point 2: The nested operation above shows why it's natural to return monomials NOT as elements of the algebra: iterating over an algebra element gives the pairs, iterating over a monomial gives variable-exponent pairs. The separation actually provides easier access to the underlying data.

For normal polynomial rings this is probably avoided for efficiency reasons, but you quickly notice that it's a little inconvenient: you end up testing quite a bit whether given polynomials are actually monomials, where doing this via a type check would often in principle be quite doable.


---

Comment by ppurka created at 2013-10-13 08:15:23

1. The iteration operation was not clear to me at all, and it definitely not possible for beginner to figure it out. By a beginner, I don't mean a beginner to programming - more like a beginner to Sage, or this specific implementation in Sage. I don't find this kind of iteration documented anywhere, even for polynomial rings - maybe it is hidden somewhere. Secondly, the parent `FreeAlgebra` does have `variable_name` and `variable_names` methods. Both are undocumented. The first one, for some weird reason, returns only the first variable as a string. The second one returns all the variables as strings. This is quite useless for programming purposes. It is _maybe_ ok for interactive use, where one can look at this output and then decide to run the `F.inject_variables()` once one is sure it won't clobber existing variables.

2. Checking for monomials can be easily done using the list comprehension you provided. Or, even better for efficiency reasons - a `for` loop with an `enumerate` that returns `False` as soon as it encounters a second tuple.

```python
def is_monomial(self):
    for i,_ in enumerate(self):
        if i == 1:
             return False
    return True
```



---

Comment by tscrim created at 2014-04-02 01:22:16

Changing status from needs_work to needs_review.


---

Comment by tscrim created at 2014-04-02 01:22:16

I've made `FreeAlgebra` inherit from `CombinatorialFreeModule`; it was close enough to it to begin with and is something Nicolas and I have wanted to do. I've had to hack together a combination of `CombinatorialFreeModuleElement` and `AlgebraElement` to pass a doctest in `matrix0.pyx` where `FreeAlgebra` is used as a base ring (this inspired #15947). So iterating through an element of `FreeAlgera` gives `index,coeff` now (finally consistency! this had bugged me a few times). I've also added a `variables` method as I don't think it does much harm to have it and `support` returns the monomials that occur.

Regarding point 2, you can now use the `monomial_coefficients()` to iterate over pairs (monomial in free algebra, coefficient)] (well...TBH actually it's a `dict`, so you need an additional `items()`). Also I agree with Nils' opinion.
----
New commits:


---

Comment by git created at 2014-04-02 01:26:57

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by nthiery created at 2014-04-02 20:05:58

Replying to [comment:8 tscrim]:
> I've made `FreeAlgebra` inherit from `CombinatorialFreeModule`; it was close enough to it to begin with and is something Nicolas and I have wanted to do.

Yeah!

> I've had to hack together a combination of `CombinatorialFreeModuleElement` and `AlgebraElement` to pass a doctest in `matrix0.pyx` where `FreeAlgebra` is used as a base ring (this inspired #15947).

Any chance to get rid of the use of AlgebraElement there altogether?

Cheers,
                      Nicolas


---

Comment by tscrim created at 2014-04-02 20:21:27

Replying to [comment:10 nthiery]:
> Any chance to get rid of the use of AlgebraElement there altogether?

Alas, no. We'd have to do something with `_rmul_` and `_lmul_` of the matrices without introducing a speed regression, which IDK what the best way to do it will be. The alternative would be to remove/change those failing doctests. I've posted an idea I've just had to #15947.


---

Comment by git created at 2014-04-15 02:16:49

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by ppurka created at 2014-04-15 13:03:35

I got one error in doctests:

```
sage -t --long src/sage/algebras/algebra.py
**********************************************************************
File "src/sage/algebras/algebra.py", line 29, in sage.algebras.algebra.is_Algebra
Failed example:
    is_Algebra(R)
Expected:
    True
Got:
    False
**********************************************************************
```


Point 1. in description is fixed, but I guess it is harder to fix point 2. So, other than this doctest, the patch looks OK to me.


---

Comment by ppurka created at 2014-04-15 13:03:35

Changing status from needs_review to needs_work.


---

Comment by git created at 2014-04-15 15:46:27

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by tscrim created at 2014-04-15 15:47:38

Fixed (and also some doctests in `categories/rings.py` that I found).


---

Comment by ppurka created at 2014-04-16 09:03:22

I am surprised. I have two questions

1. Why does this patch affect `categories/rings.py`?
2. Can you be more specific with `Exception`? In which case did you run into the `Exception`? `AttributeError`? Can you include it in a doctest?


---

Comment by tscrim created at 2014-04-16 13:56:54

Replying to [comment:16 ppurka]:
> I am surprised. I have two questions
> 
> 1. Why does this patch affect `categories/rings.py`?

It's just a doctest and it's because I swapped the order when iterating over the objects (i.e., it became index, coefficient whereas before it was coefficient, index).

> 2. Can you be more specific with `Exception`? In which case did you run into the `Exception`? `AttributeError`? Can you include it in a doctest?

There's a doctest in `categories/commutative_ring_ideals.py` which tries to pass off (incorrectly) `Partitions(4)` as a commutative ring, but the `is_Algebra` fails with a `TypeError`. However, it could also fail with other errors and I didn't want the `is_Algebra` to error out for similar reasoning to a `__contains__()` check. We can add additional doctests to `is_Algebra` but I think we're already covered by other parts of the library.


---

Comment by tscrim created at 2014-04-16 13:56:54

Changing status from needs_work to needs_review.


---

Comment by ppurka created at 2014-04-18 03:33:23

Ok. Then. Setting it to positive review.


---

Comment by ppurka created at 2014-04-18 03:33:23

Changing status from needs_review to positive_review.


---

Comment by tscrim created at 2014-04-18 03:36:16

Thank you for doing the review.


---

Comment by vbraun created at 2014-04-20 12:24:21

Lots of doctests failures


---

Comment by vbraun created at 2014-04-20 12:24:21

Changing status from positive_review to needs_work.


---

Comment by tscrim created at 2014-04-20 12:35:08

Can you list which files?


---

Comment by vbraun created at 2014-04-20 13:24:26

Sorry, too late. But there was enough breakage that you should run the whole testsuite.


---

Comment by tscrim created at 2014-04-20 14:37:33

This is mostly for my records. Here's the list I got that were "bad" errors:

```
sage -t rings/quotient_ring.py  # 8 doctests failed
sage -t rings/ring.pyx  # 3 doctests failed
sage -t structure/sage_object.pyx  # 1 doctest failed
sage -t structure/factorization.py  # 1 doctest failed
```

The pickling one is going to be the most fun to deal with.

These were from dictionary orderings (likely from hash values):

```
sage -t libs/singular/groebner_strategy.pyx  # 2 doctests failed
sage -t rings/polynomial/plural.pyx  # 5 doctests failed
sage -t rings/polynomial/multi_polynomial_ideal.py  # 13 doctests failed
```


One I don't think is related:

```
sage -t doctest/test.py  # 1 doctest failed
```

These seem to be maxima related (i.e. local to my setup so I'm going to ignore them):

```
sage -t tests/french_book/integration_doctest.py  # 1 doctest failed
sage -t calculus/desolvers.py  # 8 doctests failed
sage -t /home/travis/sage/src/doc/en/prep/Quickstarts/Differential-Equations.rst  # 2 doctests failed
sage -t /home/travis/sage/src/doc/en/constructions/calculus.rst  # 4 doctests failed
```



---

Comment by git created at 2014-04-22 16:11:52

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by tscrim created at 2014-04-22 16:12:40

Volker, double-check that I got them all please.


---

Comment by tscrim created at 2014-04-22 16:12:40

Changing status from needs_work to positive_review.


---

Comment by vbraun created at 2014-04-22 22:02:31

Resolution: fixed
