# Issue 15123: Make RealIntervalField more reliable

Issue created by migration from Trac.

Original creator: tmonteil

Original creation time: 2013-11-06 12:15:54

Assignee: tmonteil

CC:  vdelecroix

Keywords: RIF

`Real interval field` relies on MPFI, which is reliable. But Sage uses it in a wrong way in various places in the code, making the use of `Real interval field` not reliable, hence providing a wrong feeling of security. Here are two examples:


```
sage: max(RIF(2,3), RIF(1,4)).endpoints()
(2.00000000000000, 3.00000000000000)
```



```
sage: x =  -(25510582*pi - 80143857)/(52746197*pi - 165707065)
sage: int(x)
ValueError: Calling floor() on infinity or NaN
```


(this example is related to this ask question : http://ask.sagemath.org/question/3179/continued-fraction-of-pi-by-hand)

Instead of fixing small holes when we fall on them, the aim of this ticket is to audit Sage use of `RealIntervalField` (list to be enlarged):

 - check that all python builtin functions are overwritten for `RealIntervalField` (or work consistently by default).
 - grep the Sage source code and check that `RealIntervalField` is not misused.


---

Comment by vdelecroix created at 2013-11-08 03:44:48

The first problem is I think a problem of the builtin max in Python (which never fails).

For the second problem, you should use floor and not int. But anyway, there is a bug in the function as x_interval.upper().floor() may fail with a `ValueError` if the upper is infinity (line 582 and 583 in sage/functions/other.py). I guess one should fix floor at that point.

Good luck!


---

Comment by jdemeyer created at 2016-01-19 21:33:57

With Sage 7.0:

```
sage: x =  -(25510582*pi - 80143857)/(52746197*pi - 165707065)
sage: int(x)
1
```



---

Comment by jdemeyer created at 2016-01-19 21:33:57

Changing status from new to needs_review.


---

Comment by jdemeyer created at 2016-01-19 21:34:02

Changing status from needs_review to positive_review.


---

Comment by jdemeyer created at 2016-01-19 21:36:13

We cannot fix this (that is just how Python's `max()` works):

```
sage: max(RIF(2,3), RIF(1,4)).endpoints()
(2.00000000000000, 3.00000000000000)
```

but this works:

```
sage: RIF(2,3).max(RIF(1,4)).endpoints()
(2.00000000000000, 4.00000000000000)
```



---

Comment by tmonteil created at 2016-01-20 21:04:03

I wonder whether it is acceptable to overwrite the `max` fuction, by using `__max__` method if available and the builtin Python `max` otherwise. Also whether could-it be requested to Python to allow such override as part of the language ?


Note that this particular issue with `max` also exists for the symbolic ring.


---

Comment by tmonteil created at 2016-01-20 21:04:03

Changing status from positive_review to needs_info.
