# Issue 21337: simplify_log() does not

Issue created by migration from https://trac.sagemath.org/ticket/21574

Original creator: rws

Original creation time: 2016-09-23 06:47:34


```
sage: log(8)/log(2)
log(8)/log(2)
sage: _.simplify_log()
log(8)/log(2)
sage: log(8,16)
log(8)/log(16)
sage: _.simplify_full()
log(8)/log(16)
sage: _.simplify_log()
log(8)/log(16)
sage: log(x^3)/log(x)
log(x^3)/log(x)
sage: _.simplify_log()
log(x^3)/log(x)
sage: log(8)/log(2)
log(8)/log(2)
sage: _.simplify_log('all')
log(8^(1/log(2)))
```

Of course these simple cases should be handled, even if the description of `simplify_log` defines specific defaults of behaviour. At least `simplify_full()` should do it by calling some helper.
