# Issue 14489: Coercion of power series to symbolic ring

archive/issues_014489.json:
```json
{
    "body": "Assignee: @burcin\n\nCoercing a power series to the symbolic ring doesn't work as expected:\n\n\n```\nsage: R.<t> = PowerSeriesRing(QQ)\nsage: p = R([1,2,3])\nsage: SR(p).variables()\n()\nsage: diff(SR(p))\n0\n```\n\n\nPerhaps it could be converted to a polynomial first and then coerced to the symbolic ring?\n\n\n```\nsage: SR(p.polynomial()).variables()\n(t,)\nsage: diff(SR(p.polynomial()))      \n6*t + 2\n```\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/14693\n\n",
    "created_at": "2013-06-05T20:05:43Z",
    "labels": [
        "component: symbolics",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-6.4",
    "title": "Coercion of power series to symbolic ring",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/14489",
    "user": "https://github.com/eviatarbach"
}
```
Assignee: @burcin

Coercing a power series to the symbolic ring doesn't work as expected:


```
sage: R.<t> = PowerSeriesRing(QQ)
sage: p = R([1,2,3])
sage: SR(p).variables()
()
sage: diff(SR(p))
0
```


Perhaps it could be converted to a polynomial first and then coerced to the symbolic ring?


```
sage: SR(p.polynomial()).variables()
(t,)
sage: diff(SR(p.polynomial()))      
6*t + 2
```


Issue created by migration from https://trac.sagemath.org/ticket/14693





---

archive/issue_comments_183141.json:
```json
{
    "body": "#15707 is related.",
    "created_at": "2014-02-12T08:44:30Z",
    "issue": "https://github.com/sagemath/sagetest/issues/14489",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/14489#issuecomment-183141",
    "user": "https://github.com/eviatarbach"
}
```

#15707 is related.



---

archive/issue_comments_183142.json:
```json
{
    "body": "The examples here refer to conversion; not coercion. That fact that power series over \"basic\" ring types such as rationals or integers don't convert into SR is, I think, a shortcoming that can be fixed. The main thing is to find how to represent the relevant \"big-Oh\" in SR. Maxima does have power series, so there is at least one back-end that provides some support: [http://maxima.sourceforge.net/docs/manual/en/maxima_28.html#IDX1221](http://maxima.sourceforge.net/docs/manual/en/maxima_28.html#IDX1221). Linking up maxima's internal format with sage might need some work:\n\n```\nsage: F=maxima_calculus('taylor(sin(x),x,0,3)')\nsage: F\nx-x^3/6\nsage: F.ecl()\n<ECL: ((MRAT SIMP (((%SIN SIMP) $X) $X) (#:|sin(x)2136| #:X2137)\n  (($X ((3 . 1)) 0 NIL #:X2137 . 2)) TRUNC)\n PS (#:X2137 . 2) ((3 . 1)) ((1 . 1) 1 . 1) ((3 . 1) -1 . 6))>\nsage: F-x+x^3/6\n+0\nsage: (F-x+x^3/6).ecl()\n<ECL: ((MRAT SIMP ($X) (#:X2145) (($X ((3 . 1)) 0 NIL #:X2145 . 1)) TRUNC) 0 . 1)>\n```\n\n(in maxima this prints with dots, so it knows it's a power series)",
    "created_at": "2014-02-12T16:32:12Z",
    "issue": "https://github.com/sagemath/sagetest/issues/14489",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/14489#issuecomment-183142",
    "user": "https://github.com/nbruin"
}
```

The examples here refer to conversion; not coercion. That fact that power series over "basic" ring types such as rationals or integers don't convert into SR is, I think, a shortcoming that can be fixed. The main thing is to find how to represent the relevant "big-Oh" in SR. Maxima does have power series, so there is at least one back-end that provides some support: [http://maxima.sourceforge.net/docs/manual/en/maxima_28.html#IDX1221](http://maxima.sourceforge.net/docs/manual/en/maxima_28.html#IDX1221). Linking up maxima's internal format with sage might need some work:

```
sage: F=maxima_calculus('taylor(sin(x),x,0,3)')
sage: F
x-x^3/6
sage: F.ecl()
<ECL: ((MRAT SIMP (((%SIN SIMP) $X) $X) (#:|sin(x)2136| #:X2137)
  (($X ((3 . 1)) 0 NIL #:X2137 . 2)) TRUNC)
 PS (#:X2137 . 2) ((3 . 1)) ((1 . 1) 1 . 1) ((3 . 1) -1 . 6))>
sage: F-x+x^3/6
+0
sage: (F-x+x^3/6).ecl()
<ECL: ((MRAT SIMP ($X) (#:X2145) (($X ((3 . 1)) 0 NIL #:X2145 . 1)) TRUNC) 0 . 1)>
```

(in maxima this prints with dots, so it knows it's a power series)



---

archive/issue_comments_183143.json:
```json
{
    "body": "Changing status from new to needs_info.",
    "created_at": "2016-07-09T15:05:57Z",
    "issue": "https://github.com/sagemath/sagetest/issues/14489",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/14489#issuecomment-183143",
    "user": "https://trac.sagemath.org/admin/accounts/users/jakobkroeker"
}
```

Changing status from new to needs_info.



---

archive/issue_comments_183144.json:
```json
{
    "body": "seems fixed?",
    "created_at": "2016-07-09T15:05:57Z",
    "issue": "https://github.com/sagemath/sagetest/issues/14489",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/14489#issuecomment-183144",
    "user": "https://trac.sagemath.org/admin/accounts/users/jakobkroeker"
}
```

seems fixed?
