# Issue 15282: Wrong enclosing intervals for real algebraic numbers

Issue created by migration from https://trac.sagemath.org/ticket/15519

Original creator: mmezzarobba

Original creation time: 2013-12-15 10:31:49

Consider a polynomial with two close roots:

```
sage: x = polygen(QQ); pol = x^7-2*(10^20*x-1)^2
sage: pol.roots(RIF)
[(9.999999999999999999999999999999999999999999999999999999999999999999999?e-21,
  1),
 (1.000000000000000000000000000000000000000000000000000000000000000000001?e-20,
  1),
 (1.14869835499703500680?e8, 1)]
```

and represent one of these roots as an element of `AA`:

```
sage: a = AA.polynomial_root(pol, RIF((0.9e-20,1.0e-20)))
```

Then the upper bound stored internally is smaller than the actual root:

```
sage: a._descr._interval.upper()
9.99999999999999946e-21
```

and indeed we have:

```
sage: pol(a._descr._interval.lower().exact_rational()).sign()
-1
sage: pol(a._descr._interval.lower().exact_rational()).sign()
-1
sage: sage: a.n(50)
...
ValueError: Refining interval that does not bound unique root!
```



---

Comment by mmezzarobba created at 2013-12-18 07:28:06

Stupid me forgot that the upper bound of `RealIntervalField(p)((.9e-20,1.e-20))` is actually the `double` closest to `1.0`, i.e. `9.999999999999999451532714542...e-21`. Sorry for the noise.


---

Comment by tscrim created at 2013-12-21 07:00:19

Changing status from new to needs_review.


---

Comment by tscrim created at 2013-12-21 07:00:44

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2013-12-21 19:00:56

Resolution: invalid
