# Issue 27395: gmpy2.mpq can not be initialized from a pair of Sage integers

Issue created by migration from https://trac.sagemath.org/ticket/27632

Original creator: vdelecroix

Original creation time: 2019-04-10 07:37:17

CC:  vklein

works fine from integers

```
sage: gmpy2.mpq(12r)
mpq(12,1)
sage: gmpy2.mpq(12)
mpq(12,1)
```

but not for pairs

```
sage: gmpy2.mpq(2r,3r)
mpq(2,3)
sage: gmpy2.mpq(2,3)
Traceback (most recent call last):
...
TypeError: cannot convert object to mpq
```



---

Comment by vklein created at 2019-04-10 07:55:58

Indeed.\\
And it's clearly a gmpy2 issue :


```
>>> from gmpy2 import mpz
>>> import gmpy2
>>> class One:
...     def __mpz__(self): return mpz(1)
... 
>>> class Two:
...     def __mpz__(self): return mpz(2)
... 
>>> gmpy2.mpq(Two())
mpq(2,1)
>>> gmpy2.mpq(One(), Two())
Traceback (most recent call last):
  File "<stdin>", line 1, in <module>
TypeError: cannot convert object to mpq

```


I will look at this.


---

Comment by vklein created at 2019-04-11 13:16:01

As the next beta release is coming soon i don't think a patch is necessary


---

Comment by vklein created at 2019-04-11 13:16:01

Changing keywords from "" to "thursdaysbdx".


---

Comment by vdelecroix created at 2019-04-11 13:17:54

Good. Thank you of taking care of it!


---

Comment by vklein created at 2019-06-06 14:40:13

Changing status from new to needs_review.


---

Comment by vklein created at 2019-06-06 14:40:13

No point in keeping this ticket. 
Unless one want to add some doctests to remember that the problem is fixed.


---

Comment by vdelecroix created at 2019-06-06 14:43:22

Resolution: wontfix
