# Issue 25343: Symbolic partial fraction decomposition failures

Issue created by migration from Trac.

Original creator: rws

Original creation time: 2018-06-14 16:01:27

In the first example, replacing `y` with `a` makes partial fraction decomposition fail:

```
sage: (1/(x+y)/x).partial_fraction()
-1/((x + y)*y) + 1/(x*y)

sage: (1/(a+x)/x).partial_fraction()
1/((a + x)*x)
```

This occurs with any fraction having two variables of that or more negative degree, and the var with lowest degree being lexicographically greater than the others:

```
sage: (1/(c+b)^3/b^3).partial_fraction()
-6/((b + c)*c^5) + 6/(b*c^5) - 3/((b + c)^2*c^4) - 3/(b^2*c^4) - 1/((b + c)^3*c^3) + 1/(b^3*c^3)

sage: (1/(a+b)^3/b^3).partial_fraction()
1/((a + b)^3*b^3)
```




---

Comment by rws created at 2018-06-14 16:03:42

Changing status from new to needs_review.


---

Comment by rws created at 2018-06-14 16:03:42

Invalid, because the main variable should be given as argument.


---

Comment by rws created at 2018-06-14 16:04:06

Changing status from needs_review to positive_review.


---

Comment by embray created at 2019-02-26 13:58:00

Presuming these are all correctly reviewed as either duplicate, invalid, or wontfix.


---

Comment by embray created at 2019-02-26 13:58:00

Resolution: invalid
