# Issue 18105: numerical integral is wrong in pari master

Issue created by migration from Trac.

Original creator: vdelecroix

Original creation time: 2015-04-30 10:26:56

Within pari master, the gp numerical integral gives

```
? intnum(x=0,13,sin(x)+sin(x^2) + x)
%1 = 84.181815392229652966739838357234264357
```

tested on pari master at commit `17795-d04cdd3` with an amd64.

See also #18340


---

Comment by jdemeyer created at 2015-05-01 18:58:57

Upstream has answered essentially that we need to live with it. I think we should close this as wontfix.


---

Comment by vdelecroix created at 2015-05-01 20:04:38

I just read the answer from Karim. We should document that this function is not adaptative and is likely to lead to wrong results with oscillating functions (though `sin(x^2)` at `x=13` is not terribly oscillating compared to `sin(1/x)` at `0`).

Vincent


---

Comment by jdemeyer created at 2015-05-02 18:29:00

Replying to [comment:5 vdelecroix]:
> We should document
document where?  `intnum` isn't available in the Sage interface for PARI (because it has a closure argument, see #18052 and #18038).


---

Comment by vdelecroix created at 2015-05-02 18:37:19

Replying to [comment:7 jdemeyer]:
> Replying to [comment:5 vdelecroix]:
> > We should document
> document where?  `intnum` isn't available in the Sage interface for PARI (because it has a closure argument, see #18052 and #18038).

In the pari interface

```
sage: pari("intnum(x=0,13,sin(x)+sin(x^2) + x)")
85.1885681951527
```



---

Comment by leif created at 2015-05-02 18:56:20

Yep, e.g.

```
sage: pari("intnum(x=0,13,sin(x)+sin(x^2) + x)")
84.1818153922297
sage: pari("intnum(x=0,13,sin(x)+sin(x^2) + x,1)")
85.1885681951527
sage: pari("intnum(x=0,13,sin(x)+sin(x^2) + x,2)")
85.1885681951527
```

with an explanation in a comment.


---

Comment by jdemeyer created at 2015-05-03 10:52:43

Replying to [comment:8 vdelecroix]:
> Replying to [comment:7 jdemeyer]:
> > Replying to [comment:5 vdelecroix]:
> > > We should document
> > document where?  `intnum` isn't available in the Sage interface for PARI (because it has a closure argument, see #18052 and #18038).
> 
> In the pari interface
The module docstring of `pari_instance.pyx` is not the place to document a specific function.
