# Issue 19394: reduced_word breaks for automatic_monoids if not initialised

archive/issues_019394.json:
```json
{
    "body": "CC:  nthiery virmaux\n\nKeywords: submonoids, reduced word\n\nThe following should work:\n\n```\nsage: from sage.monoids.automatic_semigroup import AutomaticSemigroup\nsage: R = IntegerModRing(101)\nsage: M = AutomaticSemigroup(Family({1: R(3), 2: R(5)}), one=R.one())\n\n\nsage: sage: sage: e = M.from_reduced_word([1, 1, 1, 2, 2, 2])\nsage: e.reduced_word()\n---------------------------------------------------------------------------\nAttributeError                            Traceback (most recent call last)\n[...]\nAttributeError: 'AutomaticMonoid_with_category.element_class' object has no attribute 'construct'\n```\n\nI'm uploading a fix.\n\nIssue created by migration from https://trac.sagemath.org/ticket/19631\n\n",
    "created_at": "2015-11-27T12:22:59Z",
    "labels": [
        "combinatorics",
        "major",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-6.10",
    "title": "reduced_word breaks for automatic_monoids if not initialised",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/19394",
    "user": "hivert"
}
```
CC:  nthiery virmaux

Keywords: submonoids, reduced word

The following should work:

```
sage: from sage.monoids.automatic_semigroup import AutomaticSemigroup
sage: R = IntegerModRing(101)
sage: M = AutomaticSemigroup(Family({1: R(3), 2: R(5)}), one=R.one())


sage: sage: sage: e = M.from_reduced_word([1, 1, 1, 2, 2, 2])
sage: e.reduced_word()
---------------------------------------------------------------------------
AttributeError                            Traceback (most recent call last)
[...]
AttributeError: 'AutomaticMonoid_with_category.element_class' object has no attribute 'construct'
```

I'm uploading a fix.

Issue created by migration from https://trac.sagemath.org/ticket/19631





---

archive/issue_comments_266612.json:
```json
{
    "body": "New commits:",
    "created_at": "2015-11-27T12:30:30Z",
    "issue": "https://github.com/sagemath/sagetest/issues/19394",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/19394#issuecomment-266612",
    "user": "hivert"
}
```

New commits:



---

archive/issue_comments_266613.json:
```json
{
    "body": "Changing status from new to needs_review.",
    "created_at": "2015-11-27T12:30:53Z",
    "issue": "https://github.com/sagemath/sagetest/issues/19394",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/19394#issuecomment-266613",
    "user": "hivert"
}
```

Changing status from new to needs_review.



---

archive/issue_comments_266614.json:
```json
{
    "body": "LGTM (although I would have `from_reduced_word` set the `_reduced_word` attribute of the element, but that's for a different ticket).",
    "created_at": "2015-11-27T14:05:56Z",
    "issue": "https://github.com/sagemath/sagetest/issues/19394",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/19394#issuecomment-266614",
    "user": "tscrim"
}
```

LGTM (although I would have `from_reduced_word` set the `_reduced_word` attribute of the element, but that's for a different ticket).



---

archive/issue_comments_266615.json:
```json
{
    "body": "Changing status from needs_review to positive_review.",
    "created_at": "2015-11-27T14:13:34Z",
    "issue": "https://github.com/sagemath/sagetest/issues/19394",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/19394#issuecomment-266615",
    "user": "tscrim"
}
```

Changing status from needs_review to positive_review.



---

archive/issue_comments_266616.json:
```json
{
    "body": "Replying to [comment:5 tscrim]:\n> LGTM (although I would have `from_reduced_word` set the `_reduced_word` attribute of the element, but that's for a different ticket).\n\nThis is done by the call to `self.parent().construct(up_to=self)`:\n\n```\nsage: sage: from sage.monoids.automatic_semigroup import AutomaticSemigroup\nsage: sage: R = IntegerModRing(101)\nsage: sage: M = AutomaticSemigroup(Family({1: R(3), 2: R(5)}), one=R.one())\nsage: sage: e = M.from_reduced_word([1, 1, 1, 2, 2, 2])\nsage: e\n42\nsage: e.__dict__\n{'_reduced_word': None}\nsage: e.reduced_word()\n[1, 1, 1, 2, 2, 2]\nsage: e.__dict__\n{'_cache__transition': {},\n '_reduced_word': [1, 1, 1, 2, 2, 2],\n 'transition': Cached version of <function transition at 0x7f91a1a87a28>}\n```\n",
    "created_at": "2015-11-27T16:19:14Z",
    "issue": "https://github.com/sagemath/sagetest/issues/19394",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/19394#issuecomment-266616",
    "user": "hivert"
}
```

Replying to [comment:5 tscrim]:
> LGTM (although I would have `from_reduced_word` set the `_reduced_word` attribute of the element, but that's for a different ticket).

This is done by the call to `self.parent().construct(up_to=self)`:

```
sage: sage: from sage.monoids.automatic_semigroup import AutomaticSemigroup
sage: sage: R = IntegerModRing(101)
sage: sage: M = AutomaticSemigroup(Family({1: R(3), 2: R(5)}), one=R.one())
sage: sage: e = M.from_reduced_word([1, 1, 1, 2, 2, 2])
sage: e
42
sage: e.__dict__
{'_reduced_word': None}
sage: e.reduced_word()
[1, 1, 1, 2, 2, 2]
sage: e.__dict__
{'_cache__transition': {},
 '_reduced_word': [1, 1, 1, 2, 2, 2],
 'transition': Cached version of <function transition at 0x7f91a1a87a28>}
```




---

archive/issue_comments_266617.json:
```json
{
    "body": "Resolution: fixed",
    "created_at": "2015-11-28T13:46:03Z",
    "issue": "https://github.com/sagemath/sagetest/issues/19394",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/19394#issuecomment-266617",
    "user": "vbraun"
}
```

Resolution: fixed
