# Issue 17464: desolve TypeError snub

Issue created by migration from https://trac.sagemath.org/ticket/17701

Original creator: rws

Original creation time: 2015-01-30 17:49:16


```
t = var('t')
sage: f = function('f')
sage: desolve(diff(f,t) - (f+1)/(t+1), f)
...
TypeError: 
```

Don't know yet if it's a bug. At least it's an extremely uninformative error.


---

Comment by kcrisman created at 2015-01-30 19:03:41

Possibly related to the shenanigans induced by the distinction at #17447?  So maybe user error (though obviously completely understandable given the terrible documentation for this)?  Agreed on the uselessness of the error message, though presumably the traceback would help an experienced Sage developer... who is not the likely recipient of an error message on this, unfortunately!  More like someone in calculus or ODE.  Yuck.


---

Comment by rws created at 2015-01-31 06:42:30

Replying to [comment:1 kcrisman]:
> Possibly related to the shenanigans induced by the distinction at #17447?
That too but I think either `SR(f)` or `diff(f,t)` should work even with `NewSymbolicFunction`. If not improve the error message.


---

Comment by rws created at 2015-07-09 14:59:25

However, having `diff(f,t)` a shortcut for `diff(f(t),t)` is less useful because the other instances of `f` in the argument to `desolve` would still have to be coerced. And it is impossible to know what is the variable there.


---

Comment by rws created at 2015-07-09 15:18:11

Changing status from new to needs_review.


---

Comment by rws created at 2015-07-09 15:18:11

New commits:


---

Comment by tscrim created at 2016-03-29 19:26:49

Should we expect this to work?

```
sage: f = function('f')
sage: diff(f, x=x)
```

Also, in an effort to be an uniform with python, could you make the error message start with a lowercase letter?


---

Comment by nbruin created at 2016-03-31 20:13:21

Replying to [comment:9 tscrim]:
> Should we expect this to work?
> {{{
> sage: f = function('f')
> sage: diff(f, x=x)
> }}}
I'd say no. This would be significant feature creep into the interface of `diff`.

I am a little worried about

```
sage: diff(f,x,x)
D[0, 0](f)(x, x) + 2*D[0, 1](f)(x, x) + D[1, 1](f)(x, x)
```

where almost certainly a user who would type this would be hoping for

```
D[0, 0](f)(x)
```

I think the ambiguity in meaning when multiple arguments are given makes it safer to disallow it altogether.

I wouldn't mind if we wouldn't support this at all, but if we do, I recommend that we only allow repetition of a single argument variable, and interpret it as the n-th derivative of a univariate function evaluated at that argument


---

Comment by rws created at 2016-08-05 07:53:00

Changing status from needs_review to needs_work.


---

Comment by rws created at 2016-11-06 16:10:23

With Sage develop:

```
sage: t = var('t')
sage: sage: f = function('f')(t)
sage: diff(f,x,x)
0
sage: desolve(diff(f,t) - (f+1)/(t+1), f)
(_C - 1/(t + 1))*(t + 1)

sage: sage: f = function('f')
sage: diff(f,t) 
...
TypeError: unable to convert f to a symbolic expression
sage: diff(sin,t)
...
TypeError: unable to convert sin to a symbolic expression
```

So an error does only happen with anonymous functions (`NewSymbolicFunction`) and bare `Function` objects.

With this branch there is

```
sage: diff(sin,t)
cos(t)
sage: diff(f,t)
diff(f(t), t)
sage: diff(f,x,x)
D[0, 0](f)(x, x) + 2*D[0, 1](f)(x, x) + D[1, 1](f)(x, x)
```

of which the latter has to be improved according to Nils.


---

Comment by nbruin created at 2021-12-04 19:15:59

Changing status from needs_work to needs_review.


---

Comment by nbruin created at 2021-12-04 19:15:59

Replying to [comment:12 rws]:
> With this branch there is
> {{{
> sage: diff(sin,t)
> cos(t)
> sage: diff(f,t)
> diff(f(t), t)
> sage: diff(f,x,x)
> D[0, 0](f)(x, x) + 2*D[0, 1](f)(x, x) + D[1, 1](f)(x, x)
> }}}
> of which the latter has to be improved according to Nils.
I'd say the first ones need to be improved as well: if `diff(sin,t)==cos(t)` then `diff` apparently evaluates `sin` at `t` and then differentiates it. I think it's very confusing to let `diff` evaluate its argument.
For instance, if `f=(x^2).function(x)` then `f` is callable, so extending the above definition would give `diff(f,t)==diff(t^2,t)=2*t`. Instead, we have the perfectly acceptable `diff(f,t)== (0*x).function(x)`: `f` is perfectly understood to be a function in `x`, and hence differentiating with respect to `t` would involve the derivative of `x` wrt. `t`, and `x` is not indicated to depend on `t`.

Having derivatives of functions with anonymous argument with respect to a named variable result in error seems desirable to me and that's the current behaviour.

So I'd advocate for closing this ticket as "notabug/wontfix".


---

Comment by tscrim created at 2021-12-05 07:34:15

I agree with you that there is no reasonable well-defined behavior and anything other than an error will likely cause confusion. However, the error message is a bit cryptic, and suggests to me that this behavior might accidentally be changed. Perhaps we can try to clean that up a bit?


---

Comment by nbruin created at 2021-12-05 21:46:32

Replying to [comment:15 tscrim]:
> I agree with you that there is no reasonable well-defined behavior and anything other than an error will likely cause confusion. However, the error message is a bit cryptic, and suggests to me that this behavior might accidentally be changed. Perhaps we can try to clean that up a bit?

Sure, catching the call and raising a different error would be fine with me.
