# Issue 14685: Equality in PowerSeriesRing can be unpredictable

archive/issues_014685.json:
```json
{
    "body": "Assignee: AlexGhitza\n\nKeywords: power series, halting problem, discreteness, equality\n\nI know this is unavoidable, but I'd say it should be better documented...\n\nOver a finite field:\n\n\n```\nsage: K.<u> = PowerSeriesRing(GF(5))\nsage: u = K.gen()\nsage: u ** 25\nu^25\nsage: u ** 25 == 0\nFalse\nsage: (1 + u) ** 25\n1 + u^25\nsage: (1 + u) ** 25 == 1\nFalse\nsage: (1 / (1 - u)) ** 25     \n1 + O(u^20)\nsage: (1 / (1 - u)) ** 25 == 1\nTrue\n```\n\n\nI suspect the last ``True`` is due to ``(1 / (1 - u)) ** 25`` being a dense series, which leads to Sage keeping precision at O(u^20) rather than moving to a higher exponent. But this seems not to be the whole story, since no such bull happens over the rationals:\n\n\n```\nsage: K.<u> = PowerSeriesRing(QQ)   \nsage: u = K.gen()\nsage: u ** 25 == 0\nFalse\nsage: (1 + u) ** 25 == 1\nFalse\nsage: (1 / (1 - u)) ** 25 == 1\nFalse\n```\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/14889\n\n",
    "created_at": "2013-07-13T20:00:35Z",
    "labels": [
        "algebra",
        "minor",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-6.4",
    "title": "Equality in PowerSeriesRing can be unpredictable",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/14685",
    "user": "darij"
}
```
Assignee: AlexGhitza

Keywords: power series, halting problem, discreteness, equality

I know this is unavoidable, but I'd say it should be better documented...

Over a finite field:


```
sage: K.<u> = PowerSeriesRing(GF(5))
sage: u = K.gen()
sage: u ** 25
u^25
sage: u ** 25 == 0
False
sage: (1 + u) ** 25
1 + u^25
sage: (1 + u) ** 25 == 1
False
sage: (1 / (1 - u)) ** 25     
1 + O(u^20)
sage: (1 / (1 - u)) ** 25 == 1
True
```


I suspect the last ``True`` is due to ``(1 / (1 - u)) ** 25`` being a dense series, which leads to Sage keeping precision at O(u^20) rather than moving to a higher exponent. But this seems not to be the whole story, since no such bull happens over the rationals:


```
sage: K.<u> = PowerSeriesRing(QQ)   
sage: u = K.gen()
sage: u ** 25 == 0
False
sage: (1 + u) ** 25 == 1
False
sage: (1 / (1 - u)) ** 25 == 1
False
```


Issue created by migration from https://trac.sagemath.org/ticket/14889





---

archive/issue_comments_187001.json:
```json
{
    "body": "The power series ring tries to keep arbitrary precision if possible, and only switches to series expansion if necessary. So `u^25` is kept as exact, even though it is zero to the `default_prec=20`.\n\nFor interactive use, I think this is what one would want. However, for non-interactive use an \"always approximate\" mode where `u^25` is immediately zero would be nice. I have written lots of code where many lines end in `+O(u^prec)` to get the precision back down.",
    "created_at": "2013-07-13T20:34:07Z",
    "issue": "https://github.com/sagemath/sagetest/issues/14685",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/14685#issuecomment-187001",
    "user": "vbraun"
}
```

The power series ring tries to keep arbitrary precision if possible, and only switches to series expansion if necessary. So `u^25` is kept as exact, even though it is zero to the `default_prec=20`.

For interactive use, I think this is what one would want. However, for non-interactive use an "always approximate" mode where `u^25` is immediately zero would be nice. I have written lots of code where many lines end in `+O(u^prec)` to get the precision back down.
