# Issue 14718: HeilbronnMerel(50000) raises a RuntimeError

Issue created by migration from Trac.

Original creator: tian

Original creation time: 2013-07-23 13:48:26


```
sage: H=HeilbronnMerel(50000)
--------------------------------------------------------------------
RuntimeError Traceback (most recent call last)
/home/guests/sage-5.4.1/<ipython console=""> in <module>()
/home/guests/sage-5.4.1/local/lib/python2.7/site-packages/sage/modular/modsym/heilbronn.so in sage.modular.modsym.heilbronn.HeilbronnMerel.__init__ (sage/modular/modsym/heilbronn.c:5185)()
/home/guests/sage-5.4.1/local/lib/python2.7/site-packages/sage/modular/modsym/heilbronn.so in sage.modular.modsym.heilbronn.HeilbronnMerel._initialize_list (sage/modular/modsym/heilbronn.c:5343)()
RuntimeError: Floating point exception
```



---

Comment by AlexGhitza created at 2013-07-25 06:24:07

For the record, `HeilbronnMerel(46342)` seems to be the earliest point of failure.


---

Comment by davidloeffler created at 2013-07-25 15:06:58

Changing keywords from "" to "sd51".


---

Comment by pbruin created at 2014-04-24 19:31:07

Replying to [comment:1 AlexGhitza]:
> For the record, `HeilbronnMerel(46342)` seems to be the earliest point of failure.
This looks like an integer overflow.  The method `HeilbronnMerel._initialize_list()` sets `bc = a*d - n`, where `a` and `d` are `<= n`, and `bc` is an `int`.

```
sage: n = 46342
sage: n^2 - n < 2^31
False
sage: (n-1)^2 - (n-1) < 2^31
True
```

I guess making `bc` a `long long` will solve this.


---

Comment by pbruin created at 2014-04-24 20:13:06

Changing status from new to needs_review.


---

Comment by pbruin created at 2014-04-24 20:13:06

Indeed it does.  (Note about the patch: `llong` is defined as `long long` earlier in the file.)  I have tested this, but have not added any doctests, since any example would take much longer than the longest currently existing doctests.


---

Comment by AlexGhitza created at 2014-04-25 04:44:25

Looks good to me.  For the record, under sage-6.2.beta8 running on sage.math, `HeilbronnMerel(46342)` finishes (successfully) in about 5 minutes, and `HeilbronnMerel(50000)` in about 6 minutes.


---

Comment by AlexGhitza created at 2014-04-25 04:44:49

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2014-04-25 14:20:40

Resolution: fixed
