# Issue 19184: let asymptotic terms accept multivariate polynomials

Issue created by migration from https://trac.sagemath.org/ticket/19421

Original creator: dkrenn

Original creation time: 2015-10-16 12:08:01

CC:  cheuberg behackl

At the moment we have

```
sage: from sage.rings.asymptotic.term_monoid import TermMonoid
sage: from sage.rings.asymptotic.growth_group import GrowthGroup
sage: G_ZZ = GrowthGroup('y^ZZ*z^ZZ')
sage: T_ZZ = TermMonoid('exact', G_ZZ, QQ)
sage: R.<y, z> = ZZ[]
sage: T_ZZ._get_factors_(5*y*z)
(5*y*z,)
sage: G_ZZ(y)*G_ZZ(z)
y*z
sage: G_ZZ(y*z)
Traceback (most recent call last):
...
ValueError: y*z is not in Growth Group y^ZZ * z^ZZ.
> *previous* ValueError: y*z is not in any of the factors of Growth Group y^ZZ * z^ZZ
```

Make this work...

See also #19083, comment 64, 26.
