# Issue 15858: preserve term order in polynomial ring when extending base ring

Issue created by migration from Trac.

Original creator: dkrenn

Original creation time: 2014-04-08 11:52:40

CC:  jakobkroeker

Keywords: polynomial ring, term order, preserve

We have the following

```
sage: S.<Y,X> = PolynomialRing(ZZ, order='lex')
sage: f = 1/2 * X
sage: f
1/2*X
sage: f.parent()
Multivariate Polynomial Ring in Y, X over Rational Field
sage: S
Multivariate Polynomial Ring in Y, X over Integer Ring
sage: f.parent().term_order()
Degree reverse lexicographic term order
sage: S.term_order()
Lexicographic term order
```


The term ordering should be preserved.

(This was reported by R. Rissner (personal communication))


---

Comment by dkrenn created at 2015-04-16 20:13:00

Still there in 6.6.


---

Comment by jakobkroeker created at 2017-03-04 00:29:29

So is this incorrect behaviour?


---

Comment by dkrenn created at 2017-03-19 11:43:59

Replying to [comment:4 jakobkroeker]:
> So is this incorrect behaviour?

Yes. (Why asking?)


---

Comment by jakobkroeker created at 2017-03-19 17:41:16

Replying to [comment:5 dkrenn]:
> Replying to [comment:4 jakobkroeker]:
> > So is this incorrect behaviour?
> 
> Yes. (Why asking?)

To add this issue to the list of silently wrong results

https://trac.sagemath.org/report/79


---

Comment by dkrenn created at 2017-03-19 18:32:01

Replying to [comment:6 jakobkroeker]:
> Replying to [comment:5 dkrenn]:
> > Replying to [comment:4 jakobkroeker]:
> > > So is this incorrect behaviour?
> > 
> > Yes. (Why asking?)
> 
> To add this issue to the list of silently wrong results
> 
> https://trac.sagemath.org/report/79

Ok, thank you for doing this.


---

Comment by chapoton created at 2019-10-12 11:54:49

Note that something close works:

```
sage: S
Multivariate Polynomial Ring in Y, X over Integer Ring
sage: S.change_ring(QQ)
Multivariate Polynomial Ring in Y, X over Rational Field
sage: S.change_ring(QQ).term_order()
Lexicographic term order
sage: S.term_order()
Lexicographic term order
```



---

Comment by chapoton created at 2019-10-12 11:56:47

Its only during coercion that this fails:

```
sage: from sage.structure.element import coercion_model
sage: coercion_model.common_parent(g,X)
Multivariate Polynomial Ring in Y, X over Rational Field
sage: coercion_model.common_parent(g,X).term_order()
Degree reverse lexicographic term order
```

