# Issue 12635: Taking the real part of a sum of exponentials with imaginary exponents gives wrong result

archive/issues_012635.json:
```json
{
    "body": "Assignee: burcin\n\nIn sage 4.8 the following computation gives 1/2, while the right result is -3/2:\n\n```\nsage: a = exp(i*2*pi/3)\nsage: b = exp(i*pi/3)\nsage: c = 2*a-b\nsage: c.real()\n1/2\n```\n\n\nDoing the computation numerically gives the right result:\n\n```\nsage: N(c).real()\n-1.50000000000000\n```\n\nand asking maxima directly also works:\n\n```\nsage: (c.maxima_methods().rectform()).real()\n-3/2\n```\n\n\nThis is sage 4.8 running on Fedora 16, linux 3.1.0-7.fc16.x86_64 SMP.\n\nIssue created by migration from https://trac.sagemath.org/ticket/12807\n\n",
    "created_at": "2012-04-04T10:13:54Z",
    "labels": [
        "symbolics",
        "major",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-6.7",
    "title": "Taking the real part of a sum of exponentials with imaginary exponents gives wrong result",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/12635",
    "user": "inaki"
}
```
Assignee: burcin

In sage 4.8 the following computation gives 1/2, while the right result is -3/2:

```
sage: a = exp(i*2*pi/3)
sage: b = exp(i*pi/3)
sage: c = 2*a-b
sage: c.real()
1/2
```


Doing the computation numerically gives the right result:

```
sage: N(c).real()
-1.50000000000000
```

and asking maxima directly also works:

```
sage: (c.maxima_methods().rectform()).real()
-3/2
```


This is sage 4.8 running on Fedora 16, linux 3.1.0-7.fc16.x86_64 SMP.

Issue created by migration from https://trac.sagemath.org/ticket/12807





---

archive/issue_comments_150434.json:
```json
{
    "body": "Thanks for the report! This is a bug in Pynac. I opened a ticket here:\n\nhttp://hg.pynac.org/pynac/issue/15/wrong-result-from-real-part",
    "created_at": "2012-11-22T15:53:08Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12635",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12635#issuecomment-150434",
    "user": "burcin"
}
```

Thanks for the report! This is a bug in Pynac. I opened a ticket here:

http://hg.pynac.org/pynac/issue/15/wrong-result-from-real-part



---

archive/issue_comments_150435.json:
```json
{
    "body": "This gets really weird, actually.\n\n```\nsage: a.real()\n-1/2\nsage: b.real()\n1/2\nsage: (a-b).real() # good\n-1\nsage: (a-2*b).real() # good\n-3/2\nsage: (a-3*b).real()  # ho-hum\n-2\nsage: (2*a-b).real() # yikes\n1/2\nsage: (3*a-b).real()  # what?\n3/4\nsage: (4*a-b).real()  # consistent...\n1\nsage: (5*a-b).real()  # ?!?!?\n5/4\nsage: (-a-b).real()  # seeing but not believing\n-1/4\nsage: (-2*a-b).real()\n-1/2\nsage: (-3*a-b).real()\n-3/4\nsage: (2*a).real()  # okay\n-1\nsage: (2*a+b).real()  #  okay\n-1/2\nsage: (3*a+b).real()\n-1\nsage: (4*a+b).real()\n-3/2\n```\n\nThis is consistent with Pynac somehow thinking that `a.real()==1/4` when preceded by a positive constant and `-1/4` when given a negative constant.  But only when part of a sum including `-b`, with `+b` it's fine.\n\nI tried to figure out what it was but so far no luck.",
    "created_at": "2014-11-21T15:31:16Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12635",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12635#issuecomment-150435",
    "user": "kcrisman"
}
```

This gets really weird, actually.

```
sage: a.real()
-1/2
sage: b.real()
1/2
sage: (a-b).real() # good
-1
sage: (a-2*b).real() # good
-3/2
sage: (a-3*b).real()  # ho-hum
-2
sage: (2*a-b).real() # yikes
1/2
sage: (3*a-b).real()  # what?
3/4
sage: (4*a-b).real()  # consistent...
1
sage: (5*a-b).real()  # ?!?!?
5/4
sage: (-a-b).real()  # seeing but not believing
-1/4
sage: (-2*a-b).real()
-1/2
sage: (-3*a-b).real()
-3/4
sage: (2*a).real()  # okay
-1
sage: (2*a+b).real()  #  okay
-1/2
sage: (3*a+b).real()
-1
sage: (4*a+b).real()
-3/2
```

This is consistent with Pynac somehow thinking that `a.real()==1/4` when preceded by a positive constant and `-1/4` when given a negative constant.  But only when part of a sum including `-b`, with `+b` it's fine.

I tried to figure out what it was but so far no luck.



---

archive/issue_comments_150436.json:
```json
{
    "body": "Actually and surprisingly what's happening is that the simplified values of the `exp` expressions (`1/2` and `-1/2`) and their coefficients are all multiplied together on final evaluation:\n\n```\nsage: (4*exp(i*pi/3)-4*exp(i*2*pi/3)).real_part()\n4\nsage: (6*exp(i*pi/3)-6*exp(i*2*pi/3)).real_part()\n9\n```\n\nThis is evident in the GiNaC source, this line(https://github.com/pynac/pynac/blob/master/ginac/add.cpp#L432):\n\n```\n    oc = oc.mul(ex_to<numeric>(j->rest)).mul(ex_to<numeric>(j->coeff));\n```\n\nis so rarely executed that e.g. only three doctests in `symbolic/` touch it but don't trigger the bug because the expressions are too short.\n\nThe fix will be in Pynac-0.3.7.",
    "created_at": "2015-05-03T05:55:30Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12635",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12635#issuecomment-150436",
    "user": "rws"
}
```

Actually and surprisingly what's happening is that the simplified values of the `exp` expressions (`1/2` and `-1/2`) and their coefficients are all multiplied together on final evaluation:

```
sage: (4*exp(i*pi/3)-4*exp(i*2*pi/3)).real_part()
4
sage: (6*exp(i*pi/3)-6*exp(i*2*pi/3)).real_part()
9
```

This is evident in the GiNaC source, this line(https://github.com/pynac/pynac/blob/master/ginac/add.cpp#L432):

```
    oc = oc.mul(ex_to<numeric>(j->rest)).mul(ex_to<numeric>(j->coeff));
```

is so rarely executed that e.g. only three doctests in `symbolic/` touch it but don't trigger the bug because the expressions are too short.

The fix will be in Pynac-0.3.7.



---

archive/issue_comments_150437.json:
```json
{
    "body": "Changing status from new to needs_review.",
    "created_at": "2015-05-04T13:42:19Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12635",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12635#issuecomment-150437",
    "user": "rws"
}
```

Changing status from new to needs_review.



---

archive/issue_comments_150438.json:
```json
{
    "body": "New commits:",
    "created_at": "2015-05-04T13:42:19Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12635",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12635#issuecomment-150438",
    "user": "rws"
}
```

New commits:



---

archive/issue_comments_150439.json:
```json
{
    "body": "LGTM.",
    "created_at": "2015-05-10T18:11:46Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12635",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12635#issuecomment-150439",
    "user": "tscrim"
}
```

LGTM.



---

archive/issue_comments_150440.json:
```json
{
    "body": "Changing status from needs_review to positive_review.",
    "created_at": "2015-05-10T18:11:46Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12635",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12635#issuecomment-150440",
    "user": "tscrim"
}
```

Changing status from needs_review to positive_review.



---

archive/issue_comments_150441.json:
```json
{
    "body": "Resolution: fixed",
    "created_at": "2015-05-14T22:40:16Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12635",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12635#issuecomment-150441",
    "user": "vbraun"
}
```

Resolution: fixed
