# Issue 33787: Polynomials over p-adics and power series are wrong

archive/issues_033787.json:
```json
{
    "body": "The design choice made for p-adics and power series is that `O(p^n)` and `O(x^n)` behave similarly to zero in comparisons. All of\n- `a.is_zero()`\n- `not a`\n- `a == a.parent().zero()`\n- `not (a != a.parent().zero()`\nanswer `True` for `O(p^n)` or `O(x^n)`\n\n```\nsage: a = O(2^3)\nsage: a.is_zero()\nTrue\nsage: a.is_zero() and not a and a == a.parent().zero() and not (a != a.parent().zero())\nTrue\nsage: R.<x> = PowerSeriesRing(QQ)\nsage: a = O(x^3)\nsage: a.is_zero() and not a and a == a.parent().zero() and not (a != a.parent().zero())\nTrue\n```\n\n\nAs a consequence, the generic implementation of uni-variate and multi-variate polynomials are broken on those rings (as it does remove terms whose coefficients are zero).\n\n```\nsage: Z2 = Zp(2)\nsage: R.<x,y> = Z2[]\nsage: R(1) - R(1)\n0\nsage: Z2(1) - Z2(1)\nO(2^20)\n```\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/34024\n\n",
    "created_at": "2022-06-19T18:42:23Z",
    "labels": [
        "component: algebra",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-9.8",
    "title": "Polynomials over p-adics and power series are wrong",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/33787",
    "user": "https://github.com/videlec"
}
```
The design choice made for p-adics and power series is that `O(p^n)` and `O(x^n)` behave similarly to zero in comparisons. All of
- `a.is_zero()`
- `not a`
- `a == a.parent().zero()`
- `not (a != a.parent().zero()`
answer `True` for `O(p^n)` or `O(x^n)`

```
sage: a = O(2^3)
sage: a.is_zero()
True
sage: a.is_zero() and not a and a == a.parent().zero() and not (a != a.parent().zero())
True
sage: R.<x> = PowerSeriesRing(QQ)
sage: a = O(x^3)
sage: a.is_zero() and not a and a == a.parent().zero() and not (a != a.parent().zero())
True
```


As a consequence, the generic implementation of uni-variate and multi-variate polynomials are broken on those rings (as it does remove terms whose coefficients are zero).

```
sage: Z2 = Zp(2)
sage: R.<x,y> = Z2[]
sage: R(1) - R(1)
0
sage: Z2(1) - Z2(1)
O(2^20)
```


Issue created by migration from https://trac.sagemath.org/ticket/34024





---

archive/issue_comments_479659.json:
```json
{
    "body": "My personal feeling is that `bool(a)` should be equivalent to \"a is not exact zero\".",
    "created_at": "2022-06-19T18:43:24Z",
    "issue": "https://github.com/sagemath/sagetest/issues/33787",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/33787#issuecomment-479659",
    "user": "https://github.com/videlec"
}
```

My personal feeling is that `bool(a)` should be equivalent to "a is not exact zero".



---

archive/issue_events_089036.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-09-19T18:58:47Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/33787",
    "milestone": "sage-9.8",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/33787#event-89036"
}
```
