# Issue 15689: hurwitz_zeta is numerically off

Issue created by migration from https://trac.sagemath.org/ticket/15926

Original creator: zimmerma

Original creation time: 2014-03-12 15:02:30

`hurwitz_zeta(s,x,N)` is assumed to give N correct decimals, however in Sage 6.0:

```
sage: hurwitz_zeta(42,1,21)
-1.255404431975609756e9
sage: zeta(42.)
1.00000000000023
```

Clearly no digit is correct in `hurwitz_zeta(42,1,21)`!


---

Comment by chapoton created at 2014-03-15 08:29:37

Changing keywords from "" to "hurwitz".


---

Comment by chapoton created at 2014-03-15 08:29:37

This has been corrected in #15095


```
sage: hurwitz_zeta(42.,1)
1.00000000000023
sage: zeta(42.)
1.00000000000023
```



---

Comment by chapoton created at 2014-03-15 08:29:37

Changing status from new to needs_review.


---

Comment by zimmerma created at 2014-03-15 08:39:15

> This has been corrected in #15095

indeed, however it is still bad:

```
sage: hurwitz_zeta(42,1).n(4)
4.0
```

Paul


---

Comment by chapoton created at 2014-03-15 10:32:56

If you want N correct decimal, you have to use digits=N


```
sage: hurwitz_zeta(42,1).n(digits=4)
1.000
```



---

Comment by zimmerma created at 2014-03-15 16:42:57

however the answer 4.0 is far away from the correct one with 4 significant **bits**, i.e., 1.0.


---

Comment by chapoton created at 2014-03-16 13:08:14

This has nothing to do with hurwitz

```
sage: (pi^42).n(4)
3.2e21
sage: (pi^42).n(44)
7.59092417206e20
```



---

Comment by chapoton created at 2014-03-21 20:37:48

There is indeed a problem somewhere in the power method:

```
sage: sage: (pi^42).n(4)
3.2e21
sage: sage: (pi^42).n(44)
7.59092417206e20
sage: sage: (pi^42).n(44).n(4)
7.4e20
```



---

Comment by rws created at 2014-03-26 16:47:27

I don't think so. And it's only 4 bits after all.

```
sage: (pi*pi).n(4)
11.
```



---

Comment by rws created at 2014-03-26 16:47:27

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2014-03-31 12:31:20

Resolution: invalid
