# Issue 24216: narrow_class_group: bug report

archive/issues_024216.json:
```json
{
    "body": "Keywords: narrow class group, quadratic field\n\nThe narrow_class_group function does not even work for some simple real quadratic fields.  Specifically, while it works for Q(sqrt(2)), it does not for Q(sqrt(3)) (I have not tried other number fields).  See snippet below.\n\n\n```\nsage: version()\n'SageMath version 8.1, Release Date: 2017-12-07'\nsage: F.<a> = QuadraticField(2)\nsage: F.narrow_class_group()\nTrivial Abelian group\nsage: F.<a> = QuadraticField(3)\nsage: F.narrow_class_group()\n  File \"<string>\", line 1\n    [2, [2], [[0, -1]~]]\n                     ^\nSyntaxError: invalid syntax\n\nsage: NumberField(x^2-3,'a').narrow_class_group()\n  File \"<string>\", line 1\n    [2, [2], [[0, -1]~]]\n                     ^\nSyntaxError: invalid syntax\n\n```\n\n\nIf it matters, I was using a pre-built Mac binary.\n\nIssue created by migration from https://trac.sagemath.org/ticket/24453\n\n",
    "created_at": "2017-12-31T04:51:38Z",
    "labels": [
        "number fields",
        "major",
        "bug"
    ],
    "title": "narrow_class_group: bug report",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/24216",
    "user": "kimball"
}
```
Keywords: narrow class group, quadratic field

The narrow_class_group function does not even work for some simple real quadratic fields.  Specifically, while it works for Q(sqrt(2)), it does not for Q(sqrt(3)) (I have not tried other number fields).  See snippet below.


```
sage: version()
'SageMath version 8.1, Release Date: 2017-12-07'
sage: F.<a> = QuadraticField(2)
sage: F.narrow_class_group()
Trivial Abelian group
sage: F.<a> = QuadraticField(3)
sage: F.narrow_class_group()
  File "<string>", line 1
    [2, [2], [[0, -1]~]]
                     ^
SyntaxError: invalid syntax

sage: NumberField(x^2-3,'a').narrow_class_group()
  File "<string>", line 1
    [2, [2], [[0, -1]~]]
                     ^
SyntaxError: invalid syntax

```


If it matters, I was using a pre-built Mac binary.

Issue created by migration from https://trac.sagemath.org/ticket/24453





---

archive/issue_comments_339151.json:
```json
{
    "body": "Indeed, there is maybe something strange..\n\n```\nsage: F.<a> = QuadraticField(3)\nsage: F.pari_bnf().bnfnarrow()\n[2, [2], [[0, -1]~]]\nsage: F.<a> = QuadraticField(2)\nsage: F.pari_bnf().bnfnarrow()\n[1, [], []]\nsage: F.<a> = NumberField(x**3-7)\nsage: F.pari_bnf().bnfnarrow()\n[3, [3], [[2, 1, 1; 0, 1, 0; 0, 0, 1]]]\n```\n",
    "created_at": "2018-01-01T08:35:05Z",
    "issue": "https://github.com/sagemath/sagetest/issues/24216",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/24216#issuecomment-339151",
    "user": "chapoton"
}
```

Indeed, there is maybe something strange..

```
sage: F.<a> = QuadraticField(3)
sage: F.pari_bnf().bnfnarrow()
[2, [2], [[0, -1]~]]
sage: F.<a> = QuadraticField(2)
sage: F.pari_bnf().bnfnarrow()
[1, [], []]
sage: F.<a> = NumberField(x**3-7)
sage: F.pari_bnf().bnfnarrow()
[3, [3], [[2, 1, 1; 0, 1, 0; 0, 0, 1]]]
```




---

archive/issue_comments_339152.json:
```json
{
    "body": "New commits:",
    "created_at": "2018-01-01T12:53:05Z",
    "issue": "https://github.com/sagemath/sagetest/issues/24216",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/24216#issuecomment-339152",
    "user": "chapoton"
}
```

New commits:



---

archive/issue_comments_339153.json:
```json
{
    "body": "Changing status from new to needs_review.",
    "created_at": "2018-01-01T12:53:05Z",
    "issue": "https://github.com/sagemath/sagetest/issues/24216",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/24216#issuecomment-339153",
    "user": "chapoton"
}
```

Changing status from new to needs_review.



---

archive/issue_comments_339154.json:
```json
{
    "body": "Why did you make it a cached method?",
    "created_at": "2018-01-01T13:22:33Z",
    "issue": "https://github.com/sagemath/sagetest/issues/24216",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/24216#issuecomment-339154",
    "user": "vdelecroix"
}
```

Why did you make it a cached method?



---

archive/issue_comments_339155.json:
```json
{
    "body": "oh, well, I thought it would be a good idea to replace the custom cache by the usual decorator..",
    "created_at": "2018-01-01T17:40:21Z",
    "issue": "https://github.com/sagemath/sagetest/issues/24216",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/24216#issuecomment-339155",
    "user": "chapoton"
}
```

oh, well, I thought it would be a good idea to replace the custom cache by the usual decorator..



---

archive/issue_comments_339156.json:
```json
{
    "body": "Oh! I missed the old cache.",
    "created_at": "2018-01-01T18:22:50Z",
    "issue": "https://github.com/sagemath/sagetest/issues/24216",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/24216#issuecomment-339156",
    "user": "vdelecroix"
}
```

Oh! I missed the old cache.



---

archive/issue_comments_339157.json:
```json
{
    "body": "Changing status from needs_review to positive_review.",
    "created_at": "2018-01-01T18:22:50Z",
    "issue": "https://github.com/sagemath/sagetest/issues/24216",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/24216#issuecomment-339157",
    "user": "vdelecroix"
}
```

Changing status from needs_review to positive_review.



---

archive/issue_comments_339158.json:
```json
{
    "body": "Resolution: fixed",
    "created_at": "2018-01-04T07:59:40Z",
    "issue": "https://github.com/sagemath/sagetest/issues/24216",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/24216#issuecomment-339158",
    "user": "vbraun"
}
```

Resolution: fixed
