# Issue 10072: held variables aren't restored

Issue created by migration from Trac.

Original creator: kcrisman

Original creation time: 2010-10-05 13:52:47

Assignee: burcin

See #9879, where this was discovered.  After #9901 is merged, this will be possible:

```
sage: I.log(hold=True).simplify()
1/2*I*pi
sage: var('I')
I
sage: I.log(hold=True).simplify()
log(I)
sage: restore('I')
sage: I.log(hold=True).simplify()
log(I)
```

It's totally unclear to me why this is happening.  It even happens across different classes in doctesting.  For now I'm putting this under symbolics, but it may be unrelated to that, and instead related to the miscellaneous commands.


---

Comment by jpflori created at 2010-10-06 15:14:58

By the way, that does not happen when you do not use the hold parameter followed by the simplify call :


```
sage: I.log()
1/2*I*pi
sage: var('I')
I
sage: I.log()
log(I)
sage: restore('I')
sage: I.log()
1/2*I*pi

```

So 'I' gets restored but maybe Maxima gets the var('I') which was created and not the default numeric 'I'.

Here is another strange thing:


```
sage: I.log()
1/2*I*pi
sage: J = deepcopy(I)
sage: bool(I == J)
True
sage: J.log()
1.57079632679490*I
```



---

Comment by kcrisman created at 2010-10-06 15:19:49

Yes, Burcin says it has something to do with "a problem with restore and the maxima interface, not pynac".  This seems likely.  I can't explain the second thing.


---

Comment by rws created at 2015-01-31 08:23:08

Something has changed here, probably with #6882:

```
sage: I.log(hold=True).simplify()
1/2*I*pi
sage: var('I')
I
sage: I.log(hold=True).simplify()
log(_I)
sage: restore('I')
sage: I.log(hold=True).simplify()
log(I)
sage: I.log()
1/2*I*pi
sage: I.log(hold=True).simplify_full()
log(_I)
```

This is not encouraging.
