# Issue 27246: Hilbert polynomial function of a polynomial ideal broken in certain cases

Issue created by migration from https://trac.sagemath.org/ticket/27483

Original creator: jipilab

Original creation time: 2019-03-14 14:01:15

CC:  simonking tscrim

Coming from the sage-devel thread:

https://groups.google.com/forum/#!topic/sage-devel/nsbfuLEZNVY

The following code is broken in Sage 8.7.beta7:


```
sage: P.<x,y,z> = PolynomialRing(QQ)
sage: I = Ideal([x^3, x*y^2, y^4, x^2*y*z, y^3*z, x^2*z^2, x*y*z^2, x*z^3])
sage: I.hilbert_polynomial()
Traceback (most recent call last):
...
AttributeError: 'sage.rings.rational.Rational' object has no attribute 'leading_coefficient'
```


This seems to come from a recent fix in #20145.


---

Comment by SimonKing created at 2019-03-14 14:10:16

Right, that's a bug. My intention was that the code will always create a univariate polynomial, potentially of degree zero. However, in this example, the Hilbert polynomial for some reason is a number:

```
sage: I.hilbert_polynomial(algorithm='singular')
3
```

I just wonder why the result is not given as `3*t^0` in my code. Anyway, should be easy to fix.


---

Comment by dimpase created at 2019-03-14 14:12:53

Hmm, it seem to work for me.

```
$ ./sage
┌────────────────────────────────────────────────────────────────────┐
│ SageMath version 8.7.beta7, Release Date: 2019-03-10               │
│ Using Python 2.7.15. Type "help()" for help.                       │
└────────────────────────────────────────────────────────────────────┘
┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
┃ Warning: this is a prerelease version, and it may be unstable.     ┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛
sage: P.<x,y,z> = PolynomialRing(QQ)
sage: I = Ideal([x^3, x*y^2, y^4, x^2*y*z, y^3*z, x^2*z^2, x*y*z^2, x*z^3])
sage: I.hilbert_series()
(5*t^4 - 2*t^3 - 3*t^2 - 2*t - 1)/(t - 1)
```


Are you on Python 3? I'm on 2, still :-)


---

Comment by dimpase created at 2019-03-14 14:14:50

Oops, sorry, it works for `series`, not for `polynomial`...


---

Comment by dimpase created at 2019-03-14 14:30:53

If I homogenise this ideal, I get a seemingly meaningful answer

```
sage: P.<x,y,z,u> = PolynomialRing(QQ)
sage: I = Ideal([x^3*u, u*x*y^2, y^4, x^2*y*z, y^3*z, x^2*z^2, x*y*z^2, x*z^3])
sage: I.hilbert_series()
(t^6 - 5*t^5 - 3*t^4 + 4*t^3 + 3*t^2 + 2*t + 1)/(t^2 - 2*t + 1)
sage: I.hilbert_polynomial()
3*t + 14
```



---

Comment by SimonKing created at 2019-03-14 14:37:13

Replying to [comment:4 dimpase]:
> If I homogenise this ideal, I get a seemingly meaningful answer

Yes, but that shouldn't be necessary. It's simply a programming error. There should be a polynomial of degree zero created (which has the attribute `leading_coefficient()`), not a number (which has the attribute not).


---

Comment by SimonKing created at 2019-03-14 20:27:14

Changing status from new to needs_review.


---

Comment by SimonKing created at 2019-03-14 20:27:14

Fixed (by adding the zero of the polynomial ring).
----
New commits:


---

Comment by dimpase created at 2019-03-15 10:38:04

Changing status from needs_review to positive_review.


---

Comment by dimpase created at 2019-03-15 10:38:04

looks good to be, thanks!


---

Comment by embray created at 2019-03-25 10:56:15

Ticket retargeted after milestone closed (if you don't believe this ticket is appropriate for the Sage 8.8 release please retarget manually)


---

Comment by vbraun created at 2019-03-25 19:43:48

Resolution: fixed
