# Issue 30705: Implement real and imag methods for CyclotomicField elements

Issue created by migration from https://trac.sagemath.org/ticket/30942

Original creator: slelievre

Original creation time: 2020-11-22 00:17:10

CC:  slelievre

Keywords: cyclotomic, real, imag

This ticket is to implement `real` and `imag` methods
for cyclotomic field elements.

These methods should return elements of the same cyclotomic field.

In Sage 9.2, cyclotomic field elements lack `real` and `imag` methods:

```
sage: K.<a> = CyclotomicField(8)
sage: a.real()
Traceback (most recent call last)
...
AttributeError:
'sage.rings.number_field.number_field_element.NumberFieldElement_absolute'
object has no attribute 'real'
sage: a.imag()
Traceback (most recent call last)
...
AttributeError:
'sage.rings.number_field.number_field_element.NumberFieldElement_absolute'
object has no attribute 'imag'
```


This seems odd, since:

- cyclotomic fields are by default embedded
- their elements can be taken to `QQbar`, `CC`, `CDF`, the universal cyclotomic field...
- universal cyclotomic field elements have `real` and `imag` methods
- one can get their real and imaginary parts using the
  `real` and `imag` functions

Implementing `real` and `imag` should improve the results of the
`real` and `imag` functions on cyclotomic field elements too.
Currently their result can be in the symbolic ring, or not.

```
sage: K.<z> = CyclotomicField(8)
sage: a, b, c, d = real(z), imag(z), real(z^2), imag(z^2)
sage: a, b, c, d
(1/2*sqrt(2), 1/2*sqrt(2), 0, 1)
sage: [x.parent() for x in [a, b, c, d]]
[Symbolic Ring, Symbolic Ring, Rational Field, Rational Field]
```


Universal cyclotomic field elements are saner:
the results of the `real` and `imag` functions
and of the `real` and `imag` methods coincide,
and have consistent parents.

```
sage: z = E(8)
sage: a, b, c, d = z.real(), z.imag(), (z^2).real(), (z^2).imag()
sage: a, b, c, d
(1/2*E(8) - 1/2*E(8)^3, 1/2*E(8) - 1/2*E(8)^3, 0, 1)
sage: [x.parent() for x in [a, b, c, d]]
[Universal Cyclotomic Field,
 Universal Cyclotomic Field,
 Universal Cyclotomic Field,
 Universal Cyclotomic Field]
sage: a, b, c, d = real(z), imag(z), real(z^2), imag(z^2)
sage: a, b, c, d
(1/2*E(8) - 1/2*E(8)^3, 1/2*E(8) - 1/2*E(8)^3, 0, 1)
sage: [x.parent() for x in [a, b, c, d]]
[Universal Cyclotomic Field,
 Universal Cyclotomic Field,
 Universal Cyclotomic Field,
 Universal Cyclotomic Field]
```



---

Comment by mkoeppe created at 2021-02-13 20:51:01

Setting new milestone based on a cursory review of ticket status, priority, and last modification date.
