# Issue 18262: add documentation for symbolic series arithmetics

Issue created by migration from https://trac.sagemath.org/ticket/18499

Original creator: rws

Original creation time: 2015-05-25 15:09:26

It is undocumented that expressions containing series (that result from operations with them) can be "expanded" by applying `series` again.

```
sage: (1/(1-x)).series(x, 3)+(1/(1+x)).series(x,3)
(1 + (-1)*x + 1*x^2 + Order(x^3)) + (1 + 1*x + 1*x^2 + Order(x^3))
sage: _.series(x,3)
2 + 2*x^2 + Order(x^3)
sage: (1/(1-x)).series(x, 3)*(1/(1+x)).series(x,3)
(1 + (-1)*x + 1*x^2 + Order(x^3))*(1 + 1*x + 1*x^2 + Order(x^3))
sage: _.series(x,3)
1 + 1*x^2 + Order(x^3)
```


GiNaC quote:
"...if you want to work with series, i.e. multiply two series, you need to call the method ex::series again to convert it to a series object with the usual structure (expansion plus order term)."


---

Comment by ktkohl created at 2015-05-26 18:12:39

Changing status from new to needs_review.


---

Comment by ktkohl created at 2015-05-26 18:12:39

New commits:


---

Comment by rws created at 2015-05-27 06:00:37

Looks fine, many thanks.


---

Comment by rws created at 2015-05-27 06:00:37

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2015-05-27 22:09:26

Resolution: fixed
