# Issue 16960: Bug creating Polyhedron from lines in number field

archive/issues_016960.json:
```json
{
    "body": "CC:  @fchapoton @jplab jakobkroeker\n\nKeywords: Polyhedron, Number field\n\nI reported this to the google group (https://groups.google.com/forum/#!topic/sage-support/ew0bnGzjm98) but was told to repeat it here.\n\nTo create polyhedra quickly, the final suggestion in the Polyhedron documentation (http://www.sagemath.org/doc/reference/geometry/sage/geometry/polyhedron/constructor.html#base-rings) is to work in a set number field. Although this appears to work for setting vertices, it does not appear to work for lines (or rays).\n\nFor example:\n\n```\nsage: var('x')\nx\nsage: K.<sqrt3> = NumberField(x^2-3, embedding=1.732)\nsage: P = Polyhedron(lines=[(1,sqrt3)])\nsage: P\nA 1-dimensional polyhedron in (Number Field in sqrt3 with defining polynomial x^10 + x^2 - 3)^2 defined as the convex hull of 1 vertex and 2 rays\nsage: P.rays()\n(A ray in the direction (0, -sqrt3), A ray in the direction (1, sqrt3))\n```\n\n\nThis should be compared with:\n\n```\nsage: P = Polyhedron(lines=[(1, sqrt(3))])\nsage: P\nA 1-dimensional polyhedron in (Symbolic Ring)^2 defined as the convex hull of 1 vertex and 1 line\n```\n\nand\n\n```\nsage: P = Polyhedron(lines=[(1, sqrt(3))], base_ring=AA)\nsage: P\nA 1-dimensional polyhedron in AA^2 defined as the convex hull of 1 vertex and 1 line\n```\n\n\n\nAdditionally, how can a \"1-dimensional polyhedron\" be \"defined as the convex hull of 1 vertex and 2 rays\"?\n\nIssue created by migration from https://trac.sagemath.org/ticket/17197\n\n",
    "created_at": "2014-10-22T14:09:47Z",
    "labels": [
        "component: geometry",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-7.4",
    "title": "Bug creating Polyhedron from lines in number field",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/16960",
    "user": "https://trac.sagemath.org/admin/accounts/users/mbell"
}
```
CC:  @fchapoton @jplab jakobkroeker

Keywords: Polyhedron, Number field

I reported this to the google group (https://groups.google.com/forum/#!topic/sage-support/ew0bnGzjm98) but was told to repeat it here.

To create polyhedra quickly, the final suggestion in the Polyhedron documentation (http://www.sagemath.org/doc/reference/geometry/sage/geometry/polyhedron/constructor.html#base-rings) is to work in a set number field. Although this appears to work for setting vertices, it does not appear to work for lines (or rays).

For example:

```
sage: var('x')
x
sage: K.<sqrt3> = NumberField(x^2-3, embedding=1.732)
sage: P = Polyhedron(lines=[(1,sqrt3)])
sage: P
A 1-dimensional polyhedron in (Number Field in sqrt3 with defining polynomial x^10 + x^2 - 3)^2 defined as the convex hull of 1 vertex and 2 rays
sage: P.rays()
(A ray in the direction (0, -sqrt3), A ray in the direction (1, sqrt3))
```


This should be compared with:

```
sage: P = Polyhedron(lines=[(1, sqrt(3))])
sage: P
A 1-dimensional polyhedron in (Symbolic Ring)^2 defined as the convex hull of 1 vertex and 1 line
```

and

```
sage: P = Polyhedron(lines=[(1, sqrt(3))], base_ring=AA)
sage: P
A 1-dimensional polyhedron in AA^2 defined as the convex hull of 1 vertex and 1 line
```



Additionally, how can a "1-dimensional polyhedron" be "defined as the convex hull of 1 vertex and 2 rays"?

Issue created by migration from https://trac.sagemath.org/ticket/17197





---

archive/issue_comments_224571.json:
```json
{
    "body": "With 6.4.beta6 I get \n\n```\nsage: Polyhedron(lines=[(1,sqrt3)])\nA 1-dimensional polyhedron in (Number Field in sqrt3 with defining polynomial x^2 - 3)^2 defined as the convex hull of 1 vertex and 1 line\n```\n",
    "created_at": "2014-10-22T16:03:45Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16960",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16960#issuecomment-224571",
    "user": "https://github.com/vbraun"
}
```

With 6.4.beta6 I get 

```
sage: Polyhedron(lines=[(1,sqrt3)])
A 1-dimensional polyhedron in (Number Field in sqrt3 with defining polynomial x^2 - 3)^2 defined as the convex hull of 1 vertex and 1 line
```




---

archive/issue_comments_224572.json:
```json
{
    "body": "Though the original example fails:\n\n```\nsage: K.<L> = NumberField(x^3 + 3*x^2 - 83*x - 1022, embedding=11.6515)\nsage: Polyhedron(eqns=[[0, -L - 2, -8, 2], [0, -2, -L + 6, 9], [0, -9, 5, -L - 7]])\nA 3-dimensional polyhedron in (Number Field in L with defining polynomial x^3 + 3*x^2 - 83*x - 1022)^3 defined as the convex hull of 1 vertex, 2 rays, 1 line\n```\n\n\nSlightly simpler failure:\n\n```\nsage: Polyhedron(eqns=[[0, -L - 2, -8], [0, -2, -L + 6], [0, -9, 5]])\nA 2-dimensional polyhedron in (Number Field in L with defining polynomial x^3 + 3*x^2 - 83*x - 1022)^2 defined as the convex hull of 1 vertex and 2 rays\n```\n",
    "created_at": "2014-10-22T16:09:51Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16960",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16960#issuecomment-224572",
    "user": "https://github.com/vbraun"
}
```

Though the original example fails:

```
sage: K.<L> = NumberField(x^3 + 3*x^2 - 83*x - 1022, embedding=11.6515)
sage: Polyhedron(eqns=[[0, -L - 2, -8, 2], [0, -2, -L + 6, 9], [0, -9, 5, -L - 7]])
A 3-dimensional polyhedron in (Number Field in L with defining polynomial x^3 + 3*x^2 - 83*x - 1022)^3 defined as the convex hull of 1 vertex, 2 rays, 1 line
```


Slightly simpler failure:

```
sage: Polyhedron(eqns=[[0, -L - 2, -8], [0, -2, -L + 6], [0, -9, 5]])
A 2-dimensional polyhedron in (Number Field in L with defining polynomial x^3 + 3*x^2 - 83*x - 1022)^2 defined as the convex hull of 1 vertex and 2 rays
```




---

archive/issue_comments_224573.json:
```json
{
    "body": "This originates at the following comparison:\n\n```\nsage: v = -1/392*L^2 - 45/392*L - 239/392\nsage: v > 0\nTrue\nsage: v.n()\n-2.29356924372991\n```\n",
    "created_at": "2014-10-22T17:01:24Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16960",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16960#issuecomment-224573",
    "user": "https://github.com/vbraun"
}
```

This originates at the following comparison:

```
sage: v = -1/392*L^2 - 45/392*L - 239/392
sage: v > 0
True
sage: v.n()
-2.29356924372991
```




---

archive/issue_comments_224574.json:
```json
{
    "body": "Thanks for tracking this down. Should I file a separate ticket for this under the number theory?",
    "created_at": "2014-10-23T21:09:34Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16960",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16960#issuecomment-224574",
    "user": "https://trac.sagemath.org/admin/accounts/users/mbell"
}
```

Thanks for tracking this down. Should I file a separate ticket for this under the number theory?



---

archive/issue_comments_224575.json:
```json
{
    "body": "You can just change the description and use this ticket. I think we agree that this is not a bug in polyhedra. See also the discussion on sage-devel.",
    "created_at": "2014-10-24T16:36:23Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16960",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16960#issuecomment-224575",
    "user": "https://github.com/vbraun"
}
```

You can just change the description and use this ticket. I think we agree that this is not a bug in polyhedra. See also the discussion on sage-devel.



---

archive/issue_comments_224576.json:
```json
{
    "body": "Changing component from geometry to number theory.",
    "created_at": "2014-10-24T16:51:03Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16960",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16960#issuecomment-224576",
    "user": "https://trac.sagemath.org/admin/accounts/users/mbell"
}
```

Changing component from geometry to number theory.



---

archive/issue_comments_224577.json:
```json
{
    "body": "Comparison is fixed for quadratic fields since #13213. To have it working on higher degree number field you could review #17830.\n\nVincent",
    "created_at": "2015-04-15T22:57:50Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16960",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16960#issuecomment-224577",
    "user": "https://github.com/videlec"
}
```

Comparison is fixed for quadratic fields since #13213. To have it working on higher degree number field you could review #17830.

Vincent



---

archive/issue_comments_224578.json:
```json
{
    "body": "All of these tests in description and comments seem to working in 7.3.beta9.",
    "created_at": "2016-07-26T22:38:35Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16960",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16960#issuecomment-224578",
    "user": "https://github.com/mkoeppe"
}
```

All of these tests in description and comments seem to working in 7.3.beta9.



---

archive/issue_comments_224579.json:
```json
{
    "body": "Changing status from new to needs_review.",
    "created_at": "2016-07-26T22:38:35Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16960",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16960#issuecomment-224579",
    "user": "https://github.com/mkoeppe"
}
```

Changing status from new to needs_review.



---

archive/issue_comments_224580.json:
```json
{
    "body": "yes because comparison in number fields is now working... (#17830). Instead of making it invalid, it would be much better to add doctests!",
    "created_at": "2016-07-26T22:40:13Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16960",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16960#issuecomment-224580",
    "user": "https://github.com/videlec"
}
```

yes because comparison in number fields is now working... (#17830). Instead of making it invalid, it would be much better to add doctests!



---

archive/issue_comments_224581.json:
```json
{
    "body": "Changing status from needs_review to needs_work.",
    "created_at": "2016-07-26T22:40:13Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16960",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16960#issuecomment-224581",
    "user": "https://github.com/videlec"
}
```

Changing status from needs_review to needs_work.



---

archive/issue_comments_224582.json:
```json
{
    "body": "Since the Polyhedron evolved quite a bit in the last year, here is an update on Sage8.2.rc1:\n\n\n```\nsage: var('x')\nx\nsage: K.<sqrt3> = NumberField(x^2-3, embedding=1.732)\nsage: P = Polyhedron(lines=[(1,sqrt3)])\nsage: P.rays()\n()\nsage: P.lines()\n(A line in the direction (1, sqrt3),)\n\nsage: P = Polyhedron(lines=[(1, sqrt(3))])\nTraceback (most recent call last):\n...\nValueError: for polyhedra with floating point numbers, the only allowed ring is RDF with backend 'cdd'\n\nsage: P = Polyhedron(lines=[(1, sqrt(3))], base_ring=AA)\nsage: P\nA 1-dimensional polyhedron in AA^2 defined as the convex hull of 1 vertex and 1 line\n```\n\n\nThe value error above will be changed in #24835 to a more appropriate error message, for which:\n\n\n```\nsage: P = Polyhedron(lines=[(1, sqrt(3))],backend='cdd',base_ring=RDF)\nsage: P\nA 1-dimensional polyhedron in RDF^2 defined as the convex hull of 1 vertex and 1 line\n```\n\n\nis the only way to get a symbolic expression to pass on to the constructor of Polyhedron.\n\nConcerning documenting the Polyhedron class usage through NumberFields, I believe that #22572 does the job.\n\nHence, once #22572 is merged, I would set this ticket to won't fix: the bug is fixed.",
    "created_at": "2018-04-12T00:14:14Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16960",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16960#issuecomment-224582",
    "user": "https://github.com/jplab"
}
```

Since the Polyhedron evolved quite a bit in the last year, here is an update on Sage8.2.rc1:


```
sage: var('x')
x
sage: K.<sqrt3> = NumberField(x^2-3, embedding=1.732)
sage: P = Polyhedron(lines=[(1,sqrt3)])
sage: P.rays()
()
sage: P.lines()
(A line in the direction (1, sqrt3),)

sage: P = Polyhedron(lines=[(1, sqrt(3))])
Traceback (most recent call last):
...
ValueError: for polyhedra with floating point numbers, the only allowed ring is RDF with backend 'cdd'

sage: P = Polyhedron(lines=[(1, sqrt(3))], base_ring=AA)
sage: P
A 1-dimensional polyhedron in AA^2 defined as the convex hull of 1 vertex and 1 line
```


The value error above will be changed in #24835 to a more appropriate error message, for which:


```
sage: P = Polyhedron(lines=[(1, sqrt(3))],backend='cdd',base_ring=RDF)
sage: P
A 1-dimensional polyhedron in RDF^2 defined as the convex hull of 1 vertex and 1 line
```


is the only way to get a symbolic expression to pass on to the constructor of Polyhedron.

Concerning documenting the Polyhedron class usage through NumberFields, I believe that #22572 does the job.

Hence, once #22572 is merged, I would set this ticket to won't fix: the bug is fixed.



---

archive/issue_comments_224583.json:
```json
{
    "body": "An improvement of the doc is posted on #26077, where I also point out that\nit is not sufficient to have a tutorial doc: the docstring of Polyhedron should have a real example with NF entries.",
    "created_at": "2018-08-18T08:46:30Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16960",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16960#issuecomment-224583",
    "user": "https://github.com/dimpase"
}
```

An improvement of the doc is posted on #26077, where I also point out that
it is not sufficient to have a tutorial doc: the docstring of Polyhedron should have a real example with NF entries.



---

archive/issue_comments_224584.json:
```json
{
    "body": "Just an update of the current situation in `8.9beta3`:\n\n\n```\nsage: var('x')\nx\nsage: K.<sqrt3> = NumberField(x^2-3, embedding=1.732)\nsage: P = Polyhedron(lines=[(1,sqrt3)])\nsage: P.rays()\n()\nsage: P.lines()\n(A line in the direction (1, sqrt3),)\nsage: P = Polyhedron(lines=[(1, sqrt(3))])\nTraceback (most recent call last):\n...\nValueError: no default backend for computations with Symbolic Ring\nsage: P = Polyhedron(lines=[(1, sqrt(3))], base_ring=AA); P\nA 1-dimensional polyhedron in AA^2 defined as the convex hull of 1 vertex and 1 line\nsage: Q = Polyhedron(lines=[(1, sqrt(3))], backend='normaliz'); Q\nA 1-dimensional polyhedron in (Symbolic Ring)^2 defined as the convex hull of 1 vertex and 1 line\n```\n\n\nand it is still possible to do:\n\n\n```\nsage: R = Polyhedron(lines=[(1, sqrt(3))],backend='cdd',base_ring=RDF);R\nA 1-dimensional polyhedron in RDF^2 defined as the convex hull of 1 vertex and 1 line\n```\n\n\nSimilar examples should now complete the docstring, now that #25097 is merged.",
    "created_at": "2019-07-22T16:29:49Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16960",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16960#issuecomment-224584",
    "user": "https://github.com/jplab"
}
```

Just an update of the current situation in `8.9beta3`:


```
sage: var('x')
x
sage: K.<sqrt3> = NumberField(x^2-3, embedding=1.732)
sage: P = Polyhedron(lines=[(1,sqrt3)])
sage: P.rays()
()
sage: P.lines()
(A line in the direction (1, sqrt3),)
sage: P = Polyhedron(lines=[(1, sqrt(3))])
Traceback (most recent call last):
...
ValueError: no default backend for computations with Symbolic Ring
sage: P = Polyhedron(lines=[(1, sqrt(3))], base_ring=AA); P
A 1-dimensional polyhedron in AA^2 defined as the convex hull of 1 vertex and 1 line
sage: Q = Polyhedron(lines=[(1, sqrt(3))], backend='normaliz'); Q
A 1-dimensional polyhedron in (Symbolic Ring)^2 defined as the convex hull of 1 vertex and 1 line
```


and it is still possible to do:


```
sage: R = Polyhedron(lines=[(1, sqrt(3))],backend='cdd',base_ring=RDF);R
A 1-dimensional polyhedron in RDF^2 defined as the convex hull of 1 vertex and 1 line
```


Similar examples should now complete the docstring, now that #25097 is merged.
