# Issue 32945: Symbolic expression .roots() can't solve a quadratic equation

Issue created by migration from https://trac.sagemath.org/ticket/33182

Original creator: @galashin

Original creation time: 2022-01-15 13:49:05

The following throws a `TypeError`:

```
sage: z=var("z")
sage: g=z + 2/z + 3
sage: g.roots(z,ring=ComplexField (prec=10), multiplicities=False)
TypeError: fraction must have unit denominator
```

Meanwhile, this works:

```
sage: g=z^2 + 2 + 3*z
sage: g.roots(z,ring=ComplexField (prec=10), multiplicities=False)
[-2.0, -1.0]
```




---

Comment by @DaveWitteMorris created at 2022-01-15 17:07:34

Changing priority from major to minor.


---

Comment by @DaveWitteMorris created at 2022-01-15 17:07:34

Changing type from PLEASE CHANGE to enhancement.


---

Comment by @DaveWitteMorris created at 2022-01-15 17:07:34

This is user error. Specifying a ring tells the method to convert the expression to a polynomial over that ring:

```
INPUT: ...

   * "ring" - a ring (default None): if not None, convert self to a
     polynomial over ring and find roots over ring
```

That is impossible in this case, so an exception is raised.  

Should we improve the error message, or just close this ticket as invalid?  (Or does the method need enhancement?)

PS The method works as expected if no ring is specified:

```
sage: z = var("z")
sage: g = z + 2/z + 3
sage: g.roots(z, multiplicities=False)
[-2, -1]
```



---

Comment by @DaveWitteMorris created at 2022-01-15 17:07:34

Changing component from PLEASE CHANGE to symbolics.


---

Comment by @trevorgunn created at 2022-01-16 02:08:25

I think it is more predictable to (try to) convert to a rational function and compute the roots of the numerator. One could do this manually, sure, but asking for the zeroes of a rational function isn't too uncommon. And it already computes the roots of symbolic rational functions.
