# Issue 17921: `__getitem__` for libGap_Element

Issue created by migration from Trac.

Original creator: vdelecroix

Original creation time: 2015-04-11 11:20:07

CC:  vbraun dimpase

There are two issue with `__getitem__` on gap vs libgap elements:
 - gap indices start with `1`. This is respected with the gap interface but not with the libgap interface
 - most libgap elements lacks a `__getitem__`

Compare:

```
sage: irr = libgap.Irr(libgap.CharacterTable(S))
sage: irr[0]
Character( CharacterTable( Sym( [ 1 .. 10 ] ) ), [ 1, -1, 1, -1, 1, -1, 1, -1, 1, -1, 1, -1, 1, 1, -1, 1, -1, 1, -1, 1, -1, 1, -1, 1, -1, 1, 1, -1, -1, 1, -1, 1, -1, -1, 1, 1, -1, 1, -1, 1, 1, -1 ] )
sage: irr[0][0]
Traceback (most recent call last):
...
TypeError: 'sage.libs.gap.element.GapElement' object has no attribute '__getitem__'
```

with

```
sage: irr = gap.Irr(gap.CharacterTable(S))
sage: irr[1]
Character( CharacterTable( SymmetricGroup( [ 1 .. 10 ] ) ), 
[ 1, -1, 1, -1, 1, -1, 1, -1, 1, -1, 1, -1, 1, 1, -1, 1, -1, 1, -1, 1, -1, 1, 
  -1, 1, -1, 1, 1, -1, -1, 1, -1, 1, -1, -1, 1, 1, -1, 1, -1, 1, 1, -1 ] )
sage: irr[1][1]
1
```



---

Comment by vbraun created at 2015-04-11 12:05:08

libgap lists are python-iterable, so `__getitem__` needs to start at 0. otherwise you'd have `list(x)[0] != x[0]`


---

Comment by vdelecroix created at 2015-04-11 12:12:39

Replying to [comment:1 vbraun]:
> libgap lists are python-iterable, so `__getitem__` needs to start at 0. otherwise you'd have `list(x)[0] != x[0]`

gap lists are Python iterable as well

```
sage: list(gap.List([1,2,3]))
[1, 2, 3]
```

and having `list(x)[0] != x[0]` is not breaking any rule.


---

Comment by vbraun created at 2015-04-11 12:17:46

It does break the rule of least surprise, e.g.

```
sage: l = some_computation()
sage: l 
[ 1, 2, 3 ]
sage: l[0]     # guess what?
```



---

Comment by vdelecroix created at 2015-04-11 12:30:03

Replying to [comment:3 vbraun]:
> It does break the rule of least surprise, e.g.
> {{{
> sage: l = some_computation()
> sage: l 
> [ 1, 2, 3 ]
> sage: l[0]     # guess what?
> }}}

I agree with your example. On the other hand, gap permutations starts at 1 and it is coherent with their lists starting at 1.

More importantly, for who is intended the gap/libgap interface objects (and more generally Sage interface objects):
 - everybody
 - Sage programmers
 - users knowing gap (pari, singular, etc)
 - ?
I rarely use `._pari_()`, `._gap_()` when doing actual computations. When I do, it is that Sage is lacking some interface.

Vincent


---

Comment by jdemeyer created at 2015-04-11 12:42:08

Sage also redefines indexing for PARI objects (PARI starts counting at 1, Sage at 0):

```
sage: pari("[1,2,3][1]")
1
sage: pari("[1,2,3]")[1]
2
```



---

Comment by vdelecroix created at 2015-04-11 13:18:17

Replying to [comment:5 jdemeyer]:
> Sage also redefines indexing for PARI objects (PARI starts counting at 1, Sage at 0):
> {{{
> sage: pari("[1,2,3][1]")
> 1
> sage: pari("[1,2,3]")[1]
> 2
> }}}

All right, this is as much consistent as gap vs libgap

```
sage: pari("[1,2,3]")[1]
2
sage: gp("[1,2,3]")[1]
1
```


I will just add some warning in the doc and try to implement this `__getitem__` support in libgap.

Vincent


---

Comment by vdelecroix created at 2015-04-11 14:05:46

Changing priority from critical to major.


---

Comment by vdelecroix created at 2015-04-11 14:05:46

I guess this is far from being optimal but it is at least very useful to me!

Vincent
----
New commits:


---

Comment by vdelecroix created at 2015-04-11 14:05:46

Changing status from new to needs_review.


---

Comment by vbraun created at 2015-06-19 08:58:23

Getitem without length is IMHO useless. The GAP function `IsList` just calls `IS_LIST` internally, so we should perhaps use that instead of `IS_PLIST` to decide when to wrap it in a `GapElement_List`


---

Comment by git created at 2016-04-30 21:21:16

Branch pushed to git repo; I updated commit sha1. This was a forced push. New commits:


---

Comment by vdelecroix created at 2016-04-30 21:26:57

Replying to [comment:8 vbraun]:
> Getitem without length is IMHO useless. The GAP function `IsList` just calls `IS_LIST` internally, so we should perhaps use that instead of `IS_PLIST` to decide when to wrap it in a `GapElement_List`

Indeed it is much more robust and general. That way libgap vectors and matrices are also considered as lists

```
sage: M = libgap.eval('SL(2,GF(5))').GeneratorsOfGroup()[1]
sage: M
[ [ Z(5)^2, Z(5)^0 ], [ Z(5)^2, 0*Z(5) ] ]
sage: M[0]
[ Z(5)^2, Z(5)^0 ]
```



---

Comment by dimpase created at 2016-05-03 18:52:46

I don't really get the purpose of this ticket; e.g.
`m = libgap.eval('[[Z(2^2), Z(2)^0],[0*Z(2), Z(2<sup>2)</sup>2]]')`
can just as well be done as follows, without an `eval`:

```
F=libgap.GF(4)
a=F.PrimitiveElement()
m = libgap([[a,a^0],[0*a,a^2]])
```



---

Comment by vdelecroix created at 2016-05-03 20:12:25

What are you exactly complaining about? With the branch, I am providing access to `__getitem__` and `__len__` for more gap objects. What `eval` has to do with all of this!?


---

Comment by dimpase created at 2016-05-03 20:29:38

Sorry, well, look at your branch yourself. It seems that you have removed and re-inserted a big chunk. Namely, that `m = libgap.eval('[[Z(2^2), Z(2)^0],[0*Z(2), Z(2<sup>2)</sup>2]]')` is from "green" part, and so I assumed that is a part of the ticket contribution...


---

Comment by vdelecroix created at 2016-05-03 21:24:25

Indeed, I moved `matrix` and `vector` from `GapElement` to `GapElement_List`.

Though, I can simplify the line that you don't like.


---

Comment by git created at 2016-05-03 21:31:38

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by vdelecroix created at 2016-05-08 03:03:11

Is the description helpful enough? I can revamp the commits if you like.


---

Comment by dimpase created at 2016-05-09 14:11:52

Changing status from needs_review to positive_review.


---

Comment by dimpase created at 2016-05-09 14:11:52

looks good to me.


---

Comment by vbraun created at 2016-05-17 07:16:48

Resolution: fixed
