# Issue 12042: polygon documentation in error

Issue created by migration from https://trac.sagemath.org/ticket/12214

Original creator: kcrisman

Original creation time: 2011-12-21 19:55:41

Assignee: jason, was

Keywords: beginner


```
Type polygon.options for a dictionary of the default options for polygons. 
```

This seems to not be correct.

```
sage: polygon.options
---------------------------------------------------------------------
AttributeError: 'function' object has no attribute 'options'
```

We should fix the documentation to 

```
sage: sage.plot.polygon.polygon2d.options
{'alpha': 1, 'legend_label': None, 'rgbcolor': (0, 0, 1), 'thickness': 0}
```

or something else that fixes this.


---

Comment by ksmith created at 2012-01-10 16:27:39


```
sage: polygon2d      
<function polygon2d at 0x9c61064>
sage: polygon2d.options
{'alpha': 1, 'legend_label': None, 'rgbcolor': (0, 0, 1), 'thickness': 0}
sage: polygon3d
<function polygon3d at 0x9edcd14>
sage: polygon3d.options
{'color': (0, 0, 1), 'opacity': 1}

```


Here's what actually works


---

Attachment


---

Comment by ksmith created at 2012-01-10 17:19:57

I just changed the references from polygon.options to polygon2d.options and polygon3d.options.


---

Comment by ksmith created at 2012-01-10 17:19:57

Changing status from new to needs_review.


---

Comment by kcrisman created at 2012-01-10 17:46:38

Changing status from needs_review to needs_work.


---

Comment by kcrisman created at 2012-01-10 17:46:38

Apparently the documentation is actually _wrong_ about how `reset` works.  I'll look into this.    This should definitely be fixed at the same time, so "needs work", but the initial change is fine.


---

Comment by kcrisman created at 2012-01-10 20:40:30

This is really weird.  Apparently the resetting of options actually _does_ work!  But...

```

sage: polygon2d.options
{'alpha': 1, 'legend_label': None, 'rgbcolor': (0, 0, 1), 'thickness': 0}
sage: P = polygon([[1,2], [5,6], [5,0]]); P # looks blue
sage: polygon2d.options['rgbcolor']=(1,0,0)
sage: P = polygon([[1,2], [5,6], [5,0]]); P # looks red
sage: polygon2d.options
{'alpha': 1, 'legend_label': None, 'rgbcolor': (1, 0, 0), 'thickness': 0}
sage: polygon2d.defaults()
{'alpha': 1, 'legend_label': None, 'rgbcolor': (0, 0, 1), 'thickness': 0}
sage: polygon2d.reset()
sage: polygon2d.options
{'alpha': 1, 'legend_label': None, 'rgbcolor': (1, 0, 0), 'thickness': 0}
sage: P = polygon([[1,2], [5,6], [5,0]]); P # looks blue again like it should
```

But for some reason the `options` never changed.

I've asked about this on [sage-devel](http://groups.google.com/group/sage-devel/browse_thread/thread/3a4aa8c203c36c52).  But in any case if that doesn't work, it is also that way on disk and others (I've checked), so that wouldn't hold things up on this.  

Anyway, that means we just have to change to `polygon2d.reset()` and `polygon3d.reset()`.


---

Comment by ksmith created at 2012-01-11 22:07:09

Changing keywords from "beginner" to "beginner sd35.5".


---

Comment by kcrisman created at 2012-01-12 16:02:41

> But for some reason the `options` never changed.

This is now #12300.


---

Comment by kcrisman created at 2012-05-27 06:50:54

This is a dup of #6367, more or less.  Added the author of this patch there as well.


---

Comment by kcrisman created at 2012-05-27 06:50:54

Changing status from needs_work to positive_review.


---

Comment by kcrisman created at 2012-05-27 06:51:03

Changing keywords from "beginner sd35.5" to "beginner sd35.5 sd40.5".


---

Comment by jdemeyer created at 2012-06-28 08:33:53

Resolution: duplicate
