# Issue 23962: Simplifications in calculus on manifolds with derivatives of symbolic functions

Issue created by migration from https://trac.sagemath.org/ticket/24199

Original creator: egourgoulhon

Original creation time: 2017-11-11 17:05:06

CC:  mmancini rllozes tscrim

Keywords: manifold calculus

The function `sage.manifolds.utilities.simplify_sqrt_real`, which is involved in calculus on manifolds (see [here](http://doc.sagemath.org/html/en/reference/manifolds/sage/manifolds/utilities.html#sage.manifolds.utilities.simplify_chain_real)), does not simplify sqrt's as soon as the expression contains some derivative of a symbolic function:

```
sage: from sage.manifolds.utilities import simplify_sqrt_real
sage: f = function('f')
sage: assume(x<1)
sage: simplify_sqrt_real(sqrt(x^2-2*x+1))  # OK
-x + 1
sage: simplify_sqrt_real(sqrt(x^2-2*x+1) * diff(f(x), x))  # nothing done
sqrt(x^2 - 2*x + 1)*diff(f(x), x)
```

The same limitation holds for derivatives denoted by `D[...]` instead of `diff`:

```
sage: y = var('y'); s = sqrt(x^2-2*x+1) * diff(f(x), x).subs(x=y^2); s
sqrt(x^2 - 2*x + 1)*D[0](f)(y^2)
sage: simplify_sqrt_real(s)  # nothing done
sqrt(x^2 - 2*x + 1)*D[0](f)(y^2)
```

Similarly, the function `sage.manifolds.utilities.simplify_abs_trig` does not perform any simplification when a derivative is present:

```
sage: from sage.manifolds.utilities import simplify_abs_trig
sage: assume(x>0); assumptions()
[x < 1, x > 0]
sage: simplify_abs_trig(abs(sin(x)))  # OK
sin(x)
sage: simplify_abs_trig(abs(sin(x)) * diff(f(x), x))  # nothing done
abs(sin(x))*diff(f(x), x)
```


The code introduced in this ticket repairs this. We have now, with the same assumptions as above:

```
sage: simplify_sqrt_real(sqrt(x^2-2*x+1) * diff(f(x), x))
-(x - 1)*diff(f(x), x)
sage: simplify_sqrt_real(s)
-(x - 1)*D[0](f)(y^2)
sage: simplify_abs_trig(abs(sin(x)) * diff(f(x), x))
sin(x)*diff(f(x), x)
```

In addition, `simplify_abs_trig` is now capable to treat `abs(cos(...))`:

```
sage: simplify_abs_trig(abs(cos(x))) # recall that 0 < x < 1 < pi/2
cos(x)
sage: simplify_abs_trig(abs(cos(x+2)))
-cos(x + 2)
sage: simplify_abs_trig(abs(cos(x+2)) * diff(f(x), x))
-cos(x + 2)*diff(f(x), x)
```



---

Comment by egourgoulhon created at 2017-11-11 17:10:54

New commits:


---

Comment by egourgoulhon created at 2017-11-11 17:10:54

Changing status from new to needs_review.


---

Comment by tscrim created at 2017-11-11 22:46:11

LGTM.

As a possible improvement for another ticket, instead of string manipulations, you might want to consider contacting, e.g., Ralf (rws) to see if there is a better way by directly manipulating the expression tree. Or if there is an easy way to fix some of these problems upstream.


---

Comment by tscrim created at 2017-11-11 22:46:21

Changing status from needs_review to positive_review.


---

Comment by egourgoulhon created at 2017-11-11 23:47:32

Replying to [comment:2 tscrim]:
> 
> As a possible improvement for another ticket, instead of string manipulations, you might want to consider contacting, e.g., Ralf (rws) to see if there is a better way by directly manipulating the expression tree. Or if there is an easy way to fix some of these problems upstream.

Thanks for the suggestion. I agree that using the expression tree would be an improvement.

And thank you for the review!


---

Comment by egourgoulhon created at 2017-11-17 11:16:29

Replying to [comment:4 egourgoulhon]:
> Replying to [comment:2 tscrim]:
> > 
> > As a possible improvement for another ticket, instead of string manipulations, you might want to consider contacting, e.g., Ralf (rws) to see if there is a better way by directly manipulating the expression tree. Or if there is an easy way to fix some of these problems upstream.
> 
> Thanks for the suggestion. I agree that using the expression tree would be an improvement.
> 

Done in #24232


---

Comment by egourgoulhon created at 2017-11-19 10:31:44

This is superseded by #24232.


---

Comment by embray created at 2017-12-12 08:23:33

Resolution: wontfix
