# Issue 25707: Evaluating polynomial().list() on 0 element is inconsistent among different precision types

Issue created by migration from Trac.

Original creator: varul

Original creation time: 2018-07-27 04:27:39

CC:  roed caruso

Keywords: padicIMA

I would expect the result of the following six commands to be the same.

```
sage: ZqFM(4,names='a')(0).polynomial().list()
[]
sage: ZqCA(4,names='a')(0).polynomial().list()
[]
sage: ZqFP(4,names='a')(0).polynomial().list()
[]
sage: QqFP(4,names='a')(0).polynomial().list()
[]
sage: ZqCR(4,names='a')(0).polynomial().list()
[0]
sage: QqCR(4,names='a')(0).polynomial().list()
[0]
```

However, they are not. The ones where the precision model is capped-relative gives [0] instead of the expected [].


---

Comment by roed created at 2019-09-07 12:09:10

Changing keywords from "padicIMA" to "padicIMA, padicBordeaux".
