# Issue 16668: GSL can't handle really long intervals for integration?

Issue created by migration from https://trac.sagemath.org/ticket/16905

Original creator: kcrisman

Original creation time: 2014-08-29 16:01:49

CC:  jakobkroeker


```
f1(x)=1/sqrt(x^3+2)
f2(x)=1/sqrt(x^4+2)
sage: numerical_integral(f2,1,10^8)
(0.8815690504421161, 3.309409685784312e-09)
sage: numerical_integral(f2,1,10^9)
(0.8815690594421439, 2.7280605832086615e-08)
sage: numerical_integral(f2,1,10^10)
(0.8815690603426408, 6.194229607849825e-07)
sage: numerical_integral(f2,1,10^11)
(2.3214916598860602e-07, 4.5569931705290324e-07)
```

See [here](https://groups.google.com/forum/#!topic/sage-support/l9sgScn0BX0) for first report.


---

Comment by kcrisman created at 2014-08-29 16:06:34

Maxima (the `.nintegrate` method) seems to have a similar problem.
