# Issue 11611: bug in DirichletGroup and/or DirichletCharacter when the modulus is 1

Issue created by migration from Trac.

Original creator: was

Original creation time: 2011-09-06 18:16:39

Assignee: was

Observe that the value of chi(1) below depends on whether `chi.values()` is called first.   Thus there is certainly a bug.  I think we should always have `chi(1)=1`, since `gcd(1,1)=1`; this is also consistent with the rule that if psi is trivial but not primitive, then `psi(n)=1` for all n coprime to the modulus of psi.

See this thread: 
http://groups.google.com/group/sage-devel/browse_thread/thread/fa94a97612c7225b


```
wstein`@`ubuntu:~$ sage
----------------------------------------------------------------------
----------------------------------------------------------------------                                               
**********************************************************************                                               
*                                                                    *                                               
* Warning: this is a prerelease version, and it may be unstable.     *
*                                                                    *
**********************************************************************
sage: chi = DirichletGroup(1)[0]
sage: chi(1)
1
sage: chi.values()
[1]
sage: 
Exiting Sage (CPU time 0m0.09s, Wall time 0m18.02s).
wstein`@`ubuntu:~$ sage
----------------------------------------------------------------------
----------------------------------------------------------------------
**********************************************************************
*                                                                    *
* Warning: this is a prerelease version, and it may be unstable.     *
*                                                                    *
**********************************************************************
sage: chi = DirichletGroup(1)[0]
sage: chi.values()
[0]
sage: chi(1)
0
```



---

Comment by AlexGhitza created at 2014-04-24 08:22:09

This was fixed in #14368.  In sage-6.1.1 we have:


```
sage: chi = DirichletGroup(1)[0]
sage: chi.values()
[1]
sage: chi(1)
1
```


I am adding a bit to the existing doctest to illustrate this.


---

Comment by AlexGhitza created at 2014-04-24 08:22:59

Changing status from new to needs_review.


---

Comment by AlexGhitza created at 2014-04-24 08:22:59

New commits:


---

Comment by pbruin created at 2014-04-24 11:38:45

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2014-04-25 14:20:48

Resolution: fixed
