# Issue 34065: incorrect computations in Singular ring of characteristic > 2^29

archive/issues_034065.json:
```json
{
    "body": "Example (Sage 9.6):\n\n\n```sage\nsage: # correct\nsage: F.<t> = GF((2^29-3, 2))\nsage: R.<x> = PolynomialRing(F, implementation='singular')\nsage: ~R(t)\n(-t - 1)\n```\n\n\n```sage\nsage: # incorrect\nsage: F.<t> = GF((2^29+11, 2))\nsage: R.<x> = PolynomialRing(F, implementation='singular')\nsage: ~R(t)\n0\n```\n\n\nMoreover, after running the incorrect example, the correct one becomes incorrect too, hinting at some kind of state corruption.\n\nIssue created by migration from https://trac.sagemath.org/ticket/34302\n\n",
    "created_at": "2022-08-08T04:26:22Z",
    "labels": [
        "algebra",
        "major",
        "bug"
    ],
    "title": "incorrect computations in Singular ring of characteristic > 2^29",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/34065",
    "user": "lorenz"
}
```
Example (Sage 9.6):


```sage
sage: # correct
sage: F.<t> = GF((2^29-3, 2))
sage: R.<x> = PolynomialRing(F, implementation='singular')
sage: ~R(t)
(-t - 1)
```


```sage
sage: # incorrect
sage: F.<t> = GF((2^29+11, 2))
sage: R.<x> = PolynomialRing(F, implementation='singular')
sage: ~R(t)
0
```


Moreover, after running the incorrect example, the correct one becomes incorrect too, hinting at some kind of state corruption.

Issue created by migration from https://trac.sagemath.org/ticket/34302





---

archive/issue_comments_483411.json:
```json
{
    "body": "The [singular manual](https://www.singular.uni-kl.de/hannes/sing_411.htm) says \"the characteristic of a prime field in the factory routines must be less than 536870912 (2<sup>29</sup>)\".  So I think we should be throwing an error in this situation.",
    "created_at": "2022-08-08T05:19:23Z",
    "issue": "https://github.com/sagemath/sagetest/issues/34065",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/34065#issuecomment-483411",
    "user": "@DaveWitteMorris"
}
```

The [singular manual](https://www.singular.uni-kl.de/hannes/sing_411.htm) says "the characteristic of a prime field in the factory routines must be less than 536870912 (2<sup>29</sup>)".  So I think we should be throwing an error in this situation.
