# Issue 13504: Get assumptions by variables

Issue created by migration from https://trac.sagemath.org/ticket/13708

Original creator: noud

Original creation time: 2012-11-13 20:52:07

Assignee: Noud

Keywords: symbolic, assumptions, variable

Hi everyone,

I'm very exited to create my first ticket and add my first patch. It would be nice if the assumption function could return the assumptions of a variable explicitly. For example:

```
sage: x, y, z = var('x y z')
sage: assume(x, 'integer')
sage: assume(y > 0)
sage: assume(y**2 + z**2 == 1)
sage: assume(x < 0)
sage: assumptions()
[x is integer, y > 0, y^2 + z^2 == 1, x < 0]
sage: assumptions(x)
['integer', x < 0]
sage: assumptions(x, y)
[x is integer, x < 0, y > 0, y^2 + z^2 == 1]
sage: assumptions(z)   
[y^2 + z^2 == 1]
```


I'll upload a solution for this suggestion shortly.


---

Comment by noud created at 2012-11-13 20:52:53

Changing component from PLEASE CHANGE to symbolics.


---

Attachment


---

Comment by noud created at 2012-11-13 21:00:58

I added a patch which allows sage to do the things shown in the Description box. I hope this code makes sense. Please be easy on me, it's my first patch. ;)

Best,
Noud


---

Comment by burcin created at 2012-11-19 02:56:37

Changing type from PLEASE CHANGE to enhancement.


---

Comment by burcin created at 2012-11-19 02:56:37

Changing status from new to needs_review.


---

Attachment

Thanks for the patch. Your changes look good to me. I attached a referee patch to fix some minor issues:

 * do not use strings to check if an assumption contains a variable
 * minor documentation fix (code blocks should be preceeded by `::`)

If you're OK with my changes, feel free to switch this ticket to positive_review.


---

Comment by noud created at 2012-11-20 20:42:58

Changing status from needs_review to positive_review.


---

Comment by noud created at 2012-11-20 21:26:56

Thank you, this seems very nice. I like it. 

However I would still like to do something like this:

```
sage: x = var('x')
sage: assume(x, 'integer')
sage: 'integer' in assumptions(x) # or something in this fashion
True
```

That's why I added a 'integer' string in the assumption code, but I see that you removed this in the newer patch. I still do not know a nice solution for this (small) problem.


---

Comment by burcin created at 2012-11-21 09:00:59

Replying to [comment:6 noud]:
> Thank you, this seems very nice. I like it. 
> 
> However I would still like to do something like this:
> {{{
> sage: x = var('x')
> sage: assume(x, 'integer')
> sage: 'integer' in assumptions(x) # or something in this fashion
> True
> }}}
> That's why I added a 'integer' string in the assumption code, but I see that you removed this in the newer patch. I still do not know a nice solution for this (small) problem.

I removed that code because treating only the integer case specially is not a good long term solution.

The right way to handle this is via the `is_integer()` method of symbolic expressions:


```
sage: var('y', domain=ZZ)
y
sage: y.is_integer()
False
sage: var('a')
a
sage: a.is_integer()
False
```


Unfortunately, our wrappers around Maxima assumptions don't know anything about these and these don't know about Maxima assumptions. I can't even find a bug to make the two work together. Would you be interested in helping out? 

In order to make assumptions set domains in Pynac, all we need to do is add a call to `SR.symbol(variable_name, domain=new_domain)` in the code for `assume()` and reset the domain to `CC` in `forget()`.

This should all be done on a separate ticket of course.


---

Comment by noud created at 2012-11-26 20:10:45

Replying to [comment:7 burcin]:
> The right way to handle this is via the `is_integer()` method of symbolic expressions:
> 
> {{{
> sage: var('y', domain=ZZ)
> y
> sage: y.is_integer()
> False
> sage: var('a')
> a
> sage: a.is_integer()
> False
> }}}
> 
> Unfortunately, our wrappers around Maxima assumptions don't know anything about these and these don't know about Maxima assumptions. I can't even find a bug to make the two work together. Would you be interested in helping out? 

Certainly I would like to help! But I have no idea how to approach. To me it looks like if the function is_integer() should be modified. Could you explain to me a bit better how this works? I also don't get how this should work with SR.symbol.


---

Comment by robert_dodier created at 2012-11-29 20:03:04

You can ask Maxima to report what it assumptions it has recorded for a variable, via facts(x) where x is the variable of interest. Also, propvars(p) returns the variables for which property p has been declared, e.g. propvars('integer). I'm guessing that it might be preferable to get the report directly from Maxima since that's what actually affects results. Hope this helps.


---

Comment by jdemeyer created at 2012-12-21 09:32:51

Resolution: fixed
