# Issue 22354: coercion for base rings of free algebras

Issue created by migration from Trac.

Original creator: chapoton

Original creation time: 2017-03-13 13:35:31

CC:  tscrim

This does not work:

```
sage: A = algebras.FreePreLie(ZZ,1)
sage: x = A.gens()[0]; x
B[[]]
sage: 4/5*x
```

but this should coerce to the free PreLie algebra over QQ.

Same problem with algebras.Free and algebras.FreeZinbiel.


---

Comment by tscrim created at 2017-03-13 13:42:22

This is because there is not an appropriate construction functor analogous to `PolynomialFunctor`:

```sage
sage: R.<x> = ZZ[]
sage: R.construction()
(Poly[x], Integer Ring)
sage: R.<x,y> = FreeAlgebra(ZZ)
sage: R.construction()
```



---

Comment by chapoton created at 2017-03-14 10:19:01

I made a tentative for free PreLie algebras. Almost working, it seems.

Maybe we are lacking a category of "linear magmas" or "non associative rings" ?
----
New commits:


---

Comment by tscrim created at 2017-03-14 11:19:44

This isn't a matter of having the correct category. Instead, I think we might need to have a more generic such functor to allow base ring pushouts. So I would maybe take the functor class you have now and generalize it to accept a construction method/class, as well as a name (for displaying the functor). This would be something that we would likely use in a number of other places than those simply listed here (e.g., `CombinatorialFreeModule`).


---

Comment by chapoton created at 2017-03-14 11:27:45

I agree that something more general may be better, but I do not feel able to do that.

And so far my tentative is not working on morphisms..


---

Comment by tscrim created at 2017-03-14 16:52:23

Changing keywords from "" to "days85".


---

Comment by tscrim created at 2017-03-14 16:52:23

Changing component from PLEASE CHANGE to categories.


---

Comment by tscrim created at 2017-03-14 16:52:23

Then I will try to do some work on this this week.


---

Comment by git created at 2017-03-15 09:33:52

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by git created at 2017-03-15 10:31:50

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by tscrim created at 2017-03-16 17:00:10

If we do this in full generality, we will also solve #21405.


---

Comment by chapoton created at 2017-03-16 19:50:48

Sadly, my tentative here is not working. There must be something missing.


---

Comment by chapoton created at 2017-07-12 06:55:06

help, someone ? this would be a major improvement..


---

Comment by tscrim created at 2017-07-18 12:48:41

Sorry for not looking at this in detail sooner. So the pushout construction is working correctly:

```
sage: A = algebras.FreePreLie(ZZ, 'x')
sage: from sage.categories.pushout import pushout
sage: pushout(A, QQ)
Free PreLie algebra on one generator ['x'] over Rational Field
```

However, we have this:

```
sage: coercion_model.analyse(1/2, x)
(['Will try _r_action and _l_action'], None)
```

in contrast to

```
sage: R.<y> = ZZ[]
sage: coercion_model.analyse(1/2, y)
(['Action discovered.',
  Left scalar multiplication by Rational Field on Univariate Polynomial Ring in y over Integer Ring],
 Univariate Polynomial Ring in y over Rational Field)
```

This is a result of this difference:

```
sage: from sage.structure.coerce_actions import LeftModuleAction
sage: LeftModuleAction(QQ, R, QQ.an_element(), R.an_element())
Left scalar multiplication by Rational Field on Univariate Polynomial Ring in y over Integer Ring
sage: LeftModuleAction(QQ, A, QQ.an_element(), A.an_element())
---------------------------------------------------------------------------
CoercionException                         Traceback (most recent call last)
<ipython-input-86-e33515a394e6> in <module>()
----> 1 LeftModuleAction(QQ, A, QQ.an_element(), A.an_element())

/home/travis/sage-build/src/sage/structure/coerce_actions.pyx in sage.structure.coerce_actions.ModuleAction.__init__ (/home/travis/sage-build/src/build/cythonized/sage/structure/coerce_actions.c:7195)()
    372             raise CoercionException("The parent of %s is not %s but %s"%(a,S,parent(a)))
    373         if not isinstance(g, Element) or not isinstance(a, ModuleElement):
--> 374             raise CoercionException("not an Element acting on a ModuleElement")
    375         res = self.act(g, a)
    376         if parent(res) is not the_set:

CoercionException: not an Element acting on a ModuleElement
```

This is worked around by #23440. However, I think the proper fix is to not check `isinstance(a, ModuleElement)`, but instead for its parent `S` to be in the category of modules.

Really this should be done for CFM, but that one is too much of a base class and inheriting `construction()` would almost certainly cause too many (subtle) problems. Plus considering how the functors are implemented, it almost certainly is best to do this on a case-by-case basis.


---

Comment by tscrim created at 2017-07-18 12:49:45

I should also say that with this branch and #23440, I get

```
sage: A = algebras.FreePreLie(ZZ, 'x')
sage: x = A.gen(0)
sage: A.<x> = algebras.FreePreLie(ZZ)
sage: 1/2 * x
1/2*B[[]]
sage: _.parent()
Free PreLie algebra on one generator ['x'] over Rational Field
```



---

Comment by git created at 2017-07-31 11:23:27

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by chapoton created at 2017-07-31 11:26:49

There remains some failing doctest, to be investigated.


---

Comment by chapoton created at 2017-08-21 19:41:16

Travis, what do you think of the 2 remaining failures (see patchbot), when trying to find a common parent for `FreePreLie(QQ,'z,t')` and `FreePreLie(ZZ,'x,y,z')` ? Can we hope to make this work ? The same thing seems to work fine for polynomials, and I would very much like to enjoy the same comfort for pre-Lie algebras.


---

Comment by tscrim created at 2017-08-21 19:48:37

Replying to [comment:16 chapoton]:
> Travis, what do you think of the 2 remaining failures (see patchbot), when trying to find a common parent for `FreePreLie(QQ,'z,t')` and `FreePreLie(ZZ,'x,y,z')` ? Can we hope to make this work ? The same thing seems to work fine for polynomials, and I would very much like to enjoy the same comfort for pre-Lie algebras.

I do not have this for polynomials:

```
sage: R.<x,y> = ZZ[]
sage: S.<a,b,c> = QQ[]
sage: x + a
...
TypeError: unsupported operand parent(s) for +: ...
```

So I think we should simply remove these tests.


---

Comment by chapoton created at 2017-08-21 19:54:25

What about that:

```
sage: x,y=polygens(QQ,'x,y')
sage: a,b=polygens(ZZ,'y,z')
sage: x+a
x + y
sage: x+b
x + z
sage: (x+b).parent()
Multivariate Polynomial Ring in x, y, z over Rational Field
```



---

Comment by tscrim created at 2017-08-21 19:59:48

Ah, right common variables, I misread what the test was. Looking into it now.


---

Comment by tscrim created at 2017-08-21 20:30:10

Changing keywords from "days85" to "days85, days88, IMA coding sprints".


---

Comment by tscrim created at 2017-08-21 20:30:10

Okay, there seems to be a fundamental issue:

```
sage: F.<x,y,z> = algebras.FreePreLie(ZZ)
sage: G.<z,t> = algebras.FreePreLie(QQ)
sage: from sage.categories.pushout import 
sage: pushout(F, G)
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)
<ipython-input-5-42a86045bbaa> in <module>()
----> 1 pushout(F, G)

/home/travis/sage/local/lib/python2.7/site-packages/sage/categories/pushout.pyc in pushout(R, S)
   3920         # Rc is a list of functors from Z to R and Sc is a list of functors from Z to S
   3921         R_tower = expand_tower(R_tower[:len(Rs)+1])
-> 3922         S_tower = expand_tower(S_tower[:len(Ss)+1])
   3923     Rc = [c[0] for c in R_tower[1:]]
   3924     Sc = [c[0] for c in S_tower[1:]]

/home/travis/sage/local/lib/python2.7/site-packages/sage/categories/pushout.pyc in expand_tower(tower)
   4244             for ff in reversed(fs[1:]):
   4245                 new_tower.append((ff, R))
-> 4246                 R = ff(R)
   4247             new_tower.append((fs[0], R))
   4248     return list(reversed(new_tower))

/home/travis/sage/src/sage/categories/functor.pyx in sage.categories.functor.Functor.__call__ (/home/travis/sage/src/build/cythonized/sage/categories/functor.c:3077)()
    381         if is_Morphism(x):
    382             return self._apply_functor_to_morphism(x)
--> 383         y = self._apply_functor(self._coerce_into_domain(x))
    384         if not ((y in self.__codomain) or (y in self.__codomain.hom_category())):
    385             raise TypeError("%s is ill-defined, since it sends x (=%s) to something that is not in %s." % (repr(self), x, self.__codomain))

/home/travis/sage/src/sage/categories/functor.pyx in sage.categories.functor.Functor._coerce_into_domain (/home/travis/sage/src/build/cythonized/sage/categories/functor.c:2719)()
    296         """
    297         if not (x in  self.__domain):
--> 298             raise TypeError("x (=%s) is not in %s" % (x, self.__domain))
    299         return x
    300 

TypeError: x (=Free PreLie algebra on one generator ['x'] over Integer Ring) is not in Category of rings
```

This is ultimately the same problem when doing

```
sage: 1/2 * x
```


So I think the issue is you cannot simply stack the functors in this case, at least with how we are defining our functor. In other words, `PreLie(PreLie(QQ, 'x'), 'y')` does not make sense because `PreLie(QQ, 'x')` is not a ring (as the error message indicates). Actually, is

```
PreLie(PreLie(QQ, 'x'), 'y') [isomorphic] PreLie(QQ, 'x,y')
```

true? I think we might need to do something a little different and more careful than the polynomial functors do. I'm not sure exactly what that is yet.


---

Comment by chapoton created at 2017-08-22 13:21:28

So, there is something problematic here. I must admit that I do not understand enough of all this to investigate.

I would say that

```
PreLie(PreLie(QQ, 'x'), 'y') [isomorphic] PreLie(QQ, 'x,y')
```

make no sense, because `PreLie(QQ, 'x'), 'y')` is not a ring.

What is true (and comes from the operad structure) is that there is a natural "product map" from the free Pre-Lie algebra generated by a free pre-Lie algebra on V to the free pre-Lie algebra on V. Think of the natural product map from T(T(V)) to T(V). But maybe this is not so pertinent for the problem at stake.


---

Comment by git created at 2017-08-22 14:50:36

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by tscrim created at 2017-08-22 14:54:04

Here we go, this seems to fix it. It was more of a mathematical misunderstanding, see below for details.

So what we were doing before by mimicking polynomials is constructing a tower and then multiplying/composing the functors. Basically, it was doing something like this:

```
ZZ{x}{y}{z} = ZZ{x,y,z}
```

However, this is not how the construction works as you indicated in comment:21. So instead I am merging the functors into "bigger" functors during the `pushout` by implementing `merge` more carefully and removing `expand` (because they are not equivalent). Does that help explain things?


---

Comment by chapoton created at 2017-08-23 12:57:56

Changing status from new to needs_review.


---

Comment by chapoton created at 2017-08-23 12:57:56

Great ! Thanks a lot. Do you agree that we can set to positive once a patchbot has been through ?


---

Comment by tscrim created at 2017-08-23 14:17:44

Replying to [comment:24 chapoton]:
> Great ! Thanks a lot. Do you agree that we can set to positive once a patchbot has been through ?

Yep, that is correct.


---

Comment by git created at 2017-08-23 18:11:36

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by chapoton created at 2017-08-23 18:12:33

I fixed two very small things. As bot was green, I am setting to positive.


---

Comment by chapoton created at 2017-08-23 18:12:33

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2017-08-29 19:51:14

Resolution: fixed
