# Issue 31518: NumberFieldEmbedding does not work with relative number fields

archive/issues_031518.json:
```json
{
    "body": "CC:  @slel\n\nKeywords: NumberFieldEmbedding relative\n\nExample (in version 9.1, running on Ubuntu 18.04.3 LTS (64-bit)):\n\n\n\n```\nsage: K.<sqrt2> = QuadraticField(2, embedding=1.414)\nsage: L.<s> = K.extension(x^3 + (sqrt2/2 + 1/3)*x^2 + (2*sqrt2/5+3/7)*x - 1)\nsage: from sage.rings.number_field.number_field_morphisms import\nNumberFieldEmbedding\nsage: my_embedding = NumberFieldEmbedding(L, QQbar, L.relative_polynomial().roots(QQbar)[0][0])\nsage: my_embedding\nGeneric morphism:\n  From: Number Field in s with defining polynomial x^3 + (1/2*sqrt2 + 1/3)*x^2 + (2/5*sqrt2 + 3/7)*x - 1 over its base field\n  To:   Algebraic Field\n  Defn: s -> 0.5407496381556470?\nsage: my_embedding.gen_image()\n0.5407496381556470?\nsage: my_embedding(L.gen())\n0.01354690080260168?\nsage: my_embedding(sqrt2)\n-0.9806353488506175?\n```\n\n\nOf course, gen_image() should equal the image of L.gen(), and the image of sqrt2 should be the (positive) square root of 2. The issue seems to stem from Sage somehow confusing the relative generator of L (over K) with the absolute generator of L (over QQ).\n\nRelevant discussion on sage-support: [https://groups.google.com/g/sage-support/c/tRRJ-yEPLu4](https://groups.google.com/g/sage-support/c/tRRJ-yEPLu4)\n\nIssue created by migration from https://trac.sagemath.org/ticket/31755\n\n",
    "created_at": "2021-04-29T12:19:56Z",
    "labels": [
        "number fields",
        "major",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-9.8",
    "title": "NumberFieldEmbedding does not work with relative number fields",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/31518",
    "user": "@Ilia-Smilga"
}
```
CC:  @slel

Keywords: NumberFieldEmbedding relative

Example (in version 9.1, running on Ubuntu 18.04.3 LTS (64-bit)):



```
sage: K.<sqrt2> = QuadraticField(2, embedding=1.414)
sage: L.<s> = K.extension(x^3 + (sqrt2/2 + 1/3)*x^2 + (2*sqrt2/5+3/7)*x - 1)
sage: from sage.rings.number_field.number_field_morphisms import
NumberFieldEmbedding
sage: my_embedding = NumberFieldEmbedding(L, QQbar, L.relative_polynomial().roots(QQbar)[0][0])
sage: my_embedding
Generic morphism:
  From: Number Field in s with defining polynomial x^3 + (1/2*sqrt2 + 1/3)*x^2 + (2/5*sqrt2 + 3/7)*x - 1 over its base field
  To:   Algebraic Field
  Defn: s -> 0.5407496381556470?
sage: my_embedding.gen_image()
0.5407496381556470?
sage: my_embedding(L.gen())
0.01354690080260168?
sage: my_embedding(sqrt2)
-0.9806353488506175?
```


Of course, gen_image() should equal the image of L.gen(), and the image of sqrt2 should be the (positive) square root of 2. The issue seems to stem from Sage somehow confusing the relative generator of L (over K) with the absolute generator of L (over QQ).

Relevant discussion on sage-support: [https://groups.google.com/g/sage-support/c/tRRJ-yEPLu4](https://groups.google.com/g/sage-support/c/tRRJ-yEPLu4)

Issue created by migration from https://trac.sagemath.org/ticket/31755





---

archive/issue_comments_450594.json:
```json
{
    "body": "Put your name in the \"Authors\" field if you contribute code to fix the issue.",
    "created_at": "2021-04-29T13:14:11Z",
    "issue": "https://github.com/sagemath/sagetest/issues/31518",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/31518#issuecomment-450594",
    "user": "@slel"
}
```

Put your name in the "Authors" field if you contribute code to fix the issue.
