# Issue 10948: GCD in Polynomial Rings over Extension Fields

archive/issues_010948.json:
```json
{
    "body": "Assignee: AlexGhitza\n\nKeywords: gcd, polynomialring, extension fields\n\nDuring an `ask.sagemath.org` response (see [symbolic polynomial euclidean algorithm](http://ask.sagemath.org/question/461/symbolic-polynomial-euclidean-algorithm?answer=818#818)) I came across a bug in computing the GCD of two elements of a polynomial ring over an extension field. For example:\n\n\n```\nsage: R.<x> = PolynomialRing(QQ,'x')\nsage: p = x^2-2\nsage: q = x^2-3\nsage: K.<a,b> = QQ.extension([p,q])\nsage: S.<x> = PolynomialRing(K,'x')\nsage: f = a*x^2 * (x-1); g = a*x^2 * (x-b)\nsage: f.gcd(g)\nx^2\n```\n\n\nHowever, the result should be `a*x^2`.\n\nIssue created by migration from https://trac.sagemath.org/ticket/11057\n\n",
    "created_at": "2011-03-27T00:26:44Z",
    "labels": [
        "algebra",
        "major",
        "bug"
    ],
    "title": "GCD in Polynomial Rings over Extension Fields",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/10948",
    "user": "cswiercz"
}
```
Assignee: AlexGhitza

Keywords: gcd, polynomialring, extension fields

During an `ask.sagemath.org` response (see [symbolic polynomial euclidean algorithm](http://ask.sagemath.org/question/461/symbolic-polynomial-euclidean-algorithm?answer=818#818)) I came across a bug in computing the GCD of two elements of a polynomial ring over an extension field. For example:


```
sage: R.<x> = PolynomialRing(QQ,'x')
sage: p = x^2-2
sage: q = x^2-3
sage: K.<a,b> = QQ.extension([p,q])
sage: S.<x> = PolynomialRing(K,'x')
sage: f = a*x^2 * (x-1); g = a*x^2 * (x-b)
sage: f.gcd(g)
x^2
```


However, the result should be `a*x^2`.

Issue created by migration from https://trac.sagemath.org/ticket/11057





---

archive/issue_comments_117783.json:
```json
{
    "body": "Mathematical mistake. ``a`` is a unit in $QQ(a,b)$ so it's not part of the GCD. This ticket is not an issue / defect.",
    "created_at": "2011-04-01T18:33:33Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10948",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10948#issuecomment-117783",
    "user": "cswiercz"
}
```

Mathematical mistake. ``a`` is a unit in $QQ(a,b)$ so it's not part of the GCD. This ticket is not an issue / defect.



---

archive/issue_comments_117784.json:
```json
{
    "body": "Resolution: invalid",
    "created_at": "2011-04-01T18:33:33Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10948",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10948#issuecomment-117784",
    "user": "cswiercz"
}
```

Resolution: invalid
