# Issue 11809: map_coefficients (of multivariate polynomial ring) cannot change base_ring

Issue created by migration from https://trac.sagemath.org/ticket/11981

Original creator: dkrenn

Original creation time: 2011-11-02 16:03:33

Assignee: AlexGhitza

Keywords: map coefficients, multivariate polynomial ring, base ring

The `map_coefficients()` function of a multivariate polynomial ring cannot change the base ring. Sometimes this would be nice, e.g.

```
sage:  R.<r> = GF(9); S.<s> = GF(81)
sage:  h = Hom(R,S)[0]; h
Ring morphism:
  From: Finite Field in r of size 3^2
  To:   Finite Field in s of size 3^4
  Defn: r |--> 2*s^3 + 2*s^2 + 1
sage: T.<X,Y> = R[]   
sage:  f = r*X+Y
sage:  f.map_coefficients(h)  
Traceback (most recent call last)
...
NotImplementedError: 
```

`NotImplementedError` comes, because `R(2*s^3 + 2*s^2 + 1)` is not possible; it should be `S(2*s^3 + 2*s^2 + 1)`.


---

Comment by dkrenn created at 2011-11-02 16:08:02

Changing status from new to needs_review.


---

Attachment

Now there is an additional parameter. If given, then the base ring of the polynomial ring is changed. 
Example from above continued:

```
sage: f.map_coefficients(h,S)
(-s^3 - s^2 + 1)*X + Y
```



---

Comment by saraedum created at 2011-12-21 23:06:32

tries to improve the docstring


---

Comment by saraedum created at 2011-12-21 23:46:29

Changing keywords from "map coefficients, multivariate polynomial ring, base ring" to "map coefficients, multivariate polynomial ring, base ring, sd35".


---

Attachment

I found the docstring somewhat confusing. I tried to improve it. If you're happy with my changes, feel free to set it to positive_review.


---

Comment by dkrenn created at 2012-02-01 10:54:35

Changing status from needs_review to positive_review.


---

Comment by jdemeyer created at 2012-02-06 21:25:27

Resolution: fixed
