# Issue 15260: sum(lcm(10, i), i, 1, 10) gives incorrect answer

Issue created by migration from https://trac.sagemath.org/ticket/15497

Original creator: ppurka

Original creation time: 2013-12-09 12:05:02

CC:  kcrisman kbaut jakobkroeker

From google spreadsheet which no one reads `X-(`


```
sage: sum(lcm(10,x), x, 1, 10)  # Incorrect
550

sage: sum([lcm(10,i) for i in xrange(1,11)])  # Correct
320
```



---

Comment by kcrisman created at 2013-12-09 18:17:31

Here is the problem, presumably (`lcm` not being symbolic in this way):

```
sage: lcm(10,x)
10*x
```

We can all be Gauss with this.

```
sage: sum(lcm(1,x),x,1,100)
5050
```

The solution is to make sure that `lcm(a,b)` does something symbolic, or throws an error, when we feed it symbolic entries.  Is there already a ticket for this, perhaps?


---

Comment by jdemeyer created at 2013-12-10 08:42:52

Changing component from calculus to symbolics.


---

Comment by kcrisman created at 2014-08-06 03:37:18

See also #16721.
