# Issue 1903: elliptic curve period lattice Omega computation is always wrong the first time

Issue created by migration from https://trac.sagemath.org/ticket/1903

Original creator: was

Original creation time: 2008-01-24 02:36:13

Assignee: was

Check this out. The first time I define an elliptic curve and compute
the period lattice, it always gives exactly the same precision, irregardless
of the prec input.  Subsequent times give possibly correct precision.


```
sage: E = EllipticCurve('37a1')
sage: Lambda = E.period_lattice()
sage: Lambda.omega(200)
5.986917292463919259664019958905016355595167582740265970681046757126500713973
sage: Lambda.omega(100)
5.986917292463919259664019958905016355595167582740265970681046757126500713973365808240788134794102946871681054209894576388288774474744050508750753342186522750608666501193049250432894613814538902149811561273122089156345163427036485586852626497796017388487604174086333863088928480309531169016955719094015913439555469220814610215254636002519172466378969093006402072130793705592258575075486444380127839934596631023678346217719271793891480048154202569023527149733047069754453169881844338046858668017675435309133044249015102196051155809873806168636730720956496483885055762761489226969877518223414185587257206155078668194515311004693366757955307567080310433588840427191375819004300607360635859398481204844344393095079959927352487057219058204337964232422372592187511419483538297310727527566062827503999277428879770774843525427663851230372200222109074686953242505297927911230425946419543016023564723516967617433213851189659056134170443836653494765813269
sage: E = EllipticCurve('37a1')
sage: Lambda = E.period_lattice()
sage: Lambda.omega(500)
5.986917292463919259664019958905016355595167582740265970681046757126500713973
s}}}

Also, It would be good for Lambda to have a real_period() method that is the
same as omega. 


---

Comment by cremona created at 2008-09-04 16:32:20

This was duplicated in #3954 which is closed, so this can be, unless you want to hold out for real_period being a synonym for omega...


---

Comment by cremona created at 2008-09-09 14:09:35

This really can be closed now since I added the real_period function recently:

```
----------------------------------------------------------------------
----------------------------------------------------------------------
| SAGE Version 3.1.2.rc1, Release Date: 2008-09-09                   |
| Type notebook() for the GUI, and license() for information.        |
sage: E = EllipticCurve('37a1')
sage: L = E.period_lattice()
sage: L.real_period()
2.99345864623195963
sage: L.omega(100)
5.9869172924639192596640199589050163556
sage: L.omega(100)
5.9869172924639192596640199589050163556
sage: L.omega(200)
5.986917292463919259664019958905016355595167582740265970681046757127
sage: L.omega(200)
5.986917292463919259664019958905016355595167582740265970681046757127
sage: L.omega(500)
5.98691729246391925966401995890501635559516758274026597068104675712650071397336580824078813479410294687168105420989457638828877447474405050875075334218652
sage: L.omega(500)
5.98691729246391925966401995890501635559516758274026597068104675712650071397336580824078813479410294687168105420989457638828877447474405050875075334218652
```


I am changing it to "resolved as fixed";  hope that's ok.


---

Comment by cremona created at 2008-09-09 14:09:35

Resolution: fixed
