# Issue 12504: plot exclude sometimes just connects instead of excluding

archive/issues_012504.json:
```json
{
    "body": "Assignee: jason, was\n\nThis email on sage-support pretty much says it all.\n\n```\nI am trying to understand the behaviour of the option exclude in plot() when a range of values is included. \nIt looks to me that if a simple range like \"exclude=[pi..2*pi]\" is used and the function is defined and real-valued in that range then the end points and integer points between are excluded from the plot, whilst if the function is not real-valued in the range, e.g. \"sin(x)^cos(x)\",  then the whole range is excluded.  However, if several ranges are specified then when the function is real-valued the behaviour is like that for a single range, whilst if the function is not real-valued then the graph *is* plotted, incorrectly, for ranges after the first. For example the graph of \"plot(sin(x)^cos(x),(x,0,4*pi),exclude=[pi..2*pi,3*pi..4*pi])\" contains a straight line between 3*pi and 4*pi. Surely this cannot be the intended behaviour? \n```\n\nAlso, it can even happen for the first range.\n\n```\nsage: plot(sin(pi*x)^cos(pi*x),(x,0,4),exclude=[pi..2,3..4],ymax=20)\n```\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/12676\n\n",
    "created_at": "2012-03-16T12:58:15Z",
    "labels": [
        "graphics",
        "major",
        "bug"
    ],
    "title": "plot exclude sometimes just connects instead of excluding",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/12504",
    "user": "kcrisman"
}
```
Assignee: jason, was

This email on sage-support pretty much says it all.

```
I am trying to understand the behaviour of the option exclude in plot() when a range of values is included. 
It looks to me that if a simple range like "exclude=[pi..2*pi]" is used and the function is defined and real-valued in that range then the end points and integer points between are excluded from the plot, whilst if the function is not real-valued in the range, e.g. "sin(x)^cos(x)",  then the whole range is excluded.  However, if several ranges are specified then when the function is real-valued the behaviour is like that for a single range, whilst if the function is not real-valued then the graph *is* plotted, incorrectly, for ranges after the first. For example the graph of "plot(sin(x)^cos(x),(x,0,4*pi),exclude=[pi..2*pi,3*pi..4*pi])" contains a straight line between 3*pi and 4*pi. Surely this cannot be the intended behaviour? 
```

Also, it can even happen for the first range.

```
sage: plot(sin(pi*x)^cos(pi*x),(x,0,4),exclude=[pi..2,3..4],ymax=20)
```


Issue created by migration from https://trac.sagemath.org/ticket/12676





---

archive/issue_comments_148151.json:
```json
{
    "body": "Note\n\n```\nsage: [pi..2*pi,3*pi..4*pi]\n[pi, pi + 1, pi + 2, pi + 3, 3*pi, 3*pi + 1, 3*pi + 2, 3*pi + 3]\n```\n\nSo the following allows us to see more clearly what is going on.\n\nCompare\n\n```\nsage: plot(sin(x)^cos(x),(x,0,4*pi),exclude=[pi..2*pi,3*pi..4*pi],ticks=[[pi..2*pi,3*pi..4*pi],None])\n```\n\nto\n\n```\nsage: plot(sin(x)^cos(x),(x,0,4*pi-.1),exclude=[pi..2*pi,3*pi..4*pi],ticks=[[pi..2*pi,3*pi..4*pi],None])\n```\n\nto \n\n```\nsage: plot(sin(x)^cos(x),(x,0,6*pi),exclude=[pi..2*pi,3*pi..4*pi,5*pi..6*pi],ticks=[[pi..2*pi,3*pi..4*pi,5*pi..6*pi],None])\n```\n\nAnother couple to compare:\n\n```\nsage: plot(sin(pi*x)^cos(pi*x),(x,0,4),exclude=[3,4],ymax=20) \nsage: plot(sin(pi*x)^cos(pi*x),(x,0,4),exclude=[1,2,3,4],ymax=20) \n```\n\nwhich really shows that there is something subtle about the points involved when we have parts that can't be plotted due to not being real.",
    "created_at": "2012-03-16T14:09:22Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12504",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12504#issuecomment-148151",
    "user": "kcrisman"
}
```

Note

```
sage: [pi..2*pi,3*pi..4*pi]
[pi, pi + 1, pi + 2, pi + 3, 3*pi, 3*pi + 1, 3*pi + 2, 3*pi + 3]
```

So the following allows us to see more clearly what is going on.

Compare

```
sage: plot(sin(x)^cos(x),(x,0,4*pi),exclude=[pi..2*pi,3*pi..4*pi],ticks=[[pi..2*pi,3*pi..4*pi],None])
```

to

```
sage: plot(sin(x)^cos(x),(x,0,4*pi-.1),exclude=[pi..2*pi,3*pi..4*pi],ticks=[[pi..2*pi,3*pi..4*pi],None])
```

to 

```
sage: plot(sin(x)^cos(x),(x,0,6*pi),exclude=[pi..2*pi,3*pi..4*pi,5*pi..6*pi],ticks=[[pi..2*pi,3*pi..4*pi,5*pi..6*pi],None])
```

Another couple to compare:

```
sage: plot(sin(pi*x)^cos(pi*x),(x,0,4),exclude=[3,4],ymax=20) 
sage: plot(sin(pi*x)^cos(pi*x),(x,0,4),exclude=[1,2,3,4],ymax=20) 
```

which really shows that there is something subtle about the points involved when we have parts that can't be plotted due to not being real.
