# Issue 22277: Constants in an InfinitePolynomialRing do not act like polynomials

Issue created by migration from Trac.

Original creator: msaaltink

Original creation time: 2017-03-04 16:07:50

CC:  tscrim

Constants in an InfinitePolynomialRing are missing many expected methods.  For example:


```
sage: R.<x> = InfinitePolynomialRing(ZZ)
sage: a = R(3)
sage: b = 3 + x[0]
sage: type(a)
<class 'sage.rings.polynomial.infinite_polynomial_element.InfinitePolynomial_sparse'>
sage: type(b)
<class 'sage.rings.polynomial.infinite_polynomial_element.InfinitePolynomial_sparse'>
sage: b.is_constant()
False
sage: a.is_constant()
---------------------------------------------------------------------------
AttributeError                            Traceback (most recent call last)
<ipython-input-13-4b9a13af2a7a> in <module>()
----> 1 a.is_constant()

/opt/sage/local/lib/python2.7/site-packages/sage/rings/polynomial/infinite_polynomial_element.pyc in __getattr__(self, s)
    409             return getattr(self._p,s)
    410         except AttributeError:
--> 411             raise AttributeError('%s has no attribute %s'%(self.__class__, s))
    412 
    413     def ring(self):

AttributeError: <class 'sage.rings.polynomial.infinite_polynomial_element.InfinitePolynomial_sparse'> has no attribute is_constant
```


Another example:

```
sage: b.constant_coefficient()
3
sage: a.constant_coefficient()
---------------------------------------------------------------------------
AttributeError                            Traceback (most recent call last)
<ipython-input-14-2f3d9cae0a11> in <module>()
----> 1 a.constant_coefficient()

/opt/sage/local/lib/python2.7/site-packages/sage/rings/polynomial/infinite_polynomial_element.pyc in __getattr__(self, s)
    409             return getattr(self._p,s)
    410         except AttributeError:
--> 411             raise AttributeError('%s has no attribute %s'%(self.__class__, s))
    412 
    413     def ring(self):

AttributeError: <class 'sage.rings.polynomial.infinite_polynomial_element.InfinitePolynomial_sparse'> has no attribute constant_coefficient
```


And another:

```
sage: b.degree()
1
sage: a.degree()
---------------------------------------------------------------------------
AttributeError                            Traceback (most recent call last)
<ipython-input-10-1191944a72df> in <module>()
----> 1 a.degree()

/opt/sage/local/lib/python2.7/site-packages/sage/rings/polynomial/infinite_polynomial_element.pyc in __getattr__(self, s)
    409             return getattr(self._p,s)
    410         except AttributeError:
--> 411             raise AttributeError('%s has no attribute %s'%(self.__class__, s))
    412 
    413     def ring(self):

AttributeError: <class 'sage.rings.polynomial.infinite_polynomial_element.InfinitePolynomial_sparse'> has no attribute degree
```


This appears to follow from the type of the ``_p`` field of the values:

```
sage: type(b._p)
<type 'sage.rings.polynomial.multi_polynomial_libsingular.MPolynomial_libsingular'>
sage: type(a._p)
<type 'sage.rings.finite_rings.integer_mod.IntegerMod_int'>
```



---

Comment by msaaltink created at 2017-05-29 21:52:01

When the base ring is itself a polynomial ring, we can get mathematically incorrect answers:

```
sage: S.<y> = ZZ[]
sage: Q.<z> = InfinitePolynomialRing(S)
sage: a = Q(1+y)
sage: a
y + 1
sage: b = (1+y+z[0]) - z[0]
sage: b
y + 1
sage: a.parent()
Infinite polynomial ring in z over Univariate Polynomial Ring in y over Integer Ring
sage: b.parent()
Infinite polynomial ring in z over Univariate Polynomial Ring in y over Integer Ring
sage: a == b
True
sage: a.is_constant()
False
sage: b.is_constant()
True
sage: a.constant_coefficient()
1
sage: b.constant_coefficient()
y + 1
```

`b` is giving the correct answers, while `a` is not.


---

Comment by msaaltink created at 2017-05-29 21:58:52

There are also issues when creating from strings:

```
R.<x> = InfinitePolynomialRing(ZZ)
sage: R(3).parent()
Infinite polynomial ring in x over Integer Ring
sage: R("3").parent()
Integer Ring
```


Other polynomial rings work differently:

```
sage: S.<y> = ZZ[]
sage: S(3).parent()
Univariate Polynomial Ring in y over Integer Ring
sage: S("3").parent()
Univariate Polynomial Ring in y over Integer Ring
```



---

Comment by msaaltink created at 2017-07-09 20:32:18

Changing status from new to needs_review.


---

Comment by msaaltink created at 2017-07-09 20:32:18

I am not at all sure that this is the right way to fix the problem, but it is one way to do it.  I got a bit lost in the thickets of the coercion system trying to find a more reasonable place than in the `__init__` method (which has a comment stating that all the needed checks should already have been done elsewhere).
----
New commits:


---

Comment by vdelecroix created at 2017-07-09 21:00:49

To the question

```
# is there a better way to recognize polynomials than this "duck typing"?
```

the answer is yes

```
sage: from sage.rings.polynomial.polynomial_element import is_Polynomial
sage: from sage.rings.polynomial.multi_polynomial_element import is_MPolynomial
sage: p1 = ZZ['x'].an_element()
sage: p2 = ZZ.an_element()
sage: p3 = ZZ['x']['y'].an_element()
sage: p4 = ZZ['x,y'].an_element()
sage: def is_poly(p):
....:     return is_Polynomial(p) or is_MPolynomial(p)
sage: [is_poly(p) for p in (p1,p2,p3,p4)]
[True, False, True, True]
```



---

Comment by msaaltink created at 2017-07-09 21:21:07

OK, that's useful, thanks.  In fact, the _p field should always satisfy is_MPolynomial so I should just be able to use that.


---

Comment by git created at 2017-07-09 21:22:37

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by vdelecroix created at 2017-07-10 06:57:39

Changing status from needs_review to needs_work.


---

Comment by vdelecroix created at 2017-07-10 06:57:39

In the doctests, you need to have a line break before the first example and indent the examples with four spaces.

```
Check that :trac:`22514` is fixed
::
sage: R.<x> = InfinitePolynomialRing(ZZ)
```

should be

```
Check that :trac:`22514` is fixed::

   sage: R.<x> = InfinitePolynomialRing(ZZ)
```



---

Comment by vdelecroix created at 2017-07-10 07:04:11

This behavior is wrong

```
sage: R.<x> = InfinitePolynomialRing(QQ)
sage: R.gens_dict()['1']
1
sage: parent(_)
Rational Field
```

In order to respect compatibility with the other polynomial rings, 1 should not be a generator. (And the 1 above should not have been a Rational).


---

Comment by git created at 2017-07-10 13:54:35

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by msaaltink created at 2017-07-10 14:07:24

Re: "In the doctests, you need to have a line break before the first example and indent the examples ..."

Indeed this was a mistake; I have pushed a fix.

Re "This behavior is wrong  ... `R.gens_dict()['1']` ...": that's the way it worked before these patches.  I agree it is wrong, but seems unrelated to this ticket.  Should it perhaps be a new issue?

Strangely enough, `R.gens_dict()[s]` does not exhibit this problem for s = `'0'` or s = `'2'`; the underlying issue seems to be this:

```
sage: QQ.gens_dict()
{'1': 1}
```


You can get a similar issue with 

```
sage: GaussianIntegers().gens_dict()
{'I': I}
sage: R.<x> = InfinitePolynomialRing(GaussianIntegers())
sage: R.gens_dict()['I']
I
```



---

Comment by tscrim created at 2017-07-10 16:12:03

Replying to [comment:12 msaaltink]:
> Re "This behavior is wrong  ... `R.gens_dict()['1']` ...": that's the way it worked before these patches.  I agree it is wrong, but seems unrelated to this ticket.  Should it perhaps be a new issue?

I am not completely sure about that. The infinite polynomial ring is considered as tower of polynomial rings, which we really are considering as algebras over a base ring `R`. In this tower, there is a ring isomorphic to `R`, which is generated by `1` as an `R`-algebra. This is in line with, e.g., *Q*:

```
sage: QQ.gens()
(1,)
```

As `@`vdelecroix points out, this is inconsistent with polynomial rings in Sage:

```
sage: R = PolynomialRing(QQ, 0, 'x')
sage: R.gens()
()
```

Yet, to me, this says that the polynomial ring over `R` with 0 variables is precisely `{0}`. So I would instead classify this behavior of polynomial rings as a bug.

However, this is a little tangential to this ticket and probably should be a separate ticket.


---

Comment by msaaltink created at 2017-07-24 20:44:38

Replying to comment:13 from tscrim:

An old discussion on sage-devel, https://groups.google.com/forum/#!msg/sage-devel/BRE2F90oezU/xmKC86SRllEJ;context-place=forum/sage-devel suggests the following rule: if `R.base_ring()` is not `R`, then `R.gens()` should return the generators for R over its base ring.  So in your example, `R.base_ring()` is `QQ`, which is not `R` if we are being pedantic (ind indeed Sage is), and so a slavish adoption of the rule says that the empty set of generators is in fact the right answer.

The same rigid adoption of this rule says Sage is wrong here:

```
sage: R.<x> = InfinitePolynomialRing(QQ)
sage: R.ngens()
1
```

Surely the answer should be `+Infinity`.  I can see that the `gens_dict` we get for this makes some kind of sense, with an apparent infinity of keys, but `gens` seems wrong - it returns  one "generator" that is not even an element of the ring.

I'll do up a separate ticket on the generators.  With that, can _this_ ticket go back to the needs_review state (or maybe positive_review), or is there still some other issue?


---

Comment by tscrim created at 2017-07-24 22:58:24

Borrowing a famous quote, "It depends on what the meaning of the word 'is' is." If 'is' is in the Python sense, then yes. If 'is' means isomorphic to, then no. Plus, I think that it is worse to not break with convention here as 0 generators implies `{0}` a little too much.

I would say it is slightly misleading to call it a "discussion" when it is one question and one response. Plus, that is too far out of date to say that should still be the convention. We can always try a new thread on sage-devel and see what people think about this corner case.

However, the generators issue can definitely be a separate ticket. Sage has evolved since the initial implementation of `InfinitePolynomialRing`. I think the best way forward is to have an `algebra_generators` (and maybe `gens`) return a subclass of the appropriate `Family` that combines the behavior of `GensDictWithBasering`. Then we kill `ngens` with fire and holy water, where it becomes `R.gens().cardinality()` in real code. Finally, we implement a special `_first_ngens` that returns the appropriate `InfinitePolynomialGen` so we keep supporting the `R.<x> = ...` syntax.


---

Comment by msaaltink created at 2017-07-27 01:45:58

Changing status from needs_work to needs_review.


---

Comment by msaaltink created at 2017-07-27 01:45:58

I opened a topic on the correct behaviour of `R.gens()` and `R.gens_dict()` in the `sage-devel` group.  When there's some consensus there, I'll be happy to open a new ticket to have `InfinitePolynomialRing` conform to it.  With that deferred, I think this ticket is ready for review again.


---

Comment by msaaltink created at 2018-01-10 15:53:00

To [This is the Trac macro *ticket:22514* that was inherited from the migration](https://trac.sagemath.org/wiki/WikiMacros#ticket:22514-macro) and [This is the Trac macro *ticket:22514* that was inherited from the migration](https://trac.sagemath.org/wiki/WikiMacros#ticket:22514-macro):  This has been stalled for quite a while now and there has been no interest in the general question on `R.gens()` in `sage-devel`.  Is this patch just dead?  Can't we fix this defect?  What, if anything, can I do to move it forward?


---

Comment by vdelecroix created at 2018-01-11 17:11:32

"Authors" field of the ticket sould be filled.


---

Comment by vdelecroix created at 2020-02-17 20:51:40

Changing status from needs_review to needs_work.


---

Comment by vdelecroix created at 2020-02-17 20:51:40

New commits:


---

Comment by vdelecroix created at 2020-02-17 20:51:48

(rebased on latest beta)


---

Comment by git created at 2020-02-17 21:06:13

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by vdelecroix created at 2020-02-17 21:07:59

Changing status from needs_work to needs_review.


---

Comment by vdelecroix created at 2020-02-17 21:07:59

needs somebody to double check my changes


---

Comment by tscrim created at 2020-02-17 23:15:05

Changing status from needs_review to positive_review.


---

Comment by tscrim created at 2020-02-17 23:15:05

LGTM.


---

Comment by vbraun created at 2020-02-21 22:17:30

Resolution: fixed
