# Issue 17459: bug in polynomial interface to Singular (in special rings)

Issue created by migration from https://trac.sagemath.org/ticket/17696

Original creator: jakobkroeker

Original creation time: 2015-01-30 14:30:01

CC:  simonking malb swewers

Keywords: Singular polynomial interface

It seems that the interface to Singular has a bug,
see example:

```
sage: K0=GF(11)
sage: #K0=QQ
sage: R0.<b>=K0[]
sage: K.<b>=K0.extension(b^5+4)
sage: R1.<zzz>=K[]
sage: L=FractionField(R1)
sage: R.<x>=L[]
sage: f=x^4+1/(b*zzz)
True
sage: f._singular_()  #  where is the fraction 1/(b*zzz)  ?
x^4
sage: g = R(x^4)
sage: f==g
False

```


Note that already

```
sage: (1/(b*zzz))._singular_()
0 
```


Remarkable is that `f = x^4+1/(b)*(1/zzz) ` is correctly translated to Singular:

```
sage: K0=GF(11)
sage: #K0=QQ
sage: R0.<b>=K0[]
sage: K.<b>=K0.extension(b^5+4)
sage: R1.<zzz>=K[]
sage: L=FractionField(R1)
sage: R.<x>=L[]
sage: f=x^4+1/(b)*(1/zzz)
sage: f._singular_() 
-1/(4*zzz)*b^4+x^4
sage: g = -1/(4*zzz)*b^4+x^4
sage: f == g 
True
```


Please check  if there is a similar issue in other rings than in the example above.

`@`Simon, `@`Martin:
should I Ccing someone else or remove you from Cc?
