# Issue 12932: BooleanPolynomial.variables() consider "1" as a variable

archive/issues_012932.json:
```json
{
    "body": "Assignee: malb\n\nCC:  malb alexanderdreyer polybori\n\nKeywords: BooleanPolynomial\n\nThis is in contradiction with other functions (BooleanPolynomial.nvariables), and with the behavior of the \"normal\" class MPolynomial.\n\nExample:\n\n```\nsage: R.<x,y,z> = BooleanPolynomialRing()\nsage: p = R(1)\nsage: p.variables()\n(1,)\nsage: p.nvariables()\n0\n```\n\nWhich differs from:\n\n```\nsage: R.<x,y,z> = GF(2)[]\nsage: p = R(1)\nsage: p.variables()\n()\nsage: p.nvariables()\n0\n```\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/13104\n\n",
    "created_at": "2012-06-11T15:28:35Z",
    "labels": [
        "commutative algebra",
        "trivial",
        "bug"
    ],
    "title": "BooleanPolynomial.variables() consider \"1\" as a variable",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/12932",
    "user": "Bouillaguet"
}
```
Assignee: malb

CC:  malb alexanderdreyer polybori

Keywords: BooleanPolynomial

This is in contradiction with other functions (BooleanPolynomial.nvariables), and with the behavior of the "normal" class MPolynomial.

Example:

```
sage: R.<x,y,z> = BooleanPolynomialRing()
sage: p = R(1)
sage: p.variables()
(1,)
sage: p.nvariables()
0
```

Which differs from:

```
sage: R.<x,y,z> = GF(2)[]
sage: p = R(1)
sage: p.variables()
()
sage: p.nvariables()
0
```


Issue created by migration from https://trac.sagemath.org/ticket/13104





---

archive/issue_comments_155739.json:
```json
{
    "body": "Attachment [pbori_variables.patch](tarball://root/attachments/some-uuid/ticket13104/pbori_variables.patch) by Bouillaguet created at 2012-06-11 15:58:48\n\npatch that fixes the problem",
    "created_at": "2012-06-11T15:58:48Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12932",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12932#issuecomment-155739",
    "user": "Bouillaguet"
}
```

Attachment [pbori_variables.patch](tarball://root/attachments/some-uuid/ticket13104/pbori_variables.patch) by Bouillaguet created at 2012-06-11 15:58:48

patch that fixes the problem



---

archive/issue_comments_155740.json:
```json
{
    "body": "Changing status from new to needs_review.",
    "created_at": "2012-06-11T15:59:14Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12932",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12932#issuecomment-155740",
    "user": "Bouillaguet"
}
```

Changing status from new to needs_review.



---

archive/issue_comments_155741.json:
```json
{
    "body": "Hi, can you add a doctest that shows that the issue is resolved? I also CCed the PolyBoRi developers to make sure there isn't some obscure reason for this behaviour.",
    "created_at": "2012-06-11T16:19:29Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12932",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12932#issuecomment-155741",
    "user": "malb"
}
```

Hi, can you add a doctest that shows that the issue is resolved? I also CCed the PolyBoRi developers to make sure there isn't some obscure reason for this behaviour.



---

archive/issue_comments_155742.json:
```json
{
    "body": "Hi,\n\nI actually did, in fact. I modified the existing docstring to verify that:\n\n```\nsage: P.one_element().variables()  \n()\n```\n\nShould I add anything else?",
    "created_at": "2012-06-11T16:23:37Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12932",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12932#issuecomment-155742",
    "user": "Bouillaguet"
}
```

Hi,

I actually did, in fact. I modified the existing docstring to verify that:

```
sage: P.one_element().variables()  
()
```

Should I add anything else?



---

archive/issue_comments_155743.json:
```json
{
    "body": "Sorry, my bad!",
    "created_at": "2012-06-11T16:49:17Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12932",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12932#issuecomment-155743",
    "user": "malb"
}
```

Sorry, my bad!



---

archive/issue_comments_155744.json:
```json
{
    "body": "`p.variables()` is a Sage extension (see #1715), the corresponding `p.vars_as_monomial()` () already behaves like this. (I think in early versions of PolyBoRi `p.vars_as_monomial()` could become 0, but this was a design error.) So I can clearly give a positive review.",
    "created_at": "2012-06-11T19:31:24Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12932",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12932#issuecomment-155744",
    "user": "AlexanderDreyer"
}
```

`p.variables()` is a Sage extension (see #1715), the corresponding `p.vars_as_monomial()` () already behaves like this. (I think in early versions of PolyBoRi `p.vars_as_monomial()` could become 0, but this was a design error.) So I can clearly give a positive review.



---

archive/issue_comments_155745.json:
```json
{
    "body": "Changing status from needs_review to positive_review.",
    "created_at": "2012-06-11T22:42:08Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12932",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12932#issuecomment-155745",
    "user": "malb"
}
```

Changing status from needs_review to positive_review.



---

archive/issue_comments_155746.json:
```json
{
    "body": "Resolution: fixed",
    "created_at": "2012-06-23T21:44:25Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12932",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12932#issuecomment-155746",
    "user": "jdemeyer"
}
```

Resolution: fixed
