# Issue 12019: is_squarefree for integer polynomials

archive/issues_012019.json:
```json
{
    "body": "Assignee: AlexGhitza\n\nKeywords: sd35 squarefree integer polynomial\n\n\n```\nsage: P.<x> = ZZ[]\nsage: (4*x).parent()\nUnivariate Polynomial Ring in x over Integer Ring\nsage: (4*x).is_squarefree()\nTrue\nsage: (QQ(4)*x).is_squarefree()\nTrue\nsage: 4.is_squarefree()\nFalse\nsage: P(4).is_squarefree()\nTrue\n```\n\n\nThe first and last should of course be False, as `2^2` is a divisor.\n\nIssue created by migration from https://trac.sagemath.org/ticket/12191\n\n",
    "created_at": "2011-12-19T11:01:58Z",
    "labels": [
        "algebra",
        "major",
        "bug"
    ],
    "title": "is_squarefree for integer polynomials",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/12019",
    "user": "mstreng"
}
```
Assignee: AlexGhitza

Keywords: sd35 squarefree integer polynomial


```
sage: P.<x> = ZZ[]
sage: (4*x).parent()
Univariate Polynomial Ring in x over Integer Ring
sage: (4*x).is_squarefree()
True
sage: (QQ(4)*x).is_squarefree()
True
sage: 4.is_squarefree()
False
sage: P(4).is_squarefree()
True
```


The first and last should of course be False, as `2^2` is a divisor.

Issue created by migration from https://trac.sagemath.org/ticket/12191





---

archive/issue_comments_138910.json:
```json
{
    "body": "Attachment\n\nShould fix the bug.",
    "created_at": "2011-12-20T10:01:35Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12019",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12019#issuecomment-138910",
    "user": "mkosters"
}
```

Attachment

Should fix the bug.



---

archive/issue_comments_138911.json:
```json
{
    "body": "The problem was that is_squarefree doesn't look at the content of the polynomial. It should be fixed with 12191.patch.",
    "created_at": "2011-12-20T10:03:05Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12019",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12019#issuecomment-138911",
    "user": "mkosters"
}
```

The problem was that is_squarefree doesn't look at the content of the polynomial. It should be fixed with 12191.patch.



---

archive/issue_comments_138912.json:
```json
{
    "body": "Changing status from new to needs_review.",
    "created_at": "2011-12-20T10:03:05Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12019",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12019#issuecomment-138912",
    "user": "mkosters"
}
```

Changing status from new to needs_review.



---

archive/issue_comments_138913.json:
```json
{
    "body": "Attachment\n\nNow with summary line.",
    "created_at": "2011-12-20T10:06:24Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12019",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12019#issuecomment-138913",
    "user": "mkosters"
}
```

Attachment

Now with summary line.



---

archive/issue_comments_138914.json:
```json
{
    "body": "Changing status from needs_review to positive_review.",
    "created_at": "2011-12-20T15:56:42Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12019",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12019#issuecomment-138914",
    "user": "MvanBeek"
}
```

Changing status from needs_review to positive_review.



---

archive/issue_comments_138915.json:
```json
{
    "body": "All doctests work with version 4.7.2. Also tests of the following form also work:\n\n\n```\nsage: R.<x>=GF(3)['x']\nsage: (x^2+1).is_squarefree()\nTrue\nsage: (x^2+x+1).is_squarefree()\nFalse\nsage: R.<x>=ZZ[]\nsage: R(x^2).is_squarefree()\nFalse\nsage: R(4*x).is_squarefree()\nFalse\nsage: R(2*x).is_squarefree()\nTrue\nsage: R(x^2+2*x+1).is_squarefree()\nFalse\n```\n\nThe bug appears to be fixed",
    "created_at": "2011-12-20T15:56:42Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12019",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12019#issuecomment-138915",
    "user": "MvanBeek"
}
```

All doctests work with version 4.7.2. Also tests of the following form also work:


```
sage: R.<x>=GF(3)['x']
sage: (x^2+1).is_squarefree()
True
sage: (x^2+x+1).is_squarefree()
False
sage: R.<x>=ZZ[]
sage: R(x^2).is_squarefree()
False
sage: R(4*x).is_squarefree()
False
sage: R(2*x).is_squarefree()
True
sage: R(x^2+2*x+1).is_squarefree()
False
```

The bug appears to be fixed



---

archive/issue_comments_138916.json:
```json
{
    "body": "Changing status from positive_review to needs_info.",
    "created_at": "2011-12-20T16:06:34Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12019",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12019#issuecomment-138916",
    "user": "MvanBeek"
}
```

Changing status from positive_review to needs_info.



---

archive/issue_comments_138917.json:
```json
{
    "body": "this does not work for polynomials over orders. Is it supposed to?\n\n\n```\nsage: R1.<a1>=NumberField(x^2+1)\nsage: R2=R1.maximal_order()\nsage: P.<x>=R2[x]\nsage: P(x).is_squarefree()\n<lots of rubbish>\n```\n",
    "created_at": "2011-12-20T16:11:48Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12019",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12019#issuecomment-138917",
    "user": "MvanBeek"
}
```

this does not work for polynomials over orders. Is it supposed to?


```
sage: R1.<a1>=NumberField(x^2+1)
sage: R2=R1.maximal_order()
sage: P.<x>=R2[x]
sage: P(x).is_squarefree()
<lots of rubbish>
```




---

archive/issue_comments_138918.json:
```json
{
    "body": "This has to do with the fact that the content of a polynomial is not always well defined. Furthermore, the is_squarefree function is not defined for say Dedekind domains.",
    "created_at": "2011-12-21T20:47:30Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12019",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12019#issuecomment-138918",
    "user": "mkosters"
}
```

This has to do with the fact that the content of a polynomial is not always well defined. Furthermore, the is_squarefree function is not defined for say Dedekind domains.



---

archive/issue_comments_138919.json:
```json
{
    "body": "Changing status from needs_info to needs_review.",
    "created_at": "2011-12-21T20:47:30Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12019",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12019#issuecomment-138919",
    "user": "mkosters"
}
```

Changing status from needs_info to needs_review.



---

archive/issue_comments_138920.json:
```json
{
    "body": "Looks good to me.",
    "created_at": "2011-12-25T15:19:30Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12019",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12019#issuecomment-138920",
    "user": "davidloeffler"
}
```

Looks good to me.



---

archive/issue_comments_138921.json:
```json
{
    "body": "Changing status from needs_review to positive_review.",
    "created_at": "2011-12-25T15:19:30Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12019",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12019#issuecomment-138921",
    "user": "davidloeffler"
}
```

Changing status from needs_review to positive_review.



---

archive/issue_comments_138922.json:
```json
{
    "body": "Resolution: fixed",
    "created_at": "2011-12-29T07:03:13Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12019",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12019#issuecomment-138922",
    "user": "jdemeyer"
}
```

Resolution: fixed
