# Issue 10657: nth_root in power series

Issue created by migration from Trac.

Original creator: pernici

Original creation time: 2011-01-31 18:18:06

Assignee: tbd

CC:  robertwb bruno

In this patch the nth-root of power series `y = x^n` is introduced using
the Newton method for `y = x^-n`

```
x' = (1+1/n)*x - y*x^(n+1)/n               (1)
```



```
sage: R.<t> = QQ[]
sage: p = (1 + 2*t + 5*t^2 + 7*t^3 + O(t^4))^3
sage: p.nth_root(3)
1 + 2*t + 5*t^2 + 7*t^3 + O(t^4)
sage: p = (1 + 2*t + 5*t^2 + 7*t^3 + O(t^4))^-3
sage: p.nth_root(-3)
1 + 2*t + 5*t^2 + 7*t^3 + O(t^4)
```


The iterations are division-free;
in the case `n=2` one can compare this division-free iteration
with the iteration used in the Newton method for `sqrt`

```
x' = (x +y/x)/2                            (2)
```



`nth_root` can be used to compute the square root of series which
currently `sqrt` does not support

```
sage: R.<x,y> = QQ[]
sage: S.<t> = R[[]]
sage: p = 1 + x*t + (x^2+y^2)*t^2 + O(t^3)
sage: p1 = p.nth_root(2); p1
1 + 1/2*x*t + (3/8*x^2 + 1/2*y^2)*t^2 + O(t^3)
sage: p1^2
1 + x*t + (x^2 + y^2)*t^2 + O(t^3)
```


In particular it can be used in the multivariate series considered
in ticket #1956 .


---

Attachment


---

Comment by pernici created at 2011-01-31 18:33:48

Changing component from PLEASE CHANGE to commutative algebra.


---

Comment by pernici created at 2011-01-31 18:33:48

Changing priority from major to minor.


---

Comment by pernici created at 2011-01-31 18:33:48

Changing keywords from "" to "power series".


---

Comment by pernici created at 2011-01-31 18:33:48

Changing assignee from tbd to pernici.


---

Attachment


---

Comment by pernici created at 2011-02-01 17:24:54

The nth-root of power series `y = x^n` is computed using
the Newton method for `y = x^-n`


```
x' = (1+1/n)*x - y*x^(n+1)/n
```



```
sage: R.<t> = QQ[]
sage: p = (1 + 2*t + 5*t^2 + 7*t^3 + O(t^4))^3
sage: p.nth_root(3)
1 + 2*t + 5*t^2 + 7*t^3 + O(t^4)
sage: p = (1 + 2*t + 5*t^2 + 7*t^3 + O(t^4))^-3
sage: p.nth_root(-3)
1 + 2*t + 5*t^2 + 7*t^3 + O(t^4)
```



With this patch `nth_root` works also for series on `ZZ`


```
sage: R.<t> = ZZ[[]]
sage: p = 1 + 4*t^2 + 3*t^3 + O(t^4)
sage: p.nth_root(2)
1 + 2*t^2 + 3/2*t^3 + O(t^4)
sage: p.sqrt(2)
1 + 2*t^2 + 3/2*t^3 + O(t^4)
sage: p.nth_root(3)
1 + 4/3*t^2 + t^3 + O(t^4)
sage: p = 4*t^2 + 3*t^3 + O(t^4)
sage: p.nth_root(2)
2*t + 3/4*t^2 + O(t^3)
sage: p.sqrt(2)
Traceback (most recent call last):
...
TypeError: no conversion of this rational to integer
```


there is a bug in `sqrt` in this case.

`nth_root` can be used to compute the square root of series which
currently `sqrt` does not support

```
sage: R.<x,y> = QQ[]
sage: S.<t> = R[[]]
sage: p = 4 + t*x + t^2*y + O(t^3)
sage: p.nth_root(2)
2 + 1/4*x*t + (-1/64*x^2 + 1/4*y)*t^2 + O(t^3)
sage: p = 32*t^5 + x*t^6 + y*t^7 + O(t^8)
sage: p.nth_root(5)
2*t + 1/80*x*t^2 + (-1/6400*x^2 + 1/80*y)*t^3 + O(t^4)
sage: p.sqrt()
Traceback (most recent call last):
...
AttributeError: 'sage.rings.polynomial.multi_polynomial_libsingular.MPolynomial_libsingular' object has no attribute 'sqrt'
```


`nth-root` iteration formula is division-free, which is convenient in this
case; in this case `sqrt`  could call `nth_root`.


`nth_root` can be used in the multivariate series considered
in ticket #1956 .


---

Comment by pernici created at 2011-02-01 18:19:03

in the above message there is a wrong example on where sqrt fails;
here is the corrected example

```
sage: R.<x,y> = QQ[]
sage: S.<t> = R[[]]
sage: p = 4 + t*x + t^2*y + O(t^3)
sage: p.nth_root(2)
2 + 1/4*x*t + (-1/64*x^2 + 1/4*y)*t^2 + O(t^3)
sage: p.sqrt()
Traceback (most recent call last):
...
AttributeError: 'sage.rings.polynomial.multi_polynomial_libsingular.MPolynomial_libsingular' object has no attribute 'sqrt'
}


---

Comment by robertwb created at 2011-02-02 08:55:15

Changing type from PLEASE CHANGE to defect.


---

Comment by robertwb created at 2011-02-02 08:55:15

Changing status from new to needs_review.


---

Comment by robertwb created at 2011-02-02 08:57:39

Apply only trac_10720_power_series_nth_root_2.patch


---

Attachment

With trac_10720_power_series_nth_root_3.patch nth_root is much faster for `n` large

```
sage: S.<t> = QQ[[]]
sage: p = t.exp(30)
sage: %time p1 = p.nth_root(1000)
Wall time: 0.01 s
```

with the previous version it takes 84s


---

Attachment


---

Comment by pernici created at 2011-02-05 16:47:13

With trac_10720_power_series_nth_root_4.patch 
nth_root and inversion become faster for series on
polynomial rings, when used together with
trac_10480_fast_PowerSeries_poly_multiplication-alternative.patch
from ticket #10480 (otherwise these functions perform as without the patch).

In the following benchmarks apply
trac_karatsuba_improvements.patch and
trac_10480_fast_PowerSeries_poly_multiplication-alternative.patch,
trac_10720_power_series_nth_root_2.patch and
trac_10720_power_series_nth_root_3.patch;
in (2) apply also the new patch


```
sage: N = 2
sage: R= PolynomialRing(QQ,N,'x')
sage: x = R.gens()
sage: S.<t> = R[[]]
sage: sx = sum(x)
sage: prec = 15
sage: p = (t.exp(prec)).subs({t:t*sx})
sage: %time p1 = p^-1
sage: %time p1 = p.nth_root(2)
```


Inversion benchmark:

```
N  prec  (1)    (2)
2  15    0.06   0.01
3  15    2.1    0.07
4  15    58     0.5
5  15    1440   3.4
```


Square root benchmark:

```
N  prec  (1)    (2)
2  15    0.15   0.03
3  15    5.2    0.31
4  15    161    3.3
```


The speedup is large because the terms with high degree in `t`
are large polynomials, due to the combinatorial
possibilities with several variables; using _mul_ instead of _mul_trunc
several products involving these large polynomials are computed and
later truncated away.


---

Comment by johanbosman created at 2011-11-13 12:27:47

This is an enhancement rather than a defect.


---

Comment by johanbosman created at 2011-11-13 12:27:47

Changing type from defect to enhancement.


---

Comment by vbraun created at 2011-12-31 12:45:05

Which patches need to be applied? Please put some information in the ticket description.

If  `trac_10720_power_series_nth_root_3.patch` is meant to be applied, please add a doctest to `__pow_trunc`.


---

Comment by saraedum created at 2013-03-04 18:48:20

As Volker mentioned, `__pow_trunc` lacks a docstring. (Just to remove this from the list of tickets needing review until that is fixed.)


---

Comment by saraedum created at 2013-03-04 18:48:20

Changing status from needs_review to needs_work.


---

Comment by chapoton created at 2013-03-15 10:00:54

One related remark:

Thanks to ticket #14115, it is now easy to implement a general rational power by

```
def rational_power(f,alpha):
    return (f.log()*alpha).exp()
```


I do not know how it compares in terms of speed with the method of this ticket.


---

Comment by rws created at 2014-04-22 13:31:29

Replying to [comment:14 chapoton]:
> Thanks to ticket #14115, it is now easy to implement a general rational power by
> {{{
> def rational_power(f,alpha):
>     return (f.log()*alpha).exp()
> }}}
> 
> I do not know how it compares in terms of speed with the method of this ticket.
Additionally #15601 implements Pari series. If a speed comparison is made please include that implementation as third case to compare.


---

Comment by vdelecroix created at 2016-06-24 07:58:50

We should use (and possibly improve) #20571. Would be a good idea to use this ticket to implement a `_pow_trunc_` following the `__pow_trunc` from [attachment:trac_10720_power_series_nth_root_3.patch].


---

Comment by vdelecroix created at 2016-06-24 08:00:53

Moreover, polynomials should provide a `nth_root_series_trunc` (the same way there exists a `inverse_series_trunc`).


---

Comment by vdelecroix created at 2017-12-18 11:04:59

recycling...


---

Comment by vdelecroix created at 2017-12-21 13:08:07

New commits:


---

Comment by vdelecroix created at 2017-12-21 13:08:07

Changing status from needs_work to needs_review.


---

Comment by vdelecroix created at 2017-12-21 13:10:41

Reproducing the example of [This is the Trac macro *comment:7 comment:7* that was inherited from the migration](https://trac.sagemath.org/wiki/WikiMacros#comment:7 comment:7-macro)

```
sage: S.<t> = QQ[[]]
sage: p = t.exp(30)
sage: %time p1 = p.nth_root(1000)
CPU times: user 11.7 ms, sys: 3.27 ms, total: 15 ms
Wall time: 13.8 ms
```



---

Comment by vdelecroix created at 2017-12-21 13:14:23

Changing status from needs_review to needs_work.


---

Comment by vdelecroix created at 2017-12-21 13:14:23

The initial proposal of using Newton method for `y^-n` is more clever since we don't need to use power series inversion...


---

Comment by git created at 2017-12-21 14:58:25

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by vdelecroix created at 2017-12-21 14:58:55

Changing status from needs_work to needs_review.


---

Comment by vdelecroix created at 2017-12-21 14:59:34

It is indeed better

```
sage: S.<t> = QQ[[]]
sage: p = t.exp(30)
sage: %time p1 = p.nth_root(1000)
CPU times: user 3.8 ms, sys: 30 Âµs, total: 3.83 ms
Wall time: 3.69 ms
```



---

Comment by vdelecroix created at 2017-12-21 15:43:29

Replying to [comment:14 chapoton]:
> One related remark:
> 
> Thanks to ticket #14115, it is now easy to implement a general rational power by
> {{{
> def rational_power(f,alpha):
>     return (f.log()*alpha).exp()
> }}}
> 
> I do not know how it compares in terms of speed with the method of this ticket.


```
sage: R.<x> = PowerSeriesRing(QQ, default_prec=100)
sage: p = (1 + 2*x - x^4)**200
sage: %timeit p1 = p.nth_root(1000)
100 loops, best of 3: 4.18 ms per loop
sage: %timeit p2 = (p.log()/1000).exp()
100 loops, best of 3: 5.84 ms per loop
```

But the main advantage of the method proposed here is that it works in positive characteristic.


---

Comment by git created at 2017-12-21 15:48:43

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by slabbe created at 2017-12-22 09:09:37

1. `def _nth_root_series(self, long n, long prec, start=None):` is missing a INPUT block, in which, in particular, the goal of input `start` should be explained.

2. At two places the input block says `- ``prec`` -- integer (optional) - precision of the result`, but the code does `prec = min(self.prec(), prec)`. I suggest to add a sentence advertising it saying something like `If prec is larger than self.prec(), then self.prec() is used.`


---

Comment by slabbe created at 2017-12-22 09:09:37

Changing status from needs_review to needs_work.


---

Comment by slabbe created at 2017-12-22 12:17:07

3. `Check that the result are consistent` -> `results`


---

Comment by slabbe created at 2017-12-22 12:34:42

Once, those three changes on the documentation aspect are done, feel free to change the status to positive review on my behalf.


---

Comment by git created at 2017-12-26 16:26:27

Branch pushed to git repo; I updated commit sha1. This was a forced push. New commits:


---

Comment by vdelecroix created at 2017-12-26 16:27:09

Changing status from needs_work to needs_review.


---

Comment by vdelecroix created at 2017-12-26 16:27:09

rebased and fixed. I am only setting to needs review to have some patchbot reviews.


---

Comment by vdelecroix created at 2017-12-28 12:26:36

Merci SÃ©bastien!


---

Comment by vdelecroix created at 2017-12-28 12:26:36

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2017-12-31 09:27:55

Resolution: fixed
