# Issue 20215: spurious limit computation

Issue created by migration from Trac.

Original creator: kcrisman

Original creation time: 2016-04-17 02:18:50

From [this sage-support thread](https://groups.google.com/forum/#!topic/sage-support/REsP6kXgMwM):

```
     sage: assume(x, 'real')
       sage: limit((x^(1/x)-1)*sqrt(x), x=infinity)
       +Infinity
       sage: limit(((1/x)^x-1)/sqrt(x), x=0, dir='+')
       +Infinity


Thanks.  In pure Maxima we get:

(%i3) limit((x^(1/x)-1)*sqrt(x),x,inf);
(%o3)                                 inf
(%i4) limit((x^(1/x)-1)*sqrt(x),x,0);
(%o4)                                 und
(%i5) limit((x^(1/x)-1)*sqrt(x),x,0,plus);
(%o5)                                  0
(%i6) limit((x^(1/x)-1)*sqrt(x),x,0,minus);
(%o6)                                 inf

From what I understand, the first of these is wrong, maybe also the last (should it be infinity (complex infinity) instead?).


Interestingly,

(%i7) domain:complex;
(%o7)                               complex
(%i10) limit((x^(1/x)-1)*sqrt(x),x,0,minus);

;;;
;;; Detected access to protected memory, also kwown as 'bus or segmentation fault'.
;;; Jumping to the outermost toplevel prompt

<lots of times>

Segmentation fault: 11
```



---

Comment by chapoton created at 2020-10-13 11:51:09

Changing keywords from "" to "limit".
