# Issue 15623: inject symbolic functions

Issue created by migration from Trac.

Original creator: dkrenn

Original creation time: 2014-02-25 08:14:41

Keywords: symbolic function, inject, space


```
sage: function('A,B')
(A, B)
sage: A
A
sage: B
B
sage: function('C, D')
(C,  D)
sage: C
C
sage: D
---------------------------------------------------------------------------
NameError                                 Traceback (most recent call last)
<ipython-input-6-57b8d7453841> in <module>()
----> 1 D

NameError: name 'D' is not defined
```

IMHO `function('C, D')` should work, i.e., the function `D` should be injected into the workspace.

The corresponding command with `var` works:

```
sage: var('c, d')
(c, d)
sage: c
c
sage: d
d
```


Further, the following works:

```
sage: C, D = function('C, D')
sage: C
C
sage: D
 D
```


This might also be related with the additional spacing, which occurs in the following:

```
sage: C, D = function('C, D')
sage: C(D(x))
C( D(x))
```

(the space in `C( D(x))`, which should also be corrected (removed).


---

Comment by mmezzarobba created at 2014-02-25 10:11:50

Changing keywords from "symbolic function, inject, space" to "symbolic function".


---

Comment by jkeitel created at 2014-07-23 14:40:38

Wrote an easy fix that removes whitespaces and added a doctest.
----
New commits:


---

Comment by jkeitel created at 2014-07-23 14:40:38

Changing status from new to needs_review.


---

Comment by dkrenn created at 2014-07-25 10:20:01

Reviewed. Everything looks fine. I've added another (rather small) doctest to check that the function injection works.
----
New commits:


---

Comment by dkrenn created at 2014-07-25 10:20:01

Changing status from needs_review to positive_review.


---

Comment by jkeitel created at 2014-07-25 11:54:26

Great, thank you.


---

Comment by vbraun created at 2014-07-25 22:19:04

Resolution: fixed
