# Issue 18100: Add methods `real` and `imag` to real interval field

Issue created by migration from https://trac.sagemath.org/ticket/18337

Original creator: vdelecroix

Original creation time: 2015-04-29 17:19:37

For coherence we should have `real` and `imag` on real intervals:

```
sage: RR(3).real()
3.00000000000000
sage: RR(3).imag()
0
```



---

Comment by vdelecroix created at 2015-04-29 17:38:30

Changing status from new to needs_review.


---

Comment by vdelecroix created at 2015-04-29 17:38:30

New commits:


---

Comment by git created at 2015-04-29 17:40:32

Branch pushed to git repo; I updated commit sha1. This was a forced push. New commits:


---

Comment by mmezzarobba created at 2015-05-03 08:03:08

Changing status from needs_review to positive_review.


---

Comment by mmezzarobba created at 2015-05-03 08:03:08

Lgtm. But I more and more think that there should be common base classes for all “real-like” and “complex-like” fields rather than separate implementations of stuff like that in every single one.


---

Comment by vdelecroix created at 2015-05-03 08:22:57

Replying to [comment:4 mmezzarobba]:
> Lgtm. But I more and more think that there should be common base classes for all “real-like” and “complex-like” fields rather than separate implementations of stuff like that in every single one.

+1... and some normalization too, I found the following *very* bad

```
sage: RDF(-1)**(1/3)
NaN
sage: RR(-1)**(1/3)
0.500000000000000 + 0.866025403784439*I
sage: AA(-1)**(1/3)
-1
```


Thanks for the review.


---

Comment by vbraun created at 2015-05-03 14:53:27

Resolution: fixed
