# Issue 18014: Equality comparison with 0 is not consistant

Issue created by migration from https://trac.sagemath.org/ticket/18251

Original creator: tscrim

Original creation time: 2015-04-19 18:00:05

Assignee: tscrim

CC:  nthiery darij nbruin robertwb chapoton vdelecroix

Keywords: zero

Currently we have the following in Sage:

```
sage: C = CombinatorialFreeModule(QQ, ['a','b'])
sage: C.zero() == ZZ(0)
True
sage: C.zero() == QQ(0)
False
sage: M.zero()
(0, 0, 0, 0)
sage: M.zero() == ZZ(0)
True
sage: M.zero() == QQ(0)
False
```

What I've been doing has been implementing a custom `__eq__` which checks explicitly for the other argument is 0 and then checking `self.is_zero`. However I'm thinking we should have a general fix with this as a special case, but we could do it just for these element classes.

Additionally this works when there a coercion from the base ring. I guess more generally do we want equality checking for when there is a conversion to the base ring? Thoughts?


---

Comment by jdemeyer created at 2016-07-29 14:31:05

Part of the problem is that there is no coercion defined anyway:

```
sage: C = CombinatorialFreeModule(QQ, ['a','b'])
sage: C.coerce(QQ(0))
TypeError: no canonical coercion from Rational Field to Free module generated by {'a', 'b'} over Rational Field
```


This makes sense, but it means that the problem is different from what I originally thought.


---

Comment by jdemeyer created at 2016-07-29 14:38:42

And the coercion model has an explicit special case for `ZZ(0)`.


---

Comment by jdemeyer created at 2016-07-29 14:41:55

I am going to attach my branch anyway, which does coercion but doesn't actually fix the problem.


---

Comment by jdemeyer created at 2016-07-29 14:48:14

New commits:


---

Comment by tscrim created at 2016-07-30 14:25:04

The current behavior of CFM agrees with that of the usual modules:

```sage
sage: V = QQ^3
sage: V.coerce(ZZ(0))
(0, 0, 0)
sage: V.coerce(QQ(0))
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)
...
TypeError: no canonical coercion from Rational Field to Vector space of dimension 3 over Rational Field
sage: V.zero() == QQ(0)
False
sage: V.zero() == ZZ(0)
True
```

I'm thinking a better and more general solution would be to special case the zero of the base ring or possibly just `QQ`.
