# Issue 30089: latex correctly typesets held integrals, but (incorrectly) evaluate held integrals subexpressions.

Issue created by migration from https://trac.sagemath.org/ticket/30326

Original creator: charpent

Original creation time: 2020-08-10 09:11:26

Keywords: latex integral

Consider :


```
sage: f(x)=cos(x)
sage: C=2*pi
sage: f(x)=1/(1+x^2)
sage: C=pi
sage: Ex=f(x).integrate(x,-oo,oo,hold=True)
sage: Ex
integrate(1/(x^2 + 1), x, -Infinity, +Infinity)
sage: latex(Ex)
\int_{-\infty}^{+\infty} \frac{1}{x^{2} + 1}\,{d x}
```


Correct. But :


```
sage: latex(Ex/C)
\frac{\pi}{\pi}
```


Aaaarghhh... The held integral subexpression has been evaluated (= unheld) during the `latex` processing ; furthermor, this affects only this subexpression processing, no further simplification takes place.

This seems to be specific to integrals ; I haven't been able to reproduce the problem  with `sum` :


```
sage: var("a, b")
(a, b)
sage: var("j, m", domain="integer")
(j, m)
sage: Ex=sum(binomial(m,j)*a^j*b^(m-j),j,0,m,hold=True)
sage: Ex.subs(m==3)
sum(a^j*b^(-j + 3)*binomial(3, j), j, 0, 3)
sage: Ex.subs(m==3).unhold()
a^3 + 3*a^2*b + 3*a*b^2 + b^3
sage: latex(Ex.subs(m==3))
{\sum_{j=0}^{3} a^{j} b^{-j + 3} {3 \choose j}}
```


Correct.


```
sage: latex(Ex.subs(m==3)/C)
\frac{{\sum_{j=0}^{3} a^{j} b^{-j + 3} {3 \choose j}}}{\pi}
```


Also correct.

This is annoying when one wants to illustrate difficulties with an expression involving a problematic, impossible or (worse) never-returning integral : one cannot use `latex` to illustrate the problem without isolating the problematic subexpression.

This occurrence may become more frequent with the increase in use of the Jupyter notebook, often featuring a `%display typeset` early in the notebook, where this problem could stall the notebook.


---

Comment by charpent created at 2020-08-10 09:35:22

A partial workaround is to pass the offending expression to `sympy`, whose `latex` doesn't have this bug (but doesn't correctly translates all Sage's bells and whistles) :


```
sage: f(x)=1/(1+x^2)
sage: C=pi
sage: Ex=integrate(f(x),x,-oo,oo,hold=True) ; Ex
integrate(1/(x^2 + 1), x, -Infinity, +Infinity)
sage: latex(Ex/C)
\frac{\pi}{\pi}
sage: import sympy
sage: latex(sympy.sympify(Ex/C))
\text{\texttt{Integral(1/(x**2{ }+{ }1),{ }(x,{ }{-}oo,{ }oo))/pi}}
```


(Note that `oo` isn't either `sympified` as expected or typeset as `\infty`...)


---

Comment by mkoeppe created at 2021-05-10 17:42:09

Moving to 9.4, as 9.3 has been released.


---

Comment by chapoton created at 2022-04-30 08:49:33

This seems to work in 9.6.rc3, needs a doctest

```
sage: f = integral(x, x, 0, 1, hold=True)
sage: latex(f)
\int_{0}^{1} x\,{d x}
```



---

Comment by @DaveWitteMorris created at 2022-05-01 07:55:55

No, I think we still have the problem (in 9.6.rc3):

```
sage: f = integral(x, x, 0, 1, hold=True)
sage: latex(f)  # this is correct (at least since 9.2)
\int_{0}^{1} x\,{d x}
sage: latex(f / pi)  # this is still not correct
\frac{\frac{1}{2}}{\pi}
```

