# Issue 11575: is_monomial and is_term

Issue created by migration from https://trac.sagemath.org/ticket/11747

Original creator: was

Original creation time: 2011-08-25 17:28:53

Assignee: AlexGhitza

Keywords: sd32

Ut oh, the word "monomial" turns out to be ambiguous!   There are two definitions!:

      http://en.wikipedia.org/wiki/Monomial

And in Sage we evidently have *randomly* (?) and inconsistenly chosen between the two definitions, which is very unfortunate.  

```
sage: R.<x> =QQ[]  
sage: (2*x).is_monomial()     # definition 2 in univariate poly
True
sage: (x).is_monomial()  
True
sage: R.<x,y> =QQ[]
sage: (2*x).is_monomial()     # definition 1 in multivariate poly
False
sage: x.is_monomial()    
True
```


Etc.   Fortunately, `is_monomial()` is called in only about 5 or 6 places in the entire Sage source library, according to `search_src('is_monomial')`.

Reading the argument in Wikipedia further, and discussing this with Tom Boothby, we've decided the following would work for us. 

1. Introduce a new method `is_term`, which returns True for `a*x<sup>i*y</sup>j...`, i.e. it allows a coefficient.   Fortunately, `is_term` is currently used nowhere in Sage. 

2. Unify `is_monomial` to require the coefficient to be 1.  This means changing univariate polynomials to be consistent with multivariate polynomials.


---

Attachment


---

Comment by was created at 2011-08-25 17:56:54

Changing status from new to needs_review.


---

Comment by mhansen created at 2011-08-27 07:44:54

Luckily, this choice is consistent with all of the code in sage/combinat/free_module.py .


---

Comment by mhansen created at 2011-08-27 07:46:04

Looks good to me.


---

Comment by mhansen created at 2011-08-27 07:46:04

Changing status from needs_review to positive_review.


---

Comment by leif created at 2011-09-15 15:40:07

Any clue what can cause the following?

```
sage -t -long -force_lib "devel/sage/sage/rings/polynomial/multi_polynomial_element.py"
**********************************************************************
File "/tmp/Sage/release/sage-4.7.2.alpha2/devel/sage/sage/rings/polynomial/multi_polynomial_element.py", line 101:
    sage: x + QQbar.random_element() # indirect doctest
Expected:
    x - 2
Got:
    x + 4
**********************************************************************
1 items had failures:
   1 of   5 in __main__.example_2
***Test Failed*** 1 failures.
```

This doesn't happen with only this patch applied, and no other patch (merged so far) touches `sage/rings/polynomial/multi_polynomial_element.py` (nor `qqbar.py`).

No single of the other patches merged with this one seems to cause this doctest error alone, i.e., apparently only a combination.

(And it's _not_ #10635.)


---

Comment by fbissey created at 2011-09-15 22:42:46

One thing that strikes me is that the call is for QQbar.random_element(). It seems to me that unless there is a good reason for it, the fact that we always had the same result regardless of architecture is just blind luck. 

So was there ever a justification why it should be "-2"?


---

Comment by leif created at 2011-09-16 14:45:40

Replying to [comment:5 leif]:
> Any clue what can cause the following? [...]

Oh, my bad; must have been blind or confused something when trying to track down another error.

The doctest failure most probably originates from the patch at #11725, so this ticket is certainly the wrong one to report on.

Sorry for the noise.


---

Comment by leif created at 2011-09-17 05:27:21

Resolution: fixed
