# Issue 22230: hypergeometric 2F1 bug

archive/issues_022230.json:
```json
{
    "body": "CC:  @slel\n\nThe result of expansion of a `2F1` expression using `simplify_hypergeometric` differs when substituting `x` with a numeric versus computing the numeric directly:\n\n```\nsage: hypergeometric((-1/3,4/3),(7/3,),x)\nhypergeometric((-1/3, 4/3), (7/3,), x)\nsage: _.simplify_hypergeometric()\n4/9*(-x + 1)^(2/3)*gen_legendre_P(1/3, -4/3, -2*x + 1)*gamma(1/3)/(-x)^(2/3)      # not verified\nsage: _.subs(x==-5/11)\n176/45*(5/11)^(1/3)*(2/11)^(2/3)*gen_legendre_P(1/3, -4/3, 21/11)*gamma(1/3)\nsage: _.n(200)\n-0.53941834251374840921300901563397867197519834837178347048562 + 0.93429997576840318754064074204329937894765008653252481028466*I\nsage: hypergeometric((-1/3,4/3),(7/3,),-5/11)\nhypergeometric((-1/3, 4/3), (7/3,), -5/11)\nsage: _.n(200)     # verified by Alpha\n1.0788366850274968184260180312679573439503966967435669409712\nsage: (5/11)^(1/3)*(2/11)^(2/3)\n(5/11)^(1/3)*(2/11)^(2/3)\nsage: _.n(200)\n0.24676523787226423377437176997086265498228252449900881429858\nsage: gen_legendre_P(1/3, -4/3, 21/11)\ngen_legendre_P(1/3, -4/3, 21/11)\nsage: _.n(200)     # verified by Alpha\n-0.20863099380558942774105138711985994226338270038962969500434 + 0.36135948130486860453162137841966370046727111778651381582091*I\n```\n\nIs the expansion wrong?\n\nIssue created by migration from https://trac.sagemath.org/ticket/22467\n\n",
    "created_at": "2017-02-28T08:34:54Z",
    "labels": [
        "calculus",
        "major",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-duplicate/invalid/wontfix",
    "title": "hypergeometric 2F1 bug",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/22230",
    "user": "@rwst"
}
```
CC:  @slel

The result of expansion of a `2F1` expression using `simplify_hypergeometric` differs when substituting `x` with a numeric versus computing the numeric directly:

```
sage: hypergeometric((-1/3,4/3),(7/3,),x)
hypergeometric((-1/3, 4/3), (7/3,), x)
sage: _.simplify_hypergeometric()
4/9*(-x + 1)^(2/3)*gen_legendre_P(1/3, -4/3, -2*x + 1)*gamma(1/3)/(-x)^(2/3)      # not verified
sage: _.subs(x==-5/11)
176/45*(5/11)^(1/3)*(2/11)^(2/3)*gen_legendre_P(1/3, -4/3, 21/11)*gamma(1/3)
sage: _.n(200)
-0.53941834251374840921300901563397867197519834837178347048562 + 0.93429997576840318754064074204329937894765008653252481028466*I
sage: hypergeometric((-1/3,4/3),(7/3,),-5/11)
hypergeometric((-1/3, 4/3), (7/3,), -5/11)
sage: _.n(200)     # verified by Alpha
1.0788366850274968184260180312679573439503966967435669409712
sage: (5/11)^(1/3)*(2/11)^(2/3)
(5/11)^(1/3)*(2/11)^(2/3)
sage: _.n(200)
0.24676523787226423377437176997086265498228252449900881429858
sage: gen_legendre_P(1/3, -4/3, 21/11)
gen_legendre_P(1/3, -4/3, 21/11)
sage: _.n(200)     # verified by Alpha
-0.20863099380558942774105138711985994226338270038962969500434 + 0.36135948130486860453162137841966370046727111778651381582091*I
```

Is the expansion wrong?

Issue created by migration from https://trac.sagemath.org/ticket/22467





---

archive/issue_comments_308955.json:
```json
{
    "body": "Changing status from new to needs_review.",
    "created_at": "2017-02-28T16:19:24Z",
    "issue": "https://github.com/sagemath/sagetest/issues/22230",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/22230#issuecomment-308955",
    "user": "@rwst"
}
```

Changing status from new to needs_review.



---

archive/issue_comments_308956.json:
```json
{
    "body": "User error. Assumptions given earlier interferred with `simplify_hypergemetric`.",
    "created_at": "2017-02-28T16:19:24Z",
    "issue": "https://github.com/sagemath/sagetest/issues/22230",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/22230#issuecomment-308956",
    "user": "@rwst"
}
```

User error. Assumptions given earlier interferred with `simplify_hypergemetric`.



---

archive/issue_comments_308957.json:
```json
{
    "body": "Changing status from needs_review to positive_review.",
    "created_at": "2017-02-28T16:19:40Z",
    "issue": "https://github.com/sagemath/sagetest/issues/22230",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/22230#issuecomment-308957",
    "user": "@rwst"
}
```

Changing status from needs_review to positive_review.



---

archive/issue_comments_308958.json:
```json
{
    "body": "Changing status from positive_review to needs_work.",
    "created_at": "2017-02-28T16:29:21Z",
    "issue": "https://github.com/sagemath/sagetest/issues/22230",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/22230#issuecomment-308958",
    "user": "@rwst"
}
```

Changing status from positive_review to needs_work.



---

archive/issue_comments_308959.json:
```json
{
    "body": "Hijacking ticket to prevent waste. Quite a similar error, this time for real.",
    "created_at": "2017-02-28T16:29:21Z",
    "issue": "https://github.com/sagemath/sagetest/issues/22230",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/22230#issuecomment-308959",
    "user": "@rwst"
}
```

Hijacking ticket to prevent waste. Quite a similar error, this time for real.



---

archive/issue_comments_308960.json:
```json
{
    "body": "This is an issue in conversion from maxima:\n\n```\nsage: maxima('((1-(sqrt(5)-1)/(2*sqrt(5)))^(1/10)*assoc_legendre_p(-4/5,-1/5,1-(\n....: sqrt(5)-1)/sqrt(5))*gamma(1/5))/(5*((sqrt(5)-1)/(2*sqrt(5)))^(1/10))')\n((1-(sqrt(5)-1)/(2*sqrt(5)))^(1/10)*assoc_legendre_p(-4/5,-1/5,1-(sqrt(5)-1)/sqrt(5))*gamma(1/5))/(5*((sqrt(5)-1)/(2*sqrt(5)))^(1/10))\nsage: bla=_\nsage: bla.sage()\n0\n```\n",
    "created_at": "2018-01-06T20:29:44Z",
    "issue": "https://github.com/sagemath/sagetest/issues/22230",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/22230#issuecomment-308960",
    "user": "@fchapoton"
}
```

This is an issue in conversion from maxima:

```
sage: maxima('((1-(sqrt(5)-1)/(2*sqrt(5)))^(1/10)*assoc_legendre_p(-4/5,-1/5,1-(
....: sqrt(5)-1)/sqrt(5))*gamma(1/5))/(5*((sqrt(5)-1)/(2*sqrt(5)))^(1/10))')
((1-(sqrt(5)-1)/(2*sqrt(5)))^(1/10)*assoc_legendre_p(-4/5,-1/5,1-(sqrt(5)-1)/sqrt(5))*gamma(1/5))/(5*((sqrt(5)-1)/(2*sqrt(5)))^(1/10))
sage: bla=_
sage: bla.sage()
0
```




---

archive/issue_comments_308961.json:
```json
{
    "body": "Probably boils down to \n\n```\nsage: maxima('assoc_legendre_p(-4/5,-1/5,1)')\nassoc_legendre_p(-4/5,-1/5,1)\nsage: _.sage()\n0\n```\n\nwhich in turn comes from\n\n```\nsage: gen_legendre_P(-4/5,-1/5,x)\n0\n```\n",
    "created_at": "2018-01-06T20:31:45Z",
    "issue": "https://github.com/sagemath/sagetest/issues/22230",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/22230#issuecomment-308961",
    "user": "@fchapoton"
}
```

Probably boils down to 

```
sage: maxima('assoc_legendre_p(-4/5,-1/5,1)')
assoc_legendre_p(-4/5,-1/5,1)
sage: _.sage()
0
```

which in turn comes from

```
sage: gen_legendre_P(-4/5,-1/5,x)
0
```




---

archive/issue_comments_308962.json:
```json
{
    "body": "mpmath returns `0.000000000000000` with\n\n```\n        import mpmath\n        from sage.libs.mpmath.all import call as mpcall\n        mpcall(mpmath.legenp, -0.8, -0.2, 1)\n```\n\nand Wolfram Alpha agrees with it but also agrees with the nonzero value for the 2F1 expression so the simplification by Maxima seems wrong.\n\nOn another note there is this in `Func_assoc_legendre_P._eval_special_values(self,n,m,x)`:\n\n```\n        if m > n:\n            return ZZ(0)\n```\n\nHowever in Wikipedia that if |m|>l then P<sub>l</sub><sup>m</sup>=0, so the code seems wrong (missing the abs).",
    "created_at": "2018-01-07T07:17:32Z",
    "issue": "https://github.com/sagemath/sagetest/issues/22230",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/22230#issuecomment-308962",
    "user": "@rwst"
}
```

mpmath returns `0.000000000000000` with

```
        import mpmath
        from sage.libs.mpmath.all import call as mpcall
        mpcall(mpmath.legenp, -0.8, -0.2, 1)
```

and Wolfram Alpha agrees with it but also agrees with the nonzero value for the 2F1 expression so the simplification by Maxima seems wrong.

On another note there is this in `Func_assoc_legendre_P._eval_special_values(self,n,m,x)`:

```
        if m > n:
            return ZZ(0)
```

However in Wikipedia that if |m|>l then P<sub>l</sub><sup>m</sup>=0, so the code seems wrong (missing the abs).



---

archive/issue_comments_308963.json:
```json
{
    "body": "Confirmation from arb:\n\n```\nsage: CBF(1/10*sqrt(5)*(sqrt(5) - 1)).hypergeometric([1/5,4/5],[6/5])\n[1.0429660590683 +/- 5.27e-14]\nsage: CBF(1).legendre_P(-4/5,-1/5)\n0\n```\n",
    "created_at": "2018-01-07T07:40:59Z",
    "issue": "https://github.com/sagemath/sagetest/issues/22230",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/22230#issuecomment-308963",
    "user": "@rwst"
}
```

Confirmation from arb:

```
sage: CBF(1/10*sqrt(5)*(sqrt(5) - 1)).hypergeometric([1/5,4/5],[6/5])
[1.0429660590683 +/- 5.27e-14]
sage: CBF(1).legendre_P(-4/5,-1/5)
0
```




---

archive/issue_comments_308964.json:
```json
{
    "body": "Maybe because Legendre polynomials can be extended to rational parameters either by 0 or by hypergeometric functions. What we see looks like a clash of extensions, no ?",
    "created_at": "2018-01-07T08:19:39Z",
    "issue": "https://github.com/sagemath/sagetest/issues/22230",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/22230#issuecomment-308964",
    "user": "@fchapoton"
}
```

Maybe because Legendre polynomials can be extended to rational parameters either by 0 or by hypergeometric functions. What we see looks like a clash of extensions, no ?



---

archive/issue_comments_308965.json:
```json
{
    "body": "No, the relevant extension is http://dlmf.nist.gov/14.3.E6 and it holds for x > 1 but the 2F1 argument here is 0.276 which makes x around 0.447, i.e. < 1. Agree?",
    "created_at": "2018-01-07T12:05:29Z",
    "issue": "https://github.com/sagemath/sagetest/issues/22230",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/22230#issuecomment-308965",
    "user": "@rwst"
}
```

No, the relevant extension is http://dlmf.nist.gov/14.3.E6 and it holds for x > 1 but the 2F1 argument here is 0.276 which makes x around 0.447, i.e. < 1. Agree?



---

archive/issue_comments_308966.json:
```json
{
    "body": "Changing status from needs_work to needs_review.",
    "created_at": "2021-11-26T23:33:13Z",
    "issue": "https://github.com/sagemath/sagetest/issues/22230",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/22230#issuecomment-308966",
    "user": "@slel"
}
```

Changing status from needs_work to needs_review.



---

archive/issue_comments_308967.json:
```json
{
    "body": "Seems to have been fixed, maybe by #25034\n(merged in Sage 9.3.rc5)?\n\nIn Sage 9.3 and above:\n\n```\nsage: a = hypergeometric((1/5, 4/5), (6/5,), 1/10*sqrt(5)*(sqrt(5) - 1))\nsage: a.n()\n1.04296605906833\nsage: b = a.simplify_hypergeometric()\nsage: b\n2/5*5^(19/20)*(1/10)^(9/10)*(-1/10*sqrt(5)*(sqrt(5) - 1)\n+ 1)^(1/10)*gamma(1/5)*gen_legendre_P(-4/5, -1/5,\n-1/5*sqrt(5)*(sqrt(5) - 1) + 1)/(sqrt(5) - 1)^(1/10)\nsage: b.n()\n1.04296605906833\n```\n",
    "created_at": "2021-11-26T23:33:13Z",
    "issue": "https://github.com/sagemath/sagetest/issues/22230",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/22230#issuecomment-308967",
    "user": "@slel"
}
```

Seems to have been fixed, maybe by #25034
(merged in Sage 9.3.rc5)?

In Sage 9.3 and above:

```
sage: a = hypergeometric((1/5, 4/5), (6/5,), 1/10*sqrt(5)*(sqrt(5) - 1))
sage: a.n()
1.04296605906833
sage: b = a.simplify_hypergeometric()
sage: b
2/5*5^(19/20)*(1/10)^(9/10)*(-1/10*sqrt(5)*(sqrt(5) - 1)
+ 1)^(1/10)*gamma(1/5)*gen_legendre_P(-4/5, -1/5,
-1/5*sqrt(5)*(sqrt(5) - 1) + 1)/(sqrt(5) - 1)^(1/10)
sage: b.n()
1.04296605906833
```




---

archive/issue_comments_308968.json:
```json
{
    "body": "Changing status from needs_review to positive_review.",
    "created_at": "2021-11-27T11:52:11Z",
    "issue": "https://github.com/sagemath/sagetest/issues/22230",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/22230#issuecomment-308968",
    "user": "@dimpase"
}
```

Changing status from needs_review to positive_review.



---

archive/issue_comments_308969.json:
```json
{
    "body": "Resolution: invalid",
    "created_at": "2021-12-01T02:46:14Z",
    "issue": "https://github.com/sagemath/sagetest/issues/22230",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/22230#issuecomment-308969",
    "user": "@mkoeppe"
}
```

Resolution: invalid
