# Issue 29995: symbolic ring, coercion, restriction: compatible?

Issue created by migration from https://trac.sagemath.org/ticket/30232

Original creator: @mjungmath

Original creation time: 2020-07-27 11:18:12

CC:  egourgoulhon mkoeppe tscrim

At the current stage, we get the following output:


```
sage: M = Manifold(2, 'M', structure='topological') # the 2-dimensional sphere S^2
sage: U = M.open_subset('U') # complement of the North pole
sage: c_xy.<x,y> = U.chart() # stereographic coordinates from the North pole
sage: V = M.open_subset('V') # complement of the South pole
sage: c_uv.<u,v> = V.chart() # stereographic coordinates from the South pole
sage: M.declare_union(U,V)   # S^2 is the union of U and V
sage: xy_to_uv = c_xy.transition_map(c_uv, (x/(x^2+y^2), y/(x^2+y^2)),
....:                                intersection_name='W',
....:                                restrictions1= x^2+y^2!=0,
....:                                restrictions2= u^2+v^2!=0)
sage: uv_to_xy = xy_to_uv.inverse()
sage: f = M.scalar_field_algebra()(x+u)
sage: f.display()
M --> R
sage: f._express
{}
```


This output is not consistent with the coercion model, in particular not with the coercion `SR -> ScalarFieldAlgebra`. First of all, each element in `SR` should give rise to a well-defined element in `ScalarFieldAlgebra`. This is not fulfilled in the first example. More precisely:


```
sage: g = A(x)
sage: g.display()
M --> R
on U: (x, y) |--> x
on W: (u, v) |--> u/(u^2 + v^2)
sage: h = V.scalar_field_algebra()(x)
sage: h.display()
V --> R
on W: (u, v) |--> u/(u^2 + v^2)
on W: (x, y) |--> x
```


The scalar fields resulting from the coercion `SR -> ScalarFieldAlgebra` are not defined on the whole manifold, as they should be for a coercion. In fact, the results are not even _well_-defined since they are not uniquely determined by the input.

Things get more out of control if no transition map is stated. However, we probably can assume that this is not the intended usage.


---

Comment by @mjungmath created at 2020-08-01 14:49:06

What about applying `add_expr_by_continuation` to obtain a scalar field on the whole manifold? This would also result in an error message if no transition map has been stated and solve two problems at once.


---

Comment by mkoeppe created at 2020-08-01 15:03:38

I can't comment on the details, but if it's not canonical, it should not be a coercion but only a conversion.


---

Comment by @mjungmath created at 2020-08-01 15:13:57

I agree. However, the symbolic ring is stated as the base ring of the commutative algebra of scalar fields, which means that there must be a coercion by definition.

Alternatively, the base ring must be changed. But to what?


---

Comment by tscrim created at 2020-08-07 23:14:26

The implementation of the scalar field algebra is currently a bit of an abuse since `SR` is not the true base topological field of the manifold, just an approximation for it. However, there is a good case for the convenience of having it. If you decide to not keep the abuse, then I would change the base field of the scalar field algebra to be the base field of the manifold.


---

Comment by @mjungmath created at 2020-08-16 13:07:52

What about [this](https://doc.sagemath.org/html/en/reference/calculus/sage/symbolic/ring.html#sage.symbolic.ring.SymbolicRing.subring) stating as our base ring? It seems that this is exactly what we need.


---

Comment by egourgoulhon created at 2020-08-16 19:06:16

Replying to [comment:7 gh-mjungmath]:
> What about [this](https://doc.sagemath.org/html/en/reference/calculus/sage/symbolic/ring.html#sage.symbolic.ring.SymbolicRing.subring) stating as our base ring? It seems that this is exactly what we need.

Well, I am not sure, because in addition to the coordinate symbols, we need other variables, which may represent some parameters in the scalar field. For instance, we may have

```
sage: M = Manifold(2, 'M')                                                      
sage: X.<x,y> = M.chart()                                                       
sage: a = var('a')                                                              
sage: f = M.scalar_field(a*x)                                                   
```



---

Comment by egourgoulhon created at 2020-08-17 10:01:20

Replying to [comment:8 egourgoulhon]:
> Replying to [comment:7 gh-mjungmath]:
> > What about [this](https://doc.sagemath.org/html/en/reference/calculus/sage/symbolic/ring.html#sage.symbolic.ring.SymbolicRing.subring) stating as our base ring? It seems that this is exactly what we need.
> 
> Well, I am not sure, because in addition to the coordinate symbols, we need other variables, which may represent some parameters in the scalar field. 
To clarify, we have currently:

```
sage: M = Manifold(2, 'M')                                                      
sage: X.<x,y> = M.chart()                                                       
sage: a = var('a', domain='real')                                                             
sage: f = M.scalar_field(a*x)
sage: g = a*f                                                                   
sage: g                                                                         
Scalar field on the 2-dimensional differentiable manifold M
sage: g.display()                                                               
M --> R
(x, y) |--> a^2*x
```

Having `SR` be the base field of the scalar field algebra allows the operation `a*f` to work directly, but maybe there is a better way...


---

Comment by @mjungmath created at 2020-09-11 08:54:51

Replying to [comment:9 egourgoulhon]:
> Replying to [comment:8 egourgoulhon]:
> > Replying to [comment:7 gh-mjungmath]:
> > > What about [this](https://doc.sagemath.org/html/en/reference/calculus/sage/symbolic/ring.html#sage.symbolic.ring.SymbolicRing.subring) stating as our base ring? It seems that this is exactly what we need.
> > 
> > Well, I am not sure, because in addition to the coordinate symbols, we need other variables, which may represent some parameters in the scalar field. 
> To clarify, we have currently:
> {{{
> sage: M = Manifold(2, 'M')                                                      
> sage: X.<x,y> = M.chart()                                                       
> sage: a = var('a', domain='real')                                                             
> sage: f = M.scalar_field(a*x)
> sage: g = a*f                                                                   
> sage: g                                                                         
> Scalar field on the 2-dimensional differentiable manifold M
> sage: g.display()                                                               
> M --> R
> (x, y) |--> a^2*x
> }}}
> Having `SR` be the base field of the scalar field algebra allows the operation `a*f` to work directly, but maybe there is a better way...

I see your point. What about using the option `accepting_variables` and then successively add parameters to the base ring?


---

Comment by egourgoulhon created at 2020-09-14 10:01:44

Replying to [comment:11 gh-mjungmath]:
> > Having `SR` be the base field of the scalar field algebra allows the operation `a*f` to work directly, but maybe there is a better way...
> 
> I see your point. What about using the option `accepting_variables` and then successively add parameters to the base ring?
Do you mean calling `accepting_variables` internally, i.e. in a way transparent to the user? I don't think we can ask the end user to do something more fancy than `var('a')...


---

Comment by mkoeppe created at 2021-03-24 02:04:25

Sage development has entered the release candidate phase for 9.3. Setting a new milestone for this ticket based on a cursory review of ticket status, priority, and last modification date.


---

Comment by mkoeppe created at 2021-07-25 04:55:35

+1 on encoding dependence on parameters via subrings. #32008 (`CallableSymbolicExpressionRing` over subrings of `SR`) may be relevant.


---

Comment by @mjungmath created at 2021-07-25 08:27:03

We probably have to subclass that subring, so that it dynamically keeps track of charts defined on the manifold and thus rejects all variables coming from charts.
