# Issue 10780: Conversion of PowerSeries -> SR bug

Issue created by migration from Trac.

Original creator: vbraun

Original creation time: 2011-02-24 18:30:19

Assignee: burcin

If I convert a powerseries into the symbolic ring, it does not have any variables.

```
sage: R.<x> = PowerSeriesRing(QQ)
sage: s = R([1,2,3,4,5],prec=10)
sage: s
1 + 2*x + 3*x^2 + 4*x^3 + 5*x^4 + O(x^10)
sage: SR(s)
1 + 2*x + 3*x^2 + 4*x^3 + 5*x^4 + O(x^10)
sage: SR(s).variables()
()
```

Running simplify() fixes it:

```
sage: SR(s).simplify().variables()
(x,)
```



---

Comment by vbraun created at 2011-02-24 20:26:15

A possibly related bug is Trac #9769: Coercon problems to symbolic ring


---

Comment by rws created at 2015-01-17 08:22:00

New commits:


---

Comment by rws created at 2015-01-17 08:22:00

Changing status from new to needs_review.


---

Comment by rws created at 2015-01-17 15:07:59

Deleted.


---

Comment by rws created at 2015-01-23 09:14:50

Note that GiNaC will not add an order term to series from polynomials even if requested. I would consider this a bug. The reason is that pseries are formal, anyway, so they should be fully manipulatable.

This restriction can be circumvented with a simple trick.


---

Comment by git created at 2015-01-23 09:48:58

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by rws created at 2015-03-30 06:46:45

Passes all tests in a 6.5 patchbot run.


---

Comment by vbraun created at 2015-03-30 08:03:36

Changing status from needs_review to positive_review.


---

Comment by rws created at 2015-04-01 06:43:57

Followup in #18094 which uncovers a bug with bigoh handling.


---

Comment by vbraun created at 2015-04-14 19:44:25

Resolution: fixed
