# Issue 17654: rational powers of real interval field element (containing 0) give NaN

Issue created by migration from Trac.

Original creator: dkrenn

Original creation time: 2015-03-03 15:53:07

We have

```
sage: RIF(-1,1)^QQ(1)
[.. NaN ..]
sage: RIF(-1,1)^RIF(1)
[.. NaN ..]
```

whereas

```
sage: RIF(-1,1)^ZZ(1)
0.?
```

More generally, we it works for integers

```
sage: RIF(-1,1)^ZZ(123456)
0.?
```

as well as for the rational or RIF-element 2

```
sage: RIF(-1,1)^QQ(2)
1.?
sage: RIF(-1,1)^RIF(2)
1.?
```

but not for any other rational or RIF-element, e.g.

```
sage: RIF(-1,1)^QQ(3)                              
[.. NaN ..]
sage: RIF(-1,1)^QQ(4)
[.. NaN ..]
```


The reason seems to be

```
sage: log(RIF(-1,1))
[.. NaN ..]
```


The NaN-answer can be considered as wrong, since the true result is a number and can be calculated; it's a limitation of the algorithm.
