# Issue 17080: Add unit_group() method to IntegerModRing

Issue created by migration from https://trac.sagemath.org/ticket/17317

Original creator: pbruin

Original creation time: 2014-11-12 00:16:58

CC:  rbeezer fwclarke kcrisman wuthrich jpflori

Keywords: unit group

This ticket implements a `unit_group()` method for *Z*/_n*_Z*.  Example:

```
sage: A = Zmod(24)
sage: G = A.unit_group(); G
Multiplicative Abelian group isomorphic to C2 x C2 x C2
sage: G.gens_orders()
(2, 2, 2)
sage: G.gens_values()
(7, 13, 17)
```


At the moment, there is no new class for such groups; it uses `AbelianGroupWithValues`.  However, this could easily be changed in the future if required.

The `unit_group()` method admits an optional `algorithm` argument (default: `'sage'`).  This can be set to `'pari'` to use PARI's `znstar()` function (see #17315).  This gives different generators in general.

The ticket also makes the set of generators for _n_ = 1 be the empty set, and makes Dirichlet characters modulo 1 and 2 print as

```
sage: DirichletGroup(1)[0]
Dirichlet character modulo 1 of conductor 1
sage: DirichletGroup(2)[0]
Dirichlet character modulo 2 of conductor 1
```

i.e. without the `mapping ...` appearing in

```
sage: DirichletGroup(3)[1]
Dirichlet character modulo 3 of conductor 1 mapping 2 |--> -1
```


See also:

- #7234
- https://groups.google.com/forum/#!topic/sage-devel/T5A_gwrtZT0


---

Comment by pbruin created at 2014-11-12 00:20:07

Changing status from new to needs_review.


---

Comment by jdemeyer created at 2014-11-13 12:44:24

First impressions:

1. I find the examples in the doctest all rather simple. It doesn't really show how different the `algorithm="sage"` and `algorithm="pari"` can be. I would add `Zmod(319)` as example. Also a larger example, say `Zmod(lcm([1..40]))` or so...

2. I would add a `**kwds` argument to `unit_gens()`:

```
def unit_gens(self, **kwds):
    return self.unit_group(**kwds).gens_values()
```


3. And a nitpick: I prefer to see `repr(algorithm)` in the error message, something like:

```
raise ValueError('unknown algorithm %r for computing the unit group' % algorithm)
```

This error should also be doctested in a `TESTS::` block.


---

Comment by jdemeyer created at 2014-11-13 12:44:24

Changing status from needs_review to needs_work.


---

Comment by jdemeyer created at 2014-11-13 12:49:04

I would also add doctests for the special cases `Zmod(1)` and `Zmod(2)`


---

Comment by jdemeyer created at 2014-11-13 12:50:56

If possible, I would like to see the changes to the Dirichlet character stuff in a different ticket (to make reviewing easier).


---

Comment by jdemeyer created at 2014-11-13 13:13:08

Why not

```
from sage.rings.arith import primitive_root

def _unit_gens_primecase(p):
    return primitive_root(p, check=False)

def _unit_gens_primepowercase(p, r):
    return primitive_root(p**r, check=False)
```



---

Comment by fwclarke created at 2014-11-13 13:32:17

For number fields, we have

```
sage: QuadraticField(5).unit_group(5)
Unit group with structure C2 x Z of Number Field in a with defining polynomial x^2 - 5
sage: QuadraticField(5).unit_group(5).number_field()
Number Field in a with defining polynomial x^2 - 5
```

But in the current case:

```
sage: Zmod(1000).unit_group()
Multiplicative Abelian group isomorphic to C2 x C2 x C100
```

Though we can see which ring we're working with via

```
sage: Zmod(1000).unit_group().values_group()
Ring of integers modulo 1000
```

this terminology is very non-intuitive.  I think it would be worth having a class for these groups, with a `ring` method and a more complete `_repr_`.


---

Comment by git created at 2014-11-13 17:49:29

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by git created at 2014-11-13 18:15:29

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by pbruin created at 2014-11-13 18:18:09

Replying to [comment:5 jdemeyer]:
> If possible, I would like to see the changes to the Dirichlet character stuff in a different ticket (to make reviewing easier).
See #17337 and #17338.

I think the new commits address your other comments, back to `needs_review`.


---

Comment by pbruin created at 2014-11-13 18:18:09

Changing status from needs_work to needs_review.


---

Comment by pbruin created at 2014-11-13 18:20:41

Replying to [comment:7 fwclarke]:
> For number fields, we have
> {{{
> sage: QuadraticField(5).unit_group(5)
> Unit group with structure C2 x Z of Number Field in a with defining polynomial x^2 - 5
> sage: QuadraticField(5).unit_group(5).number_field()
> Number Field in a with defining polynomial x^2 - 5
> }}}
> But in the current case:
> {{{
> sage: Zmod(1000).unit_group()
> Multiplicative Abelian group isomorphic to C2 x C2 x C100
> }}}
> Though we can see which ring we're working with via
> {{{
> sage: Zmod(1000).unit_group().values_group()
> Ring of integers modulo 1000
> }}}
> this terminology is very non-intuitive.  I think it would be worth having a class for these groups, with a `ring` method and a more complete `_repr_`.
I agree, but this should probably be done on a different ticket.  I think it won't cause problems if we change the precise type of group output by `unit_group()` in the future.  (Maybe we could just make it a subclass of `AbelianGroupWithValues`.)


---

Comment by jdemeyer created at 2014-11-13 20:16:41

Replying to [comment:11 pbruin]:
> I think the new commits address your other comments, back to `needs_review`.
From a quick look through the diffs, this is indeed the case. I'll make a deeper review later.


---

Comment by jdemeyer created at 2014-11-23 08:10:57

I added a trivial patch, looks good!
----
New commits:


---

Comment by jdemeyer created at 2014-11-23 08:10:57

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2014-11-24 16:01:09

Resolution: fixed
