# Issue 15233: reduce() on QQ(x) doesn't know how to factor out integers

Issue created by migration from https://trac.sagemath.org/ticket/15470

Original creator: darij

Original creation time: 2013-11-29 20:31:26

CC:  was burcin spancratz jakobkroeker

Keywords: fraction field, rational functions, reduce


```
sage: Qx = PolynomialRing(QQ, 'x').fraction_field()
sage: x = Qx.gen()
sage: s = (2*(x+1)) / (2*(x+2))
sage: s
(2*x + 2)/(2*x + 4)
sage: s.reduce()
sage: s
(2*x + 2)/(2*x + 4)
sage: 
```


Same behavior for multivariate rational functions. Note, however, that it reduces the integers if the fraction is a constant:


```
sage: s = (2*(x+1)) / (2*(x+1))
sage: s
1
```


I don't know if it's a bug strictly speaking (the result returned isn't false, and it compares equal with the cancelled version), but it's a major annoyance to me because seeing this behaviour I'm no longer sure if I can trust Sage to cancel out nonconstant polynomials reliably.


---

Comment by jdemeyer created at 2013-12-10 08:49:26

I remember somebody once suggesting a `_reduce_projective()` method (or whatever you want to call it) on a ring which would take any tuple `(a_1, ..., a_n)` and return a "simplified" tuple `(u a_1, ..., u a_n)` for a suitable invertible element `u`. I think that's how this should be implemented.


---

Comment by @shashwat1002 created at 2022-01-11 17:51:19

This problem does not exist in the version as it stands in the developement branch. 

as per my command line: 


`sage: Qx = PolynomialRing(QQ, 'x').fraction_field()`

`sage: x = Qx.gen()`

`sage: s = (2*x + 2) / (2*x + 4)`

`sage: s`

`(x + 1)/(x + 2)`



I suppose this ticket can be closed.


---

Comment by @shashwat1002 created at 2022-01-11 17:53:11

Changing status from new to needs_review.


---

Comment by @darijgr created at 2022-01-11 17:59:32

Changing status from needs_review to needs_work.


---

Comment by @darijgr created at 2022-01-11 17:59:32

Still happening in multiple variables...
