# Issue 33330: finer category for cubic braid group quotients

Issue created by migration from https://trac.sagemath.org/ticket/33567

Original creator: chapoton

Original creation time: 2022-03-26 09:38:04

CC:  tscrim soehms

namely, they are Shephard groups.

This requires adding a few simple methods.


---

Comment by chapoton created at 2022-03-26 09:38:55

New commits:


---

Comment by chapoton created at 2022-03-26 09:38:55

Changing status from new to needs_review.


---

Comment by tscrim created at 2022-03-27 05:08:07

LGTM.


---

Comment by tscrim created at 2022-03-27 05:08:07

Changing status from needs_review to positive_review.


---

Comment by soehms created at 2022-03-27 18:51:52

This is a good idea.

I just fixed a small typo!

Question: The following is just an irritation. But what is the reason for the reversed order for the reflection group?


```sage
sage: C4 = CubicBraidGroup(4)
sage: R4 = C4.as_reflection_group()
sage: C4.codegrees()
(0, 3, 6)
sage: R4.codegrees()
(6, 3, 0)
```

----
New commits:


---

Comment by chapoton created at 2022-03-27 18:57:48

no special reason for the inverse order of degrees. I took them from a table in some article.

Should we check that they are given in increasing order ?


---

Comment by soehms created at 2022-03-27 19:07:43

Replying to [comment:5 chapoton]:
> 
> Should we check that they are given in increasing order ?

I don't know? The order you implemented now is according to Wikipedia!


---

Comment by tscrim created at 2022-03-27 21:42:57

If people care, I would aim to be consistent with other parts of Sage, mainly that they are in increasing (resp. decreasing) order for (co)degrees (via `gap3`):

```
sage: R = ReflectionGroup((3,1,4))
sage: R.degrees()
(3, 6, 9, 12)
sage: R.codegrees()
(9, 6, 3, 0)

sage: R = ReflectionGroup((4,2,4))
sage: R.is_well_generated()
False
sage: R.degrees()
(4, 8, 8, 12)
sage: R.codegrees()
(12, 8, 4, 0)
```



---

Comment by chapoton created at 2022-03-28 07:04:31

Note that

```
sage: Permutations(4).codegrees()
(0, 1, 2)
sage: SymmetricGroup(4).codegrees()
(0, 1, 2)
sage: CoxeterGroup(['A',4]).codegrees()
(0, 1, 2, 3)
sage: WeylGroup(['A',4]).codegrees()
(0, 1, 2, 3)
```



---

Comment by tscrim created at 2022-03-28 07:46:44

Then we are horribly inconsistent across Sage. Well, it is not like there is a canonical way to order these. Choosing an order and enforcing it across Sage is best left for another ticket, if we want to do it.


---

Comment by chapoton created at 2022-03-28 08:06:30

yes, and in fact we also have

```
sage: ColoredPermutations(2,5).codegrees()
(8, 6, 4, 2, 0)
```



---

Comment by vbraun created at 2022-04-02 10:52:59

Resolution: fixed
