# Issue 17101: Fix printing of Dirichlet characters

Issue created by migration from Trac.

Original creator: pbruin

Original creation time: 2014-11-13 17:42:45

CC:  jdemeyer

Keywords: Dirichlet characters

Dirichlet characters modulo 2 are printed in a strange way:

```
sage: DirichletGroup(2)[0]
Dirichlet character modulo 2 of conductor 1 mapping 
```

After #17337, this also happens for Dirichlet characters modulo 1.

This ticket makes Dirichlet characters modulo 1 and 2 print as

```
sage: DirichletGroup(1)[0]
Dirichlet character modulo 1 of conductor 1
sage: DirichletGroup(2)[0]
Dirichlet character modulo 2 of conductor 1
```

and uses the `mapping ...` only for conductors >= 3:

```
sage: DirichletGroup(3)[1]
Dirichlet character modulo 3 of conductor 1 mapping 2 |--> -1
```




---

Comment by pbruin created at 2014-11-13 19:03:34

Changing status from new to needs_review.


---

Comment by vbraun created at 2014-12-03 10:33:57

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2014-12-03 21:56:14

Resolution: fixed
