# Issue 11963: Multiple loops handling in c_graph

Issue created by migration from https://trac.sagemath.org/ticket/12135

Original creator: brunellus

Original creation time: 2011-12-09 19:46:27

Assignee: jason, ncohen, rlm

Sage handles multiple loops on one vertex inconsistently.


```
sage:g=Graph({0:[0,0]}, loops=True, multiple_edges=True, implementation="c_graph")
sage:g.edges()
[(0, 0, None), (0, 0, None)]
sage:g.delete_edge(0,0)
sage:g.edges()
[]
```


Compare with


```
sage:g=Graph({0:[0,0]}, loops=True, multiple_edges=True, implementation="networkx")
sage:g.edges()
[(0, 0, None), (0, 0, None)]
sage:g.delete_edge(0,0)
sage:g.edges()
[(0, 0, None)]
```


and


```
sage:g=Graph({0:[1,1]}, loops=True, multiple_edges=True, implementation="c_graph")
sage:g.edges()
[(0, 1, None), (0, 1, None)]
sage:g.delete_edge(0,1)
sage:g.edges()
[(0, 1, None)]
```


Another c_graph backend functions work in this spirit: for example add_edges won't add any new loops to the vertex where some already exist. Well, that is not precise. Look:


```
sage:g=Graph({0: [0]}, loops=True, multiple_edges=True, implementation="c_graph")
sage:g.add_edges([(0,0), (0,0)])
sage:g.edges()
[(0, 0, None)]
sage:h=Graph({0: [0,0]}, loops=True, multiple_edges=True, implementation="c_graph")
sage:h.add_edges([(0,0), (0,0)])
sage:h.edges()
[(0, 0, None), (0, 0, None), (0, 0, None), (0, 0, None)]
```


I guess that multiple loops can be handy to have, for example when you want to preserve edges in repeated contractions. It is also consistent with the meaning of the two options "allow loops" and "allow multiple edges" -- it would be weird if "allow multiple edges" stopped work in the previously allowed case of (v,v) edge.

But I'm not very experiences mathematician, so I can't decide what behavior is right. I just see that the current state is... bizzare... :-)


---

Comment by brunellus created at 2012-02-06 12:16:51

A loop is stored as a single arc, but del_edge removes both ends:


```
self._cg.del_arc_label(u_int, v_int, l_int)
self._cg.del_arc_label(v_int, u_int, l_int)
```


So...


```
sage: g=Graph({0:[0]*11}); len(g.edges())
11
sage: g.delete_edge(0,0); len(g.edges())
9
sage: g.delete_edge(0,0); len(g.edges())
7
sage: g.delete_edge(0,0); len(g.edges())
5
```



---

Comment by brunellus created at 2012-02-06 12:28:42

OK, this was rather easy.


---

Comment by brunellus created at 2012-02-06 12:28:42

Changing status from new to needs_review.


---

Attachment

Helloooooooo !!!

Here is a one-line patch to add the "::" at the end of the line before the tests. If if it ok with you, the patch can be set to "positive_review". `:-)`

Nathann

(and I changed the subject because I am at Cernay with the combinat team, and that is how they want to remember which patches we worked on... Sorry about that `^^;`)


---

Attachment

Sorry, I keep forgetting about that. :-/ Thanks for the review. :-)


---

Comment by brunellus created at 2012-02-06 15:12:02

Changing status from needs_review to positive_review.


---

Comment by ncohen created at 2012-02-06 15:55:10

Looks like it shouldn't be in the topic but in the keywords... `^^;`

Thank you for the patches and the names `:-)`

Nathann


---

Comment by ncohen created at 2012-02-06 15:55:10

Changing keywords from "" to "Cernay2012".


---

Comment by jdemeyer created at 2012-02-14 14:21:10

Resolution: fixed
