# Issue 11147: Cannot create homomorphism from prime residue field to finite field

archive/issues_011147.json:
```json
{
    "body": "Assignee: robertwb\n\nKeywords: residue fields, finite fields, hom\n\nConsider K = QQ(sqrt(337)).  The prime 5 is inert in K and the prime 13 splits.  We'll start with 13 to see what goes wrong:\n\n```\nsage: K.<w> = QuadraticField(337)\nsage: pp = K.ideal(13).factor()[0][0]\nsage: RF13 = K.residue_field(pp)\nsage: RF13.gens()\n(1,)\nsage: RF13.hom([GF(13)(1)])\n...\nTypeError: images do not define a valid homomorphism\n```\n\nHowever, for residue fields that aren't prime fields it does work:\n\n```\nsage: RF5 = K.residue_field(5)\nsage: F25 = GF(25, names='a', modulus=RF5.polynomial())\nsage: RF5.hom([F25.0])\nRing morphism:\n  From: Residue field in wbar of Fractional ideal (5)\n  To:   Finite Field in a of size 5^2\n  Defn: wbar |--> a\n```\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/11319\n\n",
    "created_at": "2011-05-09T16:53:34Z",
    "labels": [
        "coercion",
        "major",
        "bug"
    ],
    "title": "Cannot create homomorphism from prime residue field to finite field",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/11147",
    "user": "johanbosman"
}
```
Assignee: robertwb

Keywords: residue fields, finite fields, hom

Consider K = QQ(sqrt(337)).  The prime 5 is inert in K and the prime 13 splits.  We'll start with 13 to see what goes wrong:

```
sage: K.<w> = QuadraticField(337)
sage: pp = K.ideal(13).factor()[0][0]
sage: RF13 = K.residue_field(pp)
sage: RF13.gens()
(1,)
sage: RF13.hom([GF(13)(1)])
...
TypeError: images do not define a valid homomorphism
```

However, for residue fields that aren't prime fields it does work:

```
sage: RF5 = K.residue_field(5)
sage: F25 = GF(25, names='a', modulus=RF5.polynomial())
sage: RF5.hom([F25.0])
Ring morphism:
  From: Residue field in wbar of Fractional ideal (5)
  To:   Finite Field in a of size 5^2
  Defn: wbar |--> a
```


Issue created by migration from https://trac.sagemath.org/ticket/11319





---

archive/issue_comments_122118.json:
```json
{
    "body": "Attachment [trac_11319_prime_field_coercion.patch](tarball://root/attachments/some-uuid/ticket11319/trac_11319_prime_field_coercion.patch) by johanbosman created at 2011-05-10 16:51:25",
    "created_at": "2011-05-10T16:51:25Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11147",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11147#issuecomment-122118",
    "user": "johanbosman"
}
```

Attachment [trac_11319_prime_field_coercion.patch](tarball://root/attachments/some-uuid/ticket11319/trac_11319_prime_field_coercion.patch) by johanbosman created at 2011-05-10 16:51:25



---

archive/issue_comments_122119.json:
```json
{
    "body": "Changing status from new to needs_review.",
    "created_at": "2011-05-10T16:51:25Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11147",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11147#issuecomment-122119",
    "user": "johanbosman"
}
```

Changing status from new to needs_review.



---

archive/issue_comments_122120.json:
```json
{
    "body": "I was trying out the patch, and the following example didn't work out like I expected:\n\n```\nsage: K\nNumber Field in a with defining polynomial x^3 - 2\nsage: K.<a> = NumberField(x^3-2)\nsage: P = K.ideal(7)\nsage: P.factor()\nFractional ideal (7)\nsage: k = P.residue_field()\nsage: k.order()\n343\nsage: F.<b> = GF(343)\nsage: F.order()\n343\nsage: k\nResidue field in abar of Fractional ideal (7)\nsage: F\nFinite Field in b of size 7^3\nsage: k.hom([F(1)])\n---------------------------------------------------------------------------\nTypeError                                 Traceback (most recent call last)\n\n/Users/aly/Desktop/sage-4.7.rc2/<ipython console> in <module>()\n\n/Users/aly/Desktop/sage-4.7.rc2/local/lib/python2.6/site-packages/sage/structure/parent_gens.so in sage.structure.parent_gens.ParentWithGens.hom (sage/structure/parent_gens.c:3792)()\n\n/Users/aly/Desktop/sage-4.7.rc2/local/lib/python2.6/site-packages/sage/structure/parent.so in sage.structure.parent.Parent.hom (sage/structure/parent.c:9067)()\n\n/Users/aly/Desktop/sage-4.7.rc2/local/lib/python2.6/site-packages/sage/rings/finite_rings/homset.pyc in __call__(self, im_gens, check)\n     49                 return self._coerce_impl(im_gens)\n     50             except TypeError:\n---> 51                 raise TypeError, \"images do not define a valid homomorphism\"\n     52         \n     53     def _coerce_impl(self, x):\n\nTypeError: images do not define a valid homomorphism   \nsage: k.has_coerce_map_from(F)\nFalse\n\n```\n\n\nShould this patch fix this as well?",
    "created_at": "2011-05-11T16:04:21Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11147",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11147#issuecomment-122120",
    "user": "aly.deines"
}
```

I was trying out the patch, and the following example didn't work out like I expected:

```
sage: K
Number Field in a with defining polynomial x^3 - 2
sage: K.<a> = NumberField(x^3-2)
sage: P = K.ideal(7)
sage: P.factor()
Fractional ideal (7)
sage: k = P.residue_field()
sage: k.order()
343
sage: F.<b> = GF(343)
sage: F.order()
343
sage: k
Residue field in abar of Fractional ideal (7)
sage: F
Finite Field in b of size 7^3
sage: k.hom([F(1)])
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)

/Users/aly/Desktop/sage-4.7.rc2/<ipython console> in <module>()

/Users/aly/Desktop/sage-4.7.rc2/local/lib/python2.6/site-packages/sage/structure/parent_gens.so in sage.structure.parent_gens.ParentWithGens.hom (sage/structure/parent_gens.c:3792)()

/Users/aly/Desktop/sage-4.7.rc2/local/lib/python2.6/site-packages/sage/structure/parent.so in sage.structure.parent.Parent.hom (sage/structure/parent.c:9067)()

/Users/aly/Desktop/sage-4.7.rc2/local/lib/python2.6/site-packages/sage/rings/finite_rings/homset.pyc in __call__(self, im_gens, check)
     49                 return self._coerce_impl(im_gens)
     50             except TypeError:
---> 51                 raise TypeError, "images do not define a valid homomorphism"
     52         
     53     def _coerce_impl(self, x):

TypeError: images do not define a valid homomorphism   
sage: k.has_coerce_map_from(F)
False

```


Should this patch fix this as well?



---

archive/issue_comments_122121.json:
```json
{
    "body": "Changing status from needs_review to needs_work.",
    "created_at": "2011-05-11T16:04:21Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11147",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11147#issuecomment-122121",
    "user": "aly.deines"
}
```

Changing status from needs_review to needs_work.



---

archive/issue_comments_122122.json:
```json
{
    "body": "In your example, you're trying to send the generator of k to the element 1 of F, which does indeed not define a field homomorphism.  This does work:\n\n```\nsage: root = k.polynomial().roots(F)[0][0]\nsage: k.hom([root])\nRing morphism:\n  From: Residue field in abar of Fractional ideal (7)\n  To:   Finite Field in b of size 7^3\n  Defn: abar |--> 4*b^2 + 4*b + 2\n```\n",
    "created_at": "2011-05-11T16:12:54Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11147",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11147#issuecomment-122122",
    "user": "johanbosman"
}
```

In your example, you're trying to send the generator of k to the element 1 of F, which does indeed not define a field homomorphism.  This does work:

```
sage: root = k.polynomial().roots(F)[0][0]
sage: k.hom([root])
Ring morphism:
  From: Residue field in abar of Fractional ideal (7)
  To:   Finite Field in b of size 7^3
  Defn: abar |--> 4*b^2 + 4*b + 2
```




---

archive/issue_comments_122123.json:
```json
{
    "body": "Changing status from needs_work to needs_review.",
    "created_at": "2011-05-11T16:12:54Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11147",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11147#issuecomment-122123",
    "user": "johanbosman"
}
```

Changing status from needs_work to needs_review.



---

archive/issue_comments_122124.json:
```json
{
    "body": "Changing status from needs_review to positive_review.",
    "created_at": "2011-06-18T13:45:35Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11147",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11147#issuecomment-122124",
    "user": "kedlaya"
}
```

Changing status from needs_review to positive_review.



---

archive/issue_comments_122125.json:
```json
{
    "body": "Looks fine, applies against 4.7, no long doctest failures.",
    "created_at": "2011-06-18T13:45:35Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11147",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11147#issuecomment-122125",
    "user": "kedlaya"
}
```

Looks fine, applies against 4.7, no long doctest failures.



---

archive/issue_comments_122126.json:
```json
{
    "body": "I think the new patch is a bit low on examples.  For example, the ticket mentions number fields, so why not add a number field example?",
    "created_at": "2011-06-21T13:16:41Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11147",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11147#issuecomment-122126",
    "user": "jdemeyer"
}
```

I think the new patch is a bit low on examples.  For example, the ticket mentions number fields, so why not add a number field example?



---

archive/issue_comments_122127.json:
```json
{
    "body": "Changing status from positive_review to needs_work.",
    "created_at": "2011-06-21T13:16:41Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11147",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11147#issuecomment-122127",
    "user": "jdemeyer"
}
```

Changing status from positive_review to needs_work.



---

archive/issue_comments_122128.json:
```json
{
    "body": "Attachment [trac_11319_number_field_example.patch](tarball://root/attachments/some-uuid/ticket11319/trac_11319_number_field_example.patch) by johanbosman created at 2011-08-02 16:09:49\n\nTo be used on top of the first patch",
    "created_at": "2011-08-02T16:09:49Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11147",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11147#issuecomment-122128",
    "user": "johanbosman"
}
```

Attachment [trac_11319_number_field_example.patch](tarball://root/attachments/some-uuid/ticket11319/trac_11319_number_field_example.patch) by johanbosman created at 2011-08-02 16:09:49

To be used on top of the first patch



---

archive/issue_comments_122129.json:
```json
{
    "body": "Changing status from needs_work to needs_review.",
    "created_at": "2011-08-02T16:11:12Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11147",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11147#issuecomment-122129",
    "user": "johanbosman"
}
```

Changing status from needs_work to needs_review.



---

archive/issue_comments_122130.json:
```json
{
    "body": "Example added. ;)",
    "created_at": "2011-08-02T16:11:12Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11147",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11147#issuecomment-122130",
    "user": "johanbosman"
}
```

Example added. ;)



---

archive/issue_comments_122131.json:
```json
{
    "body": "Changing status from needs_review to positive_review.",
    "created_at": "2011-12-19T11:12:45Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11147",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11147#issuecomment-122131",
    "user": "mkosters"
}
```

Changing status from needs_review to positive_review.



---

archive/issue_comments_122132.json:
```json
{
    "body": "Resolution: fixed",
    "created_at": "2011-12-29T07:03:27Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11147",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11147#issuecomment-122132",
    "user": "jdemeyer"
}
```

Resolution: fixed



---

archive/issue_comments_122133.json:
```json
{
    "body": "Changing keywords from \"residue fields, finite fields, hom\" to \"residue fields, finite fields, hom, sd35\".",
    "created_at": "2012-01-05T13:07:29Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11147",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11147#issuecomment-122133",
    "user": "mstreng"
}
```

Changing keywords from "residue fields, finite fields, hom" to "residue fields, finite fields, hom, sd35".
