# Issue 30716: Implicit line continuation in callable symbolic expression

Issue created by migration from https://trac.sagemath.org/ticket/30953

Original creator: @jcamp0x2a

Original creation time: 2020-11-23 18:12:17

CC:  strogdon egourgoulhon @kliem slelievre

Keywords: line continuation symbolic expression preparser parentheses

Reported in comment:19:ticket:30928


```python
sage: f(x) = (x +  
....:         1)                                                                                    
  File "<ipython-input-10-ae23cb631161>", line 1
    __tmp__=var("x"); f = symbolic_expression((x + ).function(x)
                                                   ^
SyntaxError: invalid syntax
```


`sage.repl.preparse.preparse_calculus` needs to be modified to accommodate implicit line continuations such as inside parentheses, brackets, and braces.


---

Comment by egourgoulhon created at 2020-12-14 20:20:53

I've just been struck by a silent failure (!) version of this bug. A minimal version is

```
sage: f(x) = 1/2*(1 + x 
....:             + x^2)                                                                            
sage: f                                                                                             
x |--> x^2 + 1/2*x + 1/2
```

This issue is present in Sage 9.1, 9.2 and 9.3.beta3.


---

Comment by egourgoulhon created at 2020-12-14 20:22:35

Because this is a silent failure in an elementary operation.


---

Comment by egourgoulhon created at 2020-12-14 20:22:35

Changing priority from major to critical.


---

Comment by @kliem created at 2021-09-16 14:49:26

Changing status from new to needs_review.


---

Comment by @kliem created at 2021-09-16 14:49:26

Only works in the interactive shell so far and not when parsing `*.sage` files.
----
New commits:


---

Comment by @kliem created at 2021-09-21 15:30:36

Changing status from needs_review to needs_work.


---

Comment by @kliem created at 2021-09-21 15:30:36

I'm reworking the entire `preparse` now.

There is so much basic stuff that is just not working, e.g. line continuation for


```
sage: def foo():
....:     a = 2312334432134.factor()
```



---

Comment by @kliem created at 2021-09-27 21:51:53

In #31951#comment:42 I suggest a simple fix for #31951 and doing the more elaborate work here.
----
New commits:


---

Comment by @kliem created at 2021-09-27 21:56:13

Renamed the branch and added to commits.
----
New commits:


---

Comment by klee created at 2021-09-28 16:19:21

Fixed in #31951.


---

Comment by klee created at 2021-09-28 16:19:21

Changing status from needs_work to needs_review.


---

Comment by @kliem created at 2021-10-01 06:31:57

This is fixed by #31951.


---

Comment by @kliem created at 2021-10-01 06:31:57

Changing status from needs_review to positive_review.


---

Comment by mkoeppe created at 2021-10-04 23:44:13

Resolution: invalid
