# Issue 17685: coeffs() function more consistent between Expressions and polynomial rings

Issue created by migration from https://trac.sagemath.org/ticket/17922

Original creator: JoalHeagney

Original creation time: 2015-03-10 01:18:41

Keywords: coeffs


```
y = 3*x^3 + 2*x^2 - 4*x
print(y)
type(y)
```

Gives:


```
3*x^3 + 2*x^2 - 4*x
<type 'sage.symbolic.expression.Expression'>
```

And


```
M = matrix(SR,[[1,2],[0,-2]])
ch = M.charpoly()
print(ch)
type(ch)
```

gives


```
x^2 + x - 2
<class 'sage.rings.polynomial.polynomial_element_generic.Polynomial_generic_dense_field'>
```

But:


```
y.coeffs()
```

returns


```
[[−4,1],[2,2],[3,3]]
```

and


```
ch.coeffs()
```

returns


```
[−2,1,1]
```


I'd prefer if these two functions returned the same format, preferably the Expression format, as having access to the index allows list comprehension tastiness.


---

Comment by JoalHeagney created at 2015-03-10 01:19:33

Changing type from PLEASE CHANGE to enhancement.


---

Comment by JoalHeagney created at 2015-03-10 01:19:33

Changing keywords from "coeffs" to "coeffs, rings, polynomials, expression, symbolic".


---

Comment by rws created at 2015-03-11 15:16:43

Have list comprehension tastiness with `dict`:

```
sage: ch.dict().values()
[-2, 1, 1]
```

In #17518 we started being more consistent by deprecating `coeffs`.


---

Comment by JoalHeagney created at 2015-03-11 21:56:51

That works for polynomial rings, are there plans to add that to sage.symbolic.expression.Expressions?


---

Comment by rws created at 2015-03-12 07:22:34

Clarified the ticket description.


---

Comment by rws created at 2015-03-12 07:37:50

Replying to [comment:3 JoalHeagney]:
> That works for polynomial rings, are there plans to add that to sage.symbolic.expression.Expressions?
That would not be difficult (in comparison). If you expect it then to behave identically you will be disappointed however, because symbolics have no default generator (although `Expression.coefficients()` has the lexically first occuring var hard-wired when no varname is given).

```
sage: var('a,b,c')
(a, b, c)
sage: (a+2*a^2+3*b).list()
[3*b, 1, 2]
sage: (3*b+a+2*a^2).list()
[3*b, 1, 2]
sage: (3*b+c+2*c^2).list()
[2*c^2 + c, 3]
```

so you could never have true polymorphism.
