# Issue 23265: .round() will not round an integer

Issue created by migration from https://trac.sagemath.org/ticket/23502

Original creator: christelle

Original creation time: 2017-07-20 22:40:43

Keywords: round(), Integer, sd87

The Sage function .round() cannot be called on an Integer. This can be annoying. For example, 

```
sage: 7.round() 
AttributeError: 'sage.rings.integer.Integer' object has no attribute 'round'
```

but

```
sage: 7.0.round() 
7
```



---

Comment by kedlaya created at 2017-09-23 04:32:54

To make things even more confusing, the global `round` function does allow an integer input, but the output is not a Sage integer!

```
sage: u = round(7); u
7.0
sage: u.parent()
Real Double Field
```

According to the docstring for this function, "If no precision is specified this just calls the element's `.round()` method." This means that addressing the originally reported problem, by adding a `.round()` method to Sage integers which acts as the identity map, would fix this too.


---

Comment by kedlaya created at 2017-09-23 05:53:27

I have a branch to upload, but `git trac push` doesn't seem to be working for me right now. Will get this up as soon as I can.


---

Comment by git created at 2017-09-23 20:45:58

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by kedlaya created at 2017-09-24 01:58:31

Waiting for patchbot, but in the meantime here goes.


---

Comment by kedlaya created at 2017-09-24 01:58:31

Changing status from new to needs_review.


---

Comment by chapoton created at 2017-09-24 06:26:45

Changing status from needs_review to positive_review.


---

Comment by chapoton created at 2017-09-24 06:26:45

ok


---

Comment by vbraun created at 2017-09-26 06:58:04

Resolution: fixed
