# Issue 12200: maxima.eval('1+1;;') hangs

Issue created by migration from https://trac.sagemath.org/ticket/12372

Original creator: kcrisman

Original creation time: 2012-01-28 03:03:06

Assignee: was

CC:  mjo nbruin dimpase


```
maxima.eval('1+1;;')
}}} 
hangs Sage. Now, this ''is'' a syntax error
{{{

(%i4) 1+1;;

(%o4) 2

stdin:76667:incorrect syntax: Premature termination of input at ;.
;
 ^
}}}
but at least we should fail gracefully, and maybe even give an answer.  

This was first reported at #8439, and separated from it.


---

Comment by nbruin created at 2012-01-28 03:34:37

One way of looking at this example is that it's two commands: A grammatical and an erroneous one. The pexpect interface for maxima does not seem to support parsing the output of multiple commands:

```
sage: maxima.eval("1+2;3+4;")
'3(%o17)7'
```

only a little better:

```
sage: from sage.interfaces.maxima_lib import maxima
sage: sage: maxima.eval("1+2;3+4;")
'37'
sage: maxima.eval("1+2;;")
'3'
```

This could be as easy as replacing ";<any whitespace>*;" by ";", but I'm not sure the slow-down of the extra regex is worth catching this corner-case.


---

Comment by kcrisman created at 2012-01-28 03:37:18

> This could be as easy as replacing ";<any whitespace>*;" by ";", but I'm not sure the slow-down of the extra regex is worth catching this corner-case.
Good point, but I figured I might as well open the ticket :)


---

Comment by was created at 2012-01-28 05:28:18

Replying to [comment:2 kcrisman]:t
> > This could be as easy as replacing ";<any whitespace>*;" by ";", but I'm not sure the slow-down of the extra regex is worth catching this corner-case.
> Good point, but I figured I might as well open the ticket :)

Careful not to do that replace inside of string literals.


---

Comment by mkoeppe created at 2020-07-08 16:37:58

Still hanging after 8 years


---

Comment by mjo created at 2020-07-08 17:05:41

Not that important because there's a better interface to maxima now:


```
sage: from sage.interfaces.maxima_lib import maxima_lib
sage: maxima_lib.eval("1+1;;")
'2'
```



---

Comment by mkoeppe created at 2021-04-07 19:29:15

Sage development has entered the release candidate phase for 9.3. Setting a new milestone for this ticket based on a cursory review.
