# Issue 24941: I should not be allowed as a symbolic variable name

archive/issues_024941.json:
```json
{
    "body": "CC:  @rwst @slel @spaghettisalat\n\nThis behavior is confusing\n\n```\nsage: SR('I') ** 2   # complex imaginary\n-1\nsage: SR.var('I')\nI\nsage: SR('I') ** 2   # now a variable!\nI^2\n```\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/25178\n\n",
    "created_at": "2018-04-16T09:03:05Z",
    "labels": [
        "symbolics",
        "major",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-9.8",
    "title": "I should not be allowed as a symbolic variable name",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/24941",
    "user": "@videlec"
}
```
CC:  @rwst @slel @spaghettisalat

This behavior is confusing

```
sage: SR('I') ** 2   # complex imaginary
-1
sage: SR.var('I')
I
sage: SR('I') ** 2   # now a variable!
I^2
```


Issue created by migration from https://trac.sagemath.org/ticket/25178





---

archive/issue_comments_351016.json:
```json
{
    "body": "I am not sure if this is really so bad. It is the same for other constants:\n\n\n```\nsage: SR('e').n()   # Euler's constant\n2.71828182845905\nsage: SR.var('e')   \ne\nsage: SR('e').n()   # now a variable\n---------------------------------------------------------------------------\nTypeError                                 Traceback (most recent call last)\n\nTypeError: cannot evaluate symbolic expression numerically\n```\n\nBut I can imagine that it would be very useful to use `e` sometimes as a symbolic variable (e.g. when using `a`, `b`, `c` and `d` before..)",
    "created_at": "2018-04-16T09:12:53Z",
    "issue": "https://github.com/sagemath/sagetest/issues/24941",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/24941#issuecomment-351016",
    "user": "@mo271"
}
```

I am not sure if this is really so bad. It is the same for other constants:


```
sage: SR('e').n()   # Euler's constant
2.71828182845905
sage: SR.var('e')   
e
sage: SR('e').n()   # now a variable
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)

TypeError: cannot evaluate symbolic expression numerically
```

But I can imagine that it would be very useful to use `e` sometimes as a symbolic variable (e.g. when using `a`, `b`, `c` and `d` before..)



---

archive/issue_comments_351017.json:
```json
{
    "body": "I agree that this is not a bug. `I` is just a variable with a default value of `sqrt(-1)`, but that value can be changed.",
    "created_at": "2018-04-16T09:46:50Z",
    "issue": "https://github.com/sagemath/sagetest/issues/24941",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/24941#issuecomment-351017",
    "user": "@jdemeyer"
}
```

I agree that this is not a bug. `I` is just a variable with a default value of `sqrt(-1)`, but that value can be changed.



---

archive/issue_comments_351018.json:
```json
{
    "body": "My complaint is about the way `SR(whatever)` is interpreting its argument. When I do `SR.var('my_name')` I clearly want a new variable name. But the behavior of `SR(whatever)` depends on the variables created at a given time. It is easy to imagine\n\n```\ndef f():\n    a,b,c,d,e = SR.var('a,b,c,d,e')\n    # now using the symbolic variables\n\nm = f()\ne = SR('e')  # this is not anymore exp(1)!!\n```\n",
    "created_at": "2018-04-16T09:50:56Z",
    "issue": "https://github.com/sagemath/sagetest/issues/24941",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/24941#issuecomment-351018",
    "user": "@videlec"
}
```

My complaint is about the way `SR(whatever)` is interpreting its argument. When I do `SR.var('my_name')` I clearly want a new variable name. But the behavior of `SR(whatever)` depends on the variables created at a given time. It is easy to imagine

```
def f():
    a,b,c,d,e = SR.var('a,b,c,d,e')
    # now using the symbolic variables

m = f()
e = SR('e')  # this is not anymore exp(1)!!
```




---

archive/issue_comments_351019.json:
```json
{
    "body": "What do you propose to do? What behavior do you want to have? Should `SR.var('a,b,c,d,e')` raise an error? \n\nI think a line like `a,b,c,d,e = SR.var('a,b,c,d,e')` or `a,b,c,d,e = var('a,b,c,d,e')' is very natural. In fact:\n\n\n```\nsage: search_src(\"var\\('a, b, c, d, e\")\ntensor/coordinate_patch.py:230:            sage: a, b, c, d, e = var('a, b, c, d, e')\ntests/french_book/nonlinear_doctest.py:64:    sage: a, b, c, d, e, f, x = var('a, b, c, d, e, f, x')\nmatrix/special.py:3625:        sage: matrix.hankel(SR.var('a, b, c, d, e'))\nmatrix/special.py:3634:        sage: matrix.hankel(SR.var('a, b, c, d, e'), SR.var('f, g, h, i'))\n```\n",
    "created_at": "2018-04-16T10:41:10Z",
    "issue": "https://github.com/sagemath/sagetest/issues/24941",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/24941#issuecomment-351019",
    "user": "@mo271"
}
```

What do you propose to do? What behavior do you want to have? Should `SR.var('a,b,c,d,e')` raise an error? 

I think a line like `a,b,c,d,e = SR.var('a,b,c,d,e')` or `a,b,c,d,e = var('a,b,c,d,e')' is very natural. In fact:


```
sage: search_src("var\('a, b, c, d, e")
tensor/coordinate_patch.py:230:            sage: a, b, c, d, e = var('a, b, c, d, e')
tests/french_book/nonlinear_doctest.py:64:    sage: a, b, c, d, e, f, x = var('a, b, c, d, e, f, x')
matrix/special.py:3625:        sage: matrix.hankel(SR.var('a, b, c, d, e'))
matrix/special.py:3634:        sage: matrix.hankel(SR.var('a, b, c, d, e'), SR.var('f, g, h, i'))
```




---

archive/issue_comments_351020.json:
```json
{
    "body": "- option 1: keep `SR.var('e')` (variable creation) and make `SR('e')` always return `exp(1)` for consistency\n- option 2: forbid standard variable names (`e`, `pi`, `cos`, etc)",
    "created_at": "2018-04-16T11:04:30Z",
    "issue": "https://github.com/sagemath/sagetest/issues/24941",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/24941#issuecomment-351020",
    "user": "@videlec"
}
```

- option 1: keep `SR.var('e')` (variable creation) and make `SR('e')` always return `exp(1)` for consistency
- option 2: forbid standard variable names (`e`, `pi`, `cos`, etc)



---

archive/issue_comments_351021.json:
```json
{
    "body": "One option could be to have `SR.I()`, `SR.e()`, etc working the same way as the existing `SR.pi()`, and let `SR(string)` return/inject a symbolic variable.",
    "created_at": "2018-04-16T21:52:39Z",
    "issue": "https://github.com/sagemath/sagetest/issues/24941",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/24941#issuecomment-351021",
    "user": "tmonteil"
}
```

One option could be to have `SR.I()`, `SR.e()`, etc working the same way as the existing `SR.pi()`, and let `SR(string)` return/inject a symbolic variable.



---

archive/issue_comments_351022.json:
```json
{
    "body": "I don't see how\n\n```\nsage: SR('I') ** 2   # complex imaginary\n-1\nsage: SR.var('I')\nI\nsage: SR('I') ** 2   # now a variable!\nI^2\n```\n\nis any more confusing than\n\n```\nsage: exp(1)         # exponential\ne\nsage: exp = log\nsage: exp(1)         # now logarithm!\n0\n```\n",
    "created_at": "2018-04-17T08:55:19Z",
    "issue": "https://github.com/sagemath/sagetest/issues/24941",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/24941#issuecomment-351022",
    "user": "@slel"
}
```

I don't see how

```
sage: SR('I') ** 2   # complex imaginary
-1
sage: SR.var('I')
I
sage: SR('I') ** 2   # now a variable!
I^2
```

is any more confusing than

```
sage: exp(1)         # exponential
e
sage: exp = log
sage: exp(1)         # now logarithm!
0
```




---

archive/issue_comments_351023.json:
```json
{
    "body": "Replying to [comment:9 slelievre]:\n> I don't see how\n> {{{\n> sage: SR('I') ** 2   # complex imaginary\n> -1\n> sage: SR.var('I')\n> I\n> sage: SR('I') ** 2   # now a variable!\n> I^2\n> }}}\n> is any more confusing than\n> {{{\n> sage: exp(1)         # exponential\n> e\n> sage: exp = log\n> sage: exp(1)         # now logarithm!\n> 0\n> }}}\n\nSee [comment:3].",
    "created_at": "2018-04-17T09:28:33Z",
    "issue": "https://github.com/sagemath/sagetest/issues/24941",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/24941#issuecomment-351023",
    "user": "@videlec"
}
```

Replying to [comment:9 slelievre]:
> I don't see how
> {{{
> sage: SR('I') ** 2   # complex imaginary
> -1
> sage: SR.var('I')
> I
> sage: SR('I') ** 2   # now a variable!
> I^2
> }}}
> is any more confusing than
> {{{
> sage: exp(1)         # exponential
> e
> sage: exp = log
> sage: exp(1)         # now logarithm!
> 0
> }}}

See [comment:3].



---

archive/issue_comments_351024.json:
```json
{
    "body": "More precisely\n\n```\ndef f():\n    exp = log\n    SR.var('e')\nf()\nexp(x)  # still exp(x)\nSR('e') # e is a variable here\n```\n",
    "created_at": "2018-04-17T09:29:37Z",
    "issue": "https://github.com/sagemath/sagetest/issues/24941",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/24941#issuecomment-351024",
    "user": "@videlec"
}
```

More precisely

```
def f():
    exp = log
    SR.var('e')
f()
exp(x)  # still exp(x)
SR('e') # e is a variable here
```




---

archive/issue_comments_351025.json:
```json
{
    "body": "I get it now. The changed behaviour would be expected after\n\n```\nsage: I = SR.var('I')\n```\n\nbut not after\n\n```\nsage: SR.var('I')\n```\n",
    "created_at": "2018-04-17T09:35:55Z",
    "issue": "https://github.com/sagemath/sagetest/issues/24941",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/24941#issuecomment-351025",
    "user": "@slel"
}
```

I get it now. The changed behaviour would be expected after

```
sage: I = SR.var('I')
```

but not after

```
sage: SR.var('I')
```




---

archive/issue_comments_351026.json:
```json
{
    "body": "Replying to [comment:7 tmonteil]:\n> One option could be to have `SR.I()`, `SR.e()`, etc working the same way as the existing `SR.pi()`, and let `SR(string)` return/inject a symbolic variable.\n\nIndeed.",
    "created_at": "2018-05-12T15:27:02Z",
    "issue": "https://github.com/sagemath/sagetest/issues/24941",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/24941#issuecomment-351026",
    "user": "@videlec"
}
```

Replying to [comment:7 tmonteil]:
> One option could be to have `SR.I()`, `SR.e()`, etc working the same way as the existing `SR.pi()`, and let `SR(string)` return/inject a symbolic variable.

Indeed.



---

archive/issue_comments_351027.json:
```json
{
    "body": "update milestone 8.3 -> 8.4",
    "created_at": "2018-08-03T19:20:18Z",
    "issue": "https://github.com/sagemath/sagetest/issues/24941",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/24941#issuecomment-351027",
    "user": "@videlec"
}
```

update milestone 8.3 -> 8.4
