# Issue 10854: Fix typo in the multiple edges detection code of DiGraph

Issue created by migration from Trac.

Original creator: nthiery

Original creation time: 2011-03-14 13:04:38

Assignee: jason, ncohen, rlm

CC:  ncohen


```
sage: DiGraph([(1, 2, 0), (1,2,1)])
Traceback (most recent call last):
  ...
  File "/opt/sage-4.6.2/local/lib/python2.6/site-packages/sage/graphs/digraph.py", line 417, in __init__
    (u in data[v])):
KeyError: 2

sage:             sage: DiGraph([(1, 2, 0)])
------------------------------------------------------------
Traceback (most recent call last):
  ...
  File "/opt/sage-4.6.2/local/lib/python2.6/site-packages/sage/graphs/digraph.py", line 417, in __init__
    (u in data[v])):
KeyError: 2

```


The test should have been v in data[u]. I'll attach soon a patch doing this:


```
     sage: DiGraph([(1, 2, 0), (1,2,1)])
     Multi-digraph on 2 vertices
     sage: DiGraph([(1, 2, 0)])
     Digraph on 2 vertices
```



---

Comment by nthiery created at 2011-03-14 13:10:24

Changing status from new to needs_review.


---

Attachment


---

Comment by nthiery created at 2011-03-14 13:18:42

Btw: pyflakes complains about ``choice`` not being defined on l. 602 of this file. But I leave that to someone else to investigate this further.


---

Comment by ncohen created at 2011-03-14 14:16:28

Changing status from needs_review to positive_review.


---

Comment by ncohen created at 2011-03-14 14:16:28

I thought there would be a similar problem in graph.py, but the situation there is obviously more... symmetric `:-)`

Nathann


---

Comment by nthiery created at 2011-03-14 16:01:04

Replying to [comment:3 ncohen]:
> I thought there would be a similar problem in graph.py, but the situation there is obviously more... symmetric `:-)`
> 
> Nathann

Thanks for the review!


---

Comment by jdemeyer created at 2011-03-18 19:18:30

Resolution: fixed
