# Issue 19577: Group Theory::random_prime(n) generating composite numbers for large values of n

Issue created by migration from https://trac.sagemath.org/ticket/19814

Original creator: DayneSorvisto

Original creation time: 2015-12-31 07:56:02

Keywords: prime numbers

Hi, 

First time posting a bug report on trac. The bug I'd like to report is "random_value" returns composite numbers for large integers. For example  m = random_prime(100000000000000000000000000000000000000000000000000000000000000000000000000)
returned 
71944724797690175157403755256108218794891687825722145298657347991279721529
which is a composite number ending in 9.


---

Comment by DayneSorvisto created at 2015-12-31 08:02:05

Set assignee to DayneSorvisto.


---

Comment by DayneSorvisto created at 2015-12-31 08:02:45

Changing type from PLEASE CHANGE to defect.


---

Comment by DayneSorvisto created at 2015-12-31 08:37:39

added to original post


---

Comment by tscrim created at 2016-01-03 01:25:44

Changing status from new to needs_review.


---

Comment by tscrim created at 2016-01-03 01:25:44

As far as I can tell, that is a prime number:

```
sage: x = 71944724797690175157403755256108218794891687825722145298657347991279721529
sage: sum(x.digits())
368
sage: 3+6+8 % 3
11
sage: (3+6+8) % 3
2
sage: x.is_prime()
True
```

If I'm mistaken, could you tell me its prime decomposition?


---

Comment by vbraun created at 2016-01-04 17:32:00

Also, according to the docs there are currently no known pseudoprimes that are not actually prime, so if you find a counterexample it would probably be publication worthy ;-)


---

Comment by vbraun created at 2016-01-04 17:33:11

Resolution: invalid
