# Issue 23478: rational matrices ignore transformation=true in echelon form

Issue created by migration from https://trac.sagemath.org/ticket/23715

Original creator: vdelecroix

Original creation time: 2017-08-25 16:32:34

CC:  jipilab slelievre

Keywords: days88


```
sage: matrix(ZZ,2,range(4)).echelon_form(transformation=True)
(
[2 0]  [-3  1]
[0 1], [ 1  0]
)
sage: matrix(QQ,2,range(4)).echelon_form(transformation=True)
[1 0]
[0 1]
```



---

Comment by slelievre created at 2018-09-11 11:57:14

Changing keywords from "days88" to "days88, echelon_form, matrix".


---

Comment by slelievre created at 2018-09-11 11:57:14

Related: the documentation for `rref` (reduced row-echelon form) claims that

> All arguments are passed on to :meth:`echelon_form`.

but it is not the case; in particular `transformation=True` is not passed on!


```
sage: a = matrix(ZZ, [[1, 2, 3], [3, 2, 1], [0, 1, 0]])
sage: a.rref(transformation=True)
[1 0 0]
[0 1 0]
[0 0 1]
sage: a.echelon_form(transformation=True)
(
[1 0 3]  [ 1  0 -2]
[0 1 0]  [ 0  0  1]
[0 0 8], [ 3 -1 -4]
)
```



---

Comment by slelievre created at 2018-09-11 22:39:10

Is it maybe the case that `transformation=True` is honored by `echelon_form` only if the base ring is not a field?
