# Issue 18550: Bug with matrice products over Symbolic Ring with modular integers

Issue created by migration from Trac.

Original creator: tmonteil

Original creation time: 2015-06-25 11:07:30

CC:  kcrisman slelievre

As reported on [this ask question](http://ask.sagemath.org/question/27196/multiplying-matrices-with-different-parents/)


```
sage: sage: var('A,B,C,D')
(A, B, C, D)
sage: S = matrix(SR,2,[[1+3*A,3*B],[3*C,1+3*D]])
sage: R = Zmod(9)
sage: g = matrix(R,2,[[2,1],[2,6]])
sage: gi = matrix(R,2,[[6,8],[7,2]])
sage: g*S*gi
[        6*B + 3*D + 1 3*A + 3*B + 6*C + 6*D]
[            0*A + 0*D         3*A + 0*D + 1]
```


While we have (look at the second line):


```
sage: R.<A,B,C,D> = PolynomialRing(Zmod(9),4)
sage: g = matrix(R,2,[[2,1],[2,6]])
sage: gi = matrix(R,2,[[6,8],[7,2]])
sage: S = matrix(R,2,[[1+3*A,3*B],[3*C,1+3*D]])
sage: g*S*gi
[        6*B + 3*D + 1 3*A + 3*B + 6*C + 6*D]
[                  6*B         3*A + 3*B + 1]
```



---

Comment by tmonteil created at 2015-06-25 12:23:13

Thanks for isolating the problem.


---

Comment by kcrisman created at 2015-06-25 13:20:53

Thanks very much to both for reporting and simplifying this.


---

Comment by nbruin created at 2015-06-25 18:53:32

A different issue, but it might be related:

```
sage: F=sum((i+1)*x^i for i in [0..20])
sage: G=sum(Zmod(7)(i+1)*x^i for i in [0..20])
sage: F*Zmod(7)(1) - G
x^19 + 2*x^18 + 0*x^13 + 0*x^6
sage: G*Zmod(7)(1) - G
0
```

so there seems to be something fishy with symbolic multiplication involving integers and elements of Z/n in general. It's not just a zero-divisor problem.

It's not just powers either:

```
sage: V=[SR.var("x%s"%i) for i in [0..20]]
sage: F=sum((i+1)*V[i] for i in [0..20])
sage: G=sum(Zmod(7)(i+1)*V[i] for i in [0..20])
sage: sage: F*Zmod(7)(1)-G
-x0 + 0*x13 + 6*x14 + 0*x20 + 3*x3 + 0*x6
sage: F-G 
14*x13 + 21*x20 + 7*x6
```

The last one is correct, since the terms with x6, x20 and x13 are really missing from G. This illustrates why mixing characteristics in SR is always going to be a mess (even if non-zero characteristic works properly otherwise).


---

Comment by tmonteil created at 2015-06-25 20:03:38

It seems to be a pynac/ginac issue, right ? So what should we do on our side ? Add a stopgap during conversion/coercion Zmod(n) -> SR ?


---

Comment by kcrisman created at 2015-06-25 20:24:42

(Or even just disallow it?)


---

Comment by rws created at 2015-06-26 06:30:32

This is working in pynac-0.4.1 (but not 0.3.9.1).

EDIT: I meant the original case.


---

Comment by rws created at 2015-06-26 06:35:37

Replying to [comment:6 nbruin]:
> It's not just powers either:
> {{{
> sage: V=[SR.var("x%s"%i) for i in [0..20]]
> sage: F=sum((i+1)*V[i] for i in [0..20])
> sage: G=sum(Zmod(7)(i+1)*V[i] for i in [0..20])
> sage: sage: F*Zmod(7)(1)-G
> -x0 + 0*x13 + 6*x14 + 0*x20 + 3*x3 + 0*x6
> sage: F-G 
> 14*x13 + 21*x20 + 7*x6
> }}}
This is different in 0.4.1:

```
sage: sage: sage: F*Zmod(7)(1)-G
-x0 + 0*x13 + 0*x20 + 4*x9
sage: F-G
14*x13 + 21*x20 + 7*x6
sage: F
x0 + 2*x1 + 11*x10 + 12*x11 + 13*x12 + 14*x13 + 15*x14 + 16*x15 + 17*x16 + 18*x17 + 19*x18 + 20*x19 + 3*x2 + 21*x20 + 4*x3 + 5*x4 + 6*x5 + 7*x6 + 8*x7 + 9*x8 + 10*x9
sage: G
x0 + 2*x1 + 4*x10 + 5*x11 + 6*x12 + x14 + 2*x15 + 3*x16 + 4*x17 + 5*x18 + 6*x19 + 3*x2 + 4*x3 + 5*x4 + 6*x5 + x7 + 2*x8 + 3*x9
```

EDIT: Added `F`,`G`.


---

Comment by rws created at 2015-06-26 07:01:28

Correction: this is not pynac-0.4.1 but pynac master. Narrowing down the reponsible change...


---

Comment by rws created at 2015-06-26 15:12:04

The following patch works for these two examples, just to point at the direction further completion is needed:

```
diff --git a/ginac/expairseq.cpp b/ginac/expairseq.cpp
index 2abb7b7..acef09b 100644
--- a/ginac/expairseq.cpp
+++ b/ginac/expairseq.cpp
`@``@` -1207,16 +1207,17 `@``@` void expairseq::combine_same_terms_sorted_seq()
 	// must_copy will be set to true the first time some combination is 
 	// possible from then on the sequence has changed and must be compacted
 	bool must_copy = false;
+        numeric itin1_c = ex_to<numeric>(itin1->coeff);
 	while (itin2!=last) {
 		if (itin1->rest.compare(itin2->rest)==0 &&
 				unlikely(!is_a<infinity>(itin1->rest))) {
-			itin1->coeff = ex_to<numeric>(itin1->coeff).
+			itin1->coeff = itin1_c.
 			               add_dyn(ex_to<numeric>(itin2->coeff));
 			if (expair_needs_further_processing(itin1))
 				needs_further_processing = true;
 			must_copy = true;
 		} else {
-			if (!ex_to<numeric>(itin1->coeff).is_zero()) {
+			if (not itin1_c.is_zero() or itin1_c.is_parent_pos_char()) {
 				if (must_copy)
 					*itout = *itin1;
 				++itout;
`@``@` -1225,7 +1226,7 `@``@` void expairseq::combine_same_terms_sorted_seq()
 		}
 		++itin2;
 	}
-	if (!ex_to<numeric>(itin1->coeff).is_zero()) {
+	if (not itin1_c.is_zero() or itin1_c.is_parent_pos_char()) {
 		if (must_copy)
 			*itout = *itin1;
 		++itout;
```

The relevant ticket would be https://github.com/pynac/pynac/issues/77.


---

Comment by rws created at 2015-07-16 06:00:01

Changing status from new to needs_review.


---

Comment by rws created at 2015-07-16 06:00:01

New commits:


---

Comment by jdemeyer created at 2015-07-16 13:14:56

With Sage-6.8.rc0:

```
**********************************************************************
File "src/sage/symbolic/expression.pyx", line 2821, in sage.symbolic.expression.Expression._add_
Failed example:
    (A + 3*B)*Zmod(9)(6)
Expected:
    6*A
Got:
    0* + 6*A
**********************************************************************
File "src/sage/symbolic/expression.pyx", line 2823, in sage.symbolic.expression.Expression._add_
Failed example:
    (3*A + 3*B)*Zmod(9)(6)
Expected:
    0
Got:
    0*
**********************************************************************
File "src/sage/symbolic/expression.pyx", line 2825, in sage.symbolic.expression.Expression._add_
Failed example:
    (3*A + 3*B)*Zmod(9)(6)*A
Exception raised:
    Traceback (most recent call last):
      File "/usr/local/src/sage-git/local/lib/python2.7/site-packages/sage/doctest/forker.py", line 496, in _run
        self.compile_and_execute(example, compiler, test.globs)
      File "/usr/local/src/sage-git/local/lib/python2.7/site-packages/sage/doctest/forker.py", line 858, in compile_and_execute
        exec(compiled, globs)
      File "<doctest sage.symbolic.expression.Expression._add_[24]>", line 1, in <module>
        (Integer(3)*A + Integer(3)*B)*Zmod(Integer(9))(Integer(6))*A
      File "sage/structure/element.pyx", line 1849, in sage.structure.element.RingElement.__mul__ (build/cythonized/sage/structure/element.c:16581)
        return (<RingElement>left)._mul_(<RingElement>right)
      File "sage/symbolic/expression.pyx", line 3148, in sage.symbolic.expression.Expression._mul_ (build/cythonized/sage/symbolic/expression.cpp:19837)
        x = gmul(left._gobj, _right._gobj)
    OverflowError: numeric::div(): division by zero
**********************************************************************
```



---

Comment by jdemeyer created at 2015-07-16 13:14:56

Changing status from needs_review to needs_work.


---

Comment by jdemeyer created at 2015-07-16 13:16:23

Also a detail: it's better style to use

```
sage: x = foo
```

instead of

```
sage: x=foo
```



---

Comment by rws created at 2015-07-16 13:27:34

Seems the backport from Pynac-0.4.2 missed something. When will C++11 be mandatory in Sage?


---

Comment by jdemeyer created at 2015-07-16 13:31:48

Replying to [comment:19 rws]:
> When will C++11 be mandatory in Sage?
I think I already mentioned this: I recommend you write to sage-devel with this request.


---

Comment by jdemeyer created at 2015-07-16 13:33:48

Let me add that the hard part will be to define the precise subset of C++11 that you need.

It's easy to require that the C++ compiler supports the `-std=c++0x` or `-std=c++11` option, but I don't know if that is sufficient.


---

Comment by rws created at 2015-07-16 14:23:28

Replying to [comment:21 jdemeyer]:
> Let me add that the hard part will be to define the precise subset of C++11 that you need.
Why? We have already committed to gcc-4.6 in our conversation. For the other system without gcc there will have to be an Xcode version that has equivalent functionality. These two versions will be made the minimum. No other definition necessary.


---

Comment by jdemeyer created at 2015-07-16 14:44:38

Replying to [comment:22 rws]:
> We have already committed to gcc-4.6 in our conversation
Really? I understood that you were not sure if GCC 4.6 was in fact sufficient. But if you are, that's fine for me.

Note that, for various reasons, we actually do not support GCC 4.6 in Sage, which would make GCC 4.7 the minimum.

If you're willing to go ahead with this, you should:
1. write to `sage-devel` explaining why you want C++11 support and that this means requiring GCC 4.7.
2. create a ticket for requiring C++11 and GCC 4.7 in Sage.
3. create a ticket for upgrading Pynac to the version and make it depend on the ticket in 2.


---

Comment by rws created at 2015-07-30 13:58:50

Replying to [comment:17 jdemeyer]:
> With Sage-6.8.rc0:
> {{{
> Got:
>     0* + 6*A
> Got:
>     0*
> }}}
Found it. The backport was indeed incomplete. Fix in pynac-0.3.9.3.


---

Comment by rws created at 2015-08-02 09:26:25

Changing status from needs_work to needs_review.


---

Comment by vdelecroix created at 2015-09-19 03:43:23

Changing status from needs_review to needs_info.


---

Comment by vdelecroix created at 2015-09-19 03:43:23

Why is it in sage-pending?

What about the following (inspired from [comment:6 comment:6]

```
sage: f(x) = Zmod(7)(3) * x**2 + Zmod(9)(3) * x**3
sage: f(1)
** BOOM **
```

while

```
sage: f(x) = Zmod(7)(1) * x**2 + Zmod(9)(1) * x**3
sage: f(1)
2
```


Vincent


---

Comment by rws created at 2015-09-19 06:18:48

Changing status from needs_info to needs_work.


---

Comment by rws created at 2015-09-19 06:18:48

Replying to [comment:27 vdelecroix]:
> Why is it in sage-pending?
I didn't want patchbot on it.


---

Comment by rws created at 2016-03-07 07:54:17

Replying to [comment:27 vdelecroix]:
> What about the following (inspired from [comment:6 comment:6]
> {{{
> sage: f(x) = Zmod(7)(3) * x**2 + Zmod(9)(3) * x**3
> sage: f(1)
> ** BOOM **
> }}}
> while
> {{{
> sage: f(x) = Zmod(7)(1) * x**2 + Zmod(9)(1) * x**3
> sage: f(1)
> 2
> }}}

This both now gives a `TypeError` in pynac master, equivalently to `GF(7)(1) + GF(9)(1)` and `GF(7)(3) + GF(9)(3)`.

The ticket should doctest this as soon as pynac is upgraded to 0.6.4


---

Comment by rws created at 2017-01-16 07:14:22

I believe this is resolved in #21391.


---

Comment by rws created at 2017-01-16 07:14:22

Changing status from needs_work to needs_review.


---

Comment by tmonteil created at 2017-03-06 22:37:04

Replying to [comment:31 rws]:
> I believe this is resolved in #21391.

It seems inteed to works better now. But why not adding the tests discussed on the current ticket as you did previously ?


---

Comment by tmonteil created at 2017-03-06 22:37:04

Changing status from needs_review to needs_info.


---

Comment by rws created at 2017-03-07 14:26:11

Made dependent on #21391 to prevent merge conflicts.
----
New commits:


---

Comment by rws created at 2017-03-07 14:26:11

Changing status from needs_info to needs_review.


---

Comment by mderickx created at 2017-10-25 10:27:17

Do the people on this ticket agree that #24072 solves this ticket as is claimed there?


---

Comment by rws created at 2017-10-25 12:44:23

Agree.


---

Comment by tscrim created at 2017-10-25 22:40:39

Changing status from needs_review to positive_review.


---

Comment by embray created at 2017-12-12 08:23:33

Resolution: wontfix
