# Issue 28615: Make continued_fraction_list accept float argument

Issue created by migration from https://trac.sagemath.org/ticket/28852

Original creator: slelievre

Original creation time: 2019-12-07 18:56:54

CC:  vdelecroix

Keywords: continued_fraction

In Sage 9.0.beta8, for a float, `continued_fraction` works
but `continued_fraction_list` does not:

```
sage: set_random_seed(0)
sage: x = random()
sage: x
0.111439293741037
sage: continued_fraction(x)
[0; 8, 1, 36, 1, 2, 1, 2, 3, 2, 6, 1, 12, 1, 1, 10, 1, 4]
sage: continued_fraction_list(x)
Traceback (most recent call last)
...
AttributeError: 'float' object has no attribute 'parent'
```


One would expect:

```
sage: continued_fraction_list(x)
[0, 8, 1, 36, 1, 2, 1, 2, 3, 2, 6, 1, 12, 1, 1, 10, 1, 4]
```



---

Comment by vdelecroix created at 2019-12-07 22:58:52

The simplest would be to start with the conversion of the argument with `py_scalar_to_element` (from `sage.structure.coerce`).


---

Comment by embray created at 2020-01-06 14:10:03

Ticket retargeted after milestone closed


---

Comment by mkoeppe created at 2020-05-01 04:28:42

Moving tickets to milestone sage-9.2 based on a review of last modification date, branch status, and severity.


---

Comment by mkoeppe created at 2021-04-02 20:21:54

Moving this ticket to 9.4, as it seems unlikely that it will be merged in 9.3, which is in the release candidate stage
