# Issue 26774: Quotient rings should support function field construction if they are fields.

Issue created by migration from https://trac.sagemath.org/ticket/27011

Original creator: @BrentBaccala

Original creation time: 2019-01-04 02:24:22

Keywords: function field

Univariate polynomial rings have associated function fields:


```
sage: R.<x> = QQ[]
sage: Frac(R)
Fraction Field of Univariate Polynomial Ring in x over Rational Field
sage: Frac(R).function_field()
Rational function field in x over Rational Field
```


A similar construction should be possible for quotient rings, if they are fields:


```
sage: K.<x> = FunctionField(QQ); R.<y> = K[]
sage: R.quo(y^5 - (x^3 + 2*x*y + 1/x)).function_field()
Function field in y defined by y^5 - 2*x*y + (-x^4 - 1)/x
```


This ticket adds a `function_field` method to `PolynomialQuotientRing_field`



---

Comment by @BrentBaccala created at 2019-01-04 02:29:51

Changing status from new to needs_review.


---

Comment by @BrentBaccala created at 2019-01-04 02:29:51

New commits:


---

Comment by embray created at 2019-01-15 18:15:21

Retarging tickets optimistically to the next milestone.  If you are responsible for this ticket (either its reporter or owner) and don't believe you are likely to complete this ticket before the next release (8.7) please retarget this ticket's milestone to sage-pending or sage-wishlist.


---

Comment by embray created at 2019-03-25 10:56:15

Ticket retargeted after milestone closed (if you don't believe this ticket is appropriate for the Sage 8.8 release please retarget manually)


---

Comment by soehms created at 2019-04-02 19:18:03

It's a good idea to have such a method! But I think it would be more useful if conversions between the both realizations would work.
Unfortunately, this is not the case:


```
sage: K.<x> = FunctionField(QQ); R.<y> = K[]
sage: L = R.quo(y^5 - (x^3 + 2*x*y + 1/x))
sage: F = L.function_field()
sage: F(L.an_element())
Traceback (most recent call last):
...
TypeError: cannot convert ybar/1 to an element of Fraction Field of Univariate Polynomial Ring in x over Rational Field
sage: L(F.an_element())
Traceback (most recent call last):
...
ValueError: y is not an element of the base field
```


It should not be difficult to improve this (for example via the `_convert_map_from_` method), since both maps can be obtained as ring homomorphisms:


```
sage: f = L.hom(F.gens())
sage: g = F.hom(L.gens())
sage: f(L.an_element())
y
sage: g(F.an_element())
ybar
sage: (f*g).is_one()
True
sage: (g*f).is_one()
True
```



---

Comment by embray created at 2019-07-03 11:37:56

Moving tickets from the Sage 8.8 milestone that have been actively worked on in the last six months to the next release milestone (optimistically).


---

Comment by embray created at 2019-12-30 14:48:17

Ticket retargeted after milestone closed


---

Comment by mkoeppe created at 2020-04-14 19:41:51

Batch modifying tickets that will likely not be ready for 9.1, based on a review of the ticket title, branch/review status, and last modification date.


---

Comment by slabbe created at 2020-08-14 12:18:20

changing the status to needs works according to the most recent comment


---

Comment by slabbe created at 2020-08-14 12:18:20

Changing status from needs_review to needs_work.


---

Comment by mkoeppe created at 2021-02-13 20:51:01

Setting new milestone based on a cursory review of ticket status, priority, and last modification date.


---

Comment by mkoeppe created at 2021-07-19 00:44:56

Setting a new milestone for this ticket based on a cursory review.
