# Issue 11901: MatrixGroup() or order() incorrect for G_2(F_3)

Issue created by migration from Trac.

Original creator: robharron

Original creation time: 2011-11-23 07:18:45

Assignee: joyner

Keywords: MatrixGroup, GAP, order

If I use the generators for the exceptional group G_2(F_3) in its natural 7-dimensional representation over F_3 in the MatrixGroup constructor, the order of the group returned is 8491392 (twice what it should be). However, if I use the same generators through the gap console within sage, I get the correct size.


```
K=GF(3)
sage: gens=[matrix(K,7,[
....: [0,2,0,0,0,0,0],
....: [2,0,0,0,0,0,0],
....: [0,0,0,2,0,0,0],
....: [0,0,2,0,0,0,0],
....: [0,0,0,0,0,2,0],
....: [0,0,0,0,2,0,0],
....: [2,2,2,2,1,1,1]]),
....: matrix(K,7,[
....: [2,0,0,0,0,0,0],
....: [0,0,2,0,0,0,0],
....: [1,1,1,0,0,0,0],
....: [0,0,0,0,2,0,0],
....: [1,0,0,1,1,0,0],
....: [0,0,0,0,0,0,2],
....: [1,0,0,0,0,1,1]])]
sage: MatrixGroup(gens).order()
8491392
```




```
gap> m1:= [
> [0,2,0,0,0,0,0],
> [2,0,0,0,0,0,0],
> [0,0,0,2,0,0,0],
> [0,0,2,0,0,0,0],
> [0,0,0,0,0,2,0],
> [0,0,0,0,2,0,0],
> [2,2,2,2,1,1,1]
> ]*Z(3);
gap> m2:= [
> [2,0,0,0,0,0,0],
> [0,0,2,0,0,0,0],
> [1,1,1,0,0,0,0],
> [0,0,0,0,2,0,0],
> [1,0,0,1,1,0,0],
> [0,0,0,0,0,0,2],
> [1,0,0,0,0,1,1]
> ]*Z(3);
gap> Order(Group( m1, m2 ));
4245696
```



---

Comment by chapoton created at 2017-06-02 12:39:55

Compare

```
sage: L = [gap(GF(3)(i)) for i in range(3)]; L
[0*Z(3), Z(3)^0, Z(3)]
```

and

```
gap> [0, 1, 2]*Z(3);
[ 0*Z(3), Z(3), Z(3)^0 ]
```



---

Comment by chapoton created at 2017-06-02 12:43:38

same problems for other finite fields of prime order

```
sage: p=5; L = [gap(GF(p)(i)) for i in range(p)]; L
[0*Z(5), Z(5)^0, Z(5), Z(5)^3, Z(5)^2]
```

versus

```
gap> p:=5; [0..p-1]*Z(p);
5
[ 0*Z(5), Z(5), Z(5)^2, Z(5)^0, Z(5)^3 ]
```

**EDIT**
Note also that 

```
gap> One(ZmodnZ(5));
Z(5)^0
gap> One(Z(5));
Z(5)^0
gap> One(GF(5));
Z(5)^0
```

So our conversion seems to be consistent with gap..


---

Comment by chapoton created at 2017-06-02 13:07:11

This boils down to

```
gap> 1*Z(5);
Z(5)
gap> One(Z(5));
Z(5)^0
```

which is indeed not very-good looking.


---

Comment by chapoton created at 2017-06-02 13:39:14

Changing status from new to needs_review.


---

Comment by chapoton created at 2017-06-02 13:39:14

ok, so this must come from a confusion: in Gap, Z(5) is not the one of the finite field, but a generator of the group of invertible elements. This means that your matrices are not the correct ones, I think.

I propose to close this as invalid.


---

Comment by tscrim created at 2017-06-05 08:49:00

Confirmed:

```
gap> One(GF(5));
Z(5)^0
```

and replacing by the above yields:

```
gap> Order(Group( m1, m2 ));
8491392
```



From the [GAP manual](https://www.gap-system.org/Manuals/doc/ref/chap59.html):

> The root returned by `Z` is a generator of the multiplicative group of the finite field with p<sup>d</sup> elements, which is cyclic.


---

Comment by tscrim created at 2017-06-05 08:49:00

Changing status from needs_review to positive_review.


---

Comment by embray created at 2017-07-13 07:54:31

Resolution: wontfix


---

Comment by embray created at 2017-07-13 07:54:31

Closing tickets in the sage-duplicate/invalid/wontfix module with positive_review (i.e. someone has confirmed they should be closed).
