# Issue 27115: Add checks for matrix multiplication

Issue created by migration from https://trac.sagemath.org/ticket/27352

Original creator: slelievre

Original creation time: 2019-02-25 19:17:42

CC:  slelievre

It seems the compatibility of dimensions is not always tested
when multiplying matrices.

This ticket is opened following the report at
- [Ask Sage question 45547: Strange matrix product](https://ask.sagemath.org/question/45547)

In particular, multiplying two 3 by 2 matrices should fail, but:

```
sage: A = matrix(QQ, [[1, 2], [-1, 0], [1, 1]])
sage: B = matrix(QQ, [[0, 4], [1, -1], [1, 2]])
sage: A
[ 1  2]
[-1  0]
[ 1  1]
sage: B
[ 0  4]
[ 1 -1]
[ 1  2]
sage: A*B
[ 1  0]
[ 1 -2]
[ 1  3]
```


In this case `A * B` amounts to `A.__mul__(B)` which ends up calling `A._multiply_flint(B)`.

For matrices over the integers, the multiplication above fails as it should:

```
sage: A = matrix(ZZ, [[1, 2], [-1, 0], [1, 1]])
sage: B = matrix(ZZ, [[0, 4], [1, -1], [1, 2]])
sage: A * B
Traceback (most recent call last)
...
IndexError: Number of columns of self must equal number of rows of right.
```

but we get a similar surprise by calling

```
sage: A._multiply_linbox(B)
[ 2  2]
[ 0 -4]
[ 1  3]
```


In case `_multiply_linbox` and `_multiply_flint` skip dimension tests for speed,
tests should be performed before calling them, which seems to be the case for
`_multiply_linbox` but not `_multiply_flint`.



---

Comment by jhpalmieri created at 2019-02-25 19:51:58

With 8.7.beta5, I actually get random (?) answers:

```
sage: A = matrix(QQ, [[1, 2], [-1, 0], [1, 1]])
sage: B = matrix(QQ, [[0, 4], [1, -1], [1, 2]])
sage: A * B
[          1           0]
[          1          -2]
[13204699393 26409398787]
sage: A * B
[          1           0]
[          1          -2]
[13226416241 26452832483]
sage: A * B
[          1           0]
[          1          -2]
[13226415713 26452831427]
sage: A * B
[          1           0]
[          1          -2]
[13226429585 26452859171]
sage: A * B
[          1           0]
[          1          -2]
[13226415905 26452831811]
sage: A * B
[                    1                     0]
[                    1                    -2]
[ -6917529027641081855 -13835058055282163709]
sage: A * B
[                  1                   0]
[                  1                  -2]
[-411335435850571967 -822670871701143933]
sage: A * B
[              1               0]
[              1              -2]
[140331841062305 280663682124611]
sage: A * B
[ 1  0]
[ 1 -2]
[ 1  3]
```



---

Comment by tscrim created at 2019-02-25 22:26:48

Those random answers are likely because upstream uses whatever is in that next spot in memory. I think this also has a chance of causing a segfault or destroying some other computation for the same reason.


---

Comment by jhpalmieri created at 2019-02-25 23:12:45

Regarding the ticket description, is `_multiply_linbox` used anywhere? `_multiply_flint` is funny because it has a doctest

```
            sage: matrix(QQ, 2, 3) * matrix(QQ, 4, 5)
            Traceback (most recent call last):
            ...
            TypeError: unsupported operand parent(s) for *: 'Full MatrixSpace of 2 by 3 dense matrices over Rational Field' and 'Full MatrixSpace of 4 by 5 dense matrices over Rational Field'
```

but I think if the two matrices have the same parent, then the shapes aren't checked.


---

Comment by jhpalmieri created at 2019-02-25 23:57:48

Can we just do something like this?

```diff
diff --git a/src/sage/structure/element.pyx b/src/sage/structure/element.pyx
index 1b167b7ab4..eef1798d54 100644
--- a/src/sage/structure/element.pyx
+++ b/src/sage/structure/element.pyx
@@ -3676,7 +3676,10 @@ cdef class Matrix(ModuleElement):
         """
         cdef int cl = classify_elements(left, right)
         if HAVE_SAME_PARENT(cl):
-            return (<Matrix>left)._matrix_times_matrix_(<Matrix>right)
+            if left.ncols() == right.nrows():
+                return (<Matrix>left)._matrix_times_matrix_(<Matrix>right)
+            else:
+                raise ValueError
         if BOTH_ARE_ELEMENT(cl):
             return coercion_model.bin_op(left, right, mul)
 
```

(with an appropriate message for the `ValueError`)? I don't know the `element.pyx` code well. Or should the change be done in `_matrix_times_matrix` in `matrix_rational_dense.pyx`?


---

Comment by vdelecroix created at 2019-02-27 19:27:07

Replying to [comment:4 jhpalmieri]:
> Can we just do something like this?
> {{{
> #!diff
> diff --git a/src/sage/structure/element.pyx b/src/sage/structure/element.pyx
> index 1b167b7ab4..eef1798d54 100644
> --- a/src/sage/structure/element.pyx
> +++ b/src/sage/structure/element.pyx
> `@``@` -3676,7 +3676,10 `@``@` cdef class Matrix(ModuleElement):
>          """
>          cdef int cl = classify_elements(left, right)
>          if HAVE_SAME_PARENT(cl):
> -            return (<Matrix>left)._matrix_times_matrix_(<Matrix>right)
> +            if left.ncols() == right.nrows():
> +                return (<Matrix>left)._matrix_times_matrix_(<Matrix>right)
> +            else:
> +                raise ValueError
>          if BOTH_ARE_ELEMENT(cl):
>              return coercion_model.bin_op(left, right, mul)
>  
> }}}
> (with an appropriate message for the `ValueError`)? I don't know the `element.pyx` code well. Or should the change be done in `_matrix_times_matrix` in `matrix_rational_dense.pyx`?

Yes but use `self._ncols` (`Py_ssize_t` attribute) instead of `ncols()` (Python function).

Note that the coercion model raises `TypeError`

```
sage: Zmod(3).an_element() * Zmod(2).an_element()
```

and I think it is better to follow this convention.


---

Comment by vdelecroix created at 2019-02-27 19:29:34

Replying to [comment:5 vdelecroix]:
> Replying to [comment:4 jhpalmieri]:
> 
> Yes but use `self._ncols` (`Py_ssize_t` attribute) instead of `ncols()` (Python function).
> 

This won't work, use

```
(<Matrix> left)._nrows != (<Matrix> left)._ncols
```

(note that since `left` and `right` have the same parent we want them to be square matrices)


---

Comment by jhpalmieri created at 2019-02-27 20:11:24

Changing status from new to needs_review.


---

Comment by jhpalmieri created at 2019-02-27 20:11:24

Here's a first draft. Feel free to modify it.
----
New commits:


---

Comment by vdelecroix created at 2019-02-27 20:27:51

Changing status from needs_review to needs_work.


---

Comment by vdelecroix created at 2019-02-27 20:27:51

``trac`:27352:` should be `:trac:`27352``


---

Comment by git created at 2019-02-27 20:33:10

Branch pushed to git repo; I updated commit sha1. This was a forced push. New commits:


---

Comment by jhpalmieri created at 2019-02-27 20:33:50

Fixed. (I built the reference manual, but of course this doesn't appear in the reference manual, so I didn't catch it.)


---

Comment by vdelecroix created at 2019-02-27 21:13:23

Changing status from needs_work to positive_review.


---

Comment by vdelecroix created at 2019-02-27 21:13:23

Indeed...


---

Comment by slelievre created at 2019-03-01 17:27:56

Usually, no space between the type declaration `<Matrix>` and the name `left` or `right`.

See other uses elsewhere in the source code as found by `search_src("<matrix>")`:

```
matrix/action.pyx:248:        cdef Matrix A = <Matrix>g
matrix/action.pyx:249:        cdef Matrix B = <Matrix>s
matrix/action.pyx:305:        cdef Matrix A = <Matrix>g
matrix/action.pyx:356:        cdef Matrix A = <Matrix>g
matrix/action.pyx:367:        return (<Matrix>A)._vector_times_matrix_(v) # v * A
matrix/args.pyx:652:                M = <Matrix>self.entries
matrix/args.pyx:880:            m = <Matrix>self.entries
matrix/matrix1.pyx:1461:            other = <Matrix>bottom
matrix/matrix1.pyx:1503:        cdef Matrix other = <Matrix>bottom
matrix/matrix2.pyx:790:        return (<Matrix>A)._elementwise_product(B)
matrix/matrix2.pyx:2450:        cdef Matrix M  = <Matrix> self
matrix/matrix2.pyx:2478:        cdef Matrix a = <Matrix> matrix(R, n-1, n)
matroids/lean_matrix.pyx:1033:                        if int((<Matrix>M).get_unsafe(i, j)) & 1:
matroids/lean_matrix.pyx:1655:                        s = int((<Matrix>M).get_unsafe(i, j)) % 3
matroids/lean_matrix.pyx:2208:                self._gf4 = (<Matrix>M).base_ring()
matroids/lean_matrix.pyx:2215:                        self.set(i, j, (<Matrix>M).get_unsafe(i, j))
structure/element.pyx:3679:            return (<Matrix>left)._matrix_times_matrix_(<Matrix>right)
```


Not sure if it's still time to change this here or it should happen in a follow-up ticket or we don't care.


---

Comment by git created at 2019-03-01 18:45:56

Changing status from positive_review to needs_review.


---

Comment by git created at 2019-03-01 18:45:56

Branch pushed to git repo; I updated commit sha1 and set ticket back to needs_review. This was a forced push. New commits:


---

Comment by jhpalmieri created at 2019-03-01 18:46:29

I don't care much, but it's easy to change. If Volker complains, we will know it was too late.


---

Comment by jhpalmieri created at 2019-03-01 18:46:29

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2019-03-03 22:38:10

Resolution: fixed
