# Issue 28632: Isomorphisms of absolute fields can not be used in change_ring

Issue created by migration from https://trac.sagemath.org/ticket/28869

Original creator: jvlangen

Original creation time: 2019-12-10 13:36:34

Keywords: absolute field, coercion

For a polynomial `f` defined over a number field `K`, when replacing `K` by its absolute field `L = K.absolute_field(names='b')` there might be an error when changing `f` with the appropriate isomorphism `f.change_ring(L.structure()[1])`.

The problem arises from the fact that `change_ring` wants to check whether the isomorphism is part of `K.Hom(L)` by calling `K.Hom(L)(L.structure()[1])` which gives an error if `L.structure()[1]` is not an instance of `NumberFieldHomomorphism_im_gens` which it not necessarily is. Here is a minimal working example


```
sage: K.<a> = CyclotomicField(8)
sage: L.<b> = K.absolute_field()
sage: phi = L.structure()[1]
sage: phi.parent() == K.Hom(L)
True
sage: K.Hom(L)(phi)
Traceback (most recent call last):
...
TypeError: unable to convert Isomorphism given by variable name change map:
  From: Cyclotomic Field of order 8 and degree 4
  To:   Number Field in b with defining polynomial x^4 + 1 to an element of Number Field in b with defining polynomial x^4 + 1
```


The error seems a consequence of a call to `K.Hom(L)` interpreting the argument as an element of the codomain if it is not an instance of `NumberFieldHomomorphism_im_gens`.

Here is the example failing on `change_ring` where the error message is even less insightful


```
sage: K.<a> = CyclotomicField(8)
sage: L.<b> = K.absolute_field()
sage: R.<x> = K[]
sage: f = x^2 + a
sage: f.change_ring(L.structure()[1])
Traceback (most recent call last):
...
TypeError: 
```

 


---

Comment by embray created at 2020-01-06 14:10:03

Ticket retargeted after milestone closed


---

Comment by pbruin created at 2020-01-14 08:39:01

One way to solve this is by moving ring homsets to the new coercion model; among other things, when doing `R.Hom(S)(f)`, this will check if `f` already has `R.Hom(S)` as its parent without checking the exact type.  I am working on this.


---

Comment by pbruin created at 2020-01-14 14:41:22

Changing status from new to needs_review.


---

Comment by git created at 2020-01-17 09:30:05

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by pbruin created at 2020-01-17 09:33:33

The last commit modifies/adds doctests to cover all `NumberFieldHomset` classes (absolute fields, relative fields and cyclotomic fields).


---

Comment by git created at 2020-01-17 22:18:33

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by tscrim created at 2020-01-29 06:00:42

LGTM.


---

Comment by tscrim created at 2020-01-29 06:00:42

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2020-01-31 23:49:43

Resolution: fixed
