# Issue 27074: bug in simple limit

archive/issues_027074.json:
```json
{
    "body": "I have found the following bug in limit:\n\n\n```\nsage: version()\n'SageMath version 8.6, Release Date: 2019-01-15'\nsage: f=exp(-2*x^2)-cos(2*x);f\n-cos(2*x) + e^(-2*x^2)\nsage: g=x*(sin(x))^3;g\nx*sin(x)^3\nsage: lim(f/g,x=0) # this is wrong\nund\nsage: lim(f/g,x=0,dir='-'),lim(f/g,x=0,dir='+') # the second result is wrong\n(4/3, +Infinity)\nsage: taylor(f/g,x,0,3) # this is right\n-26/45*x^2 + 4/3\nsage: lim(f/x^4,x=0) # this is right too\n4/3\n```\n\n\n(I am on OS X El Capitan (10.11.6).)\n\nThis seems to be a very old bug:  The results are the same for\n\n\n```\nsage: version()\n'SageMath Version 6.10, Release Date: 2015-12-18'\n```\n\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/27311\n\n",
    "created_at": "2019-02-17T16:09:28Z",
    "labels": [
        "calculus",
        "major",
        "bug"
    ],
    "title": "bug in simple limit",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/27074",
    "user": "@GMS103"
}
```
I have found the following bug in limit:


```
sage: version()
'SageMath version 8.6, Release Date: 2019-01-15'
sage: f=exp(-2*x^2)-cos(2*x);f
-cos(2*x) + e^(-2*x^2)
sage: g=x*(sin(x))^3;g
x*sin(x)^3
sage: lim(f/g,x=0) # this is wrong
und
sage: lim(f/g,x=0,dir='-'),lim(f/g,x=0,dir='+') # the second result is wrong
(4/3, +Infinity)
sage: taylor(f/g,x,0,3) # this is right
-26/45*x^2 + 4/3
sage: lim(f/x^4,x=0) # this is right too
4/3
```


(I am on OS X El Capitan (10.11.6).)

This seems to be a very old bug:  The results are the same for


```
sage: version()
'SageMath Version 6.10, Release Date: 2015-12-18'
```



Issue created by migration from https://trac.sagemath.org/ticket/27311





---

archive/issue_comments_381423.json:
```json
{
    "body": "Ticket retargeted after milestone closed (if you don't believe this ticket is appropriate for the Sage 8.8 release please retarget manually)",
    "created_at": "2019-03-25T10:56:15Z",
    "issue": "https://github.com/sagemath/sagetest/issues/27074",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/27074#issuecomment-381423",
    "user": "embray"
}
```

Ticket retargeted after milestone closed (if you don't believe this ticket is appropriate for the Sage 8.8 release please retarget manually)



---

archive/issue_comments_381424.json:
```json
{
    "body": "As the Sage-8.8 release milestone is pending, we should delete the sage-8.8 milestone for tickets that are not actively being worked on or that still require significant work to move forward.  If you feel that this ticket should be included in the next Sage release at the soonest please set its milestone to the next release milestone (sage-8.9).",
    "created_at": "2019-06-14T14:54:19Z",
    "issue": "https://github.com/sagemath/sagetest/issues/27074",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/27074#issuecomment-381424",
    "user": "embray"
}
```

As the Sage-8.8 release milestone is pending, we should delete the sage-8.8 milestone for tickets that are not actively being worked on or that still require significant work to move forward.  If you feel that this ticket should be included in the next Sage release at the soonest please set its milestone to the next release milestone (sage-8.9).



---

archive/issue_comments_381425.json:
```json
{
    "body": "Ticket retargeted after milestone closed",
    "created_at": "2019-12-30T14:48:17Z",
    "issue": "https://github.com/sagemath/sagetest/issues/27074",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/27074#issuecomment-381425",
    "user": "embray"
}
```

Ticket retargeted after milestone closed



---

archive/issue_comments_381426.json:
```json
{
    "body": "Moving tickets to milestone sage-9.2 based on a review of last modification date, branch status, and severity.",
    "created_at": "2020-05-01T04:28:42Z",
    "issue": "https://github.com/sagemath/sagetest/issues/27074",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/27074#issuecomment-381426",
    "user": "mkoeppe"
}
```

Moving tickets to milestone sage-9.2 based on a review of last modification date, branch status, and severity.



---

archive/issue_comments_381427.json:
```json
{
    "body": "still the same in 9.2.beta10",
    "created_at": "2020-08-29T18:52:00Z",
    "issue": "https://github.com/sagemath/sagetest/issues/27074",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/27074#issuecomment-381427",
    "user": "mkoeppe"
}
```

still the same in 9.2.beta10



---

archive/issue_comments_381428.json:
```json
{
    "body": "Yes, you are right.\n\nAnything I could do?  I am only a not very experienced user of [SageMath](SageMath).",
    "created_at": "2020-08-29T19:53:59Z",
    "issue": "https://github.com/sagemath/sagetest/issues/27074",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/27074#issuecomment-381428",
    "user": "@GMS103"
}
```

Yes, you are right.

Anything I could do?  I am only a not very experienced user of [SageMath](SageMath).



---

archive/issue_comments_381429.json:
```json
{
    "body": "This problem occurs only with maxima. With fricas it works as expected. But these are some of the other cases where the result is ambiguous.\n\n\n```\nsage: f = (1+1/x)^x\nsage: lim(f,x=0.5)\nund\nsage: lim(f,x=1/2)\nsqrt(3)\nsage: lim(f,dir='+',x=0.5)\n1.7320508075688774\nsage: lim(f,dir='-',x=0.5)\n1.7320508075688772\nsage: lim(f,dir='-',x=3/2)\n5/9*sqrt(5)*sqrt(3)\nsage: lim(f,x=3/2)\nund\nsage: lim(f,x=1.5)\n```\n",
    "created_at": "2020-10-11T13:38:03Z",
    "issue": "https://github.com/sagemath/sagetest/issues/27074",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/27074#issuecomment-381429",
    "user": "@ninja18"
}
```

This problem occurs only with maxima. With fricas it works as expected. But these are some of the other cases where the result is ambiguous.


```
sage: f = (1+1/x)^x
sage: lim(f,x=0.5)
und
sage: lim(f,x=1/2)
sqrt(3)
sage: lim(f,dir='+',x=0.5)
1.7320508075688774
sage: lim(f,dir='-',x=0.5)
1.7320508075688772
sage: lim(f,dir='-',x=3/2)
5/9*sqrt(5)*sqrt(3)
sage: lim(f,x=3/2)
und
sage: lim(f,x=1.5)
```




---

archive/issue_comments_381430.json:
```json
{
    "body": "Changing keywords from \"\" to \"limit\".",
    "created_at": "2020-10-13T11:09:56Z",
    "issue": "https://github.com/sagemath/sagetest/issues/27074",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/27074#issuecomment-381430",
    "user": "chapoton"
}
```

Changing keywords from "" to "limit".



---

archive/issue_comments_381431.json:
```json
{
    "body": "Sage development has entered the release candidate phase for 9.3. Setting a new milestone for this ticket based on a cursory review.",
    "created_at": "2021-04-07T19:29:15Z",
    "issue": "https://github.com/sagemath/sagetest/issues/27074",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/27074#issuecomment-381431",
    "user": "mkoeppe"
}
```

Sage development has entered the release candidate phase for 9.3. Setting a new milestone for this ticket based on a cursory review.
