# Issue 26170: Support slicing and tuples in expansion() of p-adic elements

archive/issues_026170.json:
```json
{
    "body": "Keywords: padicBordeaux\n\nAs discussed in #13300, we would like to have (probably this already works)\n\n```\nsage: K.<a> = Qq(7^2, 20)\nsage: z = K.random_element()\nsage: z == sum([z.expansion()[i] * 7^i for i in range(20)])\nTrue\n```\n\nOf course, sometimes you want to get at the coefficient of a in z, or the coefficient of a in z.expansion()[0]. Here's an idea. For matrices, we have the following::\n\n```\nsage: M = matrix(ZZ,4,4,range(16))\nsage: M[0]\n(0, 1, 2, 3)\nsage: M[0,0]\n0\nsage: M[0,:]\n[0 1 2 3]\nsage: M[:,0]\n[ 0]\n[ 4]\n[ 8]\n[12]\nsage: M[1:3,1:4]\n[ 5  6  7]\n[ 9 10 11]\n```\n\nWhat if we used a similar tuple indexing scheme for p-adic elements? For example:\n\n```\nsage: K.<a> = Qq(5^4, 5)\nsage: z = K.random_element(); z\na^3*5^-2 + (3*a^3 + 3*a^2)*5^-1 + (3*a^3 + a^2 + 3*a) + 4*a^3*5 + (4*a + 2)*5^2 + O(5^3)\nsage: z.expansion()[0]\n3*a^3 + a^2 + 3*a + O(5^3)\nsage: z.expansion()[2]\n4*a + 2 + O(5)\nsage: z.expansion()[2].parent()\nUnramified Extension of 5-adic Field with capped relative precision 5 in a defined by (1 + O(5^5))*x^4 + (O(5^5))*x^3 + (4 + O(5^5))*x^2 + (4 + O(5^5))*x + (2 + O(5^5))\nsage: z.expansion()[0,0]\nO(5^3)\nsage: z.expansion()[0,0].parent()\n5-adic Field with capped relative precision 5\nsage: z.expansion()[2,0]\n2 + O(5)\nsage: z.expansion()[2,1]\n4 + O(5)\nsage: z.expansion()[:-1]\na^3*5^-2 + O(5^-1)\nsage: z.expansion()[:1]\na^3*5^-2 + (3*a^3 + 3*a^2)*5^-1 + (3*a^3 + a^2 + 3*a) + O(5)\nsage: z.expansion()[:] == z.expansion()[:,:] == z\nTrue\nsage: all([z.expansion()[i,:] == z.expansion()[i] for i in range(-3,2)])\nTrue\nsage: z.expansion()[:,0]\n2*5^2 + O(5^3)\nsage: z.expansion()[:,0].parent()\n5-adic Field with capped relative precision 5\nsage: z.expansion()[:,1]\n3 + 4*5^2 + O(5^3)\nsage: z.expansion()[:,2]\n3*5^-1 + 1 + O(5^3)\nsage: z.expansion()[:,3]\n5^-2 + 3*5^-1 + 3 + 4*5 + O(5^3)\nsage: sum([a^j * z.expansion()[:,j] for j in range(4)]) == z\nTrue\nsage: z.expansion()[-1:2,1:3]\n3*a^2*5^-1 + (a^2 + 3*a) + O(5^2)\n```\n\nThe parent of z.expansion()[i], z.expansion()[i,T] and z.expansion()[S,T] (for integer i and slices S,T) would be the unramified extension; the parent of z.expansion()[i,j] and z.expansion()[S,j] would be the ground field (or ring). Negative indices would never be considered as counting backward from a length, even for ring elements.\n\nIssue created by migration from https://trac.sagemath.org/ticket/26407\n\n",
    "created_at": "2018-10-04T23:21:38Z",
    "labels": [
        "component: padics"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-8.4",
    "title": "Support slicing and tuples in expansion() of p-adic elements",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/26170",
    "user": "https://github.com/saraedum"
}
```
Keywords: padicBordeaux

As discussed in #13300, we would like to have (probably this already works)

```
sage: K.<a> = Qq(7^2, 20)
sage: z = K.random_element()
sage: z == sum([z.expansion()[i] * 7^i for i in range(20)])
True
```

Of course, sometimes you want to get at the coefficient of a in z, or the coefficient of a in z.expansion()[0]. Here's an idea. For matrices, we have the following::

```
sage: M = matrix(ZZ,4,4,range(16))
sage: M[0]
(0, 1, 2, 3)
sage: M[0,0]
0
sage: M[0,:]
[0 1 2 3]
sage: M[:,0]
[ 0]
[ 4]
[ 8]
[12]
sage: M[1:3,1:4]
[ 5  6  7]
[ 9 10 11]
```

What if we used a similar tuple indexing scheme for p-adic elements? For example:

```
sage: K.<a> = Qq(5^4, 5)
sage: z = K.random_element(); z
a^3*5^-2 + (3*a^3 + 3*a^2)*5^-1 + (3*a^3 + a^2 + 3*a) + 4*a^3*5 + (4*a + 2)*5^2 + O(5^3)
sage: z.expansion()[0]
3*a^3 + a^2 + 3*a + O(5^3)
sage: z.expansion()[2]
4*a + 2 + O(5)
sage: z.expansion()[2].parent()
Unramified Extension of 5-adic Field with capped relative precision 5 in a defined by (1 + O(5^5))*x^4 + (O(5^5))*x^3 + (4 + O(5^5))*x^2 + (4 + O(5^5))*x + (2 + O(5^5))
sage: z.expansion()[0,0]
O(5^3)
sage: z.expansion()[0,0].parent()
5-adic Field with capped relative precision 5
sage: z.expansion()[2,0]
2 + O(5)
sage: z.expansion()[2,1]
4 + O(5)
sage: z.expansion()[:-1]
a^3*5^-2 + O(5^-1)
sage: z.expansion()[:1]
a^3*5^-2 + (3*a^3 + 3*a^2)*5^-1 + (3*a^3 + a^2 + 3*a) + O(5)
sage: z.expansion()[:] == z.expansion()[:,:] == z
True
sage: all([z.expansion()[i,:] == z.expansion()[i] for i in range(-3,2)])
True
sage: z.expansion()[:,0]
2*5^2 + O(5^3)
sage: z.expansion()[:,0].parent()
5-adic Field with capped relative precision 5
sage: z.expansion()[:,1]
3 + 4*5^2 + O(5^3)
sage: z.expansion()[:,2]
3*5^-1 + 1 + O(5^3)
sage: z.expansion()[:,3]
5^-2 + 3*5^-1 + 3 + 4*5 + O(5^3)
sage: sum([a^j * z.expansion()[:,j] for j in range(4)]) == z
True
sage: z.expansion()[-1:2,1:3]
3*a^2*5^-1 + (a^2 + 3*a) + O(5^2)
```

The parent of z.expansion()[i], z.expansion()[i,T] and z.expansion()[S,T] (for integer i and slices S,T) would be the unramified extension; the parent of z.expansion()[i,j] and z.expansion()[S,j] would be the ground field (or ring). Negative indices would never be considered as counting backward from a length, even for ring elements.

Issue created by migration from https://trac.sagemath.org/ticket/26407





---

archive/issue_comments_368418.json:
```json
{
    "body": "Changing keywords from \"\" to \"padicBordeaux\".",
    "created_at": "2019-09-07T12:37:37Z",
    "issue": "https://github.com/sagemath/sagetest/issues/26170",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/26170#issuecomment-368418",
    "user": "https://github.com/roed314"
}
```

Changing keywords from "" to "padicBordeaux".
