# Issue 11419: Incorrect results for integrals involving exponential functions

Issue created by migration from https://trac.sagemath.org/ticket/11591

Original creator: mjo

Original creation time: 2011-07-13 00:19:53

Assignee: burcin

CC:  mjo

Posted to sage-support by Robin Hankin,

http://groups.google.com/group/sage-support/browse_thread/thread/1209ff5cb106d99c


Actual result:


```
sage: f = (x^2)*exp(x) / (1+exp(x))^2
sage: integrate(f, (x, -infinity, infinity))
0
```


Expected result:


```
sage: from mpmath import *
sage: mp.pretty=True
sage: quad(lambda x:(x^2)*exp(x)/(1+exp(x))^2,[-inf,+inf])
3.28986813369645
```




---

Comment by was created at 2011-07-13 02:05:17

A related Maxima issue I found after a few seconds of looking into this:

```
sage: y=(x^2)*exp(x)/(1+exp(x))^2
sage: N(integrate(y,(x,-1000,1000)))
;;;
;;; Stack overflow.
;;; Jumping to the outermost toplevel prompt
;;;

/Users/wstein/sage/install/current/local/bin/sage-sage: line 301: 88871 Illegal instruction     sage-ipython "$@" -i
You have new mail in /var/mail/wstein
deep:sage wstein$ 
```



---

Comment by was created at 2011-07-13 02:07:52

Here's how to replicate this directly in Maxima:


```

deep:sage wstein$ sage -maxima
;;; Loading #P"/Users/wstein/sage/install/current/local/lib/ecl/sb-bsd-sockets.fas"
;;; Loading #P"/Users/wstein/sage/install/current/local/lib/ecl/sockets.fas"
;;; Loading #P"/Users/wstein/sage/install/current/local/lib/ecl/defsystem.fas"
;;; Loading #P"/Users/wstein/sage/install/current/local/lib/ecl/cmp.fas"
Maxima 5.23.2 http://maxima.sourceforge.net
using Lisp ECL 11.1.1
Distributed under the GNU Public License. See the file COPYING.
Dedicated to the memory of William Schelter.
The function bug_report() provides bug reporting information.
(%i1) integrate(x^2*%e^x/(%e^x+1)^2,x,minf,inf);
(%o1)                                  0
```



---

Comment by mjo created at 2011-07-25 16:24:04

I just realized that I left in an extra denominator in the expected output. However, _zero_ is still obviously incorrect.


---

Comment by kcrisman created at 2011-07-29 18:17:47

This is fixed in the newest Maxima (5.24.0):

Old:

```

(%i1) f:(x^2)*%e^x / (1+%e^x)^2;
                                     2   x
                                    x  %e
(%o1)                             ----------
                                     x     2
                                  (%e  + 1)
(%i2) integrate(f,x,minf,inf);
(%o2)                                  0
```

New:

```

(%i6) integrate(f,x,minf,inf);
                                        2
                                     %pi
(%o6)                                ----
                                      3
(%i7) 
```



---

Comment by kcrisman created at 2012-01-28 02:56:27

Michael, do you want to make a patch for this as well?   It would be nice to have an easy queue to apply for all of these update patches.  Good work on all of this.


---

Comment by mjo created at 2012-01-28 03:01:19

Replying to [comment:8 kcrisman]:
> Michael, do you want to make a patch for this as well?   It would be nice to have an easy queue to apply for all of these update patches.  Good work on all of this.

Thanks, yes, I should be able to create separate patches for everything in the morning.


---

Comment by mjo created at 2012-01-28 13:38:18

Doctest for the correct result.


---

Attachment

The original bug is fixed in maxima-5.24, but the stack overflow that William reported is not. I've opened #12377 separately to deal with that.

This patch applies on top of #11483, not because we need abs_integrate, but because they both add doctests in the same spot.


---

Comment by mjo created at 2012-01-28 13:41:46

Changing status from new to needs_review.


---

Comment by aly.deines created at 2012-02-02 23:23:13

Changing status from needs_review to positive_review.


---

Comment by jdemeyer created at 2012-02-06 21:25:13

Resolution: fixed
