# Issue 27238: Improve the Sage-to-Maxima interface for symbolic functions

archive/issues_027238.json:
```json
{
    "body": "CC:  @embray @nbruin\n\nKeywords: maxima, symbolic function\n\nThe interface of Sage with Maxima for symbolic functions (i.e. objects created with `function(...)`) is broken in two ways:\n1. Some user defined names clash with special function names for Maxima; for instance `function('psi')` on the Sage side clashes with [this Maxima special function](http://maxima.sourceforge.net/docs/manual/maxima_15.html#Item_003a-psi), as reported in [this ask.sagemath question](https://ask.sagemath.org/question/43287/solved-why-does-integratepsiyfyy-return-an-error-but-integratepsityftyy-works/) and [this sage-devel thread](https://groups.google.com/forum/#!topic/sage-devel/7BYGcand3Ac).\n2. User defined LaTeX names are sometimes lost when passed to Maxima; for instance:\n\n```\nsage: f = function('a', latex_name=r'\\alpha')(x)\nsage: latex(f)\n\\alpha\\left(x\\right)\nsage: latex(f.simplify()) # OK\n\\alpha\\left(x\\right)\nsage: g = function('b', latex_name=r'\\beta')(x)\nsage: latex(g)\n\\beta\\left(x\\right)\nsage: latex(g.simplify()) # \\beta is lost...\nb\\left(x\\right)\n```\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/27475\n\n",
    "created_at": "2019-03-12T22:58:20Z",
    "labels": [
        "symbolics",
        "major",
        "bug"
    ],
    "title": "Improve the Sage-to-Maxima interface for symbolic functions",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/27238",
    "user": "@egourgoulhon"
}
```
CC:  @embray @nbruin

Keywords: maxima, symbolic function

The interface of Sage with Maxima for symbolic functions (i.e. objects created with `function(...)`) is broken in two ways:
1. Some user defined names clash with special function names for Maxima; for instance `function('psi')` on the Sage side clashes with [this Maxima special function](http://maxima.sourceforge.net/docs/manual/maxima_15.html#Item_003a-psi), as reported in [this ask.sagemath question](https://ask.sagemath.org/question/43287/solved-why-does-integratepsiyfyy-return-an-error-but-integratepsityftyy-works/) and [this sage-devel thread](https://groups.google.com/forum/#!topic/sage-devel/7BYGcand3Ac).
2. User defined LaTeX names are sometimes lost when passed to Maxima; for instance:

```
sage: f = function('a', latex_name=r'\alpha')(x)
sage: latex(f)
\alpha\left(x\right)
sage: latex(f.simplify()) # OK
\alpha\left(x\right)
sage: g = function('b', latex_name=r'\beta')(x)
sage: latex(g)
\beta\left(x\right)
sage: latex(g.simplify()) # \beta is lost...
b\left(x\right)
```


Issue created by migration from https://trac.sagemath.org/ticket/27475





---

archive/issue_comments_383767.json:
```json
{
    "body": "Point number 2 might be specific to the strings-based interface. It's strange that `f` is not affected, while `g` is, though. It may be worth investigating why that is the case. To illustrate the strings-specific nature of this issue:\n\n```\nsage: latex(limit(g(x),x=0))\n\\lim_{x \\to 0}\\, \\beta\\left(x\\right)\nsage: latex(integrate(g(x),x))\n\\int \\beta\\left(x\\right)\\,{d x}\n```\n\nboth routines do round-trip through maxima, but do so via `sr_to_max` and `max_to_sr`, which translate expression trees rather than going through string representations.\n\nConverting `simplify` to use this interface would probably work around the  issue pointed out in the ticket. That is quite independent from encoding function names in maxima with a sage-specific prefix.",
    "created_at": "2019-03-12T23:36:52Z",
    "issue": "https://github.com/sagemath/sagetest/issues/27238",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/27238#issuecomment-383767",
    "user": "@nbruin"
}
```

Point number 2 might be specific to the strings-based interface. It's strange that `f` is not affected, while `g` is, though. It may be worth investigating why that is the case. To illustrate the strings-specific nature of this issue:

```
sage: latex(limit(g(x),x=0))
\lim_{x \to 0}\, \beta\left(x\right)
sage: latex(integrate(g(x),x))
\int \beta\left(x\right)\,{d x}
```

both routines do round-trip through maxima, but do so via `sr_to_max` and `max_to_sr`, which translate expression trees rather than going through string representations.

Converting `simplify` to use this interface would probably work around the  issue pointed out in the ticket. That is quite independent from encoding function names in maxima with a sage-specific prefix.



---

archive/issue_comments_383768.json:
```json
{
    "body": "Replying to [comment:1 nbruin]:\n> Point number 2 might be specific to the strings-based interface. It's strange that `f` is not affected, while `g` is, though. It may be worth investigating why that is the case. \n\nActually, this depends on the order of the operations: in a fresh session, if we first send `g` to Maxima, then it's OK, while `f` fails:\n\n```\nsage: g = function('b', latex_name=r'\\beta')(x)\nsage: latex(g)\n\\beta\\left(x\\right)\nsage: latex(g.simplify())  # OK\n\\beta\\left(x\\right)\nsage: f = function('a', latex_name=r'\\alpha')(x)\nsage: latex(f)\n\\alpha\\left(x\\right)\nsage: latex(f.simplify())  # this time \\alpha is lost...\na\\left(x\\right)\n```\n\nAll subsequent calls to Maxima seem to fail as well:\n\n```\nsage: h = function('c', latex_name=r'\\gamma')(x)\nsage: latex(h.simplify())\nc\\left(x\\right)\n```\n\nbut, as you pointed out, the round trip to Maxima via `sr_to_max` and `max_to_sr` succeeds:\n\n```\nsage: latex(integrate(h(x), x))\n\\int \\gamma\\left(x\\right)\\,{d x}\n```\n",
    "created_at": "2019-03-13T07:02:44Z",
    "issue": "https://github.com/sagemath/sagetest/issues/27238",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/27238#issuecomment-383768",
    "user": "@egourgoulhon"
}
```

Replying to [comment:1 nbruin]:
> Point number 2 might be specific to the strings-based interface. It's strange that `f` is not affected, while `g` is, though. It may be worth investigating why that is the case. 

Actually, this depends on the order of the operations: in a fresh session, if we first send `g` to Maxima, then it's OK, while `f` fails:

```
sage: g = function('b', latex_name=r'\beta')(x)
sage: latex(g)
\beta\left(x\right)
sage: latex(g.simplify())  # OK
\beta\left(x\right)
sage: f = function('a', latex_name=r'\alpha')(x)
sage: latex(f)
\alpha\left(x\right)
sage: latex(f.simplify())  # this time \alpha is lost...
a\left(x\right)
```

All subsequent calls to Maxima seem to fail as well:

```
sage: h = function('c', latex_name=r'\gamma')(x)
sage: latex(h.simplify())
c\left(x\right)
```

but, as you pointed out, the round trip to Maxima via `sr_to_max` and `max_to_sr` succeeds:

```
sage: latex(integrate(h(x), x))
\int \gamma\left(x\right)\,{d x}
```




---

archive/issue_comments_383769.json:
```json
{
    "body": "Replying to [comment:1 nbruin]:\n> Converting `simplify` to use this interface would probably work around the  issue pointed out in the ticket. That is quite independent from encoding function names in maxima with a sage-specific prefix.\n\nThis looks like the proper fix. One may note that all `simplify_*` methods are affected:\n\n```\nsage: latex(f.simplify_full())\na\\left(x\\right)\nsage: latex(f.simplify_factorial())\na\\left(x\\right)\nsage: latex(f.simplify_trig())\na\\left(x\\right)\nsage: latex(f.simplify_rational())\na\\left(x\\right)\nsage: latex(f.canonicalize_radical())\na\\left(x\\right)\nsage: latex(f.simplify_log())\na\\left(x\\right)\n```\n",
    "created_at": "2019-03-13T07:22:20Z",
    "issue": "https://github.com/sagemath/sagetest/issues/27238",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/27238#issuecomment-383769",
    "user": "@egourgoulhon"
}
```

Replying to [comment:1 nbruin]:
> Converting `simplify` to use this interface would probably work around the  issue pointed out in the ticket. That is quite independent from encoding function names in maxima with a sage-specific prefix.

This looks like the proper fix. One may note that all `simplify_*` methods are affected:

```
sage: latex(f.simplify_full())
a\left(x\right)
sage: latex(f.simplify_factorial())
a\left(x\right)
sage: latex(f.simplify_trig())
a\left(x\right)
sage: latex(f.simplify_rational())
a\left(x\right)
sage: latex(f.canonicalize_radical())
a\left(x\right)
sage: latex(f.simplify_log())
a\left(x\right)
```




---

archive/issue_comments_383770.json:
```json
{
    "body": "Ticket retargeted after milestone closed (if you don't believe this ticket is appropriate for the Sage 8.8 release please retarget manually)",
    "created_at": "2019-03-25T10:56:15Z",
    "issue": "https://github.com/sagemath/sagetest/issues/27238",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/27238#issuecomment-383770",
    "user": "@embray"
}
```

Ticket retargeted after milestone closed (if you don't believe this ticket is appropriate for the Sage 8.8 release please retarget manually)



---

archive/issue_comments_383771.json:
```json
{
    "body": "As the Sage-8.8 release milestone is pending, we should delete the sage-8.8 milestone for tickets that are not actively being worked on or that still require significant work to move forward.  If you feel that this ticket should be included in the next Sage release at the soonest please set its milestone to the next release milestone (sage-8.9).",
    "created_at": "2019-06-14T14:55:02Z",
    "issue": "https://github.com/sagemath/sagetest/issues/27238",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/27238#issuecomment-383771",
    "user": "@embray"
}
```

As the Sage-8.8 release milestone is pending, we should delete the sage-8.8 milestone for tickets that are not actively being worked on or that still require significant work to move forward.  If you feel that this ticket should be included in the next Sage release at the soonest please set its milestone to the next release milestone (sage-8.9).
