# Issue 21838: it should not be possible to set an entry of a vector in a submodule

archive/issues_021838.json:
```json
{
    "body": "Keywords: bug\n\n```python\nsage: V = VectorSpace(QQ, 3)\nsage: M = V.subspace([(1,0,0,),(0,1,0)])\nsage: v = M()\nsage: v\n(0, 0, 0)\nsage: v[2] = 2 # bug\nsage: v\n(0, 0, 2)\nsage: v.parent()\nVector space of degree 3 and dimension 2 over Rational Field\nBasis matrix:\n[1 0 0]\n[0 1 0]\nsage: v in M # bug consequence 1\nTrue\nsage: V(v)   # bug consequence 2\n(0, 0, 0)\n```\n\nIssue created by migration from https://trac.sagemath.org/ticket/22075\n\n",
    "created_at": "2016-12-19T08:56:40Z",
    "labels": [
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-7.5",
    "title": "it should not be possible to set an entry of a vector in a submodule",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/21838",
    "user": "https://github.com/videlec"
}
```
Keywords: bug

```python
sage: V = VectorSpace(QQ, 3)
sage: M = V.subspace([(1,0,0,),(0,1,0)])
sage: v = M()
sage: v
(0, 0, 0)
sage: v[2] = 2 # bug
sage: v
(0, 0, 2)
sage: v.parent()
Vector space of degree 3 and dimension 2 over Rational Field
Basis matrix:
[1 0 0]
[0 1 0]
sage: v in M # bug consequence 1
True
sage: V(v)   # bug consequence 2
(0, 0, 0)
```

Issue created by migration from https://trac.sagemath.org/ticket/22075





---

archive/issue_comments_302760.json:
```json
{
    "body": "Changing component from PLEASE CHANGE to algebra.",
    "created_at": "2016-12-19T09:04:58Z",
    "issue": "https://github.com/sagemath/sagetest/issues/21838",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/21838#issuecomment-302760",
    "user": "https://github.com/videlec"
}
```

Changing component from PLEASE CHANGE to algebra.
