# Issue 13007: Compare matrices consistently for different base rings

Issue created by migration from Trac.

Original creator: SimonKing

Original creation time: 2012-06-29 08:07:05

Assignee: jason, was

CC:  malb

Keywords: matrix comparison

Apparently we use three essentially different ways of comparing
matrices.


```
  sage: def test(K):
  ....:     M1 = Matrix(K,[This is the Trac macro *1,0,0* that was inherited from the migration](https://trac.sagemath.org/wiki/WikiMacros#1,0,0-macro))
  ....:     M2 = Matrix(K,[This is the Trac macro *0,1,0* that was inherited from the migration](https://trac.sagemath.org/wiki/WikiMacros#0,1,0-macro))
  ....:     M3 = Matrix(K,[This is the Trac macro *0,1,1* that was inherited from the migration](https://trac.sagemath.org/wiki/WikiMacros#0,1,1-macro))
  ....:     M4 = Matrix(K,[This is the Trac macro *0,0,1* that was inherited from the migration](https://trac.sagemath.org/wiki/WikiMacros#0,0,1-macro))
  ....:     L = [M1,M2,M3,M4]
  ....:     L.sort()
  ....:     return L
  ....:
```


__First group__

Matrices over not too big fields of characteristic 2

```
  sage: K = GF(2)
  sage: test(K)
  [[1 0 0], [0 1 0], [0 0 1], [0 1 1]]
  sage: K = GF(4,'z')
  sage: test(K)
  [[1 0 0], [0 1 0], [0 0 1], [0 1 1]]
  sage: K = GF(2^10,'q')
  sage: test(K)
  [[1 0 0], [0 1 0], [0 0 1], [0 1 1]]
```


__Second group__

Matrices over big finite fields of characteristic 2

```
  sage: K = GF(2^100,'q')
  sage: test(K)
  [[1 0 0], [0 1 0], [0 1 1], [0 0 1]]
```


__Third group__

Matrices over all other rings

```
  sage: K = GF(3)
  sage: test(K)
  [[0 0 1], [0 1 0], [0 1 1], [1 0 0]]
  sage: K = GF(9,'z')
  sage: test(K)
  [[0 0 1], [0 1 0], [0 1 1], [1 0 0]]
  sage: K = GF(3^100,'q')
  sage: test(K)
  [[0 0 1], [0 1 0], [0 1 1], [1 0 0]]
  sage: K = QQ
  sage: test(K)
  [[0 0 1], [0 1 0], [0 1 1], [1 0 0]]
  sage: K = ZZ
  sage: test(K)
  [[0 0 1], [0 1 0], [0 1 1], [1 0 0]]
  sage: K.<x> = GF(2)[]
  sage: test(K)
  [[0 0 1], [0 1 0], [0 1 1], [1 0 0]]
  sage: K.<x> = GF(3)[]
  sage: test(K)
  [[0 0 1], [0 1 0], [0 1 1], [1 0 0]]
  sage: K.<x> = GF(4,'z')[]
  sage: test(K)
  [[0 0 1], [0 1 0], [0 1 1], [1 0 0]]
  sage: K.<x> = GF(2^100,'z')[]
  sage: test(K)
  [[0 0 1], [0 1 0], [0 1 1], [1 0 0]]
```


I guess the inconsistent behaviour is "big fun" for all who want to implement the F4 algorithm in Sage. It ought to be fixed.


---

Comment by malb created at 2012-07-03 14:31:16

With #13180 fixed this boils down to two groups: M4RI(E) vs the rest.
