# Issue 29865: Bug with trivial input in designs.difference_family

Issue created by migration from https://trac.sagemath.org/ticket/30102

Original creator: @Ivo-Maffei

Original creation time: 2020-07-09 21:20:08

CC:  dimpase

The method `designs.difference_family` doesn't handle `k in [0,1]` properly leading to exceptions.

```
sage: designs.difference_family(1,1,1)
...
ZeroDivisionError: Integer modulo by zero
```


Also negative parameters are not properly handled.

```
sage: designs.difference_family(3,-2,-1,existence=True)
Unknown
```


The code added fixes these issues:

```
sage: designs.difference_family(1,1,1)
(Ring of integers modulo 1, [[0]])
sage: designs.difference_family(3,-2,-1,existence=True)
False
```



---

Comment by git created at 2020-07-09 21:22:24

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by @Ivo-Maffei created at 2020-07-09 21:23:55

Changing status from new to needs_review.


---

Comment by @Ivo-Maffei created at 2020-07-09 21:23:55

Changing keywords from "" to "difference_family".


---

Comment by dimpase created at 2020-07-11 10:50:50

lgtm


---

Comment by dimpase created at 2020-07-11 10:50:50

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2020-07-12 08:30:17

Resolution: fixed
