# Issue 15966: conversion from SR.series() to PowerSeries(SR) gives unexpected result

Issue created by migration from https://trac.sagemath.org/ticket/16203

Original creator: rws

Original creation time: 2014-04-22 07:43:31

CC:  kcrisman

Keywords: series conversion


```
sage: R.<x> = PowerSeriesRing(SR)
sage: var('y')
y
sage: ex=1/(1-y)
sage: ex.series(y,20)
1 + 1*y + 1*y^2 + 1*y^3 + 1*y^4 + 1*y^5 + 1*y^6 + 1*y^7 + 1*y^8 + 1*y^9 + 1*y^10 + 1*y^11 + 1*y^12 + 1*y^13 + 1*y^14 + 1*y^15 + 1*y^16 + 1*y^17 + 1*y^18 + 1*y^19 + Order(y^20)
sage: s=R(_); s
1 + y + y^2 + y^3 + y^4 + y^5 + y^6 + y^7 + y^8 + y^9 + y^10 + y^11 + y^12 + y^13 + y^14 + y^15 + y^16 + y^17 + y^18 + y^19 + Order(y^20)
sage: type(s)
<type 'sage.rings.power_series_poly.PowerSeries_poly'>
sage: s.list()
[1 + 1*y + 1*y^2 + 1*y^3 + 1*y^4 + 1*y^5 + 1*y^6 + 1*y^7 + 1*y^8 + 1*y^9 + 1*y^10 + 1*y^11 + 1*y^12 + 1*y^13 + 1*y^14 + 1*y^15 + 1*y^16 + 1*y^17 + 1*y^18 + 1*y^19 + Order(y^20)]
```

The correct result would be `1 + x + x^2...`. Obviously `Order(20)` is not recognized as a marker for the existence of a power series. The whole symbolic expression is taken as a constant.


---

Comment by rws created at 2014-12-03 09:45:35

New commits:


---

Comment by rws created at 2014-12-04 15:16:02

Changing status from new to needs_review.


---

Comment by rws created at 2014-12-04 15:16:02

This also resolves #16198
----
New commits:


---

Comment by tscrim created at 2014-12-04 18:49:06

As currently stated in the description, this is the correct result as the variable for `PowerSeriesRing` is `x`, whereas we have some symbolic expression in `y` (so is naturally an element in the coefficient ring). Having mismatched variable names automatically converting over seems fraught with problems and could lead to subtle bugs.


---

Comment by rws created at 2014-12-05 08:26:06

Replying to [comment:11 tscrim]:
> As currently stated in the description, this is the correct result as the variable for `PowerSeriesRing` is `x`, whereas we have some symbolic expression in `y` (so is naturally an element in the coefficient ring). Having mismatched variable names automatically converting over seems fraught with problems and could lead to subtle bugs.
I see. So, conversion to an existing power series ring should only be allowed if the series expansion variable has the same name as the ring var. Multiple vars aren't supported by SR.series anyway.


---

Comment by git created at 2014-12-05 09:38:55

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by rws created at 2015-01-23 08:03:50

New commits:


---

Comment by git created at 2015-01-25 15:07:58

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by git created at 2015-01-25 16:41:07

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by git created at 2015-03-23 16:39:32

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by rws created at 2015-04-20 15:50:52

Pending because #17659 is pending.


---

Comment by rws created at 2016-02-05 08:10:34

New commits:


---

Comment by maurimo created at 2016-03-21 15:03:50

Changing status from needs_review to needs_work.


---

Comment by maurimo created at 2016-03-21 15:03:50

"is" should be "==".
The changes to ring.pyx are unrelated and should be removed.
Everything else looks alright.


---

Comment by maurimo created at 2016-03-21 15:03:50

Changing keywords from "series conversion" to "series conversion days71".


---

Comment by rws created at 2016-03-21 16:17:25

Changing status from needs_work to needs_review.


---

Comment by rws created at 2016-03-21 16:17:25

New commits:


---

Comment by git created at 2016-03-21 16:19:51

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by mmezzarobba created at 2016-03-27 09:28:19

Changing status from needs_review to positive_review.


---

Comment by rws created at 2016-03-27 12:41:59

Thanks!


---

Comment by vbraun created at 2016-03-28 07:24:14

Resolution: fixed
