# Issue 17857: multiplication of powerseries wrapped in SR wrong

Issue created by migration from https://trac.sagemath.org/ticket/18094

Original creator: dkrenn

Original creation time: 2015-03-31 13:54:05

Keywords: sd66


```
sage: P.<p> = ZZ[[]]
sage: a = 1/(1+p)
sage: o = a - a.truncate()
sage: o
O(p^20)
sage: 2*o
O(p^20)
sage: 2*SR(o)
0
```

The last line is wrong.



---

Comment by vdelecroix created at 2015-03-31 20:10:48

Surely the big Oh is badly integrated into `SR`

```
sage: P.<p> = ZZ[[]]
sage: a = 1/(1+p)
sage: o = a - a.truncate()
sage: bool(SR(o) == 0)
True
```



---

Comment by nbruin created at 2015-03-31 20:22:21

At the very least related: #10846, #14693, #16203. Likely a fix there will also fix this ticket.


---

Comment by rws created at 2015-04-01 06:45:36

The fix should be on top of #10846.


---

Comment by rws created at 2015-04-01 07:22:01

New commits:


---

Comment by rws created at 2015-04-01 07:22:01

Changing status from new to needs_review.


---

Comment by dkrenn created at 2015-04-01 07:42:46

The example in the ticket now gives:

```
sage: P.<p> = ZZ[[]]
sage: a = 1/(1+p)
sage: o = a - a.truncate()
sage: 2*SR(o)
2*(Order(p^20))
```

But it should be `Order(p^20)`.


---

Comment by dkrenn created at 2015-04-01 07:43:29

Changing status from needs_review to needs_info.


---

Comment by rws created at 2015-04-01 08:05:39

It's "only" a hack that will give us bare symbolic bigoh. Realistic behaviour must be added on Pynac level, it's simply not there at the moment, if I understand correctly.

You see you cannot do arithmetics at all with symbolic series:

```
sage: s = SR(1/(1-x)).series(x,5); s
1 + 1*x + 1*x^2 + 1*x^3 + 1*x^4 + Order(x^5)
sage: 2*s
2*(1 + 1*x + 1*x^2 + 1*x^3 + 1*x^4 + Order(x^5))
```

For that reason it would be helpful if someone could at least review those tickets that deal with symbolic<-->dedicated ring conversion (#10846, #16203, #17402 and maybe #17400 and #17659). I cannot do this: I am the author 8P


---

Comment by rws created at 2015-06-07 16:08:06

Replying to [comment:8 rws]:
> It's "only" a hack that will give us bare symbolic bigoh. Realistic behaviour must be added on Pynac level, it's simply not there at the moment, if I understand correctly.
No, it's there but the user is asked to apply `series` again:

```
sage: (2*s).series(x,5)
2 + 2*x + 2*x^2 + 2*x^3 + 2*x^4 + Order(x^5)
```

So, it's not as bad as thought, and the patch could go in without having to fix a bigger issue.


---

Comment by rws created at 2016-02-05 08:48:04

Changing status from needs_info to needs_review.


---

Comment by rws created at 2016-02-05 08:48:04

New commits:


---

Comment by dkrenn created at 2016-02-08 13:00:39

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2016-02-09 23:04:13

Resolution: fixed
