# Issue 10640: SymmetricGroup function doesn't seem to do arbitrary sets

archive/issues_010640.json:
```json
{
    "body": "Assignee: sage-combinat\n\nCC:  jdemeyer\n\nKeywords: SymmetricGroup\n\nThe following doesn't seem right to me.  I tried this on sage 4.5.3 and 4.6.  My impression is that the SymmetricGroup function can take a list of distinct integers X as an argument and give the symmetric group S_X.  However, we can try the following.\n\nsage: f=SymmetricGroup([1,2,4])\nsage: for i in f:\n....:     print i\n....: \n\n()\n(2,3)\n(1,2)\n(1,2,3)\n(1,3,2)\n(1,3)\nsage: f[3]\n(1,2,3)\nsage: f[3](4)\n4\nsage: f[3](3)\n1\nsage: f.set()\n(1, 2, 4)\n\nThus, it seems that f.set() returns that right support, but in fact the support for the group is 1,2,3.  This suggests to me that S_X = S_{1,2,3}.\n\nIssue created by migration from https://trac.sagemath.org/ticket/10696\n\n",
    "created_at": "2011-01-26T16:43:30Z",
    "labels": [
        "combinatorics",
        "minor",
        "bug"
    ],
    "title": "SymmetricGroup function doesn't seem to do arbitrary sets",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/10640",
    "user": "arattan"
}
```
Assignee: sage-combinat

CC:  jdemeyer

Keywords: SymmetricGroup

The following doesn't seem right to me.  I tried this on sage 4.5.3 and 4.6.  My impression is that the SymmetricGroup function can take a list of distinct integers X as an argument and give the symmetric group S_X.  However, we can try the following.

sage: f=SymmetricGroup([1,2,4])
sage: for i in f:
....:     print i
....: 

()
(2,3)
(1,2)
(1,2,3)
(1,3,2)
(1,3)
sage: f[3]
(1,2,3)
sage: f[3](4)
4
sage: f[3](3)
1
sage: f.set()
(1, 2, 4)

Thus, it seems that f.set() returns that right support, but in fact the support for the group is 1,2,3.  This suggests to me that S_X = S_{1,2,3}.

Issue created by migration from https://trac.sagemath.org/ticket/10696





---

archive/issue_comments_111693.json:
```json
{
    "body": "This should be fixed by #10335",
    "created_at": "2011-01-26T16:52:12Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10640",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10640#issuecomment-111693",
    "user": "mhansen"
}
```

This should be fixed by #10335



---

archive/issue_comments_111694.json:
```json
{
    "body": "This can indeed be closed:\n\n\n```\n\nsage: f=SymmetricGroup([1,2,4])\nsage: for i in f:        \n....:     print i\n....:     \n()\n(2,4)\n(1,2)\n(1,2,4)\n(1,4,2)\n(1,4)\nsage: f[3] \n(1,2,4)\nsage: f[3](4)\n1\nsage: f[3](3)\n3\nsage: f.set()\n/opt/sage/local/bin/sage-ipython:1: DeprecationWarning: (Since Sage Version 4.7.1) set is deprecated. Please use domain instead.\n  #!/usr/bin/env python\n{1, 2, 4}\n```\n",
    "created_at": "2012-03-29T07:18:10Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10640",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10640#issuecomment-111694",
    "user": "mhansen"
}
```

This can indeed be closed:


```

sage: f=SymmetricGroup([1,2,4])
sage: for i in f:        
....:     print i
....:     
()
(2,4)
(1,2)
(1,2,4)
(1,4,2)
(1,4)
sage: f[3] 
(1,2,4)
sage: f[3](4)
1
sage: f[3](3)
3
sage: f.set()
/opt/sage/local/bin/sage-ipython:1: DeprecationWarning: (Since Sage Version 4.7.1) set is deprecated. Please use domain instead.
  #!/usr/bin/env python
{1, 2, 4}
```




---

archive/issue_comments_111695.json:
```json
{
    "body": "Verified results that this can be closed.",
    "created_at": "2012-05-11T22:40:15Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10640",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10640#issuecomment-111695",
    "user": "tscrim"
}
```

Verified results that this can be closed.



---

archive/issue_comments_111696.json:
```json
{
    "body": "Changing status from new to needs_review.",
    "created_at": "2012-05-11T22:40:15Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10640",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10640#issuecomment-111696",
    "user": "tscrim"
}
```

Changing status from new to needs_review.



---

archive/issue_comments_111697.json:
```json
{
    "body": "Changing status from needs_review to positive_review.",
    "created_at": "2012-05-11T22:40:37Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10640",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10640#issuecomment-111697",
    "user": "tscrim"
}
```

Changing status from needs_review to positive_review.



---

archive/issue_comments_111698.json:
```json
{
    "body": "To mark as ticket as needing to be closed, you should put the milestone to *sage-duplicate/invalid/wontfix*.",
    "created_at": "2012-05-13T20:19:59Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10640",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10640#issuecomment-111698",
    "user": "jdemeyer"
}
```

To mark as ticket as needing to be closed, you should put the milestone to *sage-duplicate/invalid/wontfix*.



---

archive/issue_comments_111699.json:
```json
{
    "body": "Resolution: duplicate",
    "created_at": "2012-05-21T08:01:41Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10640",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10640#issuecomment-111699",
    "user": "jdemeyer"
}
```

Resolution: duplicate
