# Issue 13514: Another incorrect Maxima integral

Issue created by migration from https://trac.sagemath.org/ticket/13718

Original creator: kcrisman

Original creation time: 2012-11-16 15:53:27

Assignee: burcin

This is already reported upstream at [this bug tracker ticket](https://sourceforge.net/tracker/?func=detail&aid=3587932&group_id=4933&atid=104933).

The original report from a summer PREP user:

```
integral((2/3)*x^(5/2)*(x+1)^.5, x,0,1)

I got the answer -0.888888889*sqrt(2)

integral((2/3)*x^(5/2)*(x+1)^(1/2), x,0,1)

And the answer is


-5/192*I*pi + 61/288*sqrt(2) + 5/192*log(-sqrt(2) + 1) -
5/192*log(sqrt(2) + 1)
```



---

Comment by kcrisman created at 2012-11-16 15:55:57

#11493 may be related.


---

Comment by mforets created at 2017-04-09 10:27:57

This prompts me to see what happens with alternative integration interfaces.

Try with SymPy:


```
sage: sage: integral((2/3)*x^(5/2)*(x+1)^.5, x,0,1, algorithm='sympy')   
# no output at all after ~10mins
```


Try with giac:


```
sage: giac('integrate((2/3)*x^(5/2)*sqrt(x+1), x,0,1)')   # correct and almost instantaneous
1/288*(sqrt(2)*61+15*ln(sqrt(2)-1))
sage: (1/288*(sqrt(2)*61+15*ln(sqrt(2)-1))).n()
0.253633414928700
sage: (-5/192*I*pi + 61/288*sqrt(2) + 5/192*log(-sqrt(2) + 1) -
....: 5/192*log(sqrt(2) + 1)).n()    # compare with formula given by OP
0.253633414928700
```



---

Comment by mforets created at 2017-04-28 05:27:43

fixed at Sage v8.0.beta3:


```
sage: integrate((2/3)*x^(5/2)*sqrt(x+1), x,0,1, algorithm='maxima')
-5/192*I*pi + 61/288*sqrt(2) - 5/192*log(sqrt(2) + 1) + 5/192*log(-sqrt(2) + 1)
sage: _.n()
0.253633414928700
```



---

Comment by mforets created at 2017-04-28 05:35:25

not really.. the problem is with the `0.5`:


```

sage: integral((2/3)*x^(5/2)*(x+1)^.5, x,0,1, algorithm='maxima') # wrong
-0.8888888888888888*sqrt(2)
sage: integral((2/3)*x^(5/2)*(x+1)^.5, x,0,1, algorithm='giac') # ok
0.253633414929
sage: integral((2/3)*x^(5/2)*(x+1)^.5, x,0,1, algorithm='sympy') # timeout
```



---

Comment by rws created at 2017-04-28 06:12:39

That is user error. No one can expect to get correct integrals from expressions containing floating point numbers. It is not supported and maybe Sage should throw an exception in these cases anyway. If you agree, Karl-Dieter, I'll open a ticket for just this.


---

Comment by rws created at 2017-04-28 08:12:08

Together with #22894 and `ex._convert(QQ)` one could even provide a default option that automatically converts `0.5` to `1/2` before integration.


---

Comment by chapoton created at 2022-04-02 08:00:43

Changing keywords from "" to "integral".
