# Issue 26714: Unevaluated integral of exponential

archive/issues_026714.json:
```json
{
    "body": "CC:  parisse slelievre\n\nThis is, I believe, a slight generalization of [ticket:12145].\nConsider the two integrals:\n\n```\nsage: bos=integrate(x^a/(exp(x)-1),x,0,oo)\nsage: ferm=integrate(x^a/(exp(x)+1),x,0,oo)\n```\n\nalgorithm='sympy' returns unevaluated, while algorithm='maxima' returns a need for more assumptions, however even if I do:\n\n```\nsage: assume(a,'integer');assume(a>0)\n```\n\nand then redo the above, they remain unevaluated. On the other hand:\n\n```\nsage: mathematica('Integrate[x^n/(Exp[x]+1),{x,0,Infinity}]')\nConditionalExpression[(1 - 2^(-n))*Gamma[1 + n]*Zeta[1 + n], Re[n] > -1]\n```\n\nand\n\n```\nsage: mathematica('Integrate[x^n/(Exp[x]-1),{x,0,Infinity}]')\nConditionalExpression[Gamma[1 + n]*PolyLog[1 + n, 1], Re[n] > 0]\n```\n\nCuriously, this works if one plugs in an integer value for the exponent a (though the result is a bit ugly):\n\n```\nsage: integrate(x^5/(exp(x)+1),x,0,oo,algorithm='maxima')\n-31/252*pi^6 + limit(1/6*x^6 - x^5*log(e^x + 1) - 5*x^4*dilog(-e^x) + 20*x^3*polylog(3, -e^x) - 60*x^2*polylog(4, -e^x) + 120*x*polylog(5, -e^x) - 120*polylog(6, -e^x), x, +Infinity, minus)\n```\n\nand\n\n```\nsage: integrate(x^5/(exp(x)-1),x,0,oo,algorithm='maxima')\n-8/63*pi^6 + limit(-1/6*x^6 + x^5*log(-e^x + 1) + 5*x^4*dilog(e^x) - 20*x^3*polylog(3, e^x) + 60*x^2*polylog(4, e^x) - 120*x*polylog(5, e^x) + 120*polylog(6, e^x), x, +Infinity, minus)\n```\n\nbut stays unevaluated if the exponent is not an integer.\nNumerically it doesn't seem to have this problem:\n\n```\nsage: numerical_integral(x^5/(exp(x)+1),0,oo)\n(118.26613095575462, 7.339448265242243e-05)\nsage: numerical_integral(x^5.1/(exp(x)+1),0,oo)\n(140.5258956087456, 5.885670920879882e-05)\n```\n\nand\n\n```\nsage: numerical_integral(x^5/(exp(x)-1),0,oo)\n(122.08116743819632, 7.333630007522185e-05)\nsage: numerical_integral(x^5.1/(exp(x)-1),0,oo)\n(144.7463042740809, 5.877701373857569e-05)\n```\n\nAs these are very common integrals in statistical physics, it would be nice if they could be implemented symbolically.\n\nIssue created by migration from https://trac.sagemath.org/ticket/26951\n\n",
    "created_at": "2018-12-24T17:23:33Z",
    "labels": [
        "symbolics",
        "minor"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-9.8",
    "title": "Unevaluated integral of exponential",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/26714",
    "user": "@JCGoran"
}
```
CC:  parisse slelievre

This is, I believe, a slight generalization of [ticket:12145].
Consider the two integrals:

```
sage: bos=integrate(x^a/(exp(x)-1),x,0,oo)
sage: ferm=integrate(x^a/(exp(x)+1),x,0,oo)
```

algorithm='sympy' returns unevaluated, while algorithm='maxima' returns a need for more assumptions, however even if I do:

```
sage: assume(a,'integer');assume(a>0)
```

and then redo the above, they remain unevaluated. On the other hand:

```
sage: mathematica('Integrate[x^n/(Exp[x]+1),{x,0,Infinity}]')
ConditionalExpression[(1 - 2^(-n))*Gamma[1 + n]*Zeta[1 + n], Re[n] > -1]
```

and

```
sage: mathematica('Integrate[x^n/(Exp[x]-1),{x,0,Infinity}]')
ConditionalExpression[Gamma[1 + n]*PolyLog[1 + n, 1], Re[n] > 0]
```

Curiously, this works if one plugs in an integer value for the exponent a (though the result is a bit ugly):

```
sage: integrate(x^5/(exp(x)+1),x,0,oo,algorithm='maxima')
-31/252*pi^6 + limit(1/6*x^6 - x^5*log(e^x + 1) - 5*x^4*dilog(-e^x) + 20*x^3*polylog(3, -e^x) - 60*x^2*polylog(4, -e^x) + 120*x*polylog(5, -e^x) - 120*polylog(6, -e^x), x, +Infinity, minus)
```

and

```
sage: integrate(x^5/(exp(x)-1),x,0,oo,algorithm='maxima')
-8/63*pi^6 + limit(-1/6*x^6 + x^5*log(-e^x + 1) + 5*x^4*dilog(e^x) - 20*x^3*polylog(3, e^x) + 60*x^2*polylog(4, e^x) - 120*x*polylog(5, e^x) + 120*polylog(6, e^x), x, +Infinity, minus)
```

but stays unevaluated if the exponent is not an integer.
Numerically it doesn't seem to have this problem:

```
sage: numerical_integral(x^5/(exp(x)+1),0,oo)
(118.26613095575462, 7.339448265242243e-05)
sage: numerical_integral(x^5.1/(exp(x)+1),0,oo)
(140.5258956087456, 5.885670920879882e-05)
```

and

```
sage: numerical_integral(x^5/(exp(x)-1),0,oo)
(122.08116743819632, 7.333630007522185e-05)
sage: numerical_integral(x^5.1/(exp(x)-1),0,oo)
(144.7463042740809, 5.877701373857569e-05)
```

As these are very common integrals in statistical physics, it would be nice if they could be implemented symbolically.

Issue created by migration from https://trac.sagemath.org/ticket/26951





---

archive/issue_comments_375752.json:
```json
{
    "body": "Retarging tickets optimistically to the next milestone.  If you are responsible for this ticket (either its reporter or owner) and don't believe you are likely to complete this ticket before the next release (8.7) please retarget this ticket's milestone to sage-pending or sage-wishlist.",
    "created_at": "2019-01-15T18:15:21Z",
    "issue": "https://github.com/sagemath/sagetest/issues/26714",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/26714#issuecomment-375752",
    "user": "embray"
}
```

Retarging tickets optimistically to the next milestone.  If you are responsible for this ticket (either its reporter or owner) and don't believe you are likely to complete this ticket before the next release (8.7) please retarget this ticket's milestone to sage-pending or sage-wishlist.



---

archive/issue_comments_375753.json:
```json
{
    "body": "Ticket retargeted after milestone closed (if you don't believe this ticket is appropriate for the Sage 8.8 release please retarget manually)",
    "created_at": "2019-03-25T10:56:15Z",
    "issue": "https://github.com/sagemath/sagetest/issues/26714",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/26714#issuecomment-375753",
    "user": "embray"
}
```

Ticket retargeted after milestone closed (if you don't believe this ticket is appropriate for the Sage 8.8 release please retarget manually)



---

archive/issue_comments_375754.json:
```json
{
    "body": "As the Sage-8.8 release milestone is pending, we should delete the sage-8.8 milestone for tickets that are not actively being worked on or that still require significant work to move forward.  If you feel that this ticket should be included in the next Sage release at the soonest please set its milestone to the next release milestone (sage-8.9).",
    "created_at": "2019-06-14T14:55:02Z",
    "issue": "https://github.com/sagemath/sagetest/issues/26714",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/26714#issuecomment-375754",
    "user": "embray"
}
```

As the Sage-8.8 release milestone is pending, we should delete the sage-8.8 milestone for tickets that are not actively being worked on or that still require significant work to move forward.  If you feel that this ticket should be included in the next Sage release at the soonest please set its milestone to the next release milestone (sage-8.9).



---

archive/issue_comments_375755.json:
```json
{
    "body": "giac knows something:\n\n```\nsage: integrate(x^6/(exp(x)-1),x,0,oo,algorithm='giac')\n720*zeta(7)\n```\n",
    "created_at": "2019-06-22T18:21:43Z",
    "issue": "https://github.com/sagemath/sagetest/issues/26714",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/26714#issuecomment-375755",
    "user": "chapoton"
}
```

giac knows something:

```
sage: integrate(x^6/(exp(x)-1),x,0,oo,algorithm='giac')
720*zeta(7)
```




---

archive/issue_comments_375756.json:
```json
{
    "body": "Changing keywords from \"\" to \"integration\".",
    "created_at": "2019-06-22T18:22:28Z",
    "issue": "https://github.com/sagemath/sagetest/issues/26714",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/26714#issuecomment-375756",
    "user": "chapoton"
}
```

Changing keywords from "" to "integration".



---

archive/issue_comments_375757.json:
```json
{
    "body": "`@`parisse: est-ce que giac pourrait, avec quelques changements, arriver \u00e0 r\u00e9pondre\n\n```\ngiac: integrate(x^s/(exp(x)-1),x,0,oo) \ngamma(s+1)*zeta(s+1)\n```\n\n? Ca marche actuellement pour tout s > 1 entier.",
    "created_at": "2021-08-29T09:26:41Z",
    "issue": "https://github.com/sagemath/sagetest/issues/26714",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/26714#issuecomment-375757",
    "user": "chapoton"
}
```

`@`parisse: est-ce que giac pourrait, avec quelques changements, arriver à répondre

```
giac: integrate(x^s/(exp(x)-1),x,0,oo) 
gamma(s+1)*zeta(s+1)
```

? Ca marche actuellement pour tout s > 1 entier.



---

archive/issue_comments_375758.json:
```json
{
    "body": "Changing keywords from \"integration\" to \"integration, giac\".",
    "created_at": "2021-08-29T17:24:00Z",
    "issue": "https://github.com/sagemath/sagetest/issues/26714",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/26714#issuecomment-375758",
    "user": "slelievre"
}
```

Changing keywords from "integration" to "integration, giac".



---

archive/issue_comments_375759.json:
```json
{
    "body": "Changing type from PLEASE CHANGE to enhancement.",
    "created_at": "2021-08-29T17:24:00Z",
    "issue": "https://github.com/sagemath/sagetest/issues/26714",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/26714#issuecomment-375759",
    "user": "slelievre"
}
```

Changing type from PLEASE CHANGE to enhancement.
