# Issue 13561: Cyclotomic embeddings should respect coercions.

Issue created by migration from https://trac.sagemath.org/ticket/13765

Original creator: robertwb

Original creation time: 2012-11-27 21:57:25

Assignee: davidloeffler

CC:  nbruin


```
sage: zC=(CC(-1)^(1/3))^2
sage: Ka.<aa>=CyclotomicField(3,embedding=zC)
sage: Kb.<bb>=CyclotomicField(3,embedding=zC^2)
sage: Kc.<cc>=CyclotomicField(3,embedding=CC(17))
sage: CC(aa)
-0.500000000000000 + 0.866025403784439*I
sage: CC(bb)
-0.500000000000000 - 0.866025403784439*I
sage: CC(Ka(bb))
-0.500000000000000 + 0.866025403784439*I
```


It's better to disallow coercions between these then allow this nonsense


```
sage: CC(aa+bb)
 -1.00000000000000 + 1.73205080756888*I

sage: CC(bb+aa)
 -1.00000000000000 - 1.73205080756888*I
```



---

Comment by robertwb created at 2012-11-29 11:51:05

Changing status from new to needs_review.


---

Comment by robertwb created at 2012-11-29 11:51:49

Changing type from PLEASE CHANGE to defect.


---

Comment by chapoton created at 2012-12-11 20:27:14

One minor comment about the doc :

maybe you could use the trac role :trac:`13765` to link to the ticket ?

(see #12490)


---

Comment by chapoton created at 2012-12-11 20:33:02

There is a typo  "no such integer exits"


---

Comment by chapoton created at 2012-12-18 21:41:27

I have made the small changes that I suggested :

apply trac-13765-cyclo-embeddings.patch


---

Comment by robertwb created at 2013-01-02 18:15:02

Your changes look fine to me, thanks.


---

Comment by chapoton created at 2013-01-24 18:22:46

apply trac-13765-cyclo-embeddings.patch


---

Comment by chapoton created at 2013-01-24 22:07:13

apply trac-13765-cyclo-embeddings.patch


---

Comment by ehlen created at 2013-01-25 12:28:26

* I tested the patch using Sage 5.5.
 * It is well documented and it solves the bug as far as I can see.
 * The documentation builds.

But I am not convinced that the implementation of NumberField_cyclotomic._log_gen should stay like it is. It is a private method but it might be used within the class for ther purposes later. Therefore, I think the output should always make sense. But it doesn't always and it is not completely consistent. Here is an Example.

This is what I expect from the documentation:


```
 sage: K.<zeta>=CyclotomicField(5, embedding=CC(exp(2*pi*i/5)))    
 sage: K._log_gen(10)
 sage: type(K._log_gen(10))
 <type 'NoneType'>
```

So, this is o.k., but:


```
 sage: K.<zeta>=CyclotomicField(5, embedding=CC(exp(2*pi*i/5)))    
 sage: K._log_gen(CDF(10))
 sage: 0
 sage: type(K._log_gen(CDF(10)))
 sage: <type 'sage.rings.integer.Integer'>
```

This behaviour is more or less documented in the docstring. It says that "If x is complex, returns the nearest such e whether or not the result is exact.". But I don't agree that it should be this way.

But I think this is not consistent and it should be fixed.


---

Comment by ehlen created at 2013-01-25 12:28:26

Changing status from needs_review to needs_work.


---

Attachment

Here is a better patch, as we discussed

apply trac-13765-cyclo-embeddings.patch


---

Comment by chapoton created at 2013-01-25 16:01:26

Changing status from needs_work to needs_review.


---

Comment by robertwb created at 2013-01-25 17:20:57

As you over-write the previous patch, I can't tell what changed. Is it just the two-line sanity check and corresponding change to the documentation? Seems like a OK restriction to me, in which case positive review to your changes.


---

Comment by chapoton created at 2013-01-25 18:05:59

Changing status from needs_review to positive_review.


---

Comment by jdemeyer created at 2013-01-30 07:34:22

Resolution: fixed
