# Issue 32583: numerical_integral and fast_float random

Issue created by migration from https://trac.sagemath.org/ticket/32820

Original creator: @rojizo

Original creation time: 2021-11-03 13:57:45

CC:  jdemeyer robertwb mmarco mjo

The numerical_integral and fast_float does not play along. There are a bunch of problems:

Consider the following code


```
sage: var("t, a", domain="real")
sage: f = a*t
sage: ffast = fast_float(f, 't', 'a', old=False)
sage: numerical_integral(ffast, 0, 1, params=[1])
must be real number, not list
must be real number, not list
...
must be real number, not list
must be real number, not list
(0.0, 0.0)
```


which is obviously wrong. It refuses to take the params.

Now, you can try 

```
sage: ffast = fast_float(f, 't', 'a', old=True)
sage: numerical_integral(ffast, 0, 1, params=[1])
...
UnboundLocalError: local variable 'Infinity' referenced before assignment
```

Now it crashes! This seems to be easy to fix. It seems that Infinity is not imported in the correct place. Happily you can change the integrator algorithm to get something else: 

```
sage: f = a*t
sage: ffast = fast_float(f, 't', 'a', old=False)
sage: numerical_integral(ffast, 0, 1, params=[1])
(8.933853e-317, 0.0)
```


It is not passing the parameter, it is using 0 as the value for a. You can check it if you use f = (a+1) * t








