# Issue 24982: Implement reverse() for LaurentSeries

Issue created by migration from Trac.

Original creator: @BrentBaccala

Original creation time: 2018-04-20 05:29:56

Power series have a `reverse()` method for series of valuation 1.

This enhancement wraps the power series method and makes it available for LaurentSeries of valuation 1.


```
sage: R.<x> = Frac(QQ[This is the Trac macro *'x'* that was inherited from the migration](https://trac.sagemath.org/wiki/WikiMacros#'x'-macro))
sage: f = 2*x + 3*x^2 - x^4 + O(x^5)
sage: g = f.reverse()
sage: g
1/2*x - 3/8*x^2 + 9/16*x^3 - 131/128*x^4 + O(x^5)
sage: f(g)
x + O(x^5)
sage: g(f)
x + O(x^5)
```


There is a known bug:


```
sage: B.<b> = PolynomialRing(ZZ)
sage: A.<t> = LaurentSeriesRing(B)
sage: f = 2*b*t + b*t^2 + 3*b^2*t^3 + O(t^4)
sage: g = f.reverse(); g
1/(2*b)*t - 1/(8*b^2)*t^2 + ((-3*b + 1)/(16*b^3))*t^3 + O(t^4)
sage: f(g)
t + O(t^4)
```


But now...


```
sage: g(f)
(256*b^6*t + O(t^4))/(256*b^6)
```


It seems to be a coercion problem, as `g` was computed correctly,
but `f` doesn't coerce properly and must be explicitly converted:


```
sage: g(g.parent()(f))
t + O(t^4)
```


I've concluded that this bug lies elsewhere in the code and should be given a separate ticket.


---

Comment by @BrentBaccala created at 2018-04-20 05:31:57

New commits:


---

Comment by @BrentBaccala created at 2018-04-20 19:49:56

Changing status from new to needs_review.


---

Comment by git created at 2018-12-09 03:28:21

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by vdelecroix created at 2019-03-04 19:31:11

Rather than `type(self)(self._parent, rev)` couldn't you use the parent call method? (something like `self._parent(rev)`?


---

Comment by vdelecroix created at 2019-03-04 19:36:06

Changing status from needs_review to needs_info.


---

Comment by vdelecroix created at 2019-03-04 19:36:06

Also, I am not able to reproduce the bug that you mention in the ticket description on 8.7.beta6...


---

Comment by embray created at 2019-03-25 10:56:15

Ticket retargeted after milestone closed (if you don't believe this ticket is appropriate for the Sage 8.8 release please retarget manually)


---

Comment by git created at 2019-04-12 03:03:42

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by git created at 2019-04-12 03:08:14

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by @BrentBaccala created at 2019-04-12 03:09:21

Changing status from needs_info to needs_review.


---

Comment by @BrentBaccala created at 2019-04-12 03:09:21

Code updated as suggested.

I can't reproduce the bug anymore, either.  I added it as a test case.


---

Comment by vdelecroix created at 2019-04-12 06:15:55

Does power series really behave this way

```
+        if rev.parent() == u.parent():
+            return self._parent(rev)
+        else:
+            P = self._parent.change_ring(rev.parent().base_ring())
+            return P(rev)
```

It is very counterintuitive to have methods whose output type depends on the nature of the answer. If you do `4/2` in Sage you do not obtain an integer but a rational number. I don't understand why `.reverse()` should be any different.

I would suggest to have `reverse` and `reverse_unit`.

I am just asking for your opinion as this is beyond the scope of the ticket.


---

Comment by @BrentBaccala created at 2019-04-12 17:11:25

Replying to [comment:11 vdelecroix]:
> Does power series really behave this way
> {{{
> +        if rev.parent() == u.parent():
> +            return self._parent(rev)
> +        else:
> +            P = self._parent.change_ring(rev.parent().base_ring())
> +            return P(rev)
> }}}
> It is very counterintuitive to have methods whose output type depends on the nature of the answer. If you do `4/2` in Sage you do not obtain an integer but a rational number. I don't understand why `.reverse()` should be any different.
> 
> I would suggest to have `reverse` and `reverse_unit`.
> 
> I am just asking for your opinion as this is beyond the scope of the ticket.

I chose to mimic the behavior of the existing `reverse` method in `PowerSeries_poly`.  Its docstring states:

    If the leading coefficient is not a unit, we pass to its fraction field if possible

The Laurent series code calls the power series code, and follows its lead.  So the answer to your question is yes, power series really do behave this way:


```
sage: R.<x> = ZZ[[]]
sage: (2*x+x^2).parent()
Power Series Ring in x over Integer Ring
sage: (2*x+x^2).reverse()
1/2*x - 1/8*x^2 + 1/16*x^3 - 5/128*x^4 + 7/256*x^5 - 21/1024*x^6 + 33/2048*x^7 - 429/32768*x^8 + 715/65536*x^9 - 2431/262144*x^10 + 4199/524288*x^11 - 29393/4194304*x^12 + 52003/8388608*x^13 - 185725/33554432*x^14 + 334305/67108864*x^15 - 9694845/2147483648*x^16 + 17678835/4294967296*x^17 - 64822395/17179869184*x^18 + 119409675/34359738368*x^19 + O(x^20)
sage: (2*x+x^2).reverse().parent()
Power Series Ring in x over Rational Field
```


I would tend to think that it should work this way, that `4/2` should return an integer and only `3/2` should return a rational, but I haven't thought about it enough to have a really informed opinion.


---

Comment by vdelecroix created at 2019-04-14 16:32:51

Changing status from needs_review to needs_info.


---

Comment by vdelecroix created at 2019-04-14 16:32:51

The following test is working for me

```
sage: B.<b> = PolynomialRing(ZZ)
sage: A.<t> = LaurentSeriesRing(B)
sage: f = 2*b*t + b*t^2 + 3*b^2*t^3 + O(t^4)
sage: g = f.reverse()
sage: g(f)  # known bug - f fails to coerce properly, but next test works
t + O(t^4)
```

Why is it discarded?


---

Comment by git created at 2019-04-14 16:48:04

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by @BrentBaccala created at 2019-04-14 16:52:01

Replying to [comment:13 vdelecroix]:
> The following test is working for me
> {{{
> sage: B.<b> = PolynomialRing(ZZ)
> sage: A.<t> = LaurentSeriesRing(B)
> sage: f = 2*b*t + b*t^2 + 3*b<sup>2*t</sup>3 + O(t^4)
> sage: g = f.reverse()
> sage: g(f)  # known bug - f fails to coerce properly, but next test works
> t + O(t^4)
> }}}
> Why is it discarded?

It used to fail.  I don't know what changed to fix it, but it was somewhere else in Sage.  I'll bisect the code if you really want to track it down.

Once it was working, I added it as a test case, but forgot that it was already there as a "known bug" example.  Fixed.


---

Comment by vdelecroix created at 2019-04-14 16:57:05

Changing status from needs_info to positive_review.


---

Comment by vbraun created at 2019-04-15 17:47:50

Resolution: fixed
