# Issue 27371: Expand series expansions of differentials in function field code

Issue created by migration from https://trac.sagemath.org/ticket/27608

Original creator: @BrentBaccala

Original creation time: 2019-04-05 17:51:16

We'd like to expand differentials, like this:


```
        sage: K.<x> = FunctionField(GF(2)); _.<Y> = K[]
        sage: L.<y> = K.extension(Y^2 + Y + x + 1/x)
        sage: p = L.places_finite()[0]
        sage: m = L.completion(p, prec=4)
        sage: m
        Completion map:
          From: Function field in y defined by y^2 + y + (x^2 + 1)/x
          To:   Laurent Series Ring in s over Finite Field of size 2
        sage: m(x)
        s^2 + s^3 + O(s^4)
        sage: m(x.differential())
        [s^2 + O(s^4)] ds
```


(the last line is currently unimplemented)

I'm not sure how much sense this makes for function fields over finite fields, but we'd definitely like to do this for function fields in characteristic zero.


---

Comment by embray created at 2019-06-14 14:55:02

As the Sage-8.8 release milestone is pending, we should delete the sage-8.8 milestone for tickets that are not actively being worked on or that still require significant work to move forward.  If you feel that this ticket should be included in the next Sage release at the soonest please set its milestone to the next release milestone (sage-8.9).
