# Issue 31450: factor() does not work in a simple case

archive/issues_031450.json:
```json
{
    "body": "CC:  @slel\n\nTested with https://sagecell.sagemath.org and CoCalc:\n\n```python\nsage: version()\n'SageMath version 9.2, Release Date: 2020-10-24'\n\nsage: x,y=var('x,y')\n\nsage: f=(x-5)*y/x-(x-6)*y/x ; f\n(x - 5)*y/x - (x - 6)*y/x\n\nsage: f.factor() # does not work\n(x - 5)*y/x - (x - 6)*y/x\n\nsage: (f*x).factor() # does not work either\nx*((x - 5)*y/x - (x - 6)*y/x)\n\nsage: (f*x).expand()/x # expected result\ny/x\n```\n\nOf course, this is a very simple example showing the problem.\n\n(I am sorry, I do not have any Sage 9.3.* to test.)\n\nIssue created by migration from https://trac.sagemath.org/ticket/31687\n\n",
    "created_at": "2021-04-18T21:06:37Z",
    "labels": [
        "component: factorization",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-9.8",
    "title": "factor() does not work in a simple case",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/31450",
    "user": "https://github.com/GMS103"
}
```
CC:  @slel

Tested with https://sagecell.sagemath.org and CoCalc:

```python
sage: version()
'SageMath version 9.2, Release Date: 2020-10-24'

sage: x,y=var('x,y')

sage: f=(x-5)*y/x-(x-6)*y/x ; f
(x - 5)*y/x - (x - 6)*y/x

sage: f.factor() # does not work
(x - 5)*y/x - (x - 6)*y/x

sage: (f*x).factor() # does not work either
x*((x - 5)*y/x - (x - 6)*y/x)

sage: (f*x).expand()/x # expected result
y/x
```

Of course, this is a very simple example showing the problem.

(I am sorry, I do not have any Sage 9.3.* to test.)

Issue created by migration from https://trac.sagemath.org/ticket/31687





---

archive/issue_comments_449245.json:
```json
{
    "body": "A workaround is to factor the numerator and denominator:\n\n```python\nsage: f.numerator().factor() / f.denominator().factor()\ny/x\n```\n\nOr, in this case, to work in the fraction field of a polynomial ring.\n\n```python\nsage: R = PolynomialRing(QQ, ['x', 'y'])\nsage: F = R.fraction_field()\nsage: F(f)\ny/x\nsage: F(f).factor()\nx^-1 * y\n```\n",
    "created_at": "2021-04-19T09:29:36Z",
    "issue": "https://github.com/sagemath/sagetest/issues/31450",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/31450#issuecomment-449245",
    "user": "https://github.com/slel"
}
```

A workaround is to factor the numerator and denominator:

```python
sage: f.numerator().factor() / f.denominator().factor()
y/x
```

Or, in this case, to work in the fraction field of a polynomial ring.

```python
sage: R = PolynomialRing(QQ, ['x', 'y'])
sage: F = R.fraction_field()
sage: F(f)
y/x
sage: F(f).factor()
x^-1 * y
```




---

archive/issue_comments_449246.json:
```json
{
    "body": "Well, actually in this case it suffices to expand:\n\n```\nsage: f.expand()                                                                                                        \ny/x\n```\n\nBut I was wondering about the cause of this behaviour (I do not think I would be able to find it myself).",
    "created_at": "2021-04-19T12:20:51Z",
    "issue": "https://github.com/sagemath/sagetest/issues/31450",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/31450#issuecomment-449246",
    "user": "https://github.com/GMS103"
}
```

Well, actually in this case it suffices to expand:

```
sage: f.expand()                                                                                                        
y/x
```

But I was wondering about the cause of this behaviour (I do not think I would be able to find it myself).
