# Issue 16757: Simplicial Complex from boolean function

Issue created by migration from https://trac.sagemath.org/ticket/16994

Original creator: ncohen

Original creation time: 2014-09-16 15:26:16

CC:  vinceknight kcrisman dimpase jdemeyer nthiery vdelecroix jhpalmieri

As discussed in https://groups.google.com/d/topic/sage-devel/os1LzBjsYnQ/discussion, here is a ticket to implement a function that returns, given a boolean monotone function `f` on the subsets of a set `X`, all subsets `S` of `X` such that `f(S)` is True.

The implementation assumes that `f` is very costly to evaluate, and so caches as much as possible. It can also compute in parallel.

Nathann


---

Comment by ncohen created at 2014-09-16 16:23:23

Here it is, at long last. I also removed the `**kwds` from `SimplicialComplex`, because I hate to see things like that work:


```
sage: SimplicialComplex(aergahgae="erharh")
Simplicial complex with vertex set () and facets {()}
```


It is the kind of things that makes you waste 30minutes over a typo in the function's input.

Nathann


---

Comment by ncohen created at 2014-09-16 16:23:23

Changing status from new to needs_review.


---

Comment by git created at 2014-09-16 16:24:48

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by ncohen created at 2014-09-23 11:39:52

Anybody ?...


---

Comment by dimpase created at 2014-09-23 12:40:27

I'm having a look now.


---

Comment by dimpase created at 2014-09-23 12:44:55

there is `is_mutable` and `is_immutable`... shouldn't one of these go?


---

Comment by ncohen created at 2014-09-23 12:50:10

> there is `is_mutable` and `is_immutable`... shouldn't one of these go?

These days I try to keep the amount of wars I start to a minimum.

I also want to stop fighting other people on their own grounds. I noticed that it decreased my chances of actually achieving anything, even when I am right.

Nathann


---

Comment by dimpase created at 2014-09-23 13:05:02

No vertices?!


```
sage: SimplicialComplex(from_characteristic_function=(lambda x:sum(x)<=4,range(5)))
      Simplicial complex with vertex set () and facets {(0, 4), (0, 1, 2), (0, 1, 3)}
```


cf

```
sage: SimplicialComplex([(0, 4), (0, 1, 2), (0, 1, 3)])
Simplicial complex with vertex set (0, 1, 2, 3, 4) and facets {(0, 4), (0, 1, 2), (0, 1, 3)}
```


add vertices please... (e.g. take the union of facets)


---

Comment by dimpase created at 2014-09-23 13:09:40

Changing status from needs_review to needs_work.


---

Comment by ncohen created at 2014-09-23 13:19:21

Changing status from needs_work to needs_review.


---

Comment by git created at 2014-09-23 13:19:26

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by dimpase created at 2014-09-23 14:27:55

How about adding some real example? E.g. I tested that the output (the famous 168 hyperovals in PG(2,4)) is correct on the following:

```
sage: l=map(Set,ProjectiveGeometryDesign(2,1,GF(4,name='a')).blocks())
sage: SimplicialComplex(from_characteristic_function=(lambda S: not exists(l, lambda x: Set(S).intersection(x).cardinality()>2)[0],range(21)))
Simplicial complex with 21 vertices and 168 facets
```

takes 8 seconds on my desktop, so should be marked `# long time`


---

Comment by ncohen created at 2014-09-23 14:30:27

> How about adding some real example?

Please add a commit if you want this example to be included.

Nathann


---

Comment by dimpase created at 2014-09-23 14:45:15

New commits:


---

Comment by dimpase created at 2014-09-23 14:47:06

Otherwise LGTM. So you can flip this to positive review if you like my commit :-)


---

Comment by ncohen created at 2014-09-23 14:47:12

I was wondering what was the difference between "any" and "exists" and I found that in the docstring of "exists":


```
   Note that this function is NOT suitable to be used in an if-
   statement or in any place where a boolean expression is expected.
   For those situations, use the Python built-in
```


I don't understand why, however `O_o`

Nathann


---

Comment by ncohen created at 2014-09-23 14:51:26

Also, there was a text just before my example that talked about sets whose sum is smaller than 4. Could you add some other text before yours ?

Nathann


---

Comment by dimpase created at 2014-09-23 14:52:19

Replying to [comment:16 ncohen]:
> I was wondering what was the difference between "any" and "exists" and I found that in the docstring of "exists":
> 
> {{{
>    Note that this function is NOT suitable to be used in an if-
>    statement or in any place where a boolean expression is expected.
>    For those situations, use the Python built-in
> }}}
> 
> I don't understand why, however `O_o`

Ah, I see - that's cause exists returns a pair! (notice `[0]` I had to put in).
OK, I'll fix this. Just a second


---

Comment by git created at 2014-09-23 15:01:54

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by dimpase created at 2014-09-23 15:03:35

OK, done.


---

Comment by ncohen created at 2014-09-23 15:04:55

Well.. Looks good, thanks `:-)`

Nathann


---

Comment by ncohen created at 2014-09-23 15:04:55

Changing status from needs_review to positive_review.


---

Comment by ncohen created at 2014-09-23 15:17:28

Hmmm... Funny. Your simplicial complex is a `(21,6,12)`-BIBD. And not one that we already have in the database.


```
sage: l=map(Set, designs.ProjectiveGeometryDesign(2,1,GF(4,name='a')))         
sage: S=SimplicialComplex(from_characteristic_function=(lambda S: not any(Set(S).intersection(x).cardinality()>2 for x in l), range(21))) # long time
sage: IS=IncidenceStructure([list(x) for x in s.maximal_faces()])
sage: IS.is_t_design(return_parameters=True)
(True, (2, 21, 6, 12))
sage: (21,6,12) in sage.combinat.designs.database.DF
False
```


I mean: currently the BIBD constructor does not even accept a `lambda` parameter, but we could have had a difference family for it.


```
sage: (0,9,10,12,16,13,18,11,7,8,1,4,5,3,2,15,19,6,14,20,17) in IS.automorphism_group()
True
```


And it turns out that there is a cyclic automorphism acting on the hypergraph, so there IS such a difference family.

Hmmmm.... 

Nathann


---

Comment by dimpase created at 2014-09-23 15:37:33

Replying to [comment:22 ncohen]:
> Hmmm... Funny. Your simplicial complex is a `(21,6,12)`-BIBD. 

this is not too surprising: these are the 168 octads containing a pair from a 
given triple of points in the famous Steiner system S(5,8,24) on 24 points.

> And it turns out that there is a cyclic automorphism acting on the hypergraph, so there IS such a difference family.

yep, there got to be lots of such automorphisms (the full group of automorphisms is quite big).


---

Comment by vbraun created at 2014-09-25 12:05:26

Resolution: fixed
