# Issue 30632: Some computation hangs in Multizeta

Issue created by migration from https://trac.sagemath.org/ticket/30869

Original creator: vdelecroix

Original creation time: 2020-11-07 08:26:49

CC:  chapoton


```
sage: Z = Multizeta                                                                            
sage: 12*Z(4,4) == 3/2*(Z(6,2) * Z(2,6))
```



---

Comment by chapoton created at 2020-11-07 09:32:36

Weight 8+8 = 16, what would you expect ? of course it hangs !

The code is working, but has certainly not been optimised. I agree that it is quite slow as soon as the weight gets large.


---

Comment by vdelecroix created at 2020-11-07 10:55:24

My bad... I wrote a `*` for a `+`.

```
sage: Z = Multizeta
sage: 12*Z(4,4) == 3/2*(Z(6,2) + Z(2,6))
True
```

Though, what I wrote in the ticket description is trivially wrong because the weight 8 component is non-zero. I will use this ticket to speed that up.


---

Comment by chapoton created at 2020-11-07 10:56:27

beware that there is already a positive reviwed ticket changing this file

#30851


---

Comment by chapoton created at 2020-11-10 19:33:02

Changing status from new to needs_review.


---

Comment by chapoton created at 2020-11-10 19:33:02

voila une vague tentative
----
New commits:


---

Comment by vdelecroix created at 2020-11-11 18:19:06

New commits:


---

Comment by vdelecroix created at 2020-11-11 18:20:12

More reasonable version fixing also coercion and zerology.

BTW: why do we have the two representations mzv and iterated? These are exactly the same algebras.


---

Comment by chapoton created at 2020-11-11 19:14:34

Merci. Ca m'a l'air très bien. On va attendre qu'un patchbot y jette un oeil.


---

Comment by chapoton created at 2020-11-12 07:34:19

Changing status from needs_review to positive_review.


---

Comment by chapoton created at 2020-11-12 07:34:19

ok, les bots sont moralement verts. Allons-y


---

Comment by vdelecroix created at 2020-11-12 08:55:38

follow up: J'ai remarqué des trucs bizarres avec les multiplicatios et divisions

```
sage: float(2) * Multizeta(4)
2.0*ζ(4)
sage: parent(_).base_ring()
Rational Field
sage: Multizeta(4) / 2.5
2/5*ζ(4)
```



---

Comment by chapoton created at 2020-11-12 09:04:13

Par curioité, tu t'en sers vraiment, ou c'est juste pour essayer ?


---

Comment by vdelecroix created at 2020-11-12 09:09:24

Je me sers de `Multizetas(QQ)` de manière intensive. En voulant une faire approximation numérique je me suis aperçu de ces trucs bizarres.


---

Comment by chapoton created at 2020-11-12 09:09:58

ok, cool. Je suis content


---

Comment by chapoton created at 2020-11-12 14:07:06

c'est un vieux bug, voir #18487, qui touche CombinatorialFreeModule en général

Replying to [comment:13 vdelecroix]:
> follow up: J'ai remarqué des trucs bizarres avec les multiplicatios et divisions
> {{{
> sage: float(2) * Multizeta(4)
> 2.0*ζ(4)
> sage: parent(_).base_ring()
> Rational Field
> sage: Multizeta(4) / 2.5
> 2/5*ζ(4)
> }}}


---

Comment by vbraun created at 2020-11-22 15:06:05

Resolution: fixed
