# Issue 23113: Doctest: gamma() and log_gamma() return types

Issue created by migration from Trac.

Original creator: rws

Original creation time: 2017-07-02 07:23:53

`gamma` and `log_gamma` don't return the input type. This should be the correct behaviour but actually `CC` elements are returned at the moment:

```
sage: gamma(CDF(1,1))
0.49801566811835607 - 0.15494982830181067*I
sage: type(_)
<type 'sage.rings.complex_double.ComplexDoubleElement'>
sage: gamma(CIF(1,1))
0.49801566811835607? - 0.15494982830181068?*I
sage: type(_)
<type 'sage.rings.complex_interval.ComplexIntervalFieldElement'>

sage: log_gamma(RDF(-2.5))
-0.056243716497674054 - 9.42477796076938*I
sage: type(_)
<type 'sage.rings.complex_double.ComplexDoubleElement'>
sage: log_gamma(RIF(-2.5))
-0.056243716497674054? - 9.4247779607693794?*I
sage: type(_)
<type 'sage.rings.complex_interval.ComplexIntervalFieldElement'>
```



---

Comment by rws created at 2017-12-03 16:53:19

With `log_gamma` it seems we follow the RR convention of switching to complex for negative input. This means either this convention has to be changed or the point is moot.


---

Comment by rws created at 2017-12-03 16:53:19

Changing status from new to needs_review.


---

Comment by rws created at 2017-12-03 16:53:34

Changing status from needs_review to positive_review.


---

Comment by embray created at 2017-12-12 08:23:33

Resolution: wontfix


---

Comment by zimmerma created at 2017-12-12 14:01:00

with which version of Sage was it? With Sage 8.0 I get:

```
sage: gamma(CIF(1,1))
0.498015668118356 - 0.154949828301811*I
sage: type(_)
<type 'sage.rings.complex_number.ComplexNumber'>
```

thus I don't get `ComplexIntervalFieldElement` as in the description.


---

Comment by rws created at 2017-12-12 14:04:30

With 8.1:

```
sage: gamma(CIF(1,1))
0.49801566811835607? - 0.15494982830181068?*I
sage: type(_)
<type 'sage.rings.complex_interval.ComplexIntervalFieldElement'>
```

