# Issue 15141: composition of scheme morphism defined by polynomials

Issue created by migration from Trac.

Original creator: vdelecroix

Original creation time: 2013-11-07 23:05:41

Currently the following fails

```
sage: P.<x,y>=ProjectiveSpace(QQ,1)
sage: H=Hom(P,P)
sage: f=H([x^2 -29/16*y^2, y^2])
sage: f*f
Traceback (most recent call last):
...
TypeError: unsupported operand type(s) for *: 'SchemeMorphism_polynomial_projective_space_field' and 'SchemeMorphism_polynomial_projective_space_field'
```


We just propose a generic implementation.


---

Comment by vdelecroix created at 2013-11-07 23:07:12

Changing type from PLEASE CHANGE to enhancement.


---

Comment by vdelecroix created at 2013-11-07 23:07:12

Changing component from PLEASE CHANGE to algebraic geometry.


---

Comment by vdelecroix created at 2013-11-07 23:07:12

Changing keywords from "" to "sage-days55".


---

Comment by vdelecroix created at 2013-11-08 03:01:14

New commits:


---

Comment by vdelecroix created at 2013-11-08 03:03:55

see the discussion at
https://groups.google.com/forum/#!topic/sage-devel/qW20-IW0aks


---

Comment by bhutz created at 2016-08-02 22:38:54

I added the ref to the inheritance issue in #14711. It would be nice if we could have composition working independent of the inheritance structure correction. Accordingly, I put the inheritance back how it was and the composition seems to work fine with this implementation. I added one example to test failure, but that is all.

Comments?
----
New commits:


---

Comment by git created at 2016-08-02 22:40:40

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by vdelecroix created at 2016-08-02 22:47:13

You wrote

```
+        as soon as this bug is fixed. See trac #14711.
```

first of all the right syntax is `:trac:`14711`` and secondly #14711 refers to a *closed* ticket.

(EDIT: it might not be you, but it appears in the total diff.)


---

Comment by vdelecroix created at 2016-08-02 22:48:51

I put in needs review in order to make a sign to the patchbots...


---

Comment by vdelecroix created at 2016-08-02 22:48:51

Changing status from new to needs_review.


---

Comment by bhutz created at 2016-08-02 22:50:15

Yes, I can fixed the syntax mistake.

As for it being a closed ticket. In trying to investigate this issue, the comment in the code was not very helpful. The closed ticket #14711 has a much longer description of the issue and is part of what is needed. If I'm not mistaken the other part is a python bug not tracked on trac.


---

Comment by git created at 2016-08-02 22:52:05

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by vdelecroix created at 2016-08-02 23:01:09

And this can also be removed I guess

```
+from sage.categories.morphism import Morphism
+from sage.rings.all           import Integer
+from sage.rings.commutative_ring import is_CommutativeRing
```



---

Comment by vdelecroix created at 2016-08-02 23:03:21

The correct syntax is `:trac:`14711``, no braces (these are just use for formatting the trac wiki ;-)!


---

Comment by git created at 2016-08-02 23:04:29

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by bhutz created at 2016-08-02 23:06:01

I was wondering about that trac formatting. I didn't think the docs linked to trac like that, but I figured if you said so... ;)


---

Comment by git created at 2016-08-02 23:16:00

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by vdelecroix created at 2016-08-03 14:17:22

Note that even without your branch it (sort of) works!

```
sage: P.<x,y> = ProjectiveSpace(QQ,1)
sage: H = Hom(P,P)
sage: f = H([x^2 -29/16*y^2, y^2])
sage: g = H([y,x+y])
sage: h = f*g
sage: h
Composite map:
  From: Projective Space of dimension 1 over Rational Field
  To:   Projective Space of dimension 1 over Rational Field
  Defn:   Generic endomorphism of Projective Space of dimension 1 over Rational Field
        then
          Generic endomorphism of Projective Space of dimension 1 over Rational Field
sage: p = P((1,3))
sage: p
(1/3 : 1)
sage: h(p) == f(g(p))
True
```

But I guess it is better to have the result of `f*g` with explicit polynomial coordinates.

```
sage: f[0]
x^2 - 29/16*y^2
sage: h[0]
Generic endomorphism of Projective Space of dimension 1 over Rational Field
```



---

Comment by vdelecroix created at 2016-08-03 14:26:08

I guess that the lines

```
except AttributeError:
    raise NotImplementedError
```

would better be replaced with

```
except AttributeError:
    return super(SchemeMorphism_polynomial, self)._composition_(self, other, homset)
```

as there might be some morphism other than polynomial that you may want to compose with polynomial ones. I was not able to build example though.


---

Comment by bhutz created at 2016-08-03 14:36:06

This composition is specifically for SchemeMorphism_polynomial, so I'm fine with the NotImplementedError if there are not any polynomials. If it is a different kind of morphism, it shouldn't be calling this one.

Yes, getting the defining polynomials of the composition really the point. We needed this to speed up the computations for things like #21118.


---

Comment by vdelecroix created at 2016-08-03 14:41:21

More precisely: `f` can be polynomial and `g` something else and `f * g` should work.


---

Comment by bhutz created at 2016-08-03 14:47:24

This gets the NotImplementedError


```
A2.<x,y> = AffineSpace(QQ,2)
H=End(A2)
f=H([x^2+y^2,y^2/x])
p=A2([1,2])
f*p
```



---

Comment by vdelecroix created at 2016-08-03 14:53:50

I also built another example with Galois conjugation

```
x = polygen(QQ)
K.<a> = NumberField(x^2 - 2)
p1 ,p2 = K.Hom(K)

R.<x,y> = K[]
q1 = R.Hom(R)(p1)
q2 = R.Hom(R)(p2)

A = AffineSpace(R)
f1 = A.Hom(A)(q1)
f2 = A.Hom(A)(q2)
g = A.Hom(A)([x^2-y, y+1])
f1*g  # fine
g*f1  # NotImplementedError
```



---

Comment by bhutz created at 2016-08-03 14:56:47

If I make your code

```
  return super(SchemeMorphism_polynomial, self)._composition_(other, homset)
```


Then I get


```
sage: A2.<x,y> = AffineSpace(QQ,2)
sage: H=End(A2)
sage: f=H([x^2+y^2,y^2/x])
sage: p= A2([1,2])
sage: f*p         	
Composite map:
  From: Spectrum of Rational Field
  To:   Affine Space of dimension 2 over Rational Field
  Defn:   Generic morphism:
          From: Spectrum of Rational Field
          To:   Affine Space of dimension 2 over Rational Field
        then
          Generic endomorphism of Affine Space of dimension 2 over
Rational Field
```


However, I can't seem to actually apply the map


```
sage: p(Spec(QQ).an_element())
TypeError: Point on Spectrum of Rational Field defined by the Principal ideal (0) of Rational Field fails to convert into the map's domain Spectrum of Rational Field, but a `pushforward` method is not properly implemented
```


With your new example, I now get:


```
Composite map:
  From: Affine Space of dimension 2 over Number Field in a with defining
polynomial x^2 - 2
  To:   Affine Space of dimension 2 over Number Field in a with defining
polynomial x^2 - 2
  Defn:   Generic endomorphism of Affine Space of dimension 2 over
Number Field in a with defining polynomial x^2 - 2
        then
          Generic endomorphism of Affine Space of dimension 2 over
Number Field in a with defining polynomial x^2 - 2
```


I haven't been able to evaluate yours at a pt yet...


---

Comment by vdelecroix created at 2016-08-03 15:34:07

For Galois conjugation the point is that the ring homomorphism `f1` lacks a `inverse_image` for ideals.

There is something weird with the composition telling that it is the composition of two `Generic endomorphisms`.

And an other error

```
sage: Ai = A.Hom(A).identity()
sage: f = A.Hom(A)([x,y])
sage: Ai * f  # TypeError
sage: f * Ai  # TypeError
```

I opened #21160 for the above since it is distinct from what we are trying to do here...


---

Comment by bhutz created at 2016-08-03 15:59:56

I do think allowing this general morphism composition is better, so I'll push that change shortly


---

Comment by git created at 2016-08-03 16:01:29

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by vdelecroix created at 2016-08-03 16:45:32

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2016-08-07 20:01:42

Resolution: fixed
