# Issue 20217: conversion from SR[] to SR

archive/issues_020217.json:
```json
{
    "body": "Even if there are identical generator and variable names there should not be a problem to convert from a univariate polynomial with symbolic coefficients to a symbolic expression, but:\n\n```\nsage: S.<y> = PolynomialRing(SR)\nsage: p = y^2 + pi*y + 1\nsage: p.coefficients()\n[1, pi, 1]\nsage: ex = SR(p)\n...\nTypeError: not a constant polynomial\n```\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/20454\n\n",
    "created_at": "2016-04-17T06:23:03Z",
    "labels": [
        "component: symbolics",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-7.2",
    "title": "conversion from SR[] to SR",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/20217",
    "user": "https://github.com/rwst"
}
```
Even if there are identical generator and variable names there should not be a problem to convert from a univariate polynomial with symbolic coefficients to a symbolic expression, but:

```
sage: S.<y> = PolynomialRing(SR)
sage: p = y^2 + pi*y + 1
sage: p.coefficients()
[1, pi, 1]
sage: ex = SR(p)
...
TypeError: not a constant polynomial
```


Issue created by migration from https://trac.sagemath.org/ticket/20454





---

archive/issue_comments_278274.json:
```json
{
    "body": "You can get a morphism that does this:\n\n```\nsage: H=Hom(S,SR)(SR('y'))\nsage: H(p)\n(pi + y)*y + 1\n```\n\nI think we'll get more mileage out of educating users how to define the morphisms they need than trying to stuff every possible operation into conversion (although the one you propose here wouldn't necessarily be a problem by itself. You'll just have that `S(SR(p)) != p`, which will be a little surprising (and the fact that  `S(..)` maps elements of `SR` to constants will be very hard to change, or at least cause big problems down the line if you do)",
    "created_at": "2016-04-17T20:21:35Z",
    "issue": "https://github.com/sagemath/sagetest/issues/20217",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/20217#issuecomment-278274",
    "user": "https://github.com/nbruin"
}
```

You can get a morphism that does this:

```
sage: H=Hom(S,SR)(SR('y'))
sage: H(p)
(pi + y)*y + 1
```

I think we'll get more mileage out of educating users how to define the morphisms they need than trying to stuff every possible operation into conversion (although the one you propose here wouldn't necessarily be a problem by itself. You'll just have that `S(SR(p)) != p`, which will be a little surprising (and the fact that  `S(..)` maps elements of `SR` to constants will be very hard to change, or at least cause big problems down the line if you do)
