# Issue 517: abelian_group_element / dual_abelian_group_element classes need rewrite

Issue created by migration from https://trac.sagemath.org/ticket/517

Original creator: boothby

Original creation time: 2007-08-29 21:25:29

Assignee: boothby

Implementation uses slow algorithms, where O(1) algorithms are easy.


---

Comment by boothby created at 2007-09-07 00:00:18

Changing type from enhancement to defect.


---

Comment by boothby created at 2007-09-07 00:00:18

Problems are more serious than I originally thought.  I would now describe AbelianGroup and AbelianGroupElement as "severely broken".


```

sage: A = AbelianGroup(1,[0],names="a")
sage: a = A.gens()[0]
sage: B = A.subgroup([a,a,a,a]); B
Multiplicative Abelian Group isomorphic to Z x Z x Z x Z, which is the 
subgroup of
Multiplicative Abelian Group isomorphic to Z 
generated by [a, a, a, a]

```


Z<sup>4</sup> is a subgroup of Z???


```

sage: a^-1
Exception (click to the left for traceback):
...
TypeError: unsupported operand type(s) for %: 'int' and 'PlusInfinity'
sage: ~a
Exception (click to the left for traceback):
...
AttributeError: 'AbelianGroup_class' object has no attribute 'fraction_field'
```


You can't compute the inverse of a group element?


---

Comment by boothby created at 2007-09-07 00:00:18

Changing priority from minor to major.


---

Comment by mabshoff created at 2008-04-26 07:09:14

#1849 is a rewrite of this code, so please check what is going on over there.

Cheers,

Michael


---

Comment by wdj created at 2008-04-26 13:01:52

Unfortunately, there is still (in sage 3.0) a serious lack of functionality for infinite abelian groups. I don't see an easy fix for this bug. Currently, it is AbelianSemiGroupExceptWhenFiniteThenItIsAbelianGroup_class:-)


---

Comment by mabshoff created at 2008-08-02 03:09:19

I am closing this ticket as a duplicate of #1849.

Cheers,

Michael


---

Comment by mabshoff created at 2008-08-02 03:09:19

Resolution: duplicate
