# Issue 21428: AsymptoticRing.substitute fails with exponents in QQbar

Issue created by migration from https://trac.sagemath.org/ticket/21665

Original creator: cheuberg

Original creation time: 2016-10-08 05:00:43

CC:  behackl dkrenn

Presence of a redundant exponential growth group lets substitution fail.

```
sage: A.<T> = AsymptoticRing('T^QQbar', SR)
sage: B.<n> = AsymptoticRing('QQbar^n*n^QQbar', SR)
sage: C.<p> = AsymptoticRing('n^QQbar', SR)
sage: e1 = T^QQbar(sqrt(2))
sage: e1.subs(T=p)
n^(1.414213562373095?)
sage: e1.subs(T=n)
Traceback (most recent call last):
...
TypeError: Cannot apply the substitution rules {T: n} on T^(1.414213562373095?) in Asymptotic Ring <T^(Algebraic Field)> over Symbolic Ring.
> *previous* ValueError: Cannot substitute in T^(1.414213562373095?) in Asymptotic Ring <T^(Algebraic Field)> over Symbolic Ring.
>> *previous* ValueError: Cannot substitute in T^(1.414213562373095?) in Exact Term Monoid T^(Algebraic Field) with coefficients in Symbolic Ring.
>>> *previous* ValueError: Cannot substitute in T^(1.414213562373095?) in Growth Group T^(Algebraic Field).
>>>> *previous* ValueError: Cannot take n to the exponent 1.414213562373095?.
>>>>> *previous* TypeError: no canonical coercion from Algebraic Field to Rational Field
```



---

Comment by cheuberg created at 2016-10-08 07:11:12

The problem boils down to the following:

```
sage: from sage.rings.asymptotic.growth_group import GrowthGroup
sage: G = GrowthGroup('m^QQbar')
sage: H = GrowthGroup('QQbar^n * n^QQbar')
sage: K = GrowthGroup('QQbar^p')
sage: m = G('m')
sage: n = H('n')
sage: alpha = QQbar(sqrt(2))
sage: m^alpha
m^(1.414213562373095?)
sage: n^alpha
Traceback (most recent call last):
...
/local/sage/sage-7.4.beta6/local/lib/python2.7/site-packages/sage/rings/qqbar.pyc in __pow__(self, e)
   3878             1.000000000000000? + 0.?e-18*I
   3879         """
-> 3880         e = QQ._coerce_(e)
   3881         n = e.numerator()
   3882         d = e.denominator()
...
TypeError: no canonical coercion from Algebraic Field to Rational Field
sage: K('1')^alpha
Traceback (most recent call last):
...
/local/sage/sage-7.4.beta6/local/lib/python2.7/site-packages/sage/rings/qqbar.pyc in __pow__(self, e)
   3878             1.000000000000000? + 0.?e-18*I
   3879         """
-> 3880         e = QQ._coerce_(e)
   3881         n = e.numerator()
   3882         d = e.denominator()
...
TypeError: no canonical coercion from Algebraic Field to Rational Field
```


So the problem is that we cannot compute `QQbar(1)^alpha`.

I see the following options:
1. Fix `QQbar` so that `QQbar(1)^everything == QQbar(1)`.
2. Fix `ExponentialGrowthElement.__pow__` such that `base == 1` leads to result `1`, irrespective of `exponent`.
3. Fix `GenericProduct.Element.__pow__` such that trivial factors are ignored.


---

Comment by cheuberg created at 2016-10-08 08:39:25

Another related problem:

```
sage: R.<n> = AsymptoticRing('QQbar^n*n^QQbar', SR)
sage: alpha = QQbar(sqrt(2))
sage: n.rpow(alpha)
Traceback (most recent call last):
...
ValueError: Cannot construct the power of 1.414213562373095? to the exponent n in Asymptotic Ring <(Algebraic Field)^n * n^(Algebraic Field)> over Symbolic Ring.
> *previous* ValueError: Cannot take 1.414213562373095?^n to the exponent 1.
>> *previous* TypeError: no canonical coercion from Symbolic Ring to Rational Field
```

â€‹
So basically, in order to have `alpha<sup>n*n</sup>alpha`, it is currently necessary to use the following work-around:

```
sage: R1 = AsymptoticRing('QQbar^n', SR)
sage: R2.<n> = AsymptoticRing('n^QQbar', SR)
sage: R = AsymptoticRing('QQbar^n*n^QQbar', SR)
sage: alpha = QQbar(sqrt(2))
sage: t1 = R1(R1.growth_group(raw_element=alpha)); t1
sage: t2 = n^alpha
sage: R(t1)*t2
```



---

Comment by dkrenn created at 2017-01-02 17:16:53

Replying to [comment:1 cheuberg]:
> I see the following options:
> 1. Fix `QQbar` so that `QQbar(1)^everything == QQbar(1)`.

This is now #22120.
