# Issue 28675: sage.rings.integer.Integer is problematic

Issue created by migration from https://trac.sagemath.org/ticket/28912

Original creator: @ismail

Original creation time: 2019-12-26 15:21:08

CC:  slelievre

Using [SageMath](SageMath) version 9.0.beta10 via docker image.


 {{{
 sage: x=4**10000                                                                                                                                                             
 sage: from math import log10                                                                                                                                                 
 sage: type(x)                                                                                                                                                                
 <class 'sage.rings.integer.Integer'>                                                                                                                                         
 sage: log10(x)                                                                                                                                                               
 inf                                                                                                                                                                          
 sage: log10(int(x))                                                                                                                                                          
 6020.599913279624
}}}


---

Comment by slelievre created at 2019-12-27 05:31:14

Confirmed in Sage 9.0.beta10.

Smallest Sage integers where this fails:

```
sage: a = (2^54-1)*2^(1024-54)
sage: aa = int(a)
```


Import `log10` from the `math` module:

```
sage: from math import log10
sage: [log10(x) for x in [0.01, 0.1, 1, 10, 100]]
[-2.0, -1.0, 0.0, 1.0, 2.0]
```


Computing `log10(aa)` works, but not `log10(a)`:

```
sage: log10(aa)
308.25471555991675
sage: log10(a)
inf
```


No problem with `a - 1` as a Sage integer:

```
sage: type(a-1)
<class 'sage.rings.integer.Integer'>
sage: log10(a-1)
308.25471555991675
```


Workaround:

```
sage: RR(a).log()/(10.0).log()
308.254715559917
```


Note that Sage has a built-in method for the "number of digits"
of an integer (a common reason for taking the base ten logarithm):

```
sage: a.ndigits()
309
sage: a.ndigits(base=2)
1024
```



---

Comment by slelievre created at 2019-12-27 05:31:14

Changing component from packages: standard to numerical.


---

Comment by slelievre created at 2019-12-27 05:36:09

More descriptive ticket title.


---

Comment by @ismail created at 2019-12-27 05:57:38

More of the same problem:


```
sage: math.log2(a)                                                                                                                                                           
inf                                                                                                                                                                          
sage: math.log(a)                                                                                                                                                            
inf                                                                                                                                                                          
sage: math.isinf(a)                                                                                                                                                          
True 
```



---

Comment by embray created at 2020-01-06 14:10:03

Ticket retargeted after milestone closed


---

Comment by mkoeppe created at 2020-05-01 04:28:42

Moving tickets to milestone sage-9.2 based on a review of last modification date, branch status, and severity.


---

Comment by mkoeppe created at 2021-05-10 17:42:09

Moving to 9.4, as 9.3 has been released.
