# Issue 15197: elliptic curve isogenies: follow-up to #13615

Issue created by migration from https://trac.sagemath.org/ticket/15434

Original creator: cremona

Original creation time: 2013-11-18 12:58:58

In #13615 there were major enhancements to the ability to compute isogenies of low degree for elliptic curves.  A small bug was found after the ticket was closed and the patched merged into 5.13.beta0:

```
sage: K.<i> = NumberField(x^2+1)                                                                         
sage: E = EllipticCurve(K,[-2*i-1,0])                                                                   
sage: E.isogenies_prime_degree(17)
...

ValueError: The polynomial does not define a finite subgroup of the elliptic curve.
```

while in fact this curve does have 2 17-isogenies:

```
sage: from sage.schemes.elliptic_curves.isogeny_small_degree import isogenies_prime_degree_general
sage: isogenies_prime_degree_general(E,17) # rather slow
[Isogeny of degree 17 from Elliptic Curve defined by y^2 = x^3 + (-2*i-1)*x over Number Field in i with defining polynomial x^2 + 1 to Elliptic Curve defined by y^2 = x^3 + (-82*i-641)*x over Number Field in i with defining polynomial x^2 + 1,
 Isogeny of degree 17 from Elliptic Curve defined by y^2 = x^3 + (-2*i-1)*x over Number Field in i with defining polynomial x^2 + 1 to Elliptic Curve defined by y^2 = x^3 + (-562*i+319)*x over Number Field in i with defining polynomial x^2 + 1]
```


This was found by Warwick undergraduate Warren Moore.

This problem can be fixed as follows:  in line 1770 of isogeny_small_degree.py replace -27*c4 by -27*c4/1296 (or -c4/48) twice. 


---

Comment by cremona created at 2013-11-18 13:00:37

Changing status from new to needs_review.


---

Comment by cremona created at 2013-11-18 13:00:37

I checked that the problem does not also arise for the similar case of elliptic curves with j=0 over fields containing sqrt(-3) and primes =1 (mod 3).


---

Comment by vbraun created at 2013-11-18 13:27:59

Changing status from needs_review to positive_review.


---

Comment by cremona created at 2013-11-18 13:36:03

Replying to [comment:2 vbraun]:
Thanks for looking at this so quickly!


---

Comment by cremona created at 2013-11-18 20:37:03

Changing status from positive_review to needs_work.


---

Comment by cremona created at 2013-11-18 20:37:03

Not so fast: my patch is not good on non-short Weierstrass models.  Warren now reports this:

```
sage: K.<i> = NumberField(x^2+1)
sage: E = EllipticCurve(K, [-2*i-1,0])
sage: E.isogenies_prime_degree(17)
[Isogeny of degree 17 from Elliptic Curve defined by y^2 = x^3 + (-2*i-1)*x over Number Field in i with defining polynomial x^2 + 1 to Elliptic Curve defined by y^2 = x^3 + (-82*i-641)*x over Number Field in i with defining polynomial x^2 + 1,
Isogeny of degree 17 from Elliptic Curve defined by y^2 = x^3 + (-2*i-1)*x over Number Field in i with defining polynomial x^2 + 1 to Elliptic Curve defined by y^2 = x^3 + (-562*i+319)*x over Number Field in i with defining polynomial x^2 + 1]
sage: E.global_minimal_model().isogenies_prime_degree(17)
<boom>
```



---

Attachment

applies to 5.13.beta3


---

Comment by cremona created at 2013-11-19 13:19:43

The new patch does this properly now.  The new changed line agree's with Kimi's thesis, and with the similar code for j=0, and I added another doctest with the minimal model (the first patch only worked when b2=0).


---

Comment by cremona created at 2013-11-19 13:19:43

Changing status from needs_work to needs_review.


---

Comment by vbraun created at 2013-11-19 15:31:48

looks good to me


---

Comment by vbraun created at 2013-11-19 15:31:48

Changing status from needs_review to positive_review.


---

Comment by jdemeyer created at 2013-11-22 15:49:47

Resolution: fixed
