# Issue 10626: Typesetting (LaTeX) error for complex fractions

Issue created by migration from Trac.

Original creator: jan

Original creation time: 2011-01-24 09:54:34

Assignee: jason, mpatel, was

CC:  kcrisman

The simple fraction


```
i/2* x^2/a
```


is typeset as


```
1/2* i x^2/ (2*a).
```


This is clearly wrong. There is an extra factor of 2 in the denominator. The internal representation is however correct.

Reproduce with


```
var('a x')
ratio = i/2* x^2/a
print ratio        # correct
latex(ratio)       # wrong
```


See my public worksheet http://demo.sagenb.org/home/pub/69/ (sage version 4.6)


---

Comment by kcrisman created at 2011-03-26 02:24:36

Changing component from notebook to symbolics.


---

Comment by kcrisman created at 2011-03-26 02:24:36

From a [sage-support thread](http://groups.google.com/group/sage-support/browse_thread/thread/03fea42d904df28c/6967e4f36b2d80b0), another simple example.

```
sage: latex(1/2*I/Z) 
\frac{\frac{1}{2} i}{2 \, Z}
```

This happens in Ginac/Pynac, so we'll have to look there.  It happens at the command line too, so this is not a notebook issue.


---

Comment by kcrisman created at 2011-03-26 02:24:36

Changing assignee from jason, mpatel, was to burcin.


---

Comment by burcin created at 2011-05-08 19:55:56

This does not require any changes in pynac. The problem is that quadratic number field elements have a `denominator()` method, but no `numerator()` method.


```
sage: t = (1/2*I).pyobject()
sage: t.denominator()
2
sage: t.numerator()
---------------------------------------------------------------------------
AttributeError                            Traceback (most recent call last)
<snip>
AttributeError: 'sage.rings.number_field.number_field_element_quadratic.NumberFieldElement_quadratic' object has no attribute 'numerator'
```



---

Comment by burcin created at 2011-05-08 19:55:56

Changing priority from major to critical.


---

Attachment


---

Comment by burcin created at 2011-05-25 18:56:10

make py_numer more defensive


---

Comment by burcin created at 2011-05-25 18:59:05

Changing status from new to needs_review.


---

Attachment

Attached patches fix this issue.

 * attachment:trac_10679-quadratic_number_field_numerator.patch defines a `numerator()` method for quadratic number field elements
 * attachment:trac_10679-py_numer.patch changes the `py_numer()` function so that it will still work when it encounters another element class that defines `denominator()` but not `numerator()`


---

Comment by mariah created at 2011-06-06 16:55:23

The patches do not seem to fix the reported problem:


```
eno% ./sage
----------------------------------------------------------------------
----------------------------------------------------------------------
**********************************************************************
*                                                                    *
* Warning: this is a prerelease version, and it may be unstable.     *
*                                                                    *
**********************************************************************
sage: hg_sage.apply("/home/mariah/trac_10679-py_numer.patch")
cd "/home/mariah/sage/sage-4.7.1.alpha1-x86_64-Linux-core2-fc-review-10679/devel/sage" && hg status
cd "/home/mariah/sage/sage-4.7.1.alpha1-x86_64-Linux-core2-fc-review-10679/devel/sage" && hg status
cd "/home/mariah/sage/sage-4.7.1.alpha1-x86_64-Linux-core2-fc-review-10679/devel/sage" && hg import   "/home/mariah/trac_10679-py_numer.patch"
applying /home/mariah/trac_10679-py_numer.patch
sage: hg_sage.apply("/home/mariah/trac_10679-quadratic_number_field_numerator.patch")
cd "/home/mariah/sage/sage-4.7.1.alpha1-x86_64-Linux-core2-fc-review-10679/devel/sage" && hg status
cd "/home/mariah/sage/sage-4.7.1.alpha1-x86_64-Linux-core2-fc-review-10679/devel/sage" && hg status
cd "/home/mariah/sage/sage-4.7.1.alpha1-x86_64-Linux-core2-fc-review-10679/devel/sage" && hg import   "/home/mariah/trac_10679-quadratic_number_field_numerator.patch"
applying /home/mariah/trac_10679-quadratic_number_field_numerator.patch
sage: var('a x')
(a, x)
sage: ratio = i/2* x^2/a
sage: print ratio
1/2*I*x^2/a
sage: latex(ratio)
\frac{\frac{1}{2} i \, x^{2}}{2 \, a}
sage: 
```



---

Comment by mariah created at 2011-06-06 16:55:23

Changing status from needs_review to needs_work.


---

Comment by mariah created at 2011-06-06 17:10:07

Changing status from needs_work to needs_review.


---

Comment by mariah created at 2011-06-06 17:10:07

Oops.  Just realized that I forgot to do 'sage -b.  Apologies.


---

Comment by mariah created at 2011-06-07 19:56:02

After I did 'sage -b', the patch fixed the reported problem.  I then did 'make testlong'.
All tests passed.  Positive review!


---

Comment by mariah created at 2011-06-07 19:56:02

Changing status from needs_review to positive_review.


---

Comment by jdemeyer created at 2011-06-08 20:56:50

Resolution: fixed
