# Issue 21957: Multiplying elements from polynomial rings with lots of variables exceeds recursion depth

Issue created by migration from https://trac.sagemath.org/ticket/22194

Original creator: Stefan

Original creation time: 2017-01-17 04:17:17

Keywords: PolynomialRing, multivariate, singular, recursion depth

This gives a "RuntimeError: maximum recursion depth exceeded".


```
R1 = ZZ['x0','x1']
x = R1(1)
R2 = ZZ[tuple('x'+str(i) for i in range(967))]
y = R2('x0')
x*y
```


Decreasing the number 967 results in the correct answer (it's slow though).

I'm going to guess that "coercion" is the right component.


---

Comment by tscrim created at 2017-01-17 17:38:09

Yep, something is going wrong with either the coercion or in `_element_constructor_` as these are almost instantaneous:

```
sage: phi = R2.coerce_map_from(R1)
sage: R2._element_constructor_??
sage: phi(x)
1
sage: phi(x) * y
x0
sage: R2(x) * y
x0
```



---

Comment by tscrim created at 2017-01-17 17:38:58

My guess is probably in the `_element_constructor_`.


---

Comment by jdemeyer created at 2018-03-08 10:14:58

Duplicate of #23906.


---

Comment by jdemeyer created at 2018-03-08 10:14:58

Resolution: duplicate
