# Issue 33136: Incorrect parent when evaluating constant multivariate polynomial

Issue created by migration from https://trac.sagemath.org/ticket/33373

Original creator: roed

Original creation time: 2022-02-18 08:11:08

When evaluating a univariate polynomial, it correctly takes the parent of the input into account:

```
sage: k.<a> = GF(2^4)
sage: R.<x> = PolynomialRing(k)
sage: f = R(1)
sage: S.<y> = PolynomialRing(k)
sage: f(y).parent()
Univariate Polynomial Ring in y over Finite Field in a of size 2^4
```

Multivariate polynomials do not:

```
sage: k.<a> = GF(2^4)
sage: R.<x> = PolynomialRing(k, 1)
sage: f = R(1)
sage: S.<y> = PolynomialRing(k, 1)
sage: f(y).parent()
Finite Field in a of size 2^4
```



---

Comment by roed created at 2022-02-18 08:43:14

Changing status from new to needs_review.


---

Comment by git created at 2022-02-18 08:44:52

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by mmezzarobba created at 2022-02-19 18:21:15

lgtm, let's wait for the patchbot


---

Comment by roed created at 2022-02-20 02:56:10

Changing keywords from "" to "pAdicBordeaux".


---

Comment by roed created at 2022-02-20 02:56:10

Changing status from needs_review to needs_work.


---

Comment by roed created at 2022-02-20 02:56:10

Test failures, which I'll try to take a look at.
