# Issue 17056: Taking the dual of a negated isogeny raises an error

Issue created by migration from https://trac.sagemath.org/ticket/17293

Original creator: pbruin

Original creation time: 2014-11-05 13:31:45

Keywords: isogeny dual

In the following example, taking the dual works for the isogeny `phi` but fails for the negated isogeny `psi`:

```
sage: k.<s> = QuadraticField(2)
sage: E = EllipticCurve(k, [-3*s*(4 + 5*s), 2*s*(2 + 14*s + 11*s^2)])
sage: phi = E.isogenies_prime_degree(3)[0]
sage: psi = -phi
sage: phi.dual()
Isogeny of degree 3 from Elliptic Curve defined by y^2 = x^3 + (108*s-270)*x + (-1296*s+1512) over Number Field in s with defining polynomial x^2 - 2 to Elliptic Curve defined by y^2 = x^3 + (-12*s-30)*x + (48*s+56) over Number Field in s with defining polynomial x^2 - 2
sage: psi.dual()
Traceback (most recent call last):
...
NameError: global name 'E0' is not defined
```



---

Comment by pbruin created at 2014-11-05 16:23:21

Changing status from new to needs_review.


---

Comment by chapoton created at 2015-02-09 20:35:47

Changing status from needs_review to positive_review.


---

Comment by chapoton created at 2015-02-09 20:35:47

LGTM


---

Comment by vbraun created at 2015-02-18 08:53:25

Resolution: fixed
