# Issue 14767: comparison of Infinity and RealIntervalField-Element

Issue created by migration from Trac.

Original creator: dkrenn

Original creation time: 2013-08-06 08:47:24

Keywords: infinity realintervalfield rif compare

The comparison

```
sage: oo < RIF(2)
True
```

gives the wrong result, since this should be `False`.


---

Comment by vbraun created at 2014-04-21 19:52:10

Comparisons need to be defined for all values of a type to leverage the coercion system. What is the expected output of comparison with an RIF interval that includes infinity? 

```
sage: to_inf = RIF(0, oo) 
sage: to_inf
[0.00000000000000000 .. +infinity]
sage: oo < to_inf
```



---

Comment by vbraun created at 2014-04-21 20:52:33

#13125 changes this to:

```
sage: oo < RIF(2),  oo <= RIF(2),  oo == RIF(2)
(False, False, False)
sage: oo < RIF(2,oo),  oo <= RIF(2,oo),  oo == RIF(2,oo)
(False, True, True)
```


I propose to close this ticket as duplicate.


---

Comment by vbraun created at 2014-04-21 20:52:33

Changing status from new to needs_review.


---

Comment by tscrim created at 2014-04-22 02:39:58

Changing status from needs_review to positive_review.


---

Comment by tscrim created at 2014-04-22 02:39:58

Agreed.


---

Comment by vbraun created at 2014-04-22 10:36:49

Resolution: duplicate
