# Issue 17892: Symbolic powers broken for complex numbers

Issue created by migration from https://trac.sagemath.org/ticket/18129

Original creator: vdelecroix

Original creation time: 2015-04-06 17:48:56

CC:  tmonteil gagern

Taking fractional powers of symbolic terms is broken

```
sage: a = -1
sage: b = a^(1/3)
sage: b.n()       # determination of the third root
0.500000000000000 + 0.866025403784439*I
sage: b**2        # very bad
1
```


Because of that, it is dangerous to use symbolic expressions within QQbar as in #16222.


---

Comment by rws created at 2015-04-07 06:38:25


```
sage: ((-1)^(1/3))
(-1)^(1/3)
sage: ((-1)^(2/3))
1
```

So it's apparently not the application of `**2` but the instant simplification by Pynac, if I'm not mistaken.


---

Comment by tmonteil created at 2015-04-07 23:18:53

Changing status from new to needs_review.


---

Comment by tmonteil created at 2015-04-07 23:18:53

This looks like a duplicate of #15605.


---

Comment by rws created at 2015-04-08 06:18:37

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2015-04-08 22:03:25

Resolution: duplicate
