# Issue 13273: Cuspidal subspace of modular forms over finite field contains forms that are not cuspidal

Issue created by migration from Trac.

Original creator: mderickx

Original creation time: 2012-09-11 08:45:36

Assignee: craigcitro

Executing:

```
M=ModularForms(Gamma1(29),base_ring=GF(29))
S=M.cuspidal_subspace()
S.basis()
```

gives:

```
[
1 + O(q^6),
q + O(q^6),
q^2 + O(q^6),
q^3 + O(q^6),
q^4 + O(q^6),
q^5 + O(q^6),
O(q^6),
O(q^6),
O(q^6),
O(q^6),
O(q^6),
O(q^6),
O(q^6),
O(q^6),
O(q^6),
O(q^6),
O(q^6),
O(q^6),
O(q^6),
O(q^6),
O(q^6),
O(q^6)
]
```


The first element is clearly not cuspidal



---

Comment by chapoton created at 2013-08-08 08:58:43

Looking at sage/modular/modform/cuspidal_submodule.py, it seems that the cuspidal submodule is just defined by

* computing its dimension d
* taken the first d vectors of the basis of modular forms

So it implicitly assumes that the cusp forms come first in the listing of the basis.

On the other hand, the "is_cuspidal" method just checks that the element is in the cuspidal submodule. Is there a way to really check if something is cuspidal ?


---

Comment by AlexGhitza created at 2014-04-18 23:35:57

Smaller example:


```
sage: M = ModularForms(Gamma1(11), base_ring=GF(11))
sage: S = M.cuspidal_subspace()
sage: S.basis()
[
1 + O(q^6)
]
```



---

Comment by AlexGhitza created at 2014-04-18 23:43:26

Even smaller example:


```
sage: M = ModularForms(Gamma0(11), base_ring=GF(11)); M
Modular Forms space of dimension 2 for Congruence Subgroup Gamma0(11) of weight 2 over Finite Field of size 11
sage: M.basis()
[
1 + q^2 + q^3 + q^4 + q^5 + O(q^6),
q + 9*q^2 + 10*q^3 + 2*q^4 + q^5 + O(q^6)
]
sage: S = M.cuspidal_subspace()
sage: S.basis()
[
1 + q^2 + q^3 + q^4 + q^5 + O(q^6)
]
```



---

Comment by AlexGhitza created at 2014-04-24 06:11:01

The issue was in `sage.modular.modform.ambient_R.py`, where `q_integral_basis` was used for positive characteristic base rings.  However, `q_integral_basis` does not guarantee that its output is in the format exhibited by `q_expansion_basis`, i.e. starting with a basis for the cuspidal subspace and completed to a basis of the entire space.

The modified code now computes an integral basis for the cuspidal subspace and then completes it to an integral basis of the whole space.  This strategy works for rings of prime power characteristic (e.g. finite fields or integers modulo a prime power, the two main use cases currently in Sage).
----
New commits:


---

Comment by AlexGhitza created at 2014-04-24 06:11:01

Changing status from new to needs_review.


---

Comment by pbruin created at 2014-05-09 11:05:59

Changing status from needs_review to positive_review.


---

Comment by pbruin created at 2014-05-09 11:05:59

The code looks good and the patchbot is happy.


---

Comment by vbraun created at 2014-05-12 11:34:48

Resolution: fixed
