# Issue 15593: extracting coefficient x-1 out of symbolic series wrong

archive/issues_015593.json:
```json
{
    "body": "Keywords: symbolic, series, coefficient, wrong\n\n\n```\nsage: x.series(x==1,10).coefficient(x-1,0)\nx\n```\n\nwhich is wrong. It should be `1`, which can be seen by \n\n```\nsage: x.series(x==1,10)\n1 + 1*(x - 1)\n```\n\n\nWe also have wrong results here:\n\n```\nsage: x.series(x==1,10).coefficient(x-1,1)\n0\nsage: x.series(x==1,10).coefficient(x-1)\n0\n```\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/15830\n\n",
    "created_at": "2014-02-18T10:27:20Z",
    "labels": [
        "component: symbolics",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-6.4",
    "title": "extracting coefficient x-1 out of symbolic series wrong",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/15593",
    "user": "https://github.com/dkrenn"
}
```
Keywords: symbolic, series, coefficient, wrong


```
sage: x.series(x==1,10).coefficient(x-1,0)
x
```

which is wrong. It should be `1`, which can be seen by 

```
sage: x.series(x==1,10)
1 + 1*(x - 1)
```


We also have wrong results here:

```
sage: x.series(x==1,10).coefficient(x-1,1)
0
sage: x.series(x==1,10).coefficient(x-1)
0
```


Issue created by migration from https://trac.sagemath.org/ticket/15830





---

archive/issue_comments_201663.json:
```json
{
    "body": "Also `coefficient` can only deal with monomials: \n\n```\nsage: (x-1).coefficient(x-1)\n0\n```\n\nDifferent ticket?",
    "created_at": "2014-12-25T08:54:13Z",
    "issue": "https://github.com/sagemath/sagetest/issues/15593",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/15593#issuecomment-201663",
    "user": "https://github.com/rwst"
}
```

Also `coefficient` can only deal with monomials: 

```
sage: (x-1).coefficient(x-1)
0
```

Different ticket?
