# Issue 17003: some rationals not in RIF

Issue created by migration from https://trac.sagemath.org/ticket/17240

Original creator: dkrenn

Original creation time: 2014-10-28 10:49:03

Keywords: rationals, real interval field, inclusion

We have

```
sage: 3/2 in RIF
True
sage: 2/3 in RIF
False
```

which is a bit surprising. The elements can be converted to RIF:

```
sage: RIF(2/3)
0.6666666666666667?
sage: RIF(3/2)
1.5000000000000000?
```

This is also in contrast to

```
sage: 2/3 in RR
True
sage: 3/2 in RR
True
```


I've noticed this because of

```
sage: SR(3/2) in RIF
True                                                                            
sage: SR(2/3) in RIF
False
```



---

Comment by tmonteil created at 2014-10-28 17:16:50

This is not really a bug since is is consistent with the documentation, see `RIF.__contains__??` : if x is not already an element of A, "x in A" means there is an element in A that is equal to x, which is true for 3/2 but not for 2/3. Indeed, 2/3 has no exact floating point representation, so any candidate in RIF to be equal to 2/3 will be a non trivial interval, for which equality can not hold:


```
sage: RIF(2/3).endpoints()
(0.666666666666666, 0.666666666666667)
sage: RIF(3/2).endpoints()
(1.50000000000000, 1.50000000000000)
```



---

Comment by dkrenn created at 2014-10-28 18:30:09

Replying to [comment:1 tmonteil]:
> This is not really a bug since is is consistent with the documentation, see `RIF.__contains__??` [...]

I see; my mistake. I've added an example to the documentation which shows this.
----
New commits:


---

Comment by dkrenn created at 2014-10-28 18:30:09

Changing type from defect to enhancement.


---

Comment by dkrenn created at 2014-10-28 18:30:09

Changing priority from major to minor.


---

Comment by dkrenn created at 2014-10-28 18:30:09

Changing status from new to needs_review.


---

Comment by dkrenn created at 2014-10-28 18:31:37

Changing component from misc to documentation.


---

Comment by tmonteil created at 2014-10-30 17:14:01

Documentation is always welcome.

Perhaps could you also use the `.is_exact()` method in both cases and then the `.endpoints()` method in the 2/3 case to show the difference, since equal string representations for floating point numbers does not necessarily imply equality of floating point numbers ?

See for example:


```
sage: 1.0 + 1.0.ulp()
1.00000000000000
sage: 1.0
1.00000000000000
sage: 1.0 + 1.0.ulp() == 1.0
False
```



---

Comment by git created at 2014-10-30 17:35:33

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by dkrenn created at 2014-10-30 17:36:39

Replying to [comment:5 tmonteil]:
> Documentation is always welcome.
> 
> Perhaps could you also use the `.is_exact()` method in both cases and then the `.endpoints()` method in the 2/3 case to show the difference, since equal string representations for floating point numbers does not necessarily imply equality of floating point numbers ?

Done.


---

Comment by tmonteil created at 2014-10-31 14:24:13

I tried to make explanations more explicit. Please tell if it is easier to understand.
----
New commits:


---

Comment by kcrisman created at 2014-12-19 14:44:51

I was about to give this positive review when I realized that this is almost certainly not going to appear in the _visible_ documentation.  Is there somewhere in the RIF documentation (maybe the top of the module?) that this really good documentation can appear to people who are likely to need it (as opposed to those reading the `__contains__` source, who probably know what `ulp`s are)?  Otherwise this is great.


---

Comment by kcrisman created at 2014-12-19 14:44:51

Changing status from needs_review to needs_work.


---

Comment by tmonteil created at 2014-12-19 17:56:18

You can look at [the page of the doc](http://sagemath.org/doc/reference/structure/sage/structure/parent.html#sage.structure.parent.Parent.__contains__), the `__contains__` method appears since, in the documentation of the `Parent` class, there is a line:


```
    .. automethod:: __contains__
```


This lets the hidden method `__contains__` to be visible in the doc.

That said, i agree that something about this could be made explicit in the doc of `RIF`, not only `Parent`.


---

Comment by chapoton created at 2015-03-25 19:55:12

Changing status from needs_work to positive_review.


---

Comment by chapoton created at 2015-03-25 19:55:12

Looks good to me.


---

Comment by vbraun created at 2015-04-15 06:07:19

Resolution: fixed
