# Issue 15160: Bug in product of symmetric functions

Issue created by migration from https://trac.sagemath.org/ticket/15397

Original creator: zabrocki

Original creation time: 2013-11-11 12:28:03

CC:  sage-combinat aschilling asbuch mguaypaq saliola darij tfeulner

For partitions with first part >123 the product of Schur functions has problems.

```
sage: s = SymmetricFunctions(QQ).s()
sage: s[121,1]*s[2,1] # ok
s[121, 2, 1, 1] + s[121, 2, 2] + s[121, 3, 1] + s[122, 1, 1, 1] + 2*s[122, 2, 1] + s[122, 3] + s[123, 1, 1] + s[123, 2]
sage: s[122,1]*s[2,1] # not ok
2*s[1]
```




---

Comment by zabrocki created at 2013-11-11 12:33:30

This bug was reported to me by Mercedes Rosas.  I haven't experimented yet to identify the problem precisely.

Since the product of Schur functions is done with lrcalc (which may or may not be where the bug is) I included Anders Buch in the cc of the developers list (this is the 'report upstream').


---

Comment by zabrocki created at 2013-11-11 12:37:52

Remark:

I do not have similarly incorrect answers with the product of monomial symmetric functions.

```
sage: m = SymmetricFunctions(QQ).m()
sage: m[122,1]*m[2,1]
2*m[122, 2, 1, 1] + 2*m[122, 2, 2] + m[122, 3, 1] + m[123, 2, 1] + m[123, 3] + 2*m[124, 1, 1] + m[124, 2]
sage: m[600,1]*m[2,1]
2*m[600, 2, 1, 1] + 2*m[600, 2, 2] + m[600, 3, 1] + m[601, 2, 1] + m[601, 3] + 2*m[602, 1, 1] + m[602, 2]
```



---

Comment by zabrocki created at 2013-11-11 13:21:53

My first test indicates that the bug does not lie in lrcalc, but is actually a problem in symmetrica.

```
sage: s = SymmetricFunctions(QQ).s()
sage: symmetrica.mult_schur_schur(s[122,1],s[2,1])
2*s[1]
```



---

Comment by zabrocki created at 2013-11-11 14:04:44

One fix for this bug could be to switch the product from symmetrica to lrcalc since the problem seems to be within symmetrica:

```
sage: import sage.libs.lrcalc.lrcalc as lrcalc
sage: sage.libs.lrcalc.lrcalc.mult([122,1],[2,1])
{[122, 2, 1, 1]: 1,
 [122, 2, 2]: 1,
 [122, 3, 1]: 1,
 [123, 1, 1, 1]: 1,
 [123, 2, 1]: 2,
 [123, 3]: 1,
 [124, 1, 1]: 1,
 [124, 2]: 1}
```

lrcalc seems to have a known reported bug in #14625 (to my eye, significantly less serious).  Any advice?


---

Comment by zabrocki created at 2013-11-11 14:22:38

You can test the symmetrica bug is also triggered on the website for symmetrica 
at [this link](http://www.mathe2.uni-bayreuth.de/cgi-bin/axel/gensym.exe?outerproduct_schur?2?1?PARTITION?PARTITION).  Enter `[1,122]` and `[1,2]` and the same bug appears.  I suppose in any case it is worth digging around again in the symmetrica code to identify the problem.


---

Comment by zabrocki created at 2013-11-11 14:54:01

An email message was sent to the addresses at the website for symmetrica as well as to Axel Kohnert (Nicolas indicated that he might be a contact for symmetrica).


---

Comment by aschilling created at 2013-11-11 19:00:27

Wow, this is a terrible bug!!! One option would be to do the computations using lrcalc since we already have an interface to it and in addition ask Anders Buch to try to fix the lrcalc bug reported in #14625.


---

Comment by zabrocki created at 2013-11-12 04:45:21

I am not sure if "Developers acknowledge bug." is quite accurate, but will have to do for now.  Axel Kohnert has been seriously hurt and is unconscious.  Adalbert Kerber from Bayreuth acknowledged the bug report though.

I am posting here a patch to change the multiplication from symmetrica to lrcalc.  I don't consider it quite ready for review, but it seems to solve the problem.  As a happy side effect it also seems to have a serious speedup.


```
sage: s = SymmetricFunctions(QQ).s()
sage: P = list(reversed(range(1,8)))
sage: %time s(P)*s(P);
```

has a speedup from 169.30s to 27.75s running on sage cloud.


---

Comment by zabrocki created at 2013-11-12 04:56:39

Doing some more experimenting I have found minor modifications of how to trigger the bug and the second example has very bad behavior:

```
sage: s[123,1]*s[1,1]
2*s[1]
sage: s[123]*s[2,1]
ValueError                                Traceback (most recent call last)
...
ValueError: [0, 0, ..., 0, 122, 2, 1] is not an element of Partitions
```



---

Comment by zabrocki created at 2013-11-12 05:02:09

I guess I shouldn't have stopped there because:

```
sage: s([125])*s([3])
RuntimeError                              Traceback (most recent call last)
...
RuntimeError: Segmentation fault
```



---

Attachment


---

Comment by zabrocki created at 2013-11-12 13:30:33

I don't see the fix for symmetrica.  There is clearly a bug there that one can recreate on their website.

The attached patch changes `_multiply` to `_multiply_basis` and then calls `lrcalc.mult`.  I believe that given what the former `_multiply` function did, it should have been a `_multiply_basis` all along.  I also added three doctests.

That does not mean that the bug in symmetrica should not be fixed.  The following command causes a `Segmentation fault`

```
sage: symmetrica.mult_schur_schur([125],[3])
```


My recommendation is to review this patch and move on to fixing the problems with lrcalc mentioned in #14625.  Anders Buch has a version 1.1.7 of lrcalc while the version in Sage now is 1.1.6.


---

Comment by zabrocki created at 2013-11-12 13:30:47

Changing status from new to needs_review.


---

Comment by zabrocki created at 2013-11-12 13:31:50

Changing keywords from "" to "symmetrica, lrcalc, symmetric functions".


---

Comment by aschilling created at 2013-11-12 16:40:20

The fix looks good to me!


---

Comment by aschilling created at 2013-11-12 16:41:16

Changing status from needs_review to positive_review.


---

Comment by zabrocki created at 2013-11-13 03:32:38

The bug in symmetrica was moved to ticket #15407


---

Comment by jdemeyer created at 2013-11-14 07:54:32

Resolution: fixed
