# Issue 16272: bug in .as_finite_field_element() when minimal=True

archive/issues_016272.json:
```json
{
    "body": "CC:  @pjbruin @miguelmarco @defeo\n\nKeywords: bug\n\n\n```\nsage: K = GF(5).algebraic_closure()\nsage: z=K.gen(5) - K.gen(5) + K.gen(2)\nsage: z.as_finite_field_element(minimal=True)\nTraceback (most recent call last):\n...\nTypeError: unable to coerce\n```\n\n\nThe problem comes from the fact that the finite subfields of the algebraic closure can not talk to each other.\n\nNote that hopefully, it works fine when `minimal=False` (which is the default).\n\nIssue created by migration from https://trac.sagemath.org/ticket/16509\n\n",
    "created_at": "2014-06-21T09:45:18Z",
    "labels": [
        "component: finite rings",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-6.3",
    "title": "bug in .as_finite_field_element() when minimal=True",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/16272",
    "user": "https://github.com/videlec"
}
```
CC:  @pjbruin @miguelmarco @defeo

Keywords: bug


```
sage: K = GF(5).algebraic_closure()
sage: z=K.gen(5) - K.gen(5) + K.gen(2)
sage: z.as_finite_field_element(minimal=True)
Traceback (most recent call last):
...
TypeError: unable to coerce
```


The problem comes from the fact that the finite subfields of the algebraic closure can not talk to each other.

Note that hopefully, it works fine when `minimal=False` (which is the default).

Issue created by migration from https://trac.sagemath.org/ticket/16509





---

archive/issue_comments_212661.json:
```json
{
    "body": "The finite subfields should not even have to talk to each other; it is `as_finite_field_element()` that should take care of the conversion, in a similar way as `change_level()`.  I made a small patch which I am now testing.",
    "created_at": "2014-06-21T10:46:48Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16272",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16272#issuecomment-212661",
    "user": "https://github.com/pjbruin"
}
```

The finite subfields should not even have to talk to each other; it is `as_finite_field_element()` that should take care of the conversion, in a similar way as `change_level()`.  I made a small patch which I am now testing.



---

archive/issue_comments_212662.json:
```json
{
    "body": "I would prefer that the following works...\n\n```\nsage: K = GF(5).algebraic_closure()\nsage: K3 = K.subfield(3)[0]\nsage: K6 = K.subfield(6)[0]\nsage: K3.gen()\nz3\nsage: K6(K3.gen())\nTraceback (most recent call last):\n...\nTypeError: unable to coerce from a finite field other than the prime subfield\n```\n",
    "created_at": "2014-06-21T10:55:03Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16272",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16272#issuecomment-212662",
    "user": "https://github.com/videlec"
}
```

I would prefer that the following works...

```
sage: K = GF(5).algebraic_closure()
sage: K3 = K.subfield(3)[0]
sage: K6 = K.subfield(6)[0]
sage: K3.gen()
z3
sage: K6(K3.gen())
Traceback (most recent call last):
...
TypeError: unable to coerce from a finite field other than the prime subfield
```




---

archive/issue_comments_212663.json:
```json
{
    "body": "Changing status from new to needs_review.",
    "created_at": "2014-06-21T10:58:52Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16272",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16272#issuecomment-212663",
    "user": "https://github.com/pjbruin"
}
```

Changing status from new to needs_review.



---

archive/issue_comments_212664.json:
```json
{
    "body": "Replying to [comment:2 vdelecroix]:\n> I would prefer that the following works...\n> {{{\n> sage: K = GF(5).algebraic_closure()\n> sage: K3 = K.subfield(3)[0]\n> sage: K6 = K.subfield(6)[0]  # not used\n> sage: K3.gen()\n> z3\n> sage: K6(K3.gen())\n> Traceback (most recent call last):\n> ...\n> TypeError: unable to coerce from a finite field other than the prime subfield\n> }}}\nIn my opinion, from a mathematical perspective this should *not* be expected to work.  The first component of the tuple returned by `subfield()` method is just the abstract field, and there is no canonical map between non-trivial \"stand-alone\" finite fields.  Either stay inside the algebraic closure, or otherwise use the `inclusion()` method to obtain a map that you can use outside of it:\n\n```\nsage: K = GF(5).algebraic_closure()\nsage: K3 = K.subfield(3)[0]\nsage: f = K.inclusion(3, 6)\nsage: f(K3.gen())\n4*z6^5 + z6^4 + 4*z6^3 + 4*z6^2 + 3*z6 + 3\nsage: f.codomain() is K.subfield(6)[0]\nTrue\n```\n",
    "created_at": "2014-06-21T11:04:50Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16272",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16272#issuecomment-212664",
    "user": "https://github.com/pjbruin"
}
```

Replying to [comment:2 vdelecroix]:
> I would prefer that the following works...
> {{{
> sage: K = GF(5).algebraic_closure()
> sage: K3 = K.subfield(3)[0]
> sage: K6 = K.subfield(6)[0]  # not used
> sage: K3.gen()
> z3
> sage: K6(K3.gen())
> Traceback (most recent call last):
> ...
> TypeError: unable to coerce from a finite field other than the prime subfield
> }}}
In my opinion, from a mathematical perspective this should *not* be expected to work.  The first component of the tuple returned by `subfield()` method is just the abstract field, and there is no canonical map between non-trivial "stand-alone" finite fields.  Either stay inside the algebraic closure, or otherwise use the `inclusion()` method to obtain a map that you can use outside of it:

```
sage: K = GF(5).algebraic_closure()
sage: K3 = K.subfield(3)[0]
sage: f = K.inclusion(3, 6)
sage: f(K3.gen())
4*z6^5 + z6^4 + 4*z6^3 + 4*z6^2 + 3*z6 + 3
sage: f.codomain() is K.subfield(6)[0]
True
```




---

archive/issue_comments_212665.json:
```json
{
    "body": "I see. Do you mind if I add this example to the branch?",
    "created_at": "2014-06-21T11:09:42Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16272",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16272#issuecomment-212665",
    "user": "https://github.com/videlec"
}
```

I see. Do you mind if I add this example to the branch?



---

archive/issue_comments_212666.json:
```json
{
    "body": "Hi Peter,\n\nAnd, one more remark, with QQbar when such method is called the internal representation is changed:\n\n```\nsage: a = QQbar(2^(1/4))\nsage: b = a**2\nsage: b.as_number_field_element()\n(Number Field in a with defining polynomial y^4 - 2, a^2, Ring morphism:\n   From: Number Field in a with defining polynomial y^4 - 2\n   To:   Algebraic Real Field\n   Defn: a |--> 1.189207115002722?)\nsage: b.as_number_field_element(minimal=True)\n(Number Field in a with defining polynomial y^2 - 2, a, Ring morphism:\n   From: Number Field in a with defining polynomial y^2 - 2\n   To:   Algebraic Real Field\n   Defn: a |--> 1.414213562373095?)\nsage: b.as_number_field_element(minimal=False)\n(Number Field in a with defining polynomial y^2 - 2, a, Ring morphism:\n   From: Number Field in a with defining polynomial y^2 - 2\n   To:   Algebraic Real Field\n   Defn: a |--> 1.414213562373095?)\n```\n\nDo we want the same here?\n\nVincent",
    "created_at": "2014-06-21T11:14:15Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16272",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16272#issuecomment-212666",
    "user": "https://github.com/videlec"
}
```

Hi Peter,

And, one more remark, with QQbar when such method is called the internal representation is changed:

```
sage: a = QQbar(2^(1/4))
sage: b = a**2
sage: b.as_number_field_element()
(Number Field in a with defining polynomial y^4 - 2, a^2, Ring morphism:
   From: Number Field in a with defining polynomial y^4 - 2
   To:   Algebraic Real Field
   Defn: a |--> 1.189207115002722?)
sage: b.as_number_field_element(minimal=True)
(Number Field in a with defining polynomial y^2 - 2, a, Ring morphism:
   From: Number Field in a with defining polynomial y^2 - 2
   To:   Algebraic Real Field
   Defn: a |--> 1.414213562373095?)
sage: b.as_number_field_element(minimal=False)
(Number Field in a with defining polynomial y^2 - 2, a, Ring morphism:
   From: Number Field in a with defining polynomial y^2 - 2
   To:   Algebraic Real Field
   Defn: a |--> 1.414213562373095?)
```

Do we want the same here?

Vincent



---

archive/issue_comments_212667.json:
```json
{
    "body": "Replying to [comment:5 vdelecroix]:\n> I see. Do you mind if I add this example to the branch?\nWhy not, please go ahead.\n\nI don't think we should change the internal representation when the user calls `as_number_field_element()`.  Currently, two elements that compare equal can have a different hash (which is a bad thing); changing the internal representation of an element would therefore mean that its hash can change, which is even worse.\n\nQQbar is careful enough to ensure that equal elements with different representations have the same hash; it would be nice if we could somehow do that too.",
    "created_at": "2014-06-21T11:36:50Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16272",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16272#issuecomment-212667",
    "user": "https://github.com/pjbruin"
}
```

Replying to [comment:5 vdelecroix]:
> I see. Do you mind if I add this example to the branch?
Why not, please go ahead.

I don't think we should change the internal representation when the user calls `as_number_field_element()`.  Currently, two elements that compare equal can have a different hash (which is a bad thing); changing the internal representation of an element would therefore mean that its hash can change, which is even worse.

QQbar is careful enough to ensure that equal elements with different representations have the same hash; it would be nice if we could somehow do that too.



---

archive/issue_comments_212668.json:
```json
{
    "body": "Replying to [comment:7 pbruin]:\n> Replying to [comment:5 vdelecroix]:\n> I don't think we should change the internal representation when the user calls `as_number_field_element()`.  Currently, two elements that compare equal can have a different hash (which is a bad thing); changing the internal representation of an element would therefore mean that its hash can change, which is even worse.\n\nright\n\n> QQbar is careful enough to ensure that equal elements with different representations have the same hash; it would be nice if we could somehow do that too.\n\nI know but they \"cheat\" using the fact that you have a natural embedding to the complex field. Do you have an idea to get a (fast) coherent hash for algebraic closure elements?",
    "created_at": "2014-06-21T11:42:26Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16272",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16272#issuecomment-212668",
    "user": "https://github.com/videlec"
}
```

Replying to [comment:7 pbruin]:
> Replying to [comment:5 vdelecroix]:
> I don't think we should change the internal representation when the user calls `as_number_field_element()`.  Currently, two elements that compare equal can have a different hash (which is a bad thing); changing the internal representation of an element would therefore mean that its hash can change, which is even worse.

right

> QQbar is careful enough to ensure that equal elements with different representations have the same hash; it would be nice if we could somehow do that too.

I know but they "cheat" using the fact that you have a natural embedding to the complex field. Do you have an idea to get a (fast) coherent hash for algebraic closure elements?



---

archive/issue_comments_212669.json:
```json
{
    "body": "Replying to [comment:8 vdelecroix]:\n> Do you have an idea to get a (fast) coherent hash for algebraic closure elements?\nThe only thing I can think of is to take the hash of the minimal polynomial, which unfortunately (1) is not very fast and (2) gives the same result for all conjugates of an element.\n\n[Edit: or take the hash after coercing to the minimal subfield containing the element, which solves (2) but not (1).]",
    "created_at": "2014-06-21T11:49:08Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16272",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16272#issuecomment-212669",
    "user": "https://github.com/pjbruin"
}
```

Replying to [comment:8 vdelecroix]:
> Do you have an idea to get a (fast) coherent hash for algebraic closure elements?
The only thing I can think of is to take the hash of the minimal polynomial, which unfortunately (1) is not very fast and (2) gives the same result for all conjugates of an element.

[Edit: or take the hash after coercing to the minimal subfield containing the element, which solves (2) but not (1).]



---

archive/issue_comments_212670.json:
```json
{
    "body": "I think that, the same way that there are \"number fields with fixed embeddings on QQbar\", there should be \"finite filed with fixed embeddings on the algebraic closure\". That way \n\n```\nsage: K = GF(5).algebraic_closure()\nsage: K3 = K.subfield(3)[0]\nsage: K6 = K.subfield(6)[0]  # not used\nsage: K3.gen()\nz3\nsage: K6(K3.gen())\nTraceback (most recent call last):\n...\nTypeError: unable to coerce from a finite field other than the prime subfield\n```\n\n\nCould be made to work and also make mathematical sense.",
    "created_at": "2014-06-21T20:55:52Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16272",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16272#issuecomment-212670",
    "user": "https://github.com/miguelmarco"
}
```

I think that, the same way that there are "number fields with fixed embeddings on QQbar", there should be "finite filed with fixed embeddings on the algebraic closure". That way 

```
sage: K = GF(5).algebraic_closure()
sage: K3 = K.subfield(3)[0]
sage: K6 = K.subfield(6)[0]  # not used
sage: K3.gen()
z3
sage: K6(K3.gen())
Traceback (most recent call last):
...
TypeError: unable to coerce from a finite field other than the prime subfield
```


Could be made to work and also make mathematical sense.



---

archive/issue_comments_212671.json:
```json
{
    "body": "Hi Peter,\n\nI added the doc at `public/16509` and at the same time correct a typo. If you are fine with it, set to positive review.\n\nVincent",
    "created_at": "2014-06-22T10:31:09Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16272",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16272#issuecomment-212671",
    "user": "https://github.com/videlec"
}
```

Hi Peter,

I added the doc at `public/16509` and at the same time correct a typo. If you are fine with it, set to positive review.

Vincent



---

archive/issue_comments_212672.json:
```json
{
    "body": "Changing status from needs_review to positive_review.",
    "created_at": "2014-06-23T09:29:33Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16272",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16272#issuecomment-212672",
    "user": "https://github.com/pjbruin"
}
```

Changing status from needs_review to positive_review.



---

archive/issue_comments_212673.json:
```json
{
    "body": "Resolution: fixed",
    "created_at": "2014-06-24T00:38:40Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16272",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16272#issuecomment-212673",
    "user": "https://github.com/vbraun"
}
```

Resolution: fixed
