# Issue 31198: Can't scale tuples of mismatched-dimension matrices

Issue created by migration from https://trac.sagemath.org/ticket/31435

Original creator: mjo

Original creation time: 2021-02-25 20:50:41

If we take the Cartesian product of two vector spaces over the same base ring, then their elements (i.e. pairs, triples, etc.) can be scaled even when the dimensions of the vector spaces differ:


```
sage: V1 = VectorSpace(QQ,2)                                                    
sage: V2 = VectorSpace(QQ,3)                                                    
sage: V = cartesian_product([V1,V2])                                            
sage: 2*V(((1,2),(3,4,5)))                                                      
((2, 4), (6, 8, 10))
sage: V(((1,2),(3,4,5)))*2                                                      
((2, 4), (6, 8, 10))
```


This is good. The same thing does not work for matrix spaces:


```
sage: M1 = MatrixSpace(QQ,2)                                                    
sage: M2 = MatrixSpace(QQ,3)                                                    
sage: M = cartesian_product([M1,M2])                                            
sage: 2*M((M1.one(),M2.one()))                                                  
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)
...
TypeError: unsupported operand parent(s) for *: 'Integer Ring' and 'The Cartesian product of (Full MatrixSpace of 2 by 2 dense matrices over Rational Field, Full MatrixSpace of 3 by 3 dense matrices over Rational Field)'
```


This is bad. Curiously, it works if we mix vector and matrix spaces:


```
sage: Z = cartesian_product([V1,M2])                                            
sage: 2*Z(((1,2),M2.one()))                                                     
((2, 4), [2 0 0]
[0 2 0]
[0 0 2])
sage: Z(((1,2),M2.one()))*2                                                     
((2, 4), [2 0 0]
[0 2 0]
[0 0 2])
```


Someone has already decided this is mathematically OK, so it would be nice if it worked with two matrix spaces.


---

Comment by mjo created at 2021-02-26 17:50:20

It even works for non-square matrix spaces?


```
sage: m = matrix(QQ, [[1,2],[3,4],[5,6]])                                       
sage: M = cartesian_product([m.parent(), m.parent()])                           
sage: 2*M((m,m))                                                                
([ 2  4]
[ 6  8]
[10 12], [ 2  4]
[ 6  8]
[10 12])
```



---

Comment by mjo created at 2021-02-28 04:03:47

The difference between the square and non-square matrices looks like it comes down to a missing `one_basis()` for square matrices:


```
sage: n = matrix(QQ, [[1,2],[3,4]])                                                                                                                                          
sage: n.parent().basis()                                                                                                                                                     
Finite family {(0, 0): [1 0]
[0 0], (0, 1): [0 1]
[0 0], (1, 0): [0 0]
[1 0], (1, 1): [0 0]
[0 1]}
sage: n.parent().one_basis()                                                                                                                                                 
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)
<ipython-input-53-e607727fe63d> in <module>
----> 1 n.parent().one_basis()

TypeError: 'NotImplementedType' object is not callable
```


Since the square matrices form an algebra (where "one" makes sense), that method gets called somewhere. My guess is that this crashes the coercion model in a way that it's not expecting; whereas the non-square matrices crash it in a way that it does expect.

More food for thought: non-square matrices don't work either, if you use rationals instead of integers:


```
sage: m = matrix(QQ, [[1,2],[3,4],[5,6]])                                                                                                                                    
sage: M = cartesian_product([m.parent(), m.parent()])                                                                                                                        
sage: 2*M((m,m))
([ 2  4]
[ 6  8]
[10 12], [ 2  4]
[ 6  8]
[10 12])
sage: QQ(2)*M((m,m))
TypeError                                 Traceback (most recent call last)
...
TypeError: unsupported operand parent(s) for *: 'Rational Field' and 'The Cartesian product of (Full MatrixSpace of 3 by 2 dense matrices over Rational Field, Full MatrixSpace of 3 by 2 dense matrices over Rational Field)'
```


That should of course work just as well as an integer...


---

Comment by mjo created at 2021-02-28 14:14:07

Adding `one_basis()` for square matrix spaces isn't even enough to fix integer scaling. The Cartesian product is then missing `_indices`, which causes a crash somewhere else, so something further is missing from the category mumbo jumbo in square matrix spaces.


---

Comment by mkoeppe created at 2021-05-10 17:42:09

Moving to 9.4, as 9.3 has been released.
