# Issue 10115: norm method does not work for sparse matrices

archive/issues_010115.json:
```json
{
    "body": "Assignee: jason, was\n\nCC:  @orlitzky\n\nKeywords: matrices\n\nsage: M = matrix(ZZ,4,4,sparse=True) \nsage: M.norm() \nTraceback (click to the left of this block for traceback) \n... \nAttributeError: \n'sage.matrix.matrix_generic_sparse.Matrix_generic_sparse' object has \nno \nattribute 'SVD' \nsage: M.norm(1) \nTraceback (click to the left of this block for traceback) \n... \nTypeError: base_ring (=Category of objects) must be a ring \nand similarly for any other argument to norm. \nWhen I do \nsage: M.base_ring() \nInteger Ring \nBut if I do \nsage: M = matrix(ZZ,4,4) # without sparse=True \neverything works ok\n\nIssue created by migration from https://trac.sagemath.org/ticket/10116\n\n",
    "created_at": "2010-10-10T17:03:57Z",
    "labels": [
        "component: linear algebra",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-6.4",
    "title": "norm method does not work for sparse matrices",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/10115",
    "user": "https://trac.sagemath.org/admin/accounts/users/victor"
}
```
Assignee: jason, was

CC:  @orlitzky

Keywords: matrices

sage: M = matrix(ZZ,4,4,sparse=True) 
sage: M.norm() 
Traceback (click to the left of this block for traceback) 
... 
AttributeError: 
'sage.matrix.matrix_generic_sparse.Matrix_generic_sparse' object has 
no 
attribute 'SVD' 
sage: M.norm(1) 
Traceback (click to the left of this block for traceback) 
... 
TypeError: base_ring (=Category of objects) must be a ring 
and similarly for any other argument to norm. 
When I do 
sage: M.base_ring() 
Integer Ring 
But if I do 
sage: M = matrix(ZZ,4,4) # without sparse=True 
everything works ok

Issue created by migration from https://trac.sagemath.org/ticket/10116





---

archive/issue_comments_101992.json:
```json
{
    "body": "Calculating the Frobenius norm also seems problematic with sparse matrices over higher precision floating point rings.  As seen in the example below, sometimes it works and sometimes it doesn't.  Note that the Frobenius norm can be calculated without using the SVD.\n\n```\nsage: R=RealField(200)\nsage: m=10\nsage: A=diagonal_matrix(R,range(m))\nsage: A.norm('frob')\n16.8819430161\nsage: A.transpose().norm('frob')\n16.8819430161\nsage: (A-A.transpose()).norm('frob')\n---------------------------------------------------------------------------\nTypeError                                 Traceback (most recent call last)\n\n/desert/hartke/apps/<ipython console> in <module>()\n\n/home/hartke/apps/sage/local/lib/python2.6/site-packages/sage/matrix/matrix2.so in sage.matrix.matrix2.Matrix.norm (sage/matrix/matrix2.c:36319)()\n\n/home/hartke/apps/sage/local/lib/python2.6/site-packages/sage/matrix/matrix_sparse.so in sage.matrix.matrix_sparse.Matrix_sparse.apply_map (sage/matrix/matrix_sparse.c:6433)()\n\n/home/hartke/apps/sage/local/lib/python2.6/site-packages/sage/matrix/matrix_space.pyc in MatrixSpace(base_ring, nrows, ncols, sparse)\n    179     \"\"\"\n    180     if not base_ring in Rings():\n--> 181         raise TypeError(\"base_ring (=%s) must be a ring\"%base_ring)\n    182                                                                                                                      \n    183     if ncols is None: ncols = nrows                                                                                  \n                                                                                                                             \nTypeError: base_ring (=Category of objects) must be a ring                                                                   \nsage: type(A)                                                                                                                \n<type 'sage.matrix.matrix_generic_sparse.Matrix_generic_sparse'>\n```\n",
    "created_at": "2011-04-25T00:51:28Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10115",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10115#issuecomment-101992",
    "user": "https://trac.sagemath.org/admin/accounts/users/hartke"
}
```

Calculating the Frobenius norm also seems problematic with sparse matrices over higher precision floating point rings.  As seen in the example below, sometimes it works and sometimes it doesn't.  Note that the Frobenius norm can be calculated without using the SVD.

```
sage: R=RealField(200)
sage: m=10
sage: A=diagonal_matrix(R,range(m))
sage: A.norm('frob')
16.8819430161
sage: A.transpose().norm('frob')
16.8819430161
sage: (A-A.transpose()).norm('frob')
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)

/desert/hartke/apps/<ipython console> in <module>()

/home/hartke/apps/sage/local/lib/python2.6/site-packages/sage/matrix/matrix2.so in sage.matrix.matrix2.Matrix.norm (sage/matrix/matrix2.c:36319)()

/home/hartke/apps/sage/local/lib/python2.6/site-packages/sage/matrix/matrix_sparse.so in sage.matrix.matrix_sparse.Matrix_sparse.apply_map (sage/matrix/matrix_sparse.c:6433)()

/home/hartke/apps/sage/local/lib/python2.6/site-packages/sage/matrix/matrix_space.pyc in MatrixSpace(base_ring, nrows, ncols, sparse)
    179     """
    180     if not base_ring in Rings():
--> 181         raise TypeError("base_ring (=%s) must be a ring"%base_ring)
    182                                                                                                                      
    183     if ncols is None: ncols = nrows                                                                                  
                                                                                                                             
TypeError: base_ring (=Category of objects) must be a ring                                                                   
sage: type(A)                                                                                                                
<type 'sage.matrix.matrix_generic_sparse.Matrix_generic_sparse'>
```




---

archive/issue_comments_101993.json:
```json
{
    "body": "The lack of a sparse SVD can kill this in another way:\n\n\n```\nsage: A = matrix(RDF, 1, 1, [[1]], sparse=True)\nsage: A.norm()\n...\nAttributeError: 'sage.matrix.matrix_generic_sparse.Matrix_generic_sparse' object has no attribute 'SVD'\n```\n",
    "created_at": "2021-11-21T19:48:47Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10115",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10115#issuecomment-101993",
    "user": "https://github.com/orlitzky"
}
```

The lack of a sparse SVD can kill this in another way:


```
sage: A = matrix(RDF, 1, 1, [[1]], sparse=True)
sage: A.norm()
...
AttributeError: 'sage.matrix.matrix_generic_sparse.Matrix_generic_sparse' object has no attribute 'SVD'
```

