# Issue 23773: method number_of_terms of InfinitePolynomialRing fails for zero polynomial

Issue created by migration from Trac.

Original creator: zimmerma

Original creation time: 2017-10-11 07:36:50


```
sage: R.<x> = InfinitePolynomialRing(ZZ)
sage: (x[17]+x[42]).number_of_terms()
2
sage: R(0).number_of_terms()
...
AttributeError: <class 'sage.rings.polynomial.infinite_polynomial_element.InfinitePolynomial_sparse'> has no attribute number_of_terms
```



---

Comment by tscrim created at 2017-10-13 01:33:29

I noticed another problem that the elements are not respecting the sparseness of the parent:

```
sage: R.<x> = InfinitePolynomialRing(ZZ)
sage: R
Infinite polynomial ring in x over Integer Ring
sage: type(R)
<class 'sage.rings.polynomial.infinite_polynomial_ring.InfinitePolynomialRing_dense_with_category'>
sage: type(x[0])
<class 'sage.rings.polynomial.infinite_polynomial_element.InfinitePolynomial_dense'>
sage: type(R.zero())
<class 'sage.rings.polynomial.infinite_polynomial_element.InfinitePolynomial_sparse'>
```

However, it turns out that is unrelated to this ticket. Instead, extra attributes such as `number_of_terms` are obtained from the wrapped object:

```
sage: R.zero()._p.parent()
Integer Ring
sage: x[0]._p.parent()
Multivariate Polynomial Ring in x_1, x_0 over Integer Ring
```

For consistency, constants should be in some polynomial ring (perhaps with 0 variables). This whole thing likely needs quite a bit of cleanup (at some point).
