# Issue 30536: Preparser mingles with multi-line strings

Issue created by migration from https://trac.sagemath.org/ticket/30773

Original creator: defeo

Original creation time: 2020-10-15 14:32:17

CC:  @jcamp0x2a @kliem slelievre


```
sage: "2"
'2'
sage: """2"""
'2'
sage: """2
....: """
'2\n'
"""
```


But:


```
sage: """
....: 2"""
'\nInteger(2)'
```



---

Comment by @jcamp0x2a created at 2020-10-16 02:28:27

I believe this was fixed in #30417. On 9.2rc1 I get:


```python
sage: "2"
'2'
sage: """2"""
'2'
sage: """2
....: """
'2\n'
sage: """
....: 2"""
'\n2'
```



---

Comment by @kliem created at 2020-10-16 04:40:03

Yes, this appears to be fixed.


---

Comment by chapoton created at 2020-10-16 07:03:09

Changing status from new to needs_review.


---

Comment by @kliem created at 2020-10-16 07:09:08

Changing status from needs_review to positive_review.


---

Comment by chapoton created at 2020-10-16 07:28:20

Resolution: duplicate


---

Comment by defeo created at 2020-10-16 12:38:53

This must be the fastest resolution I ever had for a ticket :) 

Thank you all!
