# Issue 17718: LaurentSeriesRing and series_precision

Issue created by migration from https://trac.sagemath.org/ticket/17955

Original creator: behackl

Original creation time: 2015-03-14 13:14:48

Keywords: series_precision, asymptotics

Currently, `LaurentSeriesRing` caches without replacing the default `default_prec=None` to the global series precision obtainable by `sage.default.series_precision()` . This leads to the following behavior:


```
sage: set_series_precision(5)
sage: R.<x> = LaurentSeriesRing(ZZ)
sage: 1/(1-x)
1 + x + x^2 + x^3 + x^4 + O(x^5)
sage: set_series_precision(3)
sage: R.<x> = LaurentSeriesRing(ZZ)
sage: 1/(1-x)
1 + x + x^2 + x^3 + x^4 + O(x^5)
```

Instead, the (second) output should be

```
sage: 1/(1-x)
1 + x + x^2 + O(x^3)
```


This is fixed by setting `default_prec` to the corresponding global series precision *before* caching the parent.


---

Comment by behackl created at 2015-03-14 13:28:50

Changing status from new to needs_review.


---

Comment by behackl created at 2015-03-14 13:28:50

Changing priority from major to trivial.


---

Comment by rws created at 2015-03-14 14:10:07

Changing component from symbolics to commutative algebra.


---

Comment by rws created at 2015-03-14 14:10:07

Changing status from needs_review to positive_review.


---

Comment by rws created at 2015-03-14 14:10:07

Is fine and passes all tests in `rings/` and `doc/`. Thanks for spotting this.


---

Comment by vbraun created at 2015-03-17 08:33:52

Resolution: fixed
