# Issue 28157: comparison of sage rationals with gmpy2 mpq broken

Issue created by migration from https://trac.sagemath.org/ticket/28394

Original creator: vdelecroix

Original creation time: 2019-08-24 14:15:47

CC:  vklein


```
sage: import gmpy2
sage: gmpy2.mpq(5,3) == 5/3
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)
<ipython-input-2-7445d1641afe> in <module>()
----> 1 gmpy2.mpq(Integer(5),Integer(3)) == Integer(5)/Integer(3)

TypeError: cannot convert object to mpq
sage: 5/3 == gmpy2.mpq(5,3)
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)
<ipython-input-3-593205bfa17f> in <module>()
----> 1 Integer(5)/Integer(3) == gmpy2.mpq(Integer(5),Integer(3))

/opt/sage/sage-py3-gcc/local/lib/python3.7/site-packages/sage/rings/rational.pyx in sage.rings.rational.Rational.__richcmp__ (build/cythonized/sage/rings/rational.c:9498)()
    868             c = mpq_cmp_si((<Rational>left).value, PyInt_AS_LONG(right), 1)
    869         else:
--> 870             return coercion_model.richcmp(left, right, op)
    871 
    872         return rich_to_bool_sgn(op, c)

/opt/sage/sage-py3-gcc/local/lib/python3.7/site-packages/sage/structure/coerce.pyx in sage.structure.coerce.CoercionModel.richcmp (build/cythonized/sage/structure/coerce.c:19779)()
   1946         # we would end up trying the same coercion again.
   1947         if not y_is_Element and Py_TYPE(y).tp_richcompare:
-> 1948             res = Py_TYPE(y).tp_richcompare(y, x, revop(op))
   1949             if res is not NotImplemented:
   1950                 return res

TypeError: cannot convert object to mpq
```

Sage integers are perfectly fine

```
sage: gmpy2.mpz(3) == 3
True
sage: 3 == gmpy2.mpz(3)
True
```



---

Comment by vklein created at 2019-08-26 08:21:53

It looks likes it's a gmpy2 bug.

```
python3.7
Python 3.7.4 (default, Jul  9 2019, 03:52:42) 
[GCC 5.4.0 20160609] on linux
Type "help", "copyright", "credits" or "license" for more information.
>>> from gmpy2 import mpz, mpq
>>> class Q:
...     def __mpq__(self): return mpq(3,2)
... 
>>> q = Q()
>>> mpq(3, 2) * q
mpq(9,4)
>>> mpq(3, 2) == q
Traceback (most recent call last):
  File "<stdin>", line 1, in <module>
TypeError: cannot convert object to mpq
>>> from gmpy2 import cmp
>>> cmp(mpq(3,2), q)
Traceback (most recent call last):
  File "<stdin>", line 1, in <module>
TypeError: cannot convert object to mpq
>>> cmp(mpq(3,2), mpq(3,2))
0
```



---

Comment by vklein created at 2019-08-27 07:29:00

Do you think this need a patch ?

IMHO it's not necessary. You can call `__mpq__` explicitly if needed :

```
sage: from gmpy2 import mpq
sage: q = 5/3
sage: q.__mpq__() == mpq(5,3)
True
sage: mpq(q) == mpq(5,3)
True
```



---

Comment by vdelecroix created at 2019-08-27 08:39:03

Thank you. I agree with you that there is no need for a patch.


---

Comment by embray created at 2019-12-30 14:48:17

Ticket retargeted after milestone closed


---

Comment by mkoeppe created at 2020-05-01 04:28:42

Moving tickets to milestone sage-9.2 based on a review of last modification date, branch status, and severity.


---

Comment by slelievre created at 2020-09-16 00:38:55

Why `TypeError: cannot convert object to mpq`
if converting is as simple as `mpq(5/3)`?


---

Comment by vdelecroix created at 2020-09-16 06:41:12

This has been fixed upstream

```
sage: gmpy2.mpq(5,3) == 5/3
True
sage: 5/3 == gmpy2.mpq(5,3)
True
```

EDIT: in version 2.1.0b4


---

Comment by vdelecroix created at 2020-09-16 07:04:05

New commits:


---

Comment by vdelecroix created at 2020-09-16 07:04:05

Changing status from new to needs_review.


---

Comment by mkoeppe created at 2020-09-16 23:35:03

New commits:


---

Comment by mkoeppe created at 2020-09-16 23:35:03

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2020-09-23 21:27:52

Resolution: fixed
