# Issue 12932: BooleanPolynomial.variables() consider "1" as a variable

Issue created by migration from Trac.

Original creator: Bouillaguet

Original creation time: 2012-06-11 15:28:35

Assignee: malb

CC:  malb alexanderdreyer polybori

Keywords: BooleanPolynomial

This is in contradiction with other functions (BooleanPolynomial.nvariables), and with the behavior of the "normal" class MPolynomial.

Example:

```
sage: R.<x,y,z> = BooleanPolynomialRing()
sage: p = R(1)
sage: p.variables()
(1,)
sage: p.nvariables()
0
```

Which differs from:

```
sage: R.<x,y,z> = GF(2)[]
sage: p = R(1)
sage: p.variables()
()
sage: p.nvariables()
0
```



---

Attachment

patch that fixes the problem


---

Comment by Bouillaguet created at 2012-06-11 15:59:14

Changing status from new to needs_review.


---

Comment by malb created at 2012-06-11 16:19:29

Hi, can you add a doctest that shows that the issue is resolved? I also CCed the PolyBoRi developers to make sure there isn't some obscure reason for this behaviour.


---

Comment by Bouillaguet created at 2012-06-11 16:23:37

Hi,

I actually did, in fact. I modified the existing docstring to verify that:

```
sage: P.one_element().variables()  
()
```

Should I add anything else?


---

Comment by malb created at 2012-06-11 16:49:17

Sorry, my bad!


---

Comment by AlexanderDreyer created at 2012-06-11 19:31:24

`p.variables()` is a Sage extension (see #1715), the corresponding `p.vars_as_monomial()` () already behaves like this. (I think in early versions of PolyBoRi `p.vars_as_monomial()` could become 0, but this was a design error.) So I can clearly give a positive review.


---

Comment by malb created at 2012-06-11 22:42:08

Changing status from needs_review to positive_review.


---

Comment by jdemeyer created at 2012-06-23 21:44:25

Resolution: fixed
