# Issue 20566: Wrong kernel computation over finite field on OSX

Issue created by migration from https://trac.sagemath.org/ticket/20803

Original creator: ehlen

Original creation time: 2016-06-10 18:27:08

CC:  cpernet

I ran into a strange problem and it took me very long to find out that it's probably not a bug in my code but maybe in sage.
I compute a large matrix over a finite field using the same code with sage 7.1 on OSX 10.11.5 and on Linux.
I attached pickles of the two matrices I obtain. They seem identical (I have made sure that the kernel computations below are not cached in the pickles).
On Linux, the right kernel of the matrix is correctly computed (and has dimension 20) whereas on OSX, the result only has dimension 16. It is a proper subspace of the kernel!

I have no idea what's going on. Can someone help me to debug it?

Here are some facts, it's really a bit confusing.
I ran the following code on OSX:


```
sage: U=load('U.sobj')
sage: UX=load('U-osx.sobj')
sage: U == UX
True
sage: V = U.right_kernel(); V
Vector space of degree 613 and dimension 16 over Finite Field of size 101
Basis matrix:
16 x 613 dense matrix over Finite Field of size 101
sage: VX = UX.right_kernel(); VX
Vector space of degree 613 and dimension 16 over Finite Field of size 101
Basis matrix:
16 x 613 dense matrix over Finite Field of size 101
sage: U.right_nullity()
20
sage: UX.right_nullity()
20
```


Now, If I take the same objects and run the code on Linux, both of them give the correct result, a space of dimension 20. Also, If I cache the result on linux, pickle it and load it in OSX, I get (unsurprisingly) the correct answer (from cache) but also, I found out that the 16-dimensional space I'm getting is really a proper subspace of the kernel (and not some random stuff).

I will also recompile sage from source and see what happens but maybe someone with OSX can try to reproduce it and maybe 


---

Attachment

Matrix computed with linux


---

Attachment

Matrix computed with OSX


---

Comment by ehlen created at 2016-06-19 12:51:30

Changing priority from major to critical.


---

Comment by ehlen created at 2016-06-19 12:51:30

So I did recompile sage and tried with the latest development version (7.3beta4) and I'm getting the same, wrong result on OSX, a kernel of dimension 16.


---

Comment by ehlen created at 2016-06-19 12:51:30

Changing keywords from "" to "OSX, kernel".


---

Comment by ehlen created at 2016-06-20 04:33:14

The problem seems to be related to linbox.
If I load any of the attached files and call `U.echelonize(algorithm='gauss')` first, then the kernel is computed correctly on OSX.


---

Comment by ehlen created at 2016-06-20 04:33:36

Changing keywords from "OSX, kernel" to "OSX, kernel, linbox".


---

Comment by ehlen created at 2016-06-20 04:35:34

The same is true for `algorithm='linbox_noefd'`, it also gives the correct result.


---

Comment by cpernet created at 2016-08-24 08:16:46

I could not reproduce the bug.
I installed a fresh stable sage (v7.3) on an OSX virtual machine and always got dimension 20.

```
bash-3.2$ uname -v
Darwin Kernel Version 13.4.0: Wed Mar 18 16:20:14 PDT 2015; root:xnu-2422.115.14~1/RELEASE_X86_64
bash-3.2$ ./sage 
┌────────────────────────────────────────────────────────────────────┐
│ SageMath version 7.3, Release Date: 2016-08-04                     │
│ Type "notebook()" for the browser-based notebook interface.        │
│ Type "help()" for help.                                            │
└────────────────────────────────────────────────────────────────────┘
sage: U=load('U.sobj')
sage: UX=load('U-osx.sobj')
sage: U==UX
True
sage: V = U.right_kernel(); V
Vector space of degree 613 and dimension 20 over Finite Field of size 101
Basis matrix:
20 x 613 dense matrix over Finite Field of size 101
sage: VX = UX.right_kernel(); VX
Vector space of degree 613 and dimension 20 over Finite Field of size 101
Basis matrix:
20 x 613 dense matrix over Finite Field of size 101
sage: UX=load('U-osx.sobj'); UX.echelonize(algorithm='linbox_noefd'); VX = UX.right_kernel(); VX
Vector space of degree 613 and dimension 20 over Finite Field of size 101
Basis matrix:
20 x 613 dense matrix over Finite Field of size 101
sage: UX=load('U-osx.sobj'); UX.echelonize(algorithm='linbox'); VX = UX.right_kernel(); VX
Vector space of degree 613 and dimension 20 over Finite Field of size 101
Basis matrix:
20 x 613 dense matrix over Finite Field of size 101
sage: UX=load('U-osx.sobj'); UX.echelonize(algorithm='gauss'); VX = UX.right_kernel(); VX
Vector space of degree 613 and dimension 20 over Finite Field of size 101
Basis matrix:
20 x 613 dense matrix over Finite Field of size 101
```


What is your OSX version?
Can anyone with a native OSX reproduce this bug?


---

Comment by cpernet created at 2016-08-24 08:17:12

Changing keywords from "OSX, kernel, linbox" to "OSX, kernel, linbox, sd75".


---

Comment by Bouillaguet created at 2016-08-30 08:47:56

I confirm the bug.


```
# uname -v
Darwin Kernel Version 15.5.0: Tue Apr 19 18:36:36 PDT 2016; root:xnu-3248.50.21~8/RELEASE_X86_64

$ ./sage 
┌────────────────────────────────────────────────────────────────────┐
│ SageMath version 7.4.beta2, Release Date: 2016-08-26               │
│ Type "notebook()" for the browser-based notebook interface.        │
│ Type "help()" for help.                                            │
└────────────────────────────────────────────────────────────────────┘
┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
┃ Warning: this is a prerelease version, and it may be unstable.     ┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛
sage: U=load('../Downloads/U.sobj')
sage: UX=load('../Downloads/U-osx.sobj')
sage: V = U.right_kernel(); V
Vector space of degree 613 and dimension 17 over Finite Field of size 101
Basis matrix:
17 x 613 dense matrix over Finite Field of size 101
sage: VX = UX.right_kernel(); VX
Vector space of degree 613 and dimension 17 over Finite Field of size 101
Basis matrix:
17 x 613 dense matrix over Finite Field of size 101
sage: U.right_nullity()
20
sage: UX.right_nullity()
20
```

