# Issue 23143: graphics documentation obscure

archive/issues_023143.json:
```json
{
    "body": "CC:  mforets\n\nThe one line description of `text` refers to arguments `(x,y)` that do not appear in the signature\n\n```\nsage: text?\nSignature:      text(*args, **kwds)\nDocstring:     \n   Returns a 2D text graphics object at the point (x,y).\n\n   Type \"text.options\" for a dictionary of options for 2D text.\n...\n```\n\nIdem for ``point2d`` (that even refers to ``size``)\n\n```\nSignature:      point2d(*args, **kwds)\nDocstring:     \n   A point of size \"size\" defined by point = (x,y).\n...\n```\n\nThe first examples of line2d are completely useless\n\n```\nSignature:      line2d(*args, **kwds)\nDocstring:     \n   Create the line through the given list of points.\n...\nEXAMPLES:\n\n   A line with no points or one point:\n\n      sage: line([])      #returns an empty plot\n      Graphics object consisting of 0 graphics primitives\n      sage: import numpy; line(numpy.array([]))\n      Graphics object consisting of 0 graphics primitives\n      sage: line([(1,1)])\n      Graphics object consisting of 1 graphics primitive\n```\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/23380\n\n",
    "created_at": "2017-07-06T12:06:55Z",
    "labels": [
        "documentation",
        "major",
        "bug"
    ],
    "title": "graphics documentation obscure",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/23143",
    "user": "vdelecroix"
}
```
CC:  mforets

The one line description of `text` refers to arguments `(x,y)` that do not appear in the signature

```
sage: text?
Signature:      text(*args, **kwds)
Docstring:     
   Returns a 2D text graphics object at the point (x,y).

   Type "text.options" for a dictionary of options for 2D text.
...
```

Idem for ``point2d`` (that even refers to ``size``)

```
Signature:      point2d(*args, **kwds)
Docstring:     
   A point of size "size" defined by point = (x,y).
...
```

The first examples of line2d are completely useless

```
Signature:      line2d(*args, **kwds)
Docstring:     
   Create the line through the given list of points.
...
EXAMPLES:

   A line with no points or one point:

      sage: line([])      #returns an empty plot
      Graphics object consisting of 0 graphics primitives
      sage: import numpy; line(numpy.array([]))
      Graphics object consisting of 0 graphics primitives
      sage: line([(1,1)])
      Graphics object consisting of 1 graphics primitive
```


Issue created by migration from https://trac.sagemath.org/ticket/23380


