# Issue 12861: Conversion PARI -> RR fails for large exponents

Issue created by migration from https://trac.sagemath.org/ticket/13033

Original creator: jdemeyer

Original creation time: 2012-05-27 16:35:17

Assignee: was

CC:  zimmerma benjaminfjones was

Keywords: sd40.5


```
sage: a = pari(10^6).erfc()
sage: a
3.15934761259943 E-434294481910
sage: a.debug()
[&=0000000000f84d10] REAL(lg=3):0400000000000003 (+,expo=-1442695040910):5ffffeb018acb072 9b56c6d11005bdc3
sage: RR(a)
5.64243263573681e124617551
```


The exponent changed from -434294481910 to 124617551.


---

Comment by was created at 2012-05-27 16:39:24

Note that

```
sage: RealField(10000)('1e-434294481910') == 0
True
sage: RealField()('1e-434294481910') == 0
True
```

so in your example above, RR(a) should be 0.


---

Comment by was created at 2012-05-27 17:39:52

jdmeyer figured this out -- the issue was "int" versus "long"... a patch will be forthcoming.


---

Comment by jdemeyer created at 2012-05-27 18:46:28

Changing keywords from "sd40.5" to "sd40.5 PARI MPFR exponent".


---

Comment by jdemeyer created at 2012-05-27 19:52:50

Changing status from new to needs_review.


---

Comment by jdemeyer created at 2012-05-27 19:52:50

Passes all long doctests on x86_64, passes all longs tests in `sage/rings` on ppc32.


---

Comment by was created at 2012-05-27 22:52:59

Changing status from needs_review to positive_review.


---

Comment by was created at 2012-05-27 22:52:59

This looks really good to me!  I've run some tests in some places (sage.math and OS X).  I've not tested on 32-bit.   I really like how the functions are tested.


---

Attachment

Fixed exception formatting (no capital, no dot).


---

Comment by jdemeyer created at 2012-06-02 12:16:52

Resolution: fixed
