# Issue 12428: machine epsilon for RR, RDF, ...

Issue created by migration from https://trac.sagemath.org/ticket/12600

Original creator: dkrenn

Original creation time: 2012-02-27 15:15:05

Assignee: jason, jkantor

Keywords: machine epsilon

Matlab and Octave have a function `eps(...)` to show the machine epsilon. From the manual of octave: "More precisely, `eps' is the relative spacing between any two adjacent numbers in the machine's floating point system.".

Sage should have that, too.

E.g., we should have something like

```
sage: RDF(1).eps()
2.2204e-16
```



---

Comment by poeschko created at 2012-04-03 20:30:45

IMHO this is exactly what `ulp()` provides. From the docs:

    Returns the unit of least precision of self, which is the weight of the least significant bit of self. Unless self is exactly a power of
    two, it is gap between this number and the next closest distinct 
    number that can be represented.

It gives the following:

```
sage: RR(1).ulp()
2.22044604925031e-16
sage: RDF(1).ulp()
1.11022302463e-16
```


Of course, `ulp` is unbounded:

```
sage: RDF(10**100).ulp()
9.71334446113e+83
sage: RDF(10**-100).ulp()
6.34485459329e-117
```


The only thing that I can imagine adding is a class method `eps()` to `RR` and `RDF` that returns `one().ulp()`.


---

Comment by dkrenn created at 2012-04-03 21:29:25

Replying to [comment:1 poeschko]:
> IMHO this is exactly what `ulp()` provides. From the docs:
Thanks for mentioning, I didn't know about `ulp`

> The only thing that I can imagine adding is a class method `eps()` to `RR` and `RDF` that returns `one().ulp()`.
Yes, that would be good to have. (Note that `RR` is `RealField(53)`, i.e. `RealField` has to be equipped with such a method.)


---

Comment by jdemeyer created at 2015-02-03 14:44:32

New commits:


---

Comment by jdemeyer created at 2015-02-03 14:44:32

Changing status from new to needs_review.


---

Comment by mmezzarobba created at 2015-02-04 16:24:27

This breaks the usual doctest in `coercion_and_categories.rst`.


```
Failed example:
    [p for p in dir(Field) if p not in dir(Parent)]
Expected:
    ['__div__', '__fraction_field', '__ideal_monoid', '__iter__',
     '__pow__', '__rdiv__', '__rpow__', '__rxor__', '__xor__',
     '_an_element', '_an_element_c', '_an_element_impl', '_coerce_',
     '_coerce_c', '_coerce_impl', '_coerce_self', '_coerce_try',
     '_default_category', '_gens', '_gens_dict',
     '_has_coerce_map_from', '_ideal_class_', '_latex_names', '_list',
     '_one_element', '_pseudo_fraction_field',
     '_random_nonzero_element', '_richcmp', '_unit_ideal',
     '_zero_element', '_zero_ideal', 'algebraic_closure',
     'base_extend', 'cardinality', 'class_group', 'coerce_map_from_c',
     'coerce_map_from_impl', 'content', 'divides', 'extension',
     'fraction_field', 'frobenius_endomorphism', 'gcd', 'gen', 'gens',
     'get_action_c', 'get_action_impl', 'has_coerce_map_from_c',
     'has_coerce_map_from_impl', 'ideal', 'ideal_monoid',
     'integral_closure', 'is_commutative', 'is_field', 'is_finite',
     'is_integral_domain', 'is_integrally_closed', 'is_noetherian',
     'is_prime_field', 'is_ring', 'is_subring',
     'krull_dimension', 'list', 'ngens', 'one', 'one_element',
     'order', 'prime_subfield', 'principal_ideal', 'quo', 'quotient',
     'quotient_ring', 'random_element', 'unit_ideal', 'zero',
     'zero_element', 'zero_ideal', 'zeta', 'zeta_order']
Got:
    ['__div__',
     '__fraction_field',
     '__ideal_monoid',
     '__iter__',
     '__pow__',
     '__rdiv__',
     '__rpow__',
     '__rxor__',
     '__xor__',
     '_an_element',
     '_an_element_c',
     '_an_element_impl',
     '_coerce_',
     '_coerce_c',
     '_coerce_impl',
     '_coerce_self',
     '_coerce_try',
     '_default_category',
     '_gens',
     '_gens_dict',
     '_has_coerce_map_from',
     '_ideal_class_',
     '_latex_names',
     '_list',
     '_one_element',
     '_pseudo_fraction_field',
     '_random_nonzero_element',
     '_richcmp',
     '_unit_ideal',
     '_zero_element',
     '_zero_ideal',
     'algebraic_closure',
     'base_extend',
     'cardinality',
     'class_group',
     'coerce_map_from_c',
     'coerce_map_from_impl',
     'content',
     'divides',
     ***'epsilon',***
     'extension',
     'fraction_field',
     'frobenius_endomorphism',
     'gcd',
     'gen',
     'gens',
     'get_action_c',
     'get_action_impl',
     'has_coerce_map_from_c',
     'has_coerce_map_from_impl',
     'ideal',
     'ideal_monoid',
     'integral_closure',
     'is_commutative',
     'is_field',
     'is_finite',
     'is_integral_domain',
     'is_integrally_closed',
     'is_noetherian',
     'is_prime_field',
     'is_ring',
     'is_subring',
     'krull_dimension',
     'list',
     'ngens',
     'one',
     'one_element',
     'order',
     'prime_subfield',
     'principal_ideal',
     'quo',
     'quotient',
     'quotient_ring',
     'random_element',
     'unit_ideal',
     'zero',
     'zero_element',
     'zero_ideal',
     'zeta',
     'zeta_order']
```



---

Comment by mmezzarobba created at 2015-02-04 16:24:27

Changing status from needs_review to needs_work.


---

Comment by git created at 2015-02-05 11:20:16

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by jdemeyer created at 2015-02-05 11:20:42

Changing status from needs_work to needs_review.


---

Comment by mmezzarobba created at 2015-02-05 13:00:27

LGTM. You might want to crosslink the doc with that of `RealNumber.epsilon` though.


---

Comment by mmezzarobba created at 2015-02-05 13:00:27

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2015-02-17 19:28:20

Resolution: fixed
