# Issue 16460: implement symbolic lower incomplete gamma function

Issue created by migration from https://trac.sagemath.org/ticket/16697

Original creator: rws

Original creation time: 2014-07-22 08:45:10

CC:  kcrisman nbruin

Keywords: gamma, incomplete, special, functions

This is actually a defect because we leave a result from Maxima undefined:

```
sage: hypergeometric([1],[b],x).simplify_hypergeometric()
(b - 1)*x^(-b + 1)*e^x*gamma_greek(b - 1, x)
sage: gamma_greek
---------------------------------------------------------------------------
NameError                                 Traceback (most recent call last)
<ipython-input-18-6e90901bc5cb> in <module>()
----> 1 gamma_greek

NameError: name 'gamma_greek' is not defined
```

https://en.wikipedia.org/wiki/Incomplete_gamma_function#Lower_incomplete_Gamma_function

Mathematica seems to have Gamma[a,z] for upper and Gamma[a,0,z] for lower; Maple seems to have upper Gamma. `gamma_inc` (the upper one in Sage) gets immediately converted to `gamma(a,x)`, so Sage has already went the Mathematica path of `gamma(a)=gamma(a,x)+gamma(a,0,x)`. The symbolic functions `gamma_inc==incomplete_gamma` are converted and never returned to the user as expression:

```
sage: gamma_inc(x,x,hold=True)
gamma(x, x)
sage: incomplete_gamma(x,x,hold=True)
gamma(x, x)
sage: assume(x>0)
sage: integral(t^(s-1)*e^(-t),t,0,x)
-gamma(s, x) + gamma(s)
```

So, what's the plan?

 1. Provide all three "user input interfaces" `gamma_inc`, `incomplete_gamma` and `lower_incomplete_gamma`, and convert the Maxima `gamma_greek` to `-gamma(a, x) + gamma(a)`
 2. Provide all three "user input interfaces" `gamma_inc`, `incomplete_gamma` and `lower_incomplete_gamma`, and convert to `gamma(a,x)` and `gamma(a,0,x)`n on output
 3. Provide all three "user input interfaces" `gamma_inc`, `incomplete_gamma` and `lower_incomplete_gamma`, and have `incomplete_gamma` and `lower_incomplete_gamma` as result instead of `gamma(...)'
 4. Change the user interface completely to `lower_incomplete_gamma` and `upper_incomplete_gamma`
 5. Change the user interface completely to `gamma_inc_lower` and `gamma_inc_upper`
 6. Change the user interface completely to `gamma(a,x)` and `gamma(a,0,x)`


---

Comment by nbruin created at 2014-07-22 15:25:54

We don't need all of `gamma, gamma_inc, incomplete_gamma` as symbolic function if they all mean the same. Some of them are probably there for user convenience or because of legacy. I think we want only one spelling for `gamma_upper`, whatever it may be. The `gamma(a,x)` convention seems fairly prominent in computer algebra, but is a poor translation of math notation, where the difference between upper and lower is made with case (and indeed, the complete gamma function tends to be capital gamma. I don't think I've ever seen different).

Because of tab completion, you definitely want a binding available that starts with `gamma`. I'd be fine with `gamma_lower` but if you want to go with `gamma_lower_incomplete`, that's fine with me too. So, I'd propose

   8. Maintain status quo with respect to upper incomplete gamma, i.e., don't change sage's behaviour for `gamma(a,x)` and `gamma_inc(a,x)`. Just implement a symbolic function `gamma_lower` (or modified spelling) to correspond to maxima's gamma_greek.


---

Comment by rws created at 2014-07-22 16:02:07

I don't underswtand. With "leave as is" you would keep `gamma(a,x)` as returned expression for the upper function? Or would you make `gamma_inc` fully symbolic in that it gets no longer converted to `gamma(a,x)`?


---

Comment by rws created at 2014-07-23 07:07:04

The reason why `gamma_inc(x,y)` gets output as `gamma(x,y)` is not conversion as I thought but simple naming super in the constructor. It would be just as easy to make that `gamma_inc` and change a few doctests such that then:

```
         sage: f = exp_integral_e(-1,x)
         sage: f.integrate(x)
-        Ei(-x) - gamma(-1, x)
+        Ei(-x) - gamma_inc(-1, x)

             sage: gamma_inc(3,2)
-            gamma(3, 2)
+            gamma_inc(3, 2)

             sage: gamma(3,2)
             gamma_inc(3, 2)

             sage: gamma(x,0)
             gamma(x)

             sage: gamma(x, 0, hold=True)
-            gamma(x, 0)
+            gamma_inc(x, 0)
```

I'm appending the patch that enables this here, so it is preserved.


---

Attachment

see comment


---

Comment by git created at 2014-07-23 12:40:55

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by git created at 2014-07-23 14:43:23

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by rws created at 2014-07-23 14:43:50

Changing status from new to needs_review.


---

Comment by git created at 2014-07-26 07:02:49

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by nbruin created at 2014-08-08 14:58:01

On [sage-support](https://groups.google.com/d/msg/sage-support/duiLiYbLNww/i8towxGMOkUJ) Rafael Greenblatt reports

```
sage: (incomplete_gamma(x,y).diff(x)).simplify()
TypeError: ECL says: Error executing code in Maxima: gamma: wrong number of arguments.
```

The problem probably arises because the function ends up separated from its arguments:

```
sage: incomplete_gamma(x,y).diff(x)
D[0](gamma)(x, y)
```

which might confuse the translator (the behaviour is consistent with just going by strings). The changes here might improve the situation. It's worth checking.

The following of course works because it does NOT primarily look at strings:

```
sage: from sage.interfaces.maxima_lib import *
sage: maxima_calculus(sr_to_max(incomplete_gamma(x,y).diff(x)))
'diff(gamma_incomplete(x,y),x,1)
```



---

Comment by rws created at 2014-08-08 15:34:14

Replying to [comment:11 nbruin]:
> On [sage-support](https://groups.google.com/d/msg/sage-support/duiLiYbLNww/i8towxGMOkUJ) Rafael Greenblatt reports
> {{{
> sage: (incomplete_gamma(x,y).diff(x)).simplify()
> TypeError: ECL says: Error executing code in Maxima: gamma: wrong number of arguments.
> }}}
> The problem probably arises because the function ends up separated from its arguments:
> {{{
> sage: incomplete_gamma(x,y).diff(x)
> D[0](gamma)(x, y)
> }}}
> which might confuse the translator (the behaviour is consistent with just going by strings). The changes here might improve the situation. It's worth checking.
Does the same with the patch. Maybe include the fix here? Is it simple?


---

Comment by nbruin created at 2014-08-08 16:27:13

Replying to [comment:12 rws]:
> Does the same with the patch. Maybe include the fix here? Is it simple?
Might not be too bad. I think the problem is in [sage.symbolic.expression_conversions.InterfaceInit.derivative (line 515 or so)](https://github.com/sagemath/sagetrac-mirror/blob/master/src/sage/symbolic/expression_conversions.py#n515). You can see there that the string representation of a derivative expression gets assembled by using `f.name()`. Replacing that by `f._maxima_init_()` might already do a better job:

```
sage: gamma(x,y).operator().name()
'gamma'
sage: gamma(x).operator().name()
'gamma'
sage: gamma(x,y).operator()._maxima_init_()
'gamma_incomplete'
sage: gamma(x).operator()._maxima_init_()
'gamma'
```



---

Comment by rws created at 2014-08-08 16:37:46

That gives:

```
sage: (incomplete_gamma(x,y).diff(x)).simplify()
D[0](gamma)(x, y)
```



---

Comment by nbruin created at 2014-08-08 18:43:12

Replying to [comment:14 rws]:
> That gives:
> {{{
> sage: (incomplete_gamma(x,y).diff(x)).simplify()
> D[0](gamma)(x, y)
> }}}
Cool! so it IS easy. Be sure to also test (I haven't checked the answer is correct, but at least it shouldn't raise an error):

```
sage: (incomplete_gamma(x,x+1).diff(x)).simplify().simplify()
-(x + 1)^(x - 1)*e^(-x - 1) + D[0](gamma)(x, x + 1)
```

to check that both occurrences of `f.name()` have been replaced. I check the rest of that file and didn't find any further suspicious uses of `name` so after this, our maxima interface is probably perfect  :-).


---

Comment by nbruin created at 2014-08-08 22:48:25

See #16785 for a more complete fix.


---

Comment by git created at 2014-08-09 15:18:31

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by rws created at 2014-08-09 15:20:45

I also had to fix a doctest in integration where the given result didn't have enough precision because it came from maxima. Now the default is mpmath and that uncovered it.


---

Comment by git created at 2014-08-10 09:28:10

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by kcrisman created at 2014-08-11 03:06:52

Sorry, we should make this clearer - that field is one currently not used but which should be (!!!) that was for saying which version/beta of Sage a given ticket was merged in.  I agree that might not be clear given the word "merge" meaning something else in git!


---

Comment by rws created at 2014-08-13 06:56:36

So, is there anything missing?


---

Comment by git created at 2014-08-16 06:35:12

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by git created at 2014-10-13 07:30:45

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by jdemeyer created at 2014-10-13 08:01:45

Just to let you know: this conflicts with #17130.


---

Comment by kcrisman created at 2014-11-17 16:47:21

See also the information [here](http://www.walkingrandomly.com/images/maxima/ChangeLog-5.17-special-functions.txt), which seems to be more information than the documentation of Maxima gives.

```


Implementation of the Incomplete Gamma function

 New Maxima User function: gamma_incomplete(a,z)

 The following features are implemented:

 - Evaluation for real and complex numbers in double float and
   bigfloat precision
 - Special values for gamma_incomplete(a,0) and gamma_incomplete(a,inf)
 - When $gamma_expand T expand the following expressions:
   gamma_incomplete(0,z)
   gamma_incomplete(n+1/2)
   gamma_incomplete(1/2-n)
   gamma_incomplete(n,z)
   gamma_incomplete(-n,z)
   gamma_incomplete(a+n,z)
   gamma_incomplete(a-n,z)
 - Mirror symmetry
 - Derivative wrt the arguments a and z

--------------------------------------------------------------------------------
Implementation of the Generalized Incomplete Gamma function

 New Maxima User function: gamma_incomplete_generalized(a,z1,z2)

 The following features are implemented:

 - Evaluation for real and complex numbers in double float and
   bigfloat precision
 - Special values for:
   gamma_incomplete_generalized(a,z1,0)
   gamma_incomplete_generalized(a,0,z2),
   gamma_incomplete_generalized(a,z1,inf)
   gamma_incomplete_generalized(a,inf,z2)
   gamma_incomplete_generalized(a,0,inf)
   gamma_incomplete_generalized(a,x,x)
 - When $gamma_expand T and n an integer expand
   gamma_incomplete_generalized(a+n,z1,z2)
 - Implementation of Mirror symmetry
 - Derivative wrt the arguments a, z1 and z2

--------------------------------------------------------------------------------
Implementation of the Regularized Incomplete Gamma function

 New Maxima User function: gamma_incomplete_regularized(a,z)

 The following features are implemented:

 - Evaluation for real and complex numbers in double float and
   bigfloat precision
 - Special values for:
   gamma_incomplete_regularized(a,0)
   gamma_incomplete_regularized(0,z)
   gamma_incomplete_regularized(a,inf)
 - When $gamma_expand T and n a positive integer expansions for
   gamma_incomplete_regularized(n+1/2,z)
   gamma_incomplete_regularized(1/2-n,z)
   gamma_incomplete_regularized(n,z)
   gamma_incomplete_regularized(a+n,z)
   gamma_incomplete_regularized(a-n,z)
 - Derivative wrt the arguments a and z
 - Implementation of Mirror symmetry

```



---

Comment by rws created at 2014-11-26 14:18:56

We don't have `gamma_incomplete_regularized` either. This would be a different ticket.


---

Comment by rws created at 2014-11-29 17:16:37

I'm going back to Pari as default since mpmath has similar problems as earlier Pari, see #17328 and https://github.com/fredrik-johansson/mpmath/issues/301


---

Comment by git created at 2014-11-30 09:03:42

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by chapoton created at 2014-12-21 07:01:16

rebased on latest 6.5.beta3

also added one missing trac role
----
New commits:


---

Comment by git created at 2014-12-21 07:07:19

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by kcrisman created at 2015-02-03 03:56:35

Frédéric, any comments on review, or was this just a drive-by improvement?

Does the following (from the description) now come out better?

```
sage: hypergeometric([1],[b],x).simplify_hypergeometric()
```


Could we add the `gamma(a,0,x)` interface for the lower gamma?  _Should_ we?


---

Comment by rws created at 2015-02-03 09:56:17

Replying to [comment:35 kcrisman]:
> Does the following (from the description) now come out better?
> {{{
> sage: hypergeometric([1],[b],x).simplify_hypergeometric()
> }}}
`(b - 1)*x^(-b + 1)*e^x*gamma_inc_lower(b - 1, x)`
> 
> Could we add the `gamma(a,0,x)` interface for the lower gamma?  _Should_ we?
A separate ticket, please?


---

Comment by kcrisman created at 2015-02-03 14:07:44

> > {{{
> > sage: hypergeometric([1],[b],x).simplify_hypergeometric()
> > }}}
> `(b - 1)*x^(-b + 1)*e^x*gamma_inc_lower(b - 1, x)`
Nice.
> > Could we add the `gamma(a,0,x)` interface for the lower gamma?  _Should_ we?
> A separate ticket, please?
Seems quite reasonable.   Do you agree this would be a useful addition?  I only mention it because it seems that at least a couple 'competitors' support it, so presumably it is somewhat of a standard and not a surprise if Sage implements it.


---

Comment by rws created at 2015-02-03 16:26:56

Replying to [comment:37 kcrisman]:
> > > Could we add the `gamma(a,0,x)` interface for the lower gamma?  _Should_ we?
> > A separate ticket, please?
> Seems quite reasonable.   Do you agree this would be a useful addition?  I only mention it because it seems that at least a couple 'competitors' support it, so presumably it is somewhat of a standard and not a surprise if Sage implements it.
Any UI change that reduces surprise is fine with me. (Actually, I have a GUI development history and have read and care much about this subject)


---

Comment by kcrisman created at 2015-02-03 16:32:58

For the record, I know nearly nothing about UI development!  It was only a question.  #17722

I'm going to hold off on looking at this in more detail in case chapoton already did but a brief glance looks good.


---

Comment by kcrisman created at 2015-03-17 01:12:24

Note sympy apparently implements this as `lowergamma` (?).


---

Comment by rws created at 2015-03-17 07:43:26

Changing status from needs_review to needs_work.


---

Comment by rws created at 2015-03-17 07:43:26

Thanks, I was completely unaware. I think I will use their `eval`. The `diff` cannot be used in completeness because we don't know about the Meijer G function (EDIT: #17970), but I can steal half of it.


---

Comment by git created at 2015-03-17 16:25:45

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by rws created at 2015-03-17 16:31:15

Three doctests fail now because we depend on `sympy.erf._sage_()` which will be in Sympy-0.7.7. So this is pending.


---

Comment by rws created at 2015-03-17 16:31:15

Changing status from needs_work to needs_review.


---

Comment by buck created at 2015-04-17 00:35:14

Is there a ticket for sympy-0.7.7?


---

Comment by rws created at 2015-04-17 06:04:38

Replying to [comment:44 buck]:
> Is there a ticket for sympy-0.7.7?
There will be as soon it is released!


---

Comment by rws created at 2015-04-20 13:25:52

The diff link of this ticket shows not the correct diff but if you `git trac checkout 16697` you get the right branch.


---

Comment by buck created at 2015-04-20 16:40:44

I tried to review this (per ticket:18210#comment:18) but quickly got confused. (This would be a lot easier on github.)

 1. Could one of you point me to the doc pertaining to `_sage_`? I did look, but the [special sage functions](http://www.sagemath.org/doc/developer/coding_in_python.html#special-sage-functions) page doesn't mention it.
 2. There are some [doctests regarding precision](https://github.com/sagemath/sage/blob/master/src/sage/functions/other.py#L1040-L1056) that have been obliterated. Was this intentional? Why?
 3. It seems like this new function (gamma_inc_lower) would be deprecated as soon as #17722 is implemented. Don't we want to take a minute to figure out a design that works for both issues?

I think if this patch implemented lower-gamma as a special case of a single general gamma function we would end up with less if statements / edge cases / opportunities for bugs. 

Edit: ... end up with *less* bugs


---

Comment by rws created at 2015-04-21 06:24:50

Replying to [comment:47 buck]:
>  1. Could one of you point me to the doc pertaining to `_sage_`?
https://github.com/sagemath/sage/blob/master/src/sage/structure/sage_object.pyx#L557
This is overridden where necessary so please see the resp. class. Probably you want to know about interfaces:
https://github.com/sagemath/sage/blob/master/src/sage/interfaces/interface.py#L803
http://sagemath.org/doc/reference/interfaces/index.html 
>  2. There are some [doctests regarding precision](https://github.com/sagemath/sage/blob/master/src/sage/functions/other.py#L1040-L1056) that have been obliterated. Was this intentional? Why?
Oh that's true, I don't know why that got ditched. 
>  3. It seems like this new function (gamma_inc_lower) would be deprecated as soon as #17722 is implemented. Don't we want to take a minute to figure out a design that works for both issues?
There should be no problem to support both interfaces, and without code duplication. We already have

```
sage: incomplete_gamma(1,2)
e^(-2)
sage: gamma(1,2)
e^(-2)
sage: gamma(2)
1
```

> I think if this patch implemented lower-gamma as a special case of a single general gamma function we would end up with less if statements / edge cases / opportunities for bugs. 
Well that's the task for #17722, right. To have many doctests will help a good deal.

Note that even if you review this ticket (please add your real name to the ticket head in case) we would need to wait for Sympy-0.7.7 to be released. But a review of the code and the math would leave only a `make ptestlong` to finish it all.

EDIT: typos


---

Comment by buck created at 2015-04-22 06:27:43

Changing status from needs_review to needs_work.


---

Comment by buck created at 2015-07-26 19:59:44

I left this as "needs work" because of your "Oh that's true, I don't know why that got ditched."

Could you merge this up with master and I'll attempt to review again?

Also, please show me how to run all the relevant tests, please?

I'm surprised sympy hasn't cut a release yet, still.
If I'm counting correctly, it's been eight months since their last release.


---

Comment by buck created at 2015-07-27 00:41:52

Merged and attempted to run the doctests, and got this result:


```
./sage -t src/sage/functions/other.py                                                                    ⬆ ✱ ◼
too few successful tests, not using stored timings
Running doctests with ID 2015-07-26-17-39-51-10ac5315.
Git branch: master
Using --optional=mpir,python2,sage,scons
Doctesting 1 file.
sage -t src/sage/functions/other.py
**********************************************************************
File "src/sage/functions/other.py", line 1076, in sage.functions.other.Function_gamma_inc_lower._eval_
Failed example:
    gamma_inc_lower(1/2,2)
Exception raised:
    Traceback (most recent call last):
      File "/home/buck/trees/mine/sage/local/lib/python2.7/site-packages/sage/doctest/forker.py", line 496, in _run
        self.compile_and_execute(example, compiler, test.globs)
      File "/home/buck/trees/mine/sage/local/lib/python2.7/site-packages/sage/doctest/forker.py", line 858, in compile_and_execute
        exec(compiled, globs)
      File "<doctest sage.functions.other.Function_gamma_inc_lower._eval_[2]>", line 1, in <module>
        gamma_inc_lower(Integer(1)/Integer(2),Integer(2))
      File "sage/symbolic/function.pyx", line 994, in sage.symbolic.function.BuiltinFunction.__call__ (/home/buck/trees/mine/sage/src/build/cythonized/sage/symbolic/function.cpp:10875)
        res = super(BuiltinFunction, self).__call__(
      File "sage/symbolic/function.pyx", line 507, in sage.symbolic.function.Function.__call__ (/home/buck/trees/mine/sage/src/build/cythonized/sage/symbolic/function.cpp:6887)
        res = g_function_eval2(self._serial, (<Expression>args[0])._gobj,
      File "sage/symbolic/pynac.pyx", line 185, in sage.symbolic.pynac.pyExpression_to_ex (/home/buck/trees/mine/sage/src/build/cythonized/sage/symbolic/pynac.cpp:3934)
        t = ring.SR.coerce(res)
      File "sage/structure/parent.pyx", line 1310, in sage.structure.parent.Parent.coerce (/home/buck/trees/mine/sage/src/build/cythonized/sage/structure/parent.c:10682)
        cpdef coerce(self, x):
      File "sage/structure/parent.pyx", line 1339, in sage.structure.parent.Parent.coerce (/home/buck/trees/mine/sage/src/build/cythonized/sage/structure/parent.c:10628)
        return (<map.Map>mor)._call_(x)
      File "sage/symbolic/ring.pyx", line 927, in sage.symbolic.ring.UnderscoreSageMorphism._call_ (/home/buck/trees/mine/sage/src/build/cythonized/sage/symbolic/ring.cpp:10428)
        return self.codomain()(a._sage_())
      File "/home/buck/trees/mine/sage/local/lib/python2.7/site-packages/sympy/core/mul.py", line 1467, in _sage_
        s *= x._sage_()
    AttributeError: 'erf' object has no attribute '_sage_'
**********************************************************************
File "src/sage/functions/other.py", line 1078, in sage.functions.other.Function_gamma_inc_lower._eval_
Failed example:
    gamma_inc_lower(1/2,1)
Exception raised:
    Traceback (most recent call last):
      File "/home/buck/trees/mine/sage/local/lib/python2.7/site-packages/sage/doctest/forker.py", line 496, in _run
        self.compile_and_execute(example, compiler, test.globs)
      File "/home/buck/trees/mine/sage/local/lib/python2.7/site-packages/sage/doctest/forker.py", line 858, in compile_and_execute
        exec(compiled, globs)
      File "<doctest sage.functions.other.Function_gamma_inc_lower._eval_[3]>", line 1, in <module>
        gamma_inc_lower(Integer(1)/Integer(2),Integer(1))
      File "sage/symbolic/function.pyx", line 994, in sage.symbolic.function.BuiltinFunction.__call__ (/home/buck/trees/mine/sage/src/build/cythonized/sage/symbolic/function.cpp:10875)
        res = super(BuiltinFunction, self).__call__(
      File "sage/symbolic/function.pyx", line 507, in sage.symbolic.function.Function.__call__ (/home/buck/trees/mine/sage/src/build/cythonized/sage/symbolic/function.cpp:6887)
        res = g_function_eval2(self._serial, (<Expression>args[0])._gobj,
      File "sage/symbolic/pynac.pyx", line 185, in sage.symbolic.pynac.pyExpression_to_ex (/home/buck/trees/mine/sage/src/build/cythonized/sage/symbolic/pynac.cpp:3934)
        t = ring.SR.coerce(res)
      File "sage/structure/parent.pyx", line 1310, in sage.structure.parent.Parent.coerce (/home/buck/trees/mine/sage/src/build/cythonized/sage/structure/parent.c:10682)
        cpdef coerce(self, x):
      File "sage/structure/parent.pyx", line 1339, in sage.structure.parent.Parent.coerce (/home/buck/trees/mine/sage/src/build/cythonized/sage/structure/parent.c:10628)
        return (<map.Map>mor)._call_(x)
      File "sage/symbolic/ring.pyx", line 927, in sage.symbolic.ring.UnderscoreSageMorphism._call_ (/home/buck/trees/mine/sage/src/build/cythonized/sage/symbolic/ring.cpp:10428)
        return self.codomain()(a._sage_())
      File "/home/buck/trees/mine/sage/local/lib/python2.7/site-packages/sympy/core/mul.py", line 1467, in _sage_
        s *= x._sage_()
    AttributeError: 'erf' object has no attribute '_sage_'
**********************************************************************
File "src/sage/functions/other.py", line 1092, in sage.functions.other.Function_gamma_inc_lower._eval_
Failed example:
    gamma_inc_lower(9/2,37/7)
Exception raised:
    Traceback (most recent call last):
      File "/home/buck/trees/mine/sage/local/lib/python2.7/site-packages/sage/doctest/forker.py", line 496, in _run
        self.compile_and_execute(example, compiler, test.globs)
      File "/home/buck/trees/mine/sage/local/lib/python2.7/site-packages/sage/doctest/forker.py", line 858, in compile_and_execute
        exec(compiled, globs)
      File "<doctest sage.functions.other.Function_gamma_inc_lower._eval_[10]>", line 1, in <module>
        gamma_inc_lower(Integer(9)/Integer(2),Integer(37)/Integer(7))
      File "sage/symbolic/function.pyx", line 994, in sage.symbolic.function.BuiltinFunction.__call__ (/home/buck/trees/mine/sage/src/build/cythonized/sage/symbolic/function.cpp:10875)
        res = super(BuiltinFunction, self).__call__(
      File "sage/symbolic/function.pyx", line 507, in sage.symbolic.function.Function.__call__ (/home/buck/trees/mine/sage/src/build/cythonized/sage/symbolic/function.cpp:6887)
        res = g_function_eval2(self._serial, (<Expression>args[0])._gobj,
      File "sage/symbolic/pynac.pyx", line 185, in sage.symbolic.pynac.pyExpression_to_ex (/home/buck/trees/mine/sage/src/build/cythonized/sage/symbolic/pynac.cpp:3934)
        t = ring.SR.coerce(res)
      File "sage/structure/parent.pyx", line 1310, in sage.structure.parent.Parent.coerce (/home/buck/trees/mine/sage/src/build/cythonized/sage/structure/parent.c:10682)
        cpdef coerce(self, x):
      File "sage/structure/parent.pyx", line 1339, in sage.structure.parent.Parent.coerce (/home/buck/trees/mine/sage/src/build/cythonized/sage/structure/parent.c:10628)
        return (<map.Map>mor)._call_(x)
      File "sage/symbolic/ring.pyx", line 927, in sage.symbolic.ring.UnderscoreSageMorphism._call_ (/home/buck/trees/mine/sage/src/build/cythonized/sage/symbolic/ring.cpp:10428)
        return self.codomain()(a._sage_())
      File "/home/buck/trees/mine/sage/local/lib/python2.7/site-packages/sympy/core/add.py", line 732, in _sage_
        s += x._sage_()
      File "/home/buck/trees/mine/sage/local/lib/python2.7/site-packages/sympy/core/mul.py", line 1467, in _sage_
        s *= x._sage_()
    AttributeError: 'erf' object has no attribute '_sage_'
**********************************************************************
1 item had failures:
   3 of  12 in sage.functions.other.Function_gamma_inc_lower._eval_
    [509 tests, 3 failures, 3.90 s]
----------------------------------------------------------------------
sage -t src/sage/functions/other.py  # 3 doctests failed
----------------------------------------------------------------------
Total time for all tests: 4.1 seconds
    cpu time: 2.5 seconds
    cumulative wall time: 3.9 seconds
```



---

Comment by buck created at 2015-07-27 01:59:45

I realized I needed to upgrade sympy for this branch to work.
After that, the functions.other doctests pass, but a full ptest shows some failures that seem unrelated, but it's hard for me to be sure. I've attached the full result.


---

Comment by buck created at 2015-07-27 02:00:29

ptest results


---

Attachment

There's something not quite right with this branch. I get `gamma_greek` if I use combine().


```
sage: e
gamma(x, y) + gamma_inc_lower(x, y)
sage: e.combine()
gamma(x, y) + gamma_greek(x, y)
sage: e(x=1, y=2)
1
sage: e.combine()(x=1, y=2)
e^(-2) + gamma_greek(1, 2)
```



---

Comment by rws created at 2015-07-27 06:57:15

Changing status from needs_work to needs_review.


---

Comment by rws created at 2015-07-27 06:57:15

Cannot confirm your doctest failures (except those where sympy-0.7.7 is needed), nor the combine problem. It looks like you tested with an older Sage the doctests of a newer Sage. 

I have squashed all commits into one, and uploaded a new branch based on Sage-6.8. In this branch the three missing doctests were added as well.

Really, a full test should only be done with sympy-0.7.7 but if you think the rest is fine(?) then the missing long test eventually is done quickly by the patchbot.
----
New commits:


---

Comment by buck created at 2015-07-27 15:59:19

I did the full test with sympy-0.7.7, only after I got your new doctests in functions.other passing.

I reproduced the combine-gamma-greek problem with sage -br, which I would think should avoid any version-mismatch issues no?  (Apparently the maxima writer forgot that uppercase gamma is also greek?)

That said, I can't reproduce it anymore after merging your branch and running another sage -br.

Should this not come out as gamma_inc_lower?


```
./sage -br
sage: maxima('gamma_greek(x, y)')
gamma_greek(x,y)
```


I do see that `_sage_` of the same expression yields gamma_inc_lower. I suppose I don't know enough about the coersion going on here. I did try looking in the docs but didn't find anything that helped me understand this particular aspect.


```
sage: maxima('gamma_greek(x, y)')
gamma_greek(x,y)

sage: maxima('gamma_greek(x, y)')._sage_()
gamma_inc_lower(x, y)

sage: maxima('gamma_greek(x, y)').simplify()
simplify(gamma_greek(x,y))

sage: maxima('gamma_greek(x, y)')._sage_().simplify()
gamma_inc_lower(x, y)
```



---

Comment by rws created at 2015-07-28 07:38:13

Replying to [comment:56 buck]:
> I did the full test with sympy-0.7.7, only after I got your new doctests in functions.other passing.
How did you do that. Are there release tarballs of sympy-0.7.7? Note that having it on your machine does not mean Sage will use it. The version used is that in the upstream directory of Sage.


---

Comment by buck created at 2015-07-28 15:43:01

I installed their master branch to the local/ tree.
Putting local/bin on the $PATH makes it close enough to a virtualenv that pip will Just Work.

I needed this to get the doctests working as well, so I presumed it was also your procedure. If not, how were you getting your tests to pass?


---

Comment by rws created at 2015-07-28 16:13:09

Replying to [comment:58 buck]:
> I needed this to get the doctests working as well, so I presumed it was also your procedure. If not, how were you getting your tests to pass?
Never said I did. The ticket has pending and dependency set as well. But thanks anyway 8) So, except from a final test, would you say your review is positive?


---

Comment by buck created at 2015-07-28 16:42:03

There's doctest coverage missing (for the deprecated function), and this patch doesn't fix the numerical instability in incomplete gamma as promised [ticket:18210#comment:18 elsewhere].



```
sage: gamma_inc_lower(25, 14.5).n()
-6.63538851954338e22
sage: gamma_inc_lower(25, 14.5).n(algorithm='mpmath')
-6.63538851954338e22
sage: gamma_inc_lower(25, 14.5).n(algorithm='pari')
-6.63538851954338e22
```



---

Comment by buck created at 2015-07-28 16:46:03

Of note, gamma (even incomplete) is strictly positive in the reals; it's an integral of a strictly positive function.

https://en.wikipedia.org/wiki/Incomplete_gamma_function#Definition


---

Comment by buck created at 2015-07-28 16:50:51

Wolfram gives the value of the same as 4.7e21, which seems correct.

http://www.wolframalpha.com/input/?i=Gamma%5B25%2C+0%2C+14.5%5D


---

Comment by buck created at 2015-07-28 17:04:21

Actually, if I ask pari directly, it gets the correct value, so maybe the algorithm argument is broken?


```
sage: pari('gamma(25) - incgam(25, 14.5)')
4.71197173824555 E21
sage: pari('incgamc(25, 14.5)')
4.71197173824555 E21
```



---

Comment by buck created at 2015-07-28 17:10:42

Same story if I ask mpmath directly. I can't imagine what's wrong.


```
sage: call(mpmath.gammainc, 25, 0, 14.5)
4.71197173824555e21
```



---

Comment by rws created at 2015-07-29 07:51:38

Replying to [comment:64 buck]:
> Same story if I ask mpmath directly. I can't imagine what's wrong.

'algorithm' isn't propagated to `evalf` so we always get the buggy pari values. As we would have to switch the default anyway as soon as a later pari version fixes the bug, I'll now simply disable pari. We'll have to live with `mpmath`'s 53 bits for now.


---

Comment by rws created at 2015-07-29 07:59:20

Replying to [comment:63 buck]:
> Actually, if I ask pari directly, it gets the correct value, so maybe the algorithm argument is broken?
> 
> {{{
> sage: pari('gamma(25) - incgam(25, 14.5)')
> 4.71197173824555 E21
> sage: pari('incgamc(25, 14.5)')
> 4.71197173824555 E21
> }}}
This works because it uses the gp interface (the libpari might be broken on our side). Ah, that's two different bugs. However, even if it is in our interface to libpari and we fix this, or if we use the gp interface, there is still the unfixed pari bug at
http://pari.math.u-bordeaux.fr/cgi-bin/bugreport.cgi?bug=1689PARI/GP


---

Comment by git created at 2015-07-29 08:30:26

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by rws created at 2015-07-29 08:31:36

Actually the 53-bit restriction applies only to larger values, so all is not lost.


---

Comment by rws created at 2016-02-19 07:46:37

Replying to [comment:30 rws]:
> I'm going back to Pari as default since mpmath has similar problems as earlier Pari, see #17328 and https://github.com/fredrik-johansson/mpmath/issues/301
The mpmath issue is now fixed as well so we have both options, mpmath or Pari/GP.


---

Comment by fredrik.johansson created at 2016-02-19 10:10:06

You could also compute the incomplete gamma function with Arb.


---

Comment by rws created at 2016-03-14 16:03:07

New commits:


---

Comment by chapoton created at 2016-05-14 08:28:21

Changing status from needs_review to needs_work.


---

Comment by chapoton created at 2016-05-14 08:28:21

does not apply


---

Comment by rws created at 2016-05-14 12:28:05

Wanna review?


---

Comment by git created at 2016-05-20 15:10:31

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by rws created at 2016-05-20 15:11:06

Changing status from needs_work to needs_review.


---

Comment by paulmasson created at 2016-06-26 22:01:45

Current 7.3.beta5 Sage builds fine with these modifications. Doctests all pass. Documentation builds.

Random numeric tests accurate. Function plots. One curious difference from `gamma_inc`:



```
sage: gamma_inc_lower(a,x).diff(x)
x^(a - 1)*e^(-x)
sage: gamma_inc(a,x).diff(x)
D[1](gamma)(a, x)
```


Looks good to me. Sympy already updated: any other reason not to merge?


---

Comment by paulmasson created at 2016-06-26 22:02:12

Changing status from needs_review to positive_review.


---

Comment by rws created at 2016-06-27 07:16:18

Thanks.


---

Comment by vbraun created at 2016-06-27 16:22:10

Resolution: fixed
