# Issue 11408: Magma interface cannot convert multivariate polynomials back to sage

Issue created by migration from https://trac.sagemath.org/ticket/11580

Original creator: nbruin

Original creation time: 2011-07-07 03:28:12

Assignee: was

Evidently:

```
sage: R.<x,y,z>=QQ[]
sage: f=x^2+3*y
sage: magma(f).sage()
NameError: name 'x' is not defined
```



---

Comment by nbruin created at 2011-07-07 03:32:27

Changing status from new to needs_review.


---

Attachment


---

Comment by nbruin created at 2011-07-09 00:56:51

Updated patch so that magma tuples of length 1 become python tuples (doesn't affect the polynomial bit of the patch)


---

Comment by was created at 2011-07-14 10:16:22

Hi Nils,

Can you add 

```
sage: R.<x,y,z>=QQ[]
sage: f=x^2+3*y
sage: magma(f).sage()        # optional - magma
x^2 + 3*y  # or whatever
```

as a doctest in interfaces/magma.py or somewhere?


---

Comment by was created at 2011-07-14 10:16:22

Changing status from needs_review to needs_work.


---

Attachment


---

Comment by nbruin created at 2011-07-15 15:13:47

Thanks William! Done.


---

Comment by nbruin created at 2011-07-15 15:13:47

Changing status from needs_work to needs_review.


---

Comment by was created at 2011-07-17 13:46:26

Changing status from needs_review to positive_review.


---

Comment by jdemeyer created at 2011-07-28 10:45:24

Changing status from positive_review to needs_work.


---

Comment by mstreng created at 2011-07-29 15:54:50

This patch breaks conversion of finite field elements from Magma to Sage.

Without patch:

```
sage: magma(GF(2)(1)).sage()
1
```

With patch:

```
sage: magma(GF(2)(1)).sage()
...
Segmentation fault
...
Magma crashed executing _sage_[3], _sage_[4] := Sage(_sage_[2]);
```

With patch:

```
sage -t -only-optional=magma devel/sage/sage/rings/finite_rings/element_givaro.pyx
(same crash)
```


When converting finite field elements from Magma to Sage, they are first converted to a `SeqEnum` of finite field elments. In particular, a proper implementation of conversions of `SeqEnum` to Sage sets of an infinite loop. This was fixed in #11456, so we should rebase this patch on top of #11456.


---

Attachment


---

Comment by mstreng created at 2011-07-29 16:22:02

Changing status from needs_work to needs_review.


---

Attachment

Rebased on top of #11456.

Removed the function `"intrinsic Sage(X::SeqEnum) -> MonStgElt, BoolElt"`, because it was equal (modulo documentation) to the one in #11456.


---

Comment by mstreng created at 2011-09-02 10:49:00

I think the original author or reviewer could quickly review my patch. I only removed some stuff from the previous version, which already had a positive review...


---

Comment by was created at 2011-09-06 21:39:52

Changing status from needs_review to positive_review.


---

Comment by was created at 2011-09-06 21:39:52

Positive review of new version.  Thanks for the rebase.


---

Comment by leif created at 2011-09-12 19:26:02

Resolution: fixed
