# Issue 10606: Improve performance of matrix group morphisms

Issue created by migration from https://trac.sagemath.org/ticket/10659

Original creator: SimonKing

Original creation time: 2011-01-19 14:00:24

Assignee: joyner

Keywords: matrix group morphism

I met the following example, that took unnecessarily long:

```
sage: O = WeylGroup(['D',6])
sage: r = prod(O.gens())
sage: r_ = r^-1
sage: f = O.hom([r*x*r_ for x in O.gens()])  # long
sage: Im = [f(x) for x in O.gens()]          # very long
```


I found the following oddities in `sage.groups.matrix_gps.matrix_group_morphism`:

1. There was a string `self._gap_hom_string` that, when evaluated in Gap, had the side-effect of defining (or, in bad cases, overriding!) something called `Phi` - a very common name.

2. The string `self._gap_hom_string` was evaluated whenever `self` was called. That was very bad waste of time, because it checks over and over again whether the input data actually yield a group homomorphism. That takes a very long time.

3. There was a `__call__` method, rather than a `_call_` and a `pushforward` method.

4. `image` and `kernel` return a Gap-readable _string_, rather than a subgroup or a group element!

With my patch, it is only tested _once_ whether or not the input data provide a group homomorphism, namely in the `__init__` method. Moreover, `image` is renamed to `pushforward`, and returns a subgroup (and so does `kernel`).

*__Examples__*

The example above still takes a while, since gap needs long to check sanity. However, the execution time considerably dropped.

Here, the last line used to return a string:

```
sage: F = GF(7); MS = MatrixSpace(F,2,2)
sage: F.multiplicative_generator()
3
sage: G = MatrixGroup([MS([3,0,0,1])])
sage: a = G.gens()[0]^2
sage: phi = G.hom([a])
sage: phi.kernel()
Matrix group over Finite Field of size 7 with 1 generators: 
 [[[6, 0], [0, 1]]]
```



Here, `image` used to return a string. The last line didn't work at all.

```
sage: F = GF(7); MS = MatrixSpace(F,2,2)
sage: F.multiplicative_generator()
3
sage: G = MatrixGroup([MS([3,0,0,1])])
sage: a = G.gens()[0]^2
sage: phi = G.hom([a])
sage: phi.image(G.gens()[0])
[2 0]
[0 1]
sage: H = MatrixGroup([MS(a.list())])
sage: H
Matrix group over Finite Field of size 7 with 1 generators:
 [[[2, 0], [0, 1]]]
sage: phi(H)
Matrix group over Finite Field of size 7 with 1 generators: 
 [[[4, 0], [0, 1]]]
```


I marked the ticket as "defect", since returning a string rather than an element is nasty.

The patch depends on #10496, that cleans up the generic code for maps.


---

Comment by SimonKing created at 2011-01-19 14:03:52

Depends on #10496. Improves performance of matrix group homomorphisms


---

Attachment

Depends on #10496

(for the patchbot)


---

Comment by SimonKing created at 2011-01-19 14:04:39

Changing status from new to needs_review.


---

Comment by SimonKing created at 2011-01-19 14:07:46

Remark: So far, I only doc-tested `sage.groups`.


---

Comment by robertwb created at 2011-01-27 06:02:13

Changing status from needs_review to positive_review.


---

Comment by robertwb created at 2011-01-27 06:02:13

Much nicer.


---

Comment by jdemeyer created at 2011-02-07 08:15:47

Resolution: fixed
