# Issue 17874: Polynomial ring reverse: Consistency in optional degree-at-which-to-reverse keyword

Issue created by migration from https://trac.sagemath.org/ticket/18111

Original creator: jsrn

Original creation time: 2015-04-02 15:15:12

Keywords: polynomial,sagedays66

Currently we have


```
        sage: Fx.<x> = GF(2)[]
        sage: p = x + 1
        sage: p.reverse(degree=5)
        x^5 + x^4
```


However:

```
        sage: Qx.<x> = QQ[]
        sage: p = x + 2
        sage: p.reverse(n=5)
        2*x^4 + x^3
```


So not only is the name of the optional arguments different, it also has subtly different semantics.

The optional argument should be the same, and `degree` makes most sense, and the behaviour should be the same.

Overview of some other base rings:

* `ZZ` is like `GF(2)`
* `RR` takes NO keyword
* `CC` is like `GF(2)`
* `GF(p^m)` is like `GF(2)`
* generic base ring is like `GF(2)`

Are there other to check?



---

Comment by vdelecroix created at 2015-04-03 08:19:56

Changing keywords from "polynomial,sagedays66" to "polynomial,sd66".
