# Issue 32327: Lopsided roundtrips of heaviside

Issue created by migration from https://trac.sagemath.org/ticket/32564

Original creator: mkoeppe

Original creation time: 2021-09-25 18:58:17


```
sage: heaviside(0)
heaviside(0)
sage: RR(heaviside(0))
TypeError: Cannot evaluate symbolic expression to a numeric value.
sage: heaviside(0)._maxima_()
1/2
sage: simplify(heaviside(0))
1/2
sage: heaviside(0)._giac_()
1
sage: heaviside(0)._sympy_()       # with current sympy (1.8)
Heaviside(0)
sage: heaviside(0)._sympy_()._sage_()
heaviside(0)
sage: heaviside(0)._sympy_()       # with sympy 1.9rc1
1/2
```


