# Issue 31198: Can't scale tuples of mismatched-dimension matrices

archive/issues_031198.json:
```json
{
    "body": "If we take the Cartesian product of two vector spaces over the same base ring, then their elements (i.e. pairs, triples, etc.) can be scaled even when the dimensions of the vector spaces differ:\n\n\n```\nsage: V1 = VectorSpace(QQ,2)                                                    \nsage: V2 = VectorSpace(QQ,3)                                                    \nsage: V = cartesian_product([V1,V2])                                            \nsage: 2*V(((1,2),(3,4,5)))                                                      \n((2, 4), (6, 8, 10))\nsage: V(((1,2),(3,4,5)))*2                                                      \n((2, 4), (6, 8, 10))\n```\n\n\nThis is good. The same thing does not work for matrix spaces:\n\n\n```\nsage: M1 = MatrixSpace(QQ,2)                                                    \nsage: M2 = MatrixSpace(QQ,3)                                                    \nsage: M = cartesian_product([M1,M2])                                            \nsage: 2*M((M1.one(),M2.one()))                                                  \n---------------------------------------------------------------------------\nTypeError                                 Traceback (most recent call last)\n...\nTypeError: unsupported operand parent(s) for *: 'Integer Ring' and 'The Cartesian product of (Full MatrixSpace of 2 by 2 dense matrices over Rational Field, Full MatrixSpace of 3 by 3 dense matrices over Rational Field)'\n```\n\n\nThis is bad. Curiously, it works if we mix vector and matrix spaces:\n\n\n```\nsage: Z = cartesian_product([V1,M2])                                            \nsage: 2*Z(((1,2),M2.one()))                                                     \n((2, 4), [2 0 0]\n[0 2 0]\n[0 0 2])\nsage: Z(((1,2),M2.one()))*2                                                     \n((2, 4), [2 0 0]\n[0 2 0]\n[0 0 2])\n```\n\n\nSomeone has already decided this is mathematically OK, so it would be nice if it worked with two matrix spaces.\n\nIssue created by migration from https://trac.sagemath.org/ticket/31435\n\n",
    "created_at": "2021-02-25T20:50:41Z",
    "labels": [
        "linear algebra",
        "major",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-9.8",
    "title": "Can't scale tuples of mismatched-dimension matrices",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/31198",
    "user": "@orlitzky"
}
```
If we take the Cartesian product of two vector spaces over the same base ring, then their elements (i.e. pairs, triples, etc.) can be scaled even when the dimensions of the vector spaces differ:


```
sage: V1 = VectorSpace(QQ,2)                                                    
sage: V2 = VectorSpace(QQ,3)                                                    
sage: V = cartesian_product([V1,V2])                                            
sage: 2*V(((1,2),(3,4,5)))                                                      
((2, 4), (6, 8, 10))
sage: V(((1,2),(3,4,5)))*2                                                      
((2, 4), (6, 8, 10))
```


This is good. The same thing does not work for matrix spaces:


```
sage: M1 = MatrixSpace(QQ,2)                                                    
sage: M2 = MatrixSpace(QQ,3)                                                    
sage: M = cartesian_product([M1,M2])                                            
sage: 2*M((M1.one(),M2.one()))                                                  
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)
...
TypeError: unsupported operand parent(s) for *: 'Integer Ring' and 'The Cartesian product of (Full MatrixSpace of 2 by 2 dense matrices over Rational Field, Full MatrixSpace of 3 by 3 dense matrices over Rational Field)'
```


This is bad. Curiously, it works if we mix vector and matrix spaces:


```
sage: Z = cartesian_product([V1,M2])                                            
sage: 2*Z(((1,2),M2.one()))                                                     
((2, 4), [2 0 0]
[0 2 0]
[0 0 2])
sage: Z(((1,2),M2.one()))*2                                                     
((2, 4), [2 0 0]
[0 2 0]
[0 0 2])
```


Someone has already decided this is mathematically OK, so it would be nice if it worked with two matrix spaces.

Issue created by migration from https://trac.sagemath.org/ticket/31435





---

archive/issue_comments_445943.json:
```json
{
    "body": "It even works for non-square matrix spaces?\n\n\n```\nsage: m = matrix(QQ, [[1,2],[3,4],[5,6]])                                       \nsage: M = cartesian_product([m.parent(), m.parent()])                           \nsage: 2*M((m,m))                                                                \n([ 2  4]\n[ 6  8]\n[10 12], [ 2  4]\n[ 6  8]\n[10 12])\n```\n",
    "created_at": "2021-02-26T17:50:20Z",
    "issue": "https://github.com/sagemath/sagetest/issues/31198",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/31198#issuecomment-445943",
    "user": "@orlitzky"
}
```

It even works for non-square matrix spaces?


```
sage: m = matrix(QQ, [[1,2],[3,4],[5,6]])                                       
sage: M = cartesian_product([m.parent(), m.parent()])                           
sage: 2*M((m,m))                                                                
([ 2  4]
[ 6  8]
[10 12], [ 2  4]
[ 6  8]
[10 12])
```




---

archive/issue_comments_445944.json:
```json
{
    "body": "The difference between the square and non-square matrices looks like it comes down to a missing `one_basis()` for square matrices:\n\n\n```\nsage: n = matrix(QQ, [[1,2],[3,4]])                                                                                                                                          \nsage: n.parent().basis()                                                                                                                                                     \nFinite family {(0, 0): [1 0]\n[0 0], (0, 1): [0 1]\n[0 0], (1, 0): [0 0]\n[1 0], (1, 1): [0 0]\n[0 1]}\nsage: n.parent().one_basis()                                                                                                                                                 \n---------------------------------------------------------------------------\nTypeError                                 Traceback (most recent call last)\n<ipython-input-53-e607727fe63d> in <module>\n----> 1 n.parent().one_basis()\n\nTypeError: 'NotImplementedType' object is not callable\n```\n\n\nSince the square matrices form an algebra (where \"one\" makes sense), that method gets called somewhere. My guess is that this crashes the coercion model in a way that it's not expecting; whereas the non-square matrices crash it in a way that it does expect.\n\nMore food for thought: non-square matrices don't work either, if you use rationals instead of integers:\n\n\n```\nsage: m = matrix(QQ, [[1,2],[3,4],[5,6]])                                                                                                                                    \nsage: M = cartesian_product([m.parent(), m.parent()])                                                                                                                        \nsage: 2*M((m,m))\n([ 2  4]\n[ 6  8]\n[10 12], [ 2  4]\n[ 6  8]\n[10 12])\nsage: QQ(2)*M((m,m))\nTypeError                                 Traceback (most recent call last)\n...\nTypeError: unsupported operand parent(s) for *: 'Rational Field' and 'The Cartesian product of (Full MatrixSpace of 3 by 2 dense matrices over Rational Field, Full MatrixSpace of 3 by 2 dense matrices over Rational Field)'\n```\n\n\nThat should of course work just as well as an integer...",
    "created_at": "2021-02-28T04:03:47Z",
    "issue": "https://github.com/sagemath/sagetest/issues/31198",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/31198#issuecomment-445944",
    "user": "@orlitzky"
}
```

The difference between the square and non-square matrices looks like it comes down to a missing `one_basis()` for square matrices:


```
sage: n = matrix(QQ, [[1,2],[3,4]])                                                                                                                                          
sage: n.parent().basis()                                                                                                                                                     
Finite family {(0, 0): [1 0]
[0 0], (0, 1): [0 1]
[0 0], (1, 0): [0 0]
[1 0], (1, 1): [0 0]
[0 1]}
sage: n.parent().one_basis()                                                                                                                                                 
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)
<ipython-input-53-e607727fe63d> in <module>
----> 1 n.parent().one_basis()

TypeError: 'NotImplementedType' object is not callable
```


Since the square matrices form an algebra (where "one" makes sense), that method gets called somewhere. My guess is that this crashes the coercion model in a way that it's not expecting; whereas the non-square matrices crash it in a way that it does expect.

More food for thought: non-square matrices don't work either, if you use rationals instead of integers:


```
sage: m = matrix(QQ, [[1,2],[3,4],[5,6]])                                                                                                                                    
sage: M = cartesian_product([m.parent(), m.parent()])                                                                                                                        
sage: 2*M((m,m))
([ 2  4]
[ 6  8]
[10 12], [ 2  4]
[ 6  8]
[10 12])
sage: QQ(2)*M((m,m))
TypeError                                 Traceback (most recent call last)
...
TypeError: unsupported operand parent(s) for *: 'Rational Field' and 'The Cartesian product of (Full MatrixSpace of 3 by 2 dense matrices over Rational Field, Full MatrixSpace of 3 by 2 dense matrices over Rational Field)'
```


That should of course work just as well as an integer...



---

archive/issue_comments_445945.json:
```json
{
    "body": "Adding `one_basis()` for square matrix spaces isn't even enough to fix integer scaling. The Cartesian product is then missing `_indices`, which causes a crash somewhere else, so something further is missing from the category mumbo jumbo in square matrix spaces.",
    "created_at": "2021-02-28T14:14:07Z",
    "issue": "https://github.com/sagemath/sagetest/issues/31198",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/31198#issuecomment-445945",
    "user": "@orlitzky"
}
```

Adding `one_basis()` for square matrix spaces isn't even enough to fix integer scaling. The Cartesian product is then missing `_indices`, which causes a crash somewhere else, so something further is missing from the category mumbo jumbo in square matrix spaces.



---

archive/issue_comments_445946.json:
```json
{
    "body": "Moving to 9.4, as 9.3 has been released.",
    "created_at": "2021-05-10T17:42:09Z",
    "issue": "https://github.com/sagemath/sagetest/issues/31198",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/31198#issuecomment-445946",
    "user": "@mkoeppe"
}
```

Moving to 9.4, as 9.3 has been released.
