# Issue 12099: coercion and conversion for relativize

archive/issues_012099.json:
```json
{
    "body": "Assignee: davidloeffler\n\nKeywords: relativize conversion coercion number field\n\nThere is no coercion and conversion for fields constructed by relativize, even though the structure morphisms are present:\n\n```\nsage: L.<a> = NumberField(x^3+2)\nsage: L_rel = L.relativize(1,'b')\nsage: b = L_rel.gen()\nsage: L(b)\n# Falls back to the generic code from #11869, which fails with\n# TypeError: No compatible natural embeddings found for Number Field in a with defining polynomial x^3 + 2 and Number Field in b0 with defining polynomial x^3 + 2 over its base field\nsage: L_rel.structure()[0](b)\n# a\nsage: L_rel(a)\n# Does not even fall back to the generic code from #11869\n# TypeError: Cannot coerce element into this number field\nsage: L_rel.structure()[1](a)\n# b0\nsage: b\n# b0\nsage: a+b\n# TypeError: unsupported operand parent(s) for '+': 'Number Field in a with defining polynomial x^3 + 2' and 'Number Field in b0 with defining polynomial x^3 + 2 over its base field'\n```\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/12271\n\n",
    "created_at": "2012-01-06T11:08:09Z",
    "labels": [
        "number fields",
        "major",
        "enhancement"
    ],
    "title": "coercion and conversion for relativize",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/12099",
    "user": "mstreng"
}
```
Assignee: davidloeffler

Keywords: relativize conversion coercion number field

There is no coercion and conversion for fields constructed by relativize, even though the structure morphisms are present:

```
sage: L.<a> = NumberField(x^3+2)
sage: L_rel = L.relativize(1,'b')
sage: b = L_rel.gen()
sage: L(b)
# Falls back to the generic code from #11869, which fails with
# TypeError: No compatible natural embeddings found for Number Field in a with defining polynomial x^3 + 2 and Number Field in b0 with defining polynomial x^3 + 2 over its base field
sage: L_rel.structure()[0](b)
# a
sage: L_rel(a)
# Does not even fall back to the generic code from #11869
# TypeError: Cannot coerce element into this number field
sage: L_rel.structure()[1](a)
# b0
sage: b
# b0
sage: a+b
# TypeError: unsupported operand parent(s) for '+': 'Number Field in a with defining polynomial x^3 + 2' and 'Number Field in b0 with defining polynomial x^3 + 2 over its base field'
```


Issue created by migration from https://trac.sagemath.org/ticket/12271





---

archive/issue_comments_140263.json:
```json
{
    "body": "See also #12269",
    "created_at": "2012-01-06T11:09:28Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12099",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12099#issuecomment-140263",
    "user": "mstreng"
}
```

See also #12269
