# Issue 25668: Missing translation of FriCAS result

Issue created by migration from Trac.

Original creator: @nasser1

Original creation time: 2018-07-23 15:21:14

CC:  mantepse

Keywords: fricas,integrate

I am not sure what is missing translation from FriCAS result to [SageMath](SageMath) here, and do not know if this is known of not. Thought to report it just in case but feel free to close if this is known.

Large number of such integrals fail because of this. Here is an example



```
SageMath version 8.3.rc2, Release Date: 2018-07-22   

sage: var('a d x c')
(a, d, x, c)
sage: integrate((I*a*tan(d*x + c) + a)^3*tan(d*x + c),x, algorithm="fricas")

```


Which gives



```
NotImplementedError                       Traceback (most recent call last)
<ipython-input-2-f02be8032da4> in <module>()
----> 1 integrate((I*a*tan(d*x + c) + a)**Integer(3)*tan(d*x + c),x, algorithm="fricas")

/usr/lib/python2.7/site-packages/sage/misc/functional.py in integral(x, *args, **kwds)
    751     """
    752     if hasattr(x, 'integral'):
--> 753         return x.integral(*args, **kwds)
    754     else:
    755         from sage.symbolic.ring import SR

/usr/lib/python2.7/site-packages/sage/symbolic/expression.pyx in sage.symbolic.expression.Expression.integral (build/cythonized/sage/symbolic/expression.cpp:69759)()
  12364                     R = ring.SR
  12365             return R(integral(f, v, a, b, **kwds))
> 12366         return integral(self, *args, **kwds)
  12367 
  12368     integrate = integral

/usr/lib/python2.7/site-packages/sage/symbolic/integration/integral.py in integrate(expression, v, a, b, algorithm, hold)
    814         if not integrator:
    815             raise ValueError("Unknown algorithm: %s" % algorithm)
--> 816         return integrator(expression, v, a, b)
    817     if a is None:
    818         return indefinite_integral(expression, v, hold=hold)

/usr/lib/python2.7/site-packages/sage/symbolic/integration/external.py in fricas_integrator(expression, v, a, b, noPole)
    189                          " in the integration interval")
    190 
--> 191     return result.sage()
    192 
    193 

/usr/lib/python2.7/site-packages/sage/interfaces/interface.py in sage(self, *args, **kwds)
   1049             [0 0]
   1050         """
-> 1051         return self._sage_(*args, **kwds)
   1052 
   1053     def __repr__(self):

/usr/lib/python2.7/site-packages/sage/interfaces/fricas.py in _sage_(self)
   1443             return R(unparsed_InputForm)
   1444 
-> 1445         raise NotImplementedError("The translation of the FriCAS object %s to sage is not yet implemented." %(unparsed_InputForm))
   1446 
   1447 

NotImplementedError: The translation of the FriCAS object sage2 to sage is not yet implemented.
sage: 


```


The above works OK in friCAS itself:



```
>fricas
AXIOM="/usr/lib/fricas/target/x86_64-linux-gnu"
spad-lib="/usr/lib/fricas/target/x86_64-linux-gnu/lib/libspad.so"
                       FriCAS Computer Algebra System 
                            Version: FriCAS 1.3.4
                   Timestamp: Thu Jun 28 08:31:47 CDT 2018
(3) -> r:=integrate((I*a*tan(d*x + c) + a)^3*tan(d*x + c),x);
(4) -> unparse(r::InputForm) 

   (4)
  "((9*I^2+(-3))*a^3*log(1/(tan(d*x+c)^2+1))+(2*I^3*a^3*tan(d*x+c)^3+9*I^2*a^3*
  tan(d*x+c)^2+((-6)*I^3+18*I)*a^3*tan(d*x+c)+(6*I^3+(-18)*I)*a^3*d*x))/(6*d)"

```



Is it the complex number I which is causing the translation back to [SageMath](SageMath)?


---

Comment by mantepse created at 2018-07-23 20:46:01

It's a mix of two problems:

There is a strange problem in FriCAS:

```
(1) -> f := (%i*a*tan(d*x + c) + a)^3*tan(d*x + c)

   (1)
           3            4      3            3         3            2
     - %i a tan(d x + c)  - 3 a tan(d x + c)  + 3 %i a tan(d x + c)
   + 
      3
     a tan(d x + c)
                                           Type: Expression(Complex(Integer))
(2) -> integrate(f, x)
 
   >> System error:
   arithmetic error DIVISION-BY-ZERO signalled
Operation was (/ -2 0).
```


and, of course, the error handling of the sage-FriCAS interface is less than perfect.

I'll report the bug on the FriCAS list.


---

Comment by mantepse created at 2018-07-24 10:44:55

See https://groups.google.com/forum/#!topic/fricas-devel/TaduS9mswqE


---

Comment by chapoton created at 2020-12-26 18:14:08

works now (9.2.b4)

```
sage: var('a d x c')                                                            
(a, d, x, c)
sage: integrate((I*a*tan(d*x + c) + a)^3*tan(d*x + c),x, algorithm="fricas")    
-2/3*(24*a^3*e^(4*I*d*x + 4*I*c) + 33*a^3*e^(2*I*d*x + 2*I*c) + 13*a^3 + 6*(a^3*e^(6*I*d*x + 6*I*c) + 3*a^3*e^(4*I*d*x + 4*I*c) + 3*a^3*e^(2*I*d*x + 2*I*c) + a^3)*log(e^(2*I*d*x + 2*I*c) + 1))/(d*e^(6*I*d*x + 6*I*c) + 3*d*e^(4*I*d*x + 4*I*c) + 3*d*e^(2*I*d*x + 2*I*c) + d)
```



---

Comment by @nasser1 created at 2020-12-26 18:53:01

Replying to [comment:6 chapoton]:
> works now (9.2.b4)
> {{{
> sage: var('a d x c')                                                            
> (a, d, x, c)
> sage: integrate((I*a*tan(d*x + c) + a)^3*tan(d*x + c),x, algorithm="fricas")    
> -2/3*(24*a<sup>3*e</sup>(4*I*d*x + 4*I*c) + 33*a<sup>3*e</sup>(2*I*d*x + 2*I*c) + 13*a^3 + 6*(a<sup>3*e</sup>(6*I*d*x + 6*I*c) + 3*a<sup>3*e</sup>(4*I*d*x + 4*I*c) + 3*a<sup>3*e</sup>(2*I*d*x + 2*I*c) + a<sup>3)*log(e</sup>(2*I*d*x + 2*I*c) + 1))/(d*e^(6*I*d*x + 6*I*c) + 3*d*e^(4*I*d*x + 4*I*c) + 3*d*e^(2*I*d*x + 2*I*c) + d)
> }}}

Thanks. It is also working on V 9.2 on Linux:



```
>sage
┌────────────────────────────────────────────────────────────────────┐
│ SageMath version 9.2, Release Date: 2020-10-24                     │
│ Using Python 3.8.6. Type "help()" for help.                        │
└────────────────────────────────────────────────────────────────────┘
sage:  var('a d x c')
(a, d, x, c)
sage: integrate((I*a*tan(d*x + c) + a)^3*tan(d*x + c),x,algorithm="fricas")
-2/3*(24*a^3*e^(4*I*d*x + 4*I*c) + 33*a^3*e^(2*I*d*x + 2*I*c) + 13*a^3 + 6*(a^3*e^(6*I*d*x + 6*I*c) + 3*a^3*e^(4*I*d*x + 4*I*c) + 3*a^3*e^(2*I*d*x + 2*I*c) + a^3)*log(e^(2*I*d*x + 2*I*c) + 1))/(d*e^(6*I*d*x + 6*I*c) + 3*d*e^(4*I*d*x + 4*I*c) + 3*d*e^(2*I*d*x + 2*I*c) + d)
sage: 


```



---

Comment by mantepse created at 2020-12-26 21:08:02

I don't know in which release of FriCAS this was fixed, though.


---

Comment by mantepse created at 2020-12-26 21:08:02

Changing status from new to needs_review.


---

Comment by chapoton created at 2020-12-26 21:14:18

this need a doctest


---

Comment by mantepse created at 2021-01-02 15:57:02

I was unable to find a simple way to verify the integral.  I did some random checks, though.
----
New commits:


---

Comment by chapoton created at 2021-01-02 18:59:48

Changing status from needs_review to positive_review.


---

Comment by chapoton created at 2021-01-02 18:59:48

ok, thx


---

Comment by vbraun created at 2021-01-04 22:37:18

Resolution: fixed
