# Issue 11264: Fix R reading files

Issue created by migration from https://trac.sagemath.org/ticket/11436

Original creator: kcrisman

Original creation time: 2011-06-07 02:51:55

Assignee: was

CC:  jhpalmieri jason was

The current way we configure the R Pexpect interface is to have a 1024 character cutoff to trying to read from a file. 

Problem: this doesn't actually seem to work.

```

    sage: s = 'matrix(c(1, 1, 1, 1,' + ' '*987 + '2,2,2,2), ncol=4)' 
    sage: len(s) 
    1024 
    sage: r.eval(s) 
    '     [,1] [,2] [,3] [,4]\n[1,]    1    1    2    2\n[2,]    1    1     
2    2' 
    sage: s = 'matrix(c(1, 1, 1, 1,' + ' '*988 + '2,2,2,2), ncol=4)' 
    sage: len(s) 
    1025 
    sage: r.eval(s) 
    '' 
```


jhpalmieri helped track this down.  See [this sage-support thread](http://groups.google.com/group/sage-support/browse_thread/thread/daa01227a8c4865d) for more details.  

Helpful links:
 * [doc for R source command](http://rss.acs.unt.edu/Rdoc/library/base/html/source.html)
 * [doc for R file command(s)](http://rss.acs.unt.edu/Rdoc/library/base/html/connections.html)

It seems like everything is creating files as should be, and using the verbose option to source shows that at least something's being computed, but the result is not showing up in Sage, possibly due to misuse of "source", or "file".


---

Comment by kcrisman created at 2011-06-07 02:57:36

In fact, the file part of what we use doesn't even seem to be necessary.  The option we need is `print.eval=TRUE`.

```
sage: r.eval('source(file="/Users/.../48141//interface//tmp48141",local=TRUE)')
''
sage: r.eval('source(file="/Users/.../48141//interface//tmp48141",print.eval=TRUE)')
'[1] 1 2 3'
```



---

Comment by kcrisman created at 2011-06-07 03:08:02

Yes, and this fixes the original problem too.

The only issue is that 

```

        """
        Reads filename into the R interpreter by calling R's source function on a
        read-only file connection.

        EXAMPLES:
            sage: filename = tmp_filename()
            sage: f = open(filename, 'w')
            sage: f.write('a <- 2+2\n')
            sage: f.close()
            sage: r.read(filename)
            sage: r.get('a')
            '[1] 4'
        """
```

So the idea is perhaps that we do NOT see the output from such an evaluation.  The problem is that then one has to know that one should assign the big computation to a name via `variable <- command`, and that is not obvious.

What is the best solution here?  To change the reading of lines or to make the documentation REALLY clear?  My preference would be to have long commands still output, just like short commands; it seems unfair to have them suddenly do this.


---

Comment by kcrisman created at 2011-06-07 03:08:39

Based on 4.4.4, but hopefully still applies...


---

Attachment

Possible patch uploaded.  Probably needs more documentation, but it fixed my problem locally so I'm going to bed.  Suggestions welcome.


---

Comment by kcrisman created at 2012-05-21 13:16:50

Changing keywords from "" to "r-project".


---

Comment by kcrisman created at 2012-05-21 13:18:15

See [this sage-devel thread](http://groups.google.com/group/sage-devel/browse_thread/thread/969ae6a98e0b74b6) for what I believe is this same problem.
