# Issue 33766: ECL crash with simple Taylor expansion

archive/issues_033766.json:
```json
{
    "body": "with Sage 9.5:\n\n```\nsage: e=(1/9007199254740992*x + 137746446019/274877906944)^(3733441697325247/4503599627370496)\nsage: taylor(e,x,0,2)\n...\nTypeError: ECL says: Memory limit reached. Please jump to an outer pointer, quit program and enlarge the\n```\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/34003\n\n",
    "created_at": "2022-06-16T12:56:18Z",
    "labels": [
        "calculus",
        "major",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-9.8",
    "title": "ECL crash with simple Taylor expansion",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/33766",
    "user": "@zimmermann6"
}
```
with Sage 9.5:

```
sage: e=(1/9007199254740992*x + 137746446019/274877906944)^(3733441697325247/4503599627370496)
sage: taylor(e,x,0,2)
...
TypeError: ECL says: Memory limit reached. Please jump to an outer pointer, quit program and enlarge the
```


Issue created by migration from https://trac.sagemath.org/ticket/34003





---

archive/issue_comments_480106.json:
```json
{
    "body": "This happens in maxima as well, so I think it's upstream:\n\n\n```\n(%i1) f: (1/9007199254740992*x + 137746446019/274877906944)^(3733441697325247/4503599627370496);\n              x           137746446019 3733441697325247/4503599627370496\n(%o1) (---------------- + ------------)\n       9007199254740992   274877906944\n(%i2) taylor(f,x,0,2);\nMaxima encountered a Lisp error:\n\n Memory limit reached. Please jump to an outer pointer, quit program and enlarge the\nmemory limits before executing the program again.\n\n```\n",
    "created_at": "2022-06-16T15:55:00Z",
    "issue": "https://github.com/sagemath/sagetest/issues/33766",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/33766#issuecomment-480106",
    "user": "@nbruin"
}
```

This happens in maxima as well, so I think it's upstream:


```
(%i1) f: (1/9007199254740992*x + 137746446019/274877906944)^(3733441697325247/4503599627370496);
              x           137746446019 3733441697325247/4503599627370496
(%o1) (---------------- + ------------)
       9007199254740992   274877906944
(%i2) taylor(f,x,0,2);
Maxima encountered a Lisp error:

 Memory limit reached. Please jump to an outer pointer, quit program and enlarge the
memory limits before executing the program again.

```




---

archive/issue_comments_480107.json:
```json
{
    "body": "Work-arounds also have problems:\n\n```\nsage: R.<t>=QQbar[[]]\nsage: c=(1/9007199254740992*t + 137746446019/274877906944)+O(t^2)\nsage: c^(3733441697325247/4503599627370496)\nOverflowError: value too large to convert to int\n```\n\n(the problem is that taking an n-th root expects an \"int\" and the denominator of the exponent here is too large for that)\nso I'm not so sure the example is a \"simple\" Taylor series expansion as claimed in the title :-). Or is this a technical term?\n\n**Edit:** Regardless of whether it's simple or not, it's an entirely reasonable example. It does look like it may be escaping some assumptions that existing code may be making; possibly for efficiency or ease-of-implementation reasons. So there's a real possibility a fix needs a different implementation rather than a small bugfix.",
    "created_at": "2022-06-16T17:12:32Z",
    "issue": "https://github.com/sagemath/sagetest/issues/33766",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/33766#issuecomment-480107",
    "user": "@nbruin"
}
```

Work-arounds also have problems:

```
sage: R.<t>=QQbar[[]]
sage: c=(1/9007199254740992*t + 137746446019/274877906944)+O(t^2)
sage: c^(3733441697325247/4503599627370496)
OverflowError: value too large to convert to int
```

(the problem is that taking an n-th root expects an "int" and the denominator of the exponent here is too large for that)
so I'm not so sure the example is a "simple" Taylor series expansion as claimed in the title :-). Or is this a technical term?

**Edit:** Regardless of whether it's simple or not, it's an entirely reasonable example. It does look like it may be escaping some assumptions that existing code may be making; possibly for efficiency or ease-of-implementation reasons. So there's a real possibility a fix needs a different implementation rather than a small bugfix.



---

archive/issue_comments_480108.json:
```json
{
    "body": "this is an example which arises in my research. Computing by hand the Taylor expansion with `diff` works well.",
    "created_at": "2022-06-17T06:11:04Z",
    "issue": "https://github.com/sagemath/sagetest/issues/33766",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/33766#issuecomment-480108",
    "user": "@zimmermann6"
}
```

this is an example which arises in my research. Computing by hand the Taylor expansion with `diff` works well.
