# Issue 25331: regression between 8.0 and 8.2

Issue created by migration from Trac.

Original creator: zimmerma

Original creation time: 2018-06-13 07:55:28

CC:  rws

this used to work in 8.0:

```
sage: a=650824205667/2^52;b=4507997673885435/2^51
sage: z=sqrt(a+i*b)
sage: a=RR(a);b=RR(b);s=a^2+b^2;rho=sqrt(s);nu=rho+a;x=sqrt(nu/2);y=b/(2*x)
sage: RR((y.exact_rational()-z.imag())/z.imag())*2^53
3.99819260752485
```

With Sage 8.2 we get for the last command:

```
sage: RR((y.exact_rational()-z.imag())/z.imag())*2^53
---------------------------------------------------------------------------
RuntimeError                              Traceback (most recent call last)
<ipython-input-34-0d9f9c6adca1> in <module>()
----> 1 RR((y.exact_rational()-z.imag())/z.imag())*Integer(2)**Integer(53)

/usr/local/sage-8.2/local/lib/python2.7/site-packages/sage/structure/element.pyx in sage.structure.element.Element.__div__ (build/cythonized/sage/structure/element.c:12773)()
   1660         cdef int cl = classify_elements(left, right)
   1661         if HAVE_SAME_PARENT(cl):
-> 1662             return (<Element>left)._div_(right)
   1663         if BOTH_ARE_ELEMENT(cl):
   1664             return coercion_model.bin_op(left, right, div)

/usr/local/sage-8.2/local/lib/python2.7/site-packages/sage/symbolic/expression.pyx in sage.symbolic.expression.Expression._div_ (build/cythonized/sage/symbolic/expression.cpp:25729)()
   3534                 raise ZeroDivisionError("Symbolic division by zero")
   3535             else:
-> 3536                 raise
   3537         finally:
   3538             sig_off()

/usr/local/sage-8.2/local/lib/python2.7/site-packages/sage/symbolic/expression.pyx in sage.symbolic.expression.Expression._div_ (build/cythonized/sage/symbolic/expression.cpp:25625)()
   3526                                o)
   3527             else:
-> 3528                 x = left._gobj / _right._gobj
   3529             return new_Expression_from_GEx(left._parent, x)
   3530         except Exception as msg:

RuntimeError: unsupported type in numeric::lcm
```



---

Comment by jdemeyer created at 2018-06-13 09:29:17

Changing component from basic arithmetic to symbolics.


---

Comment by zimmerma created at 2018-06-13 09:49:44

thank you Jeroen for analyzing the issue!


---

Comment by rws created at 2018-06-13 13:31:46

It looks like https://github.com/pynac/pynac/issues/179 is not properly resolved. In pynac-0.7.21 this no longer crashes and is generally improved but the problem of `Expression` Python objects as numeric persists:

```
sage: z
1/2*sqrt(sqrt(2))*sqrt(-sqrt(2) + 2)
sage: w
1/2*2^(1/4)*sqrt(-sqrt(2) + 2)
sage: (1/2-z)/z
-(sqrt(sqrt(2))*sqrt(-sqrt(2) + 2) - 1)/(sqrt(sqrt(2))*sqrt(-sqrt(2) + 2))
sage: (1/2-w)/w
-1/2*2^(3/4)*(2^(1/4)*sqrt(-sqrt(2) + 2) - 1)/sqrt(-sqrt(2) + 2)
```

What happens is that eventually Pynac needs the absolute value of a `NumberFieldElement` like `1+I` and in `numeric::abs` calls `PyNumber_Absolute` which in Python is `number_field_element_quadratic.pyx:NumberFieldElement_quadratic::__abs__()`. This returns `(self.real()**2 + self.imag()**2).sqrt()` which itself is a symbolic expression Python object. Pynac's `numeric::abs` is not aware of the type of Python object and puts it, as it does with all other Python objects, in a `numeric` which becomes part of the result expression:

```
sage: abs(1+I)
sqrt(2)
sage: _._dbgprinttree()
sqrt(2) (numeric) `@`0x40ee870, hash=0x678dde6e5fd29f08, flags=0x1, type PYOBJECT: "<type 'sage.symbolic.expression.Expression'>"
```



---

Comment by rws created at 2018-06-13 13:42:25

This means the specific issue is improved with #24838 but not completely resolved:

```
sage: sage: z = sqrt(1+I).imag()
....: sage: w = z.simplify()
....: 
sage: (1/2-z)/2
-1/4*sqrt(sqrt(2))*sqrt(-sqrt(2) + 2) + 1/4
sage: (1/2-w)/2
-1/4*2^(1/4)*sqrt(-sqrt(2) + 2) + 1/4
```



---

Comment by vdelecroix created at 2018-08-03 19:20:18

update milestone 8.3 -> 8.4
