# Issue 28729: Provide unicode aliases for some globals in Python 3

Issue created by migration from https://trac.sagemath.org/ticket/28966

Original creator: embray

Original creation time: 2020-01-07 15:15:24

CC:  @mwageringel tscrim nthiery

This is something that's been discussed before but I don't think there's a ticket for it.

Python 3 allows most unicode symbols (except some digit characters, whitespace and other oddities) to be used in identifiers, so we can easily provide unicode aliases for some common built-ins, e.g.


```
Ï€ = pi
â„¯ = e
ð’¾ = I
â„¤ = ZZ
â„š = QQ
```

etc.  One can have fun with it.

In Python 3 it is also possible to do tab-completion for many unicode characters: https://ipython.readthedocs.io/en/stable/api/generated/IPython.core.completer.html#latex-and-unicode-completion

This enables nice-looking code like:


```
sage: sin(Ï€)
0
sage: cos(Ï€)
-1
```


There were some things I found lacking, but this list can easily be expanded by modifying the dict in `IPython.completer.latex_symbols`.


---

Comment by mkoeppe created at 2020-04-14 19:41:51

Batch modifying tickets that will likely not be ready for 9.1, based on a review of the ticket title, branch/review status, and last modification date.


---

Comment by @mwageringel created at 2020-07-11 13:33:49

Replying to [ticket:28966 embray]:
> {{{
> â„¯ = e
> ð’¾ = I
> â„¤ = ZZ
> â„š = QQ
> }}}

Due to identifier normalization, these four identifiers are actually the same as their ASCII equivalents. For example:

```
sage: Q = 42
sage: â„š
42
```



---

Comment by mkoeppe created at 2020-08-09 16:25:59

New commits:


---

Comment by mkoeppe created at 2020-08-09 16:25:59

Changing status from new to needs_review.


---

Comment by @mwageringel created at 2020-08-13 17:27:16

Changing status from needs_review to needs_work.


---

Comment by @mwageringel created at 2020-08-13 17:27:16

There is one failing doctest. Otherwise this looks good to me.


---

Comment by mkoeppe created at 2020-08-13 18:47:58

Interactively, the failing test fails even harder:

```
sage: import_statements(pi)
TypeError: <class 'object'> is a built-in class
```



---

Comment by @mwageringel created at 2020-08-13 18:57:57

This seems to be related to https://groups.google.com/forum/#!topic/sage-devel/7qelSgBOL-0.


---

Comment by git created at 2020-08-13 19:01:50

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by mkoeppe created at 2020-08-13 19:03:04

Perhaps this fix needs to be pushed into sageinspect


---

Comment by git created at 2020-08-13 21:33:28

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by mkoeppe created at 2020-08-13 21:46:18

Changing status from needs_work to needs_review.


---

Comment by mkoeppe created at 2020-08-13 21:46:28

Replying to [comment:11 gh-mwageringel]:
> This seems to be related to https://groups.google.com/forum/#!topic/sage-devel/7qelSgBOL-0.
I'll not work on this one


---

Comment by @mwageringel created at 2020-08-14 09:12:27

Replying to [comment:16 mkoeppe]:
> I'll not work on this one

This is an upstream issue really.

This looks good to me now, so I am setting this to positive.


---

Comment by @mwageringel created at 2020-08-14 09:12:27

Changing status from needs_review to positive_review.


---

Comment by mkoeppe created at 2020-08-14 11:50:55

Thank you.


---

Comment by vbraun created at 2020-08-15 09:41:48

Resolution: fixed


---

Comment by embray created at 2020-08-19 14:08:33

Oh cool, I didn't know this was finally implemented !<sup>!</sup>


---

Comment by embray created at 2020-08-19 14:10:49

I think this should probably be mentioned in the documentation though.
