# Issue 19394: reduced_word breaks for automatic_monoids if not initialised

Issue created by migration from https://trac.sagemath.org/ticket/19631

Original creator: hivert

Original creation time: 2015-11-27 12:22:59

CC:  nthiery virmaux

Keywords: submonoids, reduced word

The following should work:

```
sage: from sage.monoids.automatic_semigroup import AutomaticSemigroup
sage: R = IntegerModRing(101)
sage: M = AutomaticSemigroup(Family({1: R(3), 2: R(5)}), one=R.one())


sage: sage: sage: e = M.from_reduced_word([1, 1, 1, 2, 2, 2])
sage: e.reduced_word()
---------------------------------------------------------------------------
AttributeError                            Traceback (most recent call last)
[...]
AttributeError: 'AutomaticMonoid_with_category.element_class' object has no attribute 'construct'
```

I'm uploading a fix.


---

Comment by hivert created at 2015-11-27 12:30:30

New commits:


---

Comment by hivert created at 2015-11-27 12:30:53

Changing status from new to needs_review.


---

Comment by tscrim created at 2015-11-27 14:05:56

LGTM (although I would have `from_reduced_word` set the `_reduced_word` attribute of the element, but that's for a different ticket).


---

Comment by tscrim created at 2015-11-27 14:13:34

Changing status from needs_review to positive_review.


---

Comment by hivert created at 2015-11-27 16:19:14

Replying to [comment:5 tscrim]:
> LGTM (although I would have `from_reduced_word` set the `_reduced_word` attribute of the element, but that's for a different ticket).

This is done by the call to `self.parent().construct(up_to=self)`:

```
sage: sage: from sage.monoids.automatic_semigroup import AutomaticSemigroup
sage: sage: R = IntegerModRing(101)
sage: sage: M = AutomaticSemigroup(Family({1: R(3), 2: R(5)}), one=R.one())
sage: sage: e = M.from_reduced_word([1, 1, 1, 2, 2, 2])
sage: e
42
sage: e.__dict__
{'_reduced_word': None}
sage: e.reduced_word()
[1, 1, 1, 2, 2, 2]
sage: e.__dict__
{'_cache__transition': {},
 '_reduced_word': [1, 1, 1, 2, 2, 2],
 'transition': Cached version of <function transition at 0x7f91a1a87a28>}
```



---

Comment by vbraun created at 2015-11-28 13:46:03

Resolution: fixed
