# Issue 12775: Bug in integrating x*cos(x^3)

Issue created by migration from https://trac.sagemath.org/ticket/12947

Original creator: kcrisman

Original creation time: 2012-05-14 12:33:57

Assignee: burcin

CC:  mjo

From this [sage-support thread](https://groups.google.com/forum/?fromgroups#!topic/sage-support/-Dzaion3VrA):

```
sage: numerical_integral(x*cos(x^3),0,.5)
(0.1247560409610376, 1.3850702913602309e-15)
sage: integrate(x*cos(x^3),(x,0,1/2)).n()
-0.0677842754623305
```

Given

```
sage: integrate(x*cos(x^3),x)
1/12*((-I*sqrt(3) - 1)*gamma(2/3, -I*x^3) + (I*sqrt(3) - 1)*gamma(2/3, I*x^3))*(x^3)^(1/3)/x
sage: integrate(x*cos(x^3),(x,0,1/2))
-1/3*gamma(2/3) + 1/6*gamma(2/3, -1/8*I) + 1/6*gamma(2/3, 1/8*I)
```

this is probably something where Maxima is returning too many imaginary things and something isn't cancelling right either there or in Sage proper?  We've had trouble with either side of this with incomplete gamma functions before.


---

Comment by kcrisman created at 2012-05-15 02:30:47


```
sage: assume(u>0)
sage: integrate(x*cos(x^3),x,0,u)
-1/3*gamma(2/3) + 1/6*gamma(2/3, -I*u^3) + 1/6*gamma(2/3, I*u^3)
```

To compare the "right" answer, do 

```
sage: f(u) = integrate(x*cos(x^3),x,0,u)
sage: plot(f,(u,0,2*pi))
sage: plot(lambda u: numerical_integral(x*cos(x^3),0,u)[0],(u,0,2*pi))
```

Note how they don't really look quite similar, not really a branch cut thing? Also, in Maxima

```
(%i2) display2d:false;
(%o2) false
(%i3) f:integrate(x*cos(x^3),x);
(%o3) (gamma_incomplete(2/3,%i*x^3)+gamma_incomplete(2/3,-%i*x^3))/6
(%i5) diff(f,x);
(%o5) (-3*%i*x*%e^(%i*x^3)/(-1)^(1/6)-3*%i*x*%e^-(%i*x^3)/(-1)^(1/6))/6
```



---

Comment by kcrisman created at 2012-05-15 14:04:13

Robert Dodier of Maxima suggests the following later in the thread.

```

(%i5) display2d:false;

(%o5) false
(%i6) integrate(x*cos(x^3),x);

(%o6) (gamma_incomplete(2/3,%i*x^3)+gamma_incomplete(2/3,-%i*x^3))/6
(%i7) domain:complex;

(%o7) complex
(%i8) integrate(x*cos(x^3),x);

(%o8) ((sqrt(3)*%i-1)*gamma_incomplete(2/3,%i*x^3)
       +(-sqrt(3)*%i-1)*gamma_incomplete(2/3,-%i*x^3))
       *(x^3)^(1/3)
       /(12*x)
```

But this doesn't resolve the original issue.

```

(%i1) display2d:false;

(%o1) false
(%i2) integrate(x*cos(x^3),x,0,1/2);

(%o2) gamma_incomplete(2/3,%i/8)/6+gamma_incomplete(2/3,-%i/8)/6-gamma(2/3)/3
(%i3) domain:complex;

(%o3) complex
(%i4) integrate(x*cos(x^3),x,0,1/2);

(%o4) gamma_incomplete(2/3,%i/8)/6+gamma_incomplete(2/3,-%i/8)/6-gamma(2/3)/3
```



---

Comment by kcrisman created at 2012-05-15 15:46:01

Robert points out that in 5.27.0 this is at least a little better, though we still need to change domain.

```

Maxima 5.27.0 http://maxima.sourceforge.net
using Lisp SBCL 1.0.24
Distributed under the GNU Public License. See the file COPYING.
Dedicated to the memory of William Schelter.
The function bug_report() provides bug reporting information.
(%i1) display2d:false;

(%o1) false
(%i2) domain:complex;

(%o2) complex
(%i3) integrate (x*cos(x^3), x, 0, 1/2); 

(%o3) %i*gamma_incomplete(2/3,%i/8)/(4*sqrt(3))
 -gamma_incomplete(2/3,%i/8)/12-%i*gamma_incomplete(2/3,-%i/8)/(4*sqrt(3))
 -gamma_incomplete(2/3,-%i/8)/12+gamma(2/3)/6
(%i4) expand(float(%));

(%o4) .1247560409610377
```



---

Comment by kcrisman created at 2012-05-15 15:50:12

But since we already use `domain:complex` in the initialization code for Maxima for integrals and such, presumably an upgrade would fix this?


---

Comment by mjo created at 2012-05-23 17:40:09

See my last comment on #11238 for why we can't have nice things.

That's the only real issue with maxima-5.27. Some messages are getting mangled e.g. when maxima asks us for more information, but they aren't substantial regressions.


---

Comment by pbruin created at 2014-05-30 22:49:36

Changing priority from major to trivial.


---

Comment by pbruin created at 2014-05-30 22:49:36

This seems to have been fixed some time ago; it works correctly in both Sage 5.13 and 6.2.

```
sage: integrate(x*cos(x^3),(x,0,1/2)).n()
0.124756040961038
```



---

Comment by pbruin created at 2014-05-30 23:09:20

Changing status from new to needs_review.


---

Comment by rws created at 2014-05-31 08:13:27

Funny I get:

```
File "src/sage/interfaces/maxima_lib.py", line 736, in sage.interfaces.maxima_lib.MaximaLib.sr_integral
Failed example:
    integrate(x*cos(x^3),(x,0,1/2)).n()
Expected:
    0.124756040961038
Got:
    0.124756040961038 + 2.77555756156289e-17*I
```

Please set positive when you think this is resolved.


---

Comment by git created at 2014-05-31 10:04:39

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by pbruin created at 2014-05-31 10:06:08

On the system I tested this on (GNU/Linux x86_64) this gives the expected answer, both with and without the Maxima upgrade of #13973.  I just checked on ARM; the first time I got the same answer as you, but then I merged this branch (did not even rebuild) and only got the expected answer from then on.  I added `# abs tol 1e-16`; can you check if this solves the problem for you?


---

Comment by kcrisman created at 2014-05-31 13:02:26

I would argue that the complex bit means that we are not quite ready to merge this if it happens on some platforms.  The question is whether this is a Maxima bug or a Sage/Pynac simplification bug.


---

Comment by rws created at 2014-05-31 13:08:00

Would you equally mind if there is a real digit wrong in the 17-th place? Regardless, it's fine on AMD now.


---

Comment by rws created at 2014-05-31 13:11:24

There are 60(!) lines in the sage code with `# abs tol` and nearly all have lower tolerance (in the sense of 'larger error')


---

Comment by pbruin created at 2014-05-31 13:27:33

The complex bit apparently comes from applying Pynac's `evalf()` to the following expression:

```
sage: e = integrate(x*cos(x^3),(x,0,1/2)); e
1/12*I*sqrt(3)*gamma(2/3, 1/8*I) - 1/12*I*sqrt(3)*gamma(2/3, -1/8*I) - 1/12*gamma(2/3, 1/8*I) - 1/12*gamma(2/3, -1/8*I) + 1/6*gamma(2/3)
sage: e.n(53)
0.124756040961038 + 2.77555756156289e-17*I
sage: e._convert({'parent': CC})  # called by .n()
0.124756040961038 + 2.77555756156289e-17*I
```

(This is on ARM; the imaginary part does not appear on x86_64.)

There are known precision problems in the incomplete Gamma function, so this may be related to #7099, although we only want the default 53 bits of precision here.


---

Comment by pbruin created at 2014-05-31 15:48:20

The presence of the imaginary part does not depend on #7099.  At least on ARM it is essentially random (maybe it depends on FPU rounding flags or something similar):

```
$ ./sage -c 'print integrate(x*cos(x^3),(x,0,1/2)).n()'
0.124756040961038
$ ./sage -c 'print integrate(x*cos(x^3),(x,0,1/2)).n()'
0.124756040961038 - 2.77555756156289e-17*I
$ ./sage -c 'print integrate(x*cos(x^3),(x,0,1/2)).n()'
0.124756040961038 - 1.38777878078145e-17*I
$ ./sage -c 'print integrate(x*cos(x^3),(x,0,1/2)).n()'
0.124756040961038 + 1.38777878078145e-17*I
```



---

Comment by kcrisman created at 2014-06-01 01:48:35

> Would you equally mind if there is a real digit wrong in the 17-th place? Regardless, it's fine on AMD now.
Haha!  No, but as I said sometimes the complex bit indicates a different kind of problem, or has in the past.  Given Peter's experiment in comment:18, though, I guess we can make that a different ticket.


---

Comment by pbruin created at 2014-06-02 00:12:44

The imaginary part turns out to be "simply" the fact that floating-point addition is not associative, and for some reason the terms in the expression `e` from comment:17 are added in random order by `.n()`.

```
sage: e = integrate(x*cos(x^3),(x,0,1/2)); e
1/12*I*sqrt(3)*gamma(2/3, 1/8*I) - 1/12*I*sqrt(3)*gamma(2/3, -1/8*I) - 1/12*gamma(2/3, 1/8*I) - 1/12*gamma(2/3, -1/8*I) + 1/6*gamma(2/3)
sage: v = [term.n() for term in e.operands()]; v
[0.0454319516149362 + 0.166098636946833*I,
 0.0454319516149362 - 0.166098636946833*I,
 -0.0958970927532841 + 0.0262301494946934*I,
 -0.0958970927532841 - 0.0262301494946934*I,
 0.225686323237733]
sage: uniq([sum(p.action(v)) for p in permutations(5)])
[0.124756040961038 - 2.77555756156289e-17*I,
 0.124756040961038,
 0.124756040961038 + 2.77555756156289e-17*I,
 0.124756040961038 - 1.38777878078145e-17*I,
 0.124756040961038,
 0.124756040961038 + 1.38777878078145e-17*I,
 0.124756040961038 - 2.77555756156289e-17*I,
 0.124756040961038,
 0.124756040961038 + 2.77555756156289e-17*I,
 0.124756040961038 - 1.38777878078145e-17*I,
 0.124756040961038 + 1.38777878078145e-17*I,
 0.124756040961038 - 2.77555756156289e-17*I,
 0.124756040961038 + 2.77555756156289e-17*I,
 0.124756040961038]
```

This gives 14 different outcomes depending on the summation order (some of the differences are hidden due to the number of digits printed).  I don't think this can be solved easily, so I propose we stick to the `# abs tol` fix.


---

Comment by git created at 2014-06-11 22:37:53

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by rws created at 2014-06-29 08:59:44

As already said ...


---

Comment by rws created at 2014-06-29 08:59:44

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2014-06-30 13:12:23

The `# abs tol` just changes how the floating point numbers are compared, it doesn't know about complex numbers. 

```
sage -t --long src/sage/interfaces/maxima_lib.py
**********************************************************************
File "src/sage/interfaces/maxima_lib.py", line 763, in sage.interfaces.maxima_lib.MaximaLib.sr_integral
Failed example:
    integrate(x*cos(x^3),(x,0,1/2)).n()  # abs tol 1e-16
Expected:
    0.124756040961038
Got:
    0.124756040961038 - 1.38777878078145e-17*I
**********************************************************************
```

and on a different machine

```
sage -t --long src/sage/interfaces/maxima_lib.py
**********************************************************************
File "src/sage/interfaces/maxima_lib.py", line 763, in sage.interfaces.maxima_lib.MaximaLib.sr_integral
Failed example:
    integrate(x*cos(x^3),(x,0,1/2)).n()  # abs tol 1e-16
Expected:
    0.124756040961038
Got:
    0.124756040961038 - 2.77555756156289e-17*I
**********************************************************************
```



---

Comment by vbraun created at 2014-06-30 13:12:34

Changing status from positive_review to needs_work.


---

Comment by git created at 2014-07-18 15:25:44

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by pbruin created at 2014-07-18 15:29:35

Changing status from needs_work to positive_review.


---

Comment by pbruin created at 2014-07-18 15:29:35

This should solve it; probably no reason to ask for another review.


---

Comment by vbraun created at 2014-07-19 04:57:53

Resolution: fixed
