# Issue 33043: sympy's And, Or, Not has no attribute _sage_()

Issue created by migration from https://trac.sagemath.org/ticket/33280

Original creator: @daju1

Original creation time: 2022-02-03 10:20:05

Examples were taken from [https://docs.sympy.org/latest/modules/logic.html](https://docs.sympy.org/latest/modules/logic.html)


```
sage: from sympy import Symbol
sage: from sympy.abc import A, B, C
sage: from sympy.logic.boolalg import And, Or, Not
sage: x = Symbol('x', real=True)
sage: sympy_and_op = And(-2 < x, x < 2)
sage: sympy_and_op
−2<𝑥∧𝑥<2
sage: sympy_and_op._sage_()
AttributeError: 'And' object has no attribute '_sage_'
```




```
sage: sympy_or_op = Or(x < -2, 2 < x)
sage: sympy_or_op𝐴∨𝐵
2<𝑥∨𝑥<−2
sage: sympy_or_op._sage_()
AttributeError: 'Or' object has no attribute '_sage_'
```




```
sage: sympy_or_op = Or(A, B)
sage: sympy_or_op
𝐴∨𝐵
sage: sympy_or_op._sage_()
AttributeError: 'Or' object has no attribute '_sage_'
```





```
sage: sympy_and_abc = And(A, B, C)
sage: sympy_and_abc
𝐴∧𝐵∧𝐶
sage: sympy_and_abc._sage_()
AttributeError: 'And' object has no attribute '_sage_'
```





```
sage: sympy_not_and_abc = Not(sympy_and_abc)
sage: sympy_not_and_abc
¬(𝐴∧𝐵∧𝐶)
sage: sympy_not_and_abc._sage_()
AttributeError: 'Not' object has no attribute '_sage_'
```





---

Comment by @daju1 created at 2022-02-03 11:02:52

Changing type from PLEASE CHANGE to task.


---

Comment by mkoeppe created at 2022-02-03 17:03:24

Yes, because Sage symbolic expressions do not have logical operators.
There is some preliminary work in this direction in #31911, which needs help.


---

Comment by mkoeppe created at 2022-02-03 18:47:38

Changing status from new to needs_review.


---

Comment by tscrim created at 2022-02-15 06:43:05

Indeed, we currently do not have the support for this. This should be taken care of in #31911.


---

Comment by tscrim created at 2022-02-15 06:43:05

Changing status from needs_review to positive_review.


---

Comment by mkoeppe created at 2022-02-26 18:53:04

Resolution: invalid
