# Issue 34100: Deprecate sage.misc.mrange.*mrange* and cartesian_product_iterator

Issue created by migration from https://trac.sagemath.org/ticket/34337

Original creator: mkoeppe

Original creation time: 2022-08-10 21:41:49

CC:  tscrim

Some of these functions are also imported into the global namespace.


---

Comment by git created at 2022-08-10 23:08:43

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by git created at 2022-08-10 23:09:29

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by git created at 2022-08-10 23:58:20

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by tscrim created at 2022-08-11 00:07:04

This isn't quite a drop-and-replace because it loses the `cardinality()` method and it doesn't allow for repeat iterations.

```
sage: I = cartesian_product_iterator([[-1, 0, 1] for i in range(1)])
sage: Ip = itertools.product([-1, 0, 1], repeat=1)
sage: list(I)
[(-1,), (0,), (1,)]
sage: list(I)
[(-1,), (0,), (1,)]
sage: list(Ip)
[(-1,), (0,), (1,)]
sage: list(Ip)
[]
```

This could potentially cause subtle changes in behavior. Granted, an object that wants it to behave like a parent should be a `cartesian_product`. All of your changes here look good (I know it is not yet ready for review), but I am just giving a slight bit of caution with the deprecation.

----

Digressing, it can be interesting when we dig into code like this that we find things like

```diff
-g = [[] for _ in itertools.repeat(None, len(m))]
+g = [[] for _ in range(len(m))]
```


```diff
-alpha = sum([True for x in itertools.product(range(4), repeat=j_form.dim()) if j_form(x) == 0])
+alpha = sum(1 for x in itertools.product(range(4), repeat=j_form.dim()) if j_form(x) == 0)
```

that could be improved.


---

Comment by mkoeppe created at 2022-08-11 00:10:54

Thanks. Yes, there are lots of details to be checked. I'm running the doctests and have found a few things already that need to be revised.


---

Comment by git created at 2022-08-11 00:19:53

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by mkoeppe created at 2022-08-11 00:36:18

One interesting use is in `number_field_ideal_rel`: It tries to use `iter_list` from the absolute field


---

Comment by git created at 2022-08-11 01:19:48

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by git created at 2022-08-11 02:46:33

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by git created at 2022-08-11 02:48:47

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by mkoeppe created at 2022-08-11 03:06:57

The second interesting use is in `skew_polynomial_finite_field`

```
            rng = xmrange_iter([kfixed]*degN, center)
            for i in range(m):
                for pol in xmrange_iter([rng]*i):
                    f = skew_ring.one()
```

This won't work when `rng` is changed to a generator


---

Comment by tscrim created at 2022-08-11 03:09:21

This likely comes from not being able to "restart" the generator. Although you might not need it defined outside of the inner `for` loop.


---

Comment by git created at 2022-08-11 03:17:22

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by mkoeppe created at 2022-08-11 03:24:35

Except for comment:10, comment:14, and the use in `CartesianProduct_iters` (which needs `len`), all other uses were trivial to replace.


---

Comment by mkoeppe created at 2022-08-11 03:26:40

Best to make this dependent on #19195, which will deprecate `CartesianProduct_iters`


---

Comment by mkoeppe created at 2022-08-11 03:30:10

Help with the remaining ones is welcome
