# Issue 26081: reduced form of polynomial modulo an ideal is broken for non default orderings

Issue created by migration from https://trac.sagemath.org/ticket/26318

Original creator: mmarco

Original creation time: 2018-09-20 09:57:47

CC:  simonking tscrim malb john_perry vbraun

The expected behaviour of reducing a polynomial modulo an ideal is


```
sage: R.<x,y,z> = QQ[]
sage: I = R.ideal([y+z])
sage: I.reduce(x)
x
sage: I.reduce(y)
-z
sage: I.reduce(x+y)
x - z
```


But if we use an order which is not the default one, we get something that is not a normal form (even if the order is global):

```
sage: R.<x,y,z> = PolynomialRing(QQ,order='lex')
sage: I = R.ideal([y+z])
sage: I.reduce(x)
x
sage: I.reduce(y)
-z
sage: I.reduce(x+y)
x + y
```


This is a bug. In fact, Singular handles this correctly:


```
> ring r = 0,(x,y,z),lp;
> ideal i = y-z;
> reduce(x,i);
x
> reduce(y,i);
z
> reduce(x+y,i);
x+z
```


