# Issue 17737: Fix conversion from PARI to multivariate polynomial rings

Issue created by migration from Trac.

Original creator: pbruin

Original creation time: 2015-03-17 16:23:06

Keywords: multivariate polynomials pari

Conversion of multivariate polynomials from PARI does not always work:

```
sage: A.<a> = PolynomialRing(QQ)
sage: B.<d,e> = PolynomialRing(A)
sage: f = pari(a*d)
sage: B(f)
Traceback (most recent call last):
...
TypeError: Unable to coerce PARI d to an Integer
```

A similar example:

```
sage: A.<a,b> = PolynomialRing(QQ)
sage: B.<d,e> = PolynomialRing(A)
sage: f = pari(a*d)
sage: B(f)
Traceback (most recent call last):
...
TypeError: Could not find a mapping of the passed element to this ring.
```




---

Comment by pbruin created at 2015-03-18 15:36:02

Changing status from new to needs_review.


---

Comment by vdelecroix created at 2015-03-21 10:08:17

Changing status from needs_review to needs_info.


---

Comment by vdelecroix created at 2015-03-21 10:08:17

Hello,

Do you know how pari chooses the order of the variables

```
sage: A.<a> = PolynomialRing(QQ)
sage: B.<d,e> = PolynomialRing(A)
sage: f = pari(a*d)
sage: f
d*a
sage: B(f)
a*d
```


On the other hand, what do you think of

```
sage: f.sage()
Traceback (most recent call last):
...
NameError: name 'd' is not defined
```


Vincent


---

Comment by pbruin created at 2015-03-21 16:00:54

Hello Vincent,
> Do you know how pari chooses the order of the variables
> {{{
> sage: A.<a> = PolynomialRing(QQ)
> sage: B.<d,e> = PolynomialRing(A)
> sage: f = pari(a*d)
> sage: f
> d*a
> sage: B(f)
> a*d
In PARI, the variables `x` and `y` are predefined (with `x` of higher priority) and subsequent variables get a successively lower priority in the order in which they are encountered.  Polynomials are printed with the variable of highest priority on the right.  In this example PARI sees `a` first, therefore it has higher priority than `d`.  Compare

```
sage: gp('a*d')
d*a
```

> On the other hand, what do you think of
> {{{
> sage: f.sage()
> Traceback (most recent call last):
> ...
> NameError: name 'd' is not defined
> }}}
This is because user-defined names are not part of the default context in which the evaluation is done.  You have to do

```
sage: f.sage({'a': a, 'd': d})
a*d
```

or

```
sage: f.sage(globals())
a*d
```



---

Comment by vdelecroix created at 2015-03-21 16:11:49

Replying to [comment:3 pbruin]:
> > On the other hand, what do you think of
> > {{{
> > sage: f.sage()
> > Traceback (most recent call last):
> > ...
> > NameError: name 'd' is not defined
> > }}}
> This is because user-defined names are not part of the default context in which the evaluation is done.  You have to do
> {{{
> sage: f.sage({'a': a, 'd': d})
> a*d
> }}}
> or
> {{{
> sage: f.sage(globals())
> a*d
> }}}

Ha nice! Could you add it to the documentation where you check pari conversion?


---

Comment by pbruin created at 2015-03-21 16:27:32

Replying to [comment:4 vdelecroix]:
> Replying to [comment:3 pbruin]:
> > You have to do
> > {{{
> > sage: f.sage({'a': a, 'd': d})
> > a*d
> > }}}
> > or
> > {{{
> > sage: f.sage(globals())
> > a*d
> > }}}
> 
> Ha nice! Could you add it to the documentation where you check pari conversion?
OK, I can add it for completeness (there are somewhat similar examples in the documentation of `f.sage()`).


---

Comment by pbruin created at 2015-03-21 16:27:32

Changing status from needs_info to needs_work.


---

Comment by git created at 2015-03-23 13:21:31

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by pbruin created at 2015-03-23 13:22:10

Changing status from needs_work to needs_review.


---

Comment by vdelecroix created at 2015-03-23 22:03:56

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2015-04-14 19:43:48

Resolution: fixed
