# Issue 31007: Add modulo to function  field element

Issue created by migration from https://trac.sagemath.org/ticket/31244

Original creator: @Saher-Amasha

Original creation time: 2021-01-15 03:11:00

a function that takes as input a polynomial.
the function returns the the current polynomial modulo the polynomial given as input


---

Comment by @DaveWitteMorris created at 2021-01-15 04:48:13

I don't understand the need for this function, because sage's "modulo" operator `%` works for polynomials:

```
sage: Qx.<x> = QQ[x]                                                                           
sage: (5*x^4 + 4*x^3 + 3*x^2 + 2*x + 1) % x^2                                                  
2*x + 1
```



---

Comment by @Saher-Amasha created at 2021-01-15 14:30:35

Replying to [comment:1 gh-DaveWitteMorris]:
> I don't understand the need for this function, because sage's "modulo" operator `%` works for polynomials:
> {{{
> sage: Qx.<x> = QQ[x]                                                                           
> sage: (5*x^4 + 4*x^3 + 3*x^2 + 2*x + 1) % x^2                                                  
> 2*x + 1
> }}}
the modulo operator doesn't work in this example

```

sage: FF.<t> = FunctionField(QQ)                                                
sage: f= t^3+t^2+1 ;f                                                           
t^3 + t^2 + 1
sage: g= t^2+ 1 ;g                                                              
t^2 + 1
sage: f%g   
sage: f.mod(g) 
```



the % operator returns an error


                    
the function mod ( f.mod(g) ) always returns zero regardless of f and g





thanks for taking the time to respond


---

Comment by @DaveWitteMorris created at 2021-01-15 21:29:26

0 is the correct answer for `f.mod(g)` (unless g = 0), because 1/g is in FF. 

However, perhaps it would make sense to have a `polynomial` method that returns `f.numerator()` if `f` is a polynomial (and gives a `ValueError` otherwise). This would allow a user to treat `f` as a polynomial. For example, they could write `f.polynomial() % g.polynomial()` or `f.polynomial().mod(g.polynomial())`.


---

Comment by mkoeppe created at 2021-02-13 20:51:01

Setting new milestone based on a cursory review of ticket status, priority, and last modification date.


---

Comment by @Saher-Amasha created at 2021-02-27 19:09:06

please remove ticket, function already exists.


---

Comment by @Saher-Amasha created at 2021-02-27 19:09:49

Changing status from new to needs_review.


---

Comment by @DaveWitteMorris created at 2021-03-07 21:30:20

OK, we can close this ticket as invalid.


---

Comment by @DaveWitteMorris created at 2021-03-07 21:30:20

Changing status from needs_review to positive_review.


---

Comment by chapoton created at 2021-05-10 11:06:30

Resolution: invalid
