# Issue 30089: latex correctly typesets held integrals, but (incorrectly) evaluate held integrals subexpressions.

archive/issues_030089.json:
```json
{
    "body": "Keywords: latex integral\n\nConsider :\n\n\n```\nsage: f(x)=cos(x)\nsage: C=2*pi\nsage: f(x)=1/(1+x^2)\nsage: C=pi\nsage: Ex=f(x).integrate(x,-oo,oo,hold=True)\nsage: Ex\nintegrate(1/(x^2 + 1), x, -Infinity, +Infinity)\nsage: latex(Ex)\n\\int_{-\\infty}^{+\\infty} \\frac{1}{x^{2} + 1}\\,{d x}\n```\n\n\nCorrect. But :\n\n\n```\nsage: latex(Ex/C)\n\\frac{\\pi}{\\pi}\n```\n\n\nAaaarghhh... The held integral subexpression has been evaluated (= unheld) during the `latex` processing ; furthermor, this affects only this subexpression processing, no further simplification takes place.\n\nThis seems to be specific to integrals ; I haven't been able to reproduce the problem  with `sum` :\n\n\n```\nsage: var(\"a, b\")\n(a, b)\nsage: var(\"j, m\", domain=\"integer\")\n(j, m)\nsage: Ex=sum(binomial(m,j)*a^j*b^(m-j),j,0,m,hold=True)\nsage: Ex.subs(m==3)\nsum(a^j*b^(-j + 3)*binomial(3, j), j, 0, 3)\nsage: Ex.subs(m==3).unhold()\na^3 + 3*a^2*b + 3*a*b^2 + b^3\nsage: latex(Ex.subs(m==3))\n{\\sum_{j=0}^{3} a^{j} b^{-j + 3} {3 \\choose j}}\n```\n\n\nCorrect.\n\n\n```\nsage: latex(Ex.subs(m==3)/C)\n\\frac{{\\sum_{j=0}^{3} a^{j} b^{-j + 3} {3 \\choose j}}}{\\pi}\n```\n\n\nAlso correct.\n\nThis is annoying when one wants to illustrate difficulties with an expression involving a problematic, impossible or (worse) never-returning integral : one cannot use `latex` to illustrate the problem without isolating the problematic subexpression.\n\nThis occurrence may become more frequent with the increase in use of the Jupyter notebook, often featuring a `%display typeset` early in the notebook, where this problem could stall the notebook.\n\nIssue created by migration from https://trac.sagemath.org/ticket/30326\n\n",
    "created_at": "2020-08-10T09:11:26Z",
    "labels": [
        "symbolics",
        "major",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-9.8",
    "title": "latex correctly typesets held integrals, but (incorrectly) evaluate held integrals subexpressions.",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/30089",
    "user": "charpent"
}
```
Keywords: latex integral

Consider :


```
sage: f(x)=cos(x)
sage: C=2*pi
sage: f(x)=1/(1+x^2)
sage: C=pi
sage: Ex=f(x).integrate(x,-oo,oo,hold=True)
sage: Ex
integrate(1/(x^2 + 1), x, -Infinity, +Infinity)
sage: latex(Ex)
\int_{-\infty}^{+\infty} \frac{1}{x^{2} + 1}\,{d x}
```


Correct. But :


```
sage: latex(Ex/C)
\frac{\pi}{\pi}
```


Aaaarghhh... The held integral subexpression has been evaluated (= unheld) during the `latex` processing ; furthermor, this affects only this subexpression processing, no further simplification takes place.

This seems to be specific to integrals ; I haven't been able to reproduce the problem  with `sum` :


```
sage: var("a, b")
(a, b)
sage: var("j, m", domain="integer")
(j, m)
sage: Ex=sum(binomial(m,j)*a^j*b^(m-j),j,0,m,hold=True)
sage: Ex.subs(m==3)
sum(a^j*b^(-j + 3)*binomial(3, j), j, 0, 3)
sage: Ex.subs(m==3).unhold()
a^3 + 3*a^2*b + 3*a*b^2 + b^3
sage: latex(Ex.subs(m==3))
{\sum_{j=0}^{3} a^{j} b^{-j + 3} {3 \choose j}}
```


Correct.


```
sage: latex(Ex.subs(m==3)/C)
\frac{{\sum_{j=0}^{3} a^{j} b^{-j + 3} {3 \choose j}}}{\pi}
```


Also correct.

This is annoying when one wants to illustrate difficulties with an expression involving a problematic, impossible or (worse) never-returning integral : one cannot use `latex` to illustrate the problem without isolating the problematic subexpression.

This occurrence may become more frequent with the increase in use of the Jupyter notebook, often featuring a `%display typeset` early in the notebook, where this problem could stall the notebook.

Issue created by migration from https://trac.sagemath.org/ticket/30326





---

archive/issue_comments_427812.json:
```json
{
    "body": "A partial workaround is to pass the offending expression to `sympy`, whose `latex` doesn't have this bug (but doesn't correctly translates all Sage's bells and whistles) :\n\n\n```\nsage: f(x)=1/(1+x^2)\nsage: C=pi\nsage: Ex=integrate(f(x),x,-oo,oo,hold=True) ; Ex\nintegrate(1/(x^2 + 1), x, -Infinity, +Infinity)\nsage: latex(Ex/C)\n\\frac{\\pi}{\\pi}\nsage: import sympy\nsage: latex(sympy.sympify(Ex/C))\n\\text{\\texttt{Integral(1/(x**2{ }+{ }1),{ }(x,{ }{-}oo,{ }oo))/pi}}\n```\n\n\n(Note that `oo` isn't either `sympified` as expected or typeset as `\\infty`...)",
    "created_at": "2020-08-10T09:35:22Z",
    "issue": "https://github.com/sagemath/sagetest/issues/30089",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/30089#issuecomment-427812",
    "user": "charpent"
}
```

A partial workaround is to pass the offending expression to `sympy`, whose `latex` doesn't have this bug (but doesn't correctly translates all Sage's bells and whistles) :


```
sage: f(x)=1/(1+x^2)
sage: C=pi
sage: Ex=integrate(f(x),x,-oo,oo,hold=True) ; Ex
integrate(1/(x^2 + 1), x, -Infinity, +Infinity)
sage: latex(Ex/C)
\frac{\pi}{\pi}
sage: import sympy
sage: latex(sympy.sympify(Ex/C))
\text{\texttt{Integral(1/(x**2{ }+{ }1),{ }(x,{ }{-}oo,{ }oo))/pi}}
```


(Note that `oo` isn't either `sympified` as expected or typeset as `\infty`...)



---

archive/issue_comments_427813.json:
```json
{
    "body": "Moving to 9.4, as 9.3 has been released.",
    "created_at": "2021-05-10T17:42:09Z",
    "issue": "https://github.com/sagemath/sagetest/issues/30089",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/30089#issuecomment-427813",
    "user": "mkoeppe"
}
```

Moving to 9.4, as 9.3 has been released.



---

archive/issue_comments_427814.json:
```json
{
    "body": "This seems to work in 9.6.rc3, needs a doctest\n\n```\nsage: f = integral(x, x, 0, 1, hold=True)\nsage: latex(f)\n\\int_{0}^{1} x\\,{d x}\n```\n",
    "created_at": "2022-04-30T08:49:33Z",
    "issue": "https://github.com/sagemath/sagetest/issues/30089",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/30089#issuecomment-427814",
    "user": "chapoton"
}
```

This seems to work in 9.6.rc3, needs a doctest

```
sage: f = integral(x, x, 0, 1, hold=True)
sage: latex(f)
\int_{0}^{1} x\,{d x}
```




---

archive/issue_comments_427815.json:
```json
{
    "body": "No, I think we still have the problem (in 9.6.rc3):\n\n```\nsage: f = integral(x, x, 0, 1, hold=True)\nsage: latex(f)  # this is correct (at least since 9.2)\n\\int_{0}^{1} x\\,{d x}\nsage: latex(f / pi)  # this is still not correct\n\\frac{\\frac{1}{2}}{\\pi}\n```\n",
    "created_at": "2022-05-01T07:55:55Z",
    "issue": "https://github.com/sagemath/sagetest/issues/30089",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/30089#issuecomment-427815",
    "user": "@DaveWitteMorris"
}
```

No, I think we still have the problem (in 9.6.rc3):

```
sage: f = integral(x, x, 0, 1, hold=True)
sage: latex(f)  # this is correct (at least since 9.2)
\int_{0}^{1} x\,{d x}
sage: latex(f / pi)  # this is still not correct
\frac{\frac{1}{2}}{\pi}
```

