# Issue 13341: Can't create a symbolic variable named 'lambda'

Issue created by migration from https://trac.sagemath.org/ticket/13545

Original creator: mjo

Original creation time: 2012-09-28 03:10:06

Assignee: burcin

I think this should work:


```
sage: l = var('lambda')
ERROR: An unexpected error occurred while tokenizing input
...
ValueError: The name "lambda" is not a valid Python identifier.
```


This is what I usually do, and it _does_ work:


```
sage: l = SR('lambda')
sage: show(l)
```


The reason to use the 'lambda' name is for the magic latex conversion.



---

Comment by nbruin created at 2012-09-28 07:09:26

It may be inconvenient, but this can't work. The problem is that the top-level `var` also injects a global variable binding and, as is correctly reported, `lambda` isn't valid because it's a reserved keyword. The workaround is to use a different `var`, such as `SR.var` or `sage.calculus.var.var` (I hope those are really the same function), which is almost equivalent to the workaround presented.

Close as "won't fix"? I don't see another option.


---

Comment by burcin created at 2012-09-28 08:51:30

Replying to [comment:1 nbruin]:
> Close as "won't fix"? I don't see another option. 

Agreed.

Another way to get a variable that is typeset as `\lambda` in latex mode is


```
sage: var('l', latex_name='\lambda')
l
sage: latex(l)
\lambda
```



---

Comment by burcin created at 2012-09-28 08:51:30

Changing status from new to needs_review.


---

Comment by burcin created at 2012-09-28 08:51:45

Changing status from needs_review to positive_review.


---

Comment by mjo created at 2012-09-28 12:12:15

Whoops, I always thought that this avoided creating a global:


```
sage: x = var('y')
sage: y
y
```


Good to know! Sorry for the noise.


---

Comment by kcrisman created at 2012-09-28 15:11:44

Replying to [comment:2 burcin]:
> Replying to [comment:1 nbruin]:
> > Close as "won't fix"? I don't see another option. 
> 
> Agreed.
> 
> Another way to get a variable that is typeset as `\lambda` in latex mode is
> 
> {{{
> sage: var('l', latex_name='\lambda')
> l
> sage: latex(l)
> \lambda
> }}}

Do we have that in the documentation?  I feel like we have something about `lambda` in there, but having a couple ways to do it would be interesting.


---

Comment by jdemeyer created at 2012-10-03 14:46:56

Resolution: wontfix
