# Issue 10946: Bug in mapping to residue fields

Issue created by migration from Trac.

Original creator: cremona

Original creation time: 2011-03-26 22:52:09

Assignee: davidloeffler

CC:  was justin ylchapuy

Keywords: residue field

See #9417:

```

sage: K.<a> = NumberField(x^2+18*x+1)
sage: P = K.ideal(2)
sage: F = K.residue_field(P)
sage: R = PolynomialRing(F, 'x')
sage: R([0, a, a, 1])
x^3 + abar*x^2 + abar*x
sage: F(a)
1
sage: a.minpoly()
x^2 + 18*x + 1
sage: F.gen()
abar
sage: F.gen().minpoly()
x^2 + x + 1
```

The polynomial `x<sup>3+a*x</sup>2+a*x` reduced modulo P=(2) wrongly to `x<sup>3+abar*x</sup>2+abar*x`. Although the generator of the residue field F is suggestively called abar, it it *not* the reduction of a mod P (which is 1 mod P).



---

Comment by cremona created at 2011-03-27 18:45:02

Note that this is correct:

```
R([F(co) for co in [0,a,a,1]])
```

I think the problem lies in lines 94-108 of sage/rings/polynomial/polynomial_zz_pex.pyx, hence I am CC-int Yann L-C! Meanwhile I am using that work-around for #9417.


---

Comment by ylchapuy created at 2011-03-28 21:13:37

see my comments on #9389

polynomial_zz_pex.pyx is not intended to be used for this base ring (maybe it could but it wasn't thought like this).
The constructor of the univariate polynomials ring should be more careful.

And I'm sorry, but I won't have time to do this myself.


---

Comment by cremona created at 2011-03-28 22:46:09

Thanks for reporting back.  I'll try to fix this myself, but in any case I was able to use a simple workaround.


---

Comment by jakobkroeker created at 2015-08-25 15:40:51

fixed?


---

Comment by cremona created at 2015-08-25 15:59:56

With 6.9.beta3 I see this:

```
K.<a> = NumberField(x^2+18*x+1)
sage: P = K.ideal(2)
sage: F = K.residue_field(P)
sage: R = PolynomialRing(F, 'x')
sage: R([0, a, a, 1])
x^3 + x^2 + x
```

which shows that the original issue has been fixed, though I do not know where or when.

I cannot see the "won't fix" option but that is what this should now get.


---

Comment by pbruin created at 2015-08-25 16:33:08

Replying to [comment:9 cremona]:
> With 6.9.beta3 I see this:
> {{{
> K.<a> = NumberField(x^2+18*x+1)
> sage: P = K.ideal(2)
> sage: F = K.residue_field(P)
> sage: R = PolynomialRing(F, 'x')
> sage: R([0, a, a, 1])
> x^3 + x^2 + x
> }}}
> which shows that the original issue has been fixed, though I do not know where or when.
It might be #11239.


---

Comment by pbruin created at 2015-08-25 16:33:08

Changing status from new to needs_review.


---

Comment by pbruin created at 2015-08-25 16:33:42

Changing status from needs_review to positive_review.


---

Comment by pbruin created at 2015-08-25 16:33:42

Replying to [comment:9 cremona]:
> I cannot see the "won't fix" option but that is what this should now get.
I agree.


---

Comment by vbraun created at 2015-09-12 14:00:06

Resolution: wontfix
