# Issue 12026: is_squarefree() over multivariate rings does not work

Issue created by migration from https://trac.sagemath.org/ticket/12198

Original creator: MvanBeek

Original creation time: 2011-12-20 10:54:35

Assignee: tbd

CC:  malb burcin jpflori

The following examples demonstrate the problem:


```
sage: R.<x,y>=PolynomialRing(ZZ,'x','y')
sage: R(1).is_squarefree()
False
sage: R(x^2+y^2).is_squarefree()
False
sage: R(x^2+1).is_squarefree()
False
```



---

Comment by vbraun created at 2011-12-20 13:08:28

Changing component from PLEASE CHANGE to algebraic geometry.


---

Comment by vbraun created at 2011-12-20 13:08:28

Singular seems to have issues with square-free factorization over ZZ:

```
                     SINGULAR                                 /  Development
 A Computer Algebra System for Polynomial Computations       /   version 3-1-3
                                                           0<
 by: W. Decker, G.-M. Greuel, G. Pfister, H. Schoenemann     \   March 2011
FB Mathematik der Universitaet, D-67653 Kaiserslautern        \
> ring R = integer,(x,y), dp;
> poly p = x^2+y^2;
> sqrfree(p);
   ? not implemented
   ? error occurred in or before STDIN line 3: `sqrfree(p);`
```

This might be implemented in a more recent version, don't know about that. Looking at the Singular source there is a `isSqrFreeZ` function in the factory that should do the right thing. Its not clear to me why the code path doesn't end up there.

Over QQ it works fine:

```
> ring Q = 0,(x,y),dp;
> poly p = x^2+y^2;
> sqrfree(p);
_[1]=x2+y2
```

I haven't found a way to test square-freeness (as opposed to compute the squarefree factorization) from the Singular command line, is this function not exposed to the Singular interpreter?


---

Comment by vbraun created at 2011-12-20 13:08:28

Changing assignee from tbd to AlexGhitza.


---

Comment by burcin created at 2011-12-20 14:53:50

Changing component from algebraic geometry to basic arithmetic.


---

Comment by burcin created at 2011-12-20 14:53:50

Integer coefficients are relatively new in Singular. Many fuctions do not work with them. In this case, Singular raises an error using a callback function (see `sage.libs.singular.singular.libsingular_error_callback`). Unfortunately we do not check for it and return wrong results.

A workaround, suggested by Martin Lee, for this immediate problem is to `change_ring(QQ)` and call `is_squarefree()` there.

If there isn't a ticket already about handling errors raised in libsingular, we should open one. Note that the magical function interface (the one you get through `sage.libs.singular.ff.*`) can handle Singular errors. It's only direct C library calls that should check explicitly if Singular raised an error. Perhaps we can solve it by wrapping the declarations in `sage/libs/singular/singular-cdefs.pxi` in a preprocessor macro which calls `PyErr_Occured()` after raising an exception in `libsingular_error_callback()`.


---

Comment by burcin created at 2011-12-20 14:53:50

Changing priority from major to critical.


---

Comment by burcin created at 2011-12-20 14:53:50

Changing keywords from "" to "squarefree, singular".


---

Comment by zimmerma created at 2012-05-11 07:17:58

the same problem happens over finite fields:

```
sage: R.<x,y> = GF(2)[]
sage: f=x+y
sage: f.is_squarefree()
False
```

If `is_squarefree` is wrong, it should be simply disabled.

See also #12404.

Paul


---

Comment by zimmerma created at 2012-05-11 07:20:48

see also #12129.

Paul


---

Comment by rws created at 2014-03-01 08:27:33

The Singular error output has changed in 4.0.0:

```
                     SINGULAR                                 /  Development
 A Computer Algebra System for Polynomial Computations       /   version 4.0.0
                                                           0<
 by: W. Decker, G.-M. Greuel, G. Pfister, H. Schoenemann     \   Dec 2013
FB Mathematik der Universitaet, D-67653 Kaiserslautern        \
// ** executing /home/ralf/Sources-Singular_4.0.0/Singular/LIB/.singularrc
> ring R = integer,(x,y), dp;
> poly p = x^2+y^2;
> sqrfree(p);
   ? not implemented for rings with rings as coeffients
   ? error occurred in or before STDIN line 3: `sqrfree(p);`
```



---

Comment by cremona created at 2017-11-12 13:41:27

This can surely be closed since the incorrect results reported are now computed correctly.  Same at #12129.


---

Comment by tscrim created at 2017-11-13 00:53:19

Agreed.


---

Comment by tscrim created at 2017-11-13 00:53:19

Changing status from new to needs_review.


---

Comment by tscrim created at 2017-11-13 00:53:24

Changing status from needs_review to positive_review.


---

Comment by cremona created at 2017-11-13 09:31:56

A doctest is being added at #12129 which covers this too.


---

Comment by embray created at 2017-12-12 08:23:33

Resolution: wontfix
