# Issue 20371: S-unit functionality not available from unit_group method

archive/issues_020371.json:
```json
{
    "body": "Keywords: S-unit group, number field\n\nThe following example is taken from the Sage Reference Guide:\n\n```\nsage: K.<a> = NumberField(x^6+2)\nsage: S = K.ideal(3).prime_factors(); S\n[Fractional ideal (3, a + 1), Fractional ideal (3, a - 1)]\nsage: SUK = UnitGroup(K,S=tuple(S)); SUK\nS-unit group with structure C2 x Z x Z x Z x Z of Number Field in a with defining polynomial x^6 + 2 with S = (Fractional ideal (3, a + 1), Fractional ideal (3, a - 1))\n```\n\nHowever, this format should also work and currently doesn't:\n\n```\nsage: K.unit_group() == UnitGroup(K)\nTrue\nsage: K.unit_group(S = tuple(S)) == SUK # Should return True\n---------------------------------------------------------------------------\nTypeError                                 Traceback (most recent call last)\n<ipython-input-5-01b385903c37> in <module>()\n----> 1 SUK = K.unit_group(S = tuple(S))\n\nTypeError: unit_group() got an unexpected keyword argument 'S'\n```\n\nOptional (may require additional discussion): also deprecate the unbound method `UnitGroup`.\n\nIssue created by migration from https://trac.sagemath.org/ticket/20608\n\n",
    "created_at": "2016-05-13T22:39:38Z",
    "labels": [
        "number theory",
        "minor",
        "enhancement"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-7.3",
    "title": "S-unit functionality not available from unit_group method",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/20371",
    "user": "kedlaya"
}
```
Keywords: S-unit group, number field

The following example is taken from the Sage Reference Guide:

```
sage: K.<a> = NumberField(x^6+2)
sage: S = K.ideal(3).prime_factors(); S
[Fractional ideal (3, a + 1), Fractional ideal (3, a - 1)]
sage: SUK = UnitGroup(K,S=tuple(S)); SUK
S-unit group with structure C2 x Z x Z x Z x Z of Number Field in a with defining polynomial x^6 + 2 with S = (Fractional ideal (3, a + 1), Fractional ideal (3, a - 1))
```

However, this format should also work and currently doesn't:

```
sage: K.unit_group() == UnitGroup(K)
True
sage: K.unit_group(S = tuple(S)) == SUK # Should return True
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)
<ipython-input-5-01b385903c37> in <module>()
----> 1 SUK = K.unit_group(S = tuple(S))

TypeError: unit_group() got an unexpected keyword argument 'S'
```

Optional (may require additional discussion): also deprecate the unbound method `UnitGroup`.

Issue created by migration from https://trac.sagemath.org/ticket/20608





---

archive/issue_comments_280853.json:
```json
{
    "body": "It appears that this format works:\n\n```\nsage: K.S_unit_group(S=S) == SUK\nTrue\n```\n\nso a simpler alternative would be to edit the docstring for `K.unit_group` to refer to `K.S_unit_group`.\n\nAside: confusingly the argument `S` is not positional:\n\n```\nsage: K.S_unit_group(S) == SUK\nFalse\nsage: K.S_unit_group(S) == K.unit_group() # S is ignored!\nTrue\n```\n",
    "created_at": "2016-05-24T18:57:09Z",
    "issue": "https://github.com/sagemath/sagetest/issues/20371",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/20371#issuecomment-280853",
    "user": "kedlaya"
}
```

It appears that this format works:

```
sage: K.S_unit_group(S=S) == SUK
True
```

so a simpler alternative would be to edit the docstring for `K.unit_group` to refer to `K.S_unit_group`.

Aside: confusingly the argument `S` is not positional:

```
sage: K.S_unit_group(S) == SUK
False
sage: K.S_unit_group(S) == K.unit_group() # S is ignored!
True
```




---

archive/issue_comments_280854.json:
```json
{
    "body": "Changing status from new to needs_review.",
    "created_at": "2016-05-24T19:48:06Z",
    "issue": "https://github.com/sagemath/sagetest/issues/20371",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/20371#issuecomment-280854",
    "user": "kedlaya"
}
```

Changing status from new to needs_review.



---

archive/issue_comments_280855.json:
```json
{
    "body": "Patch up to change the docstrings for `K.units` and `K.unit_group` to add \"SEEALSO\" lines referencing S-units. This seems easier than changing any actual functionality.\n----\nNew commits:",
    "created_at": "2016-05-24T19:48:06Z",
    "issue": "https://github.com/sagemath/sagetest/issues/20371",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/20371#issuecomment-280855",
    "user": "kedlaya"
}
```

Patch up to change the docstrings for `K.units` and `K.unit_group` to add "SEEALSO" lines referencing S-units. This seems easier than changing any actual functionality.
----
New commits:



---

archive/issue_comments_280856.json:
```json
{
    "body": "Changing status from needs_review to positive_review.",
    "created_at": "2016-05-25T23:29:40Z",
    "issue": "https://github.com/sagemath/sagetest/issues/20371",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/20371#issuecomment-280856",
    "user": "vbraun"
}
```

Changing status from needs_review to positive_review.



---

archive/issue_comments_280857.json:
```json
{
    "body": "Resolution: fixed",
    "created_at": "2016-05-27T22:39:52Z",
    "issue": "https://github.com/sagemath/sagetest/issues/20371",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/20371#issuecomment-280857",
    "user": "vbraun"
}
```

Resolution: fixed
