# Issue 26206: no conversion between number fields over base rings which have conversion

Issue created by migration from Trac.

Original creator: dkrenn

Original creation time: 2018-10-09 14:48:26

CC:  vdelecroix jipilab

{{{     
sage: CyclotomicField(3).extension(x^2+1, 'i')(QQ.extension(x^2+1, 'i').gen())
}}}
returns

```
TypeError: Cannot coerce element into this number field
```




---

Comment by nbruin created at 2018-10-18 20:38:48

While in sage it would make sense that a homomorphism sending i to i would be the preferred one, it requires some work to see if that's valid. For instance, you'd have to distinguish it from

```
CyclotomicField(4).extension(x^2+3, 'i')(QQ.extension(x^2+1, 'i').gen())
```

I'm not sure we can fix this easily.


---

Comment by dkrenn created at 2018-10-19 07:00:45

Replying to [comment:1 nbruin]:
> While in sage it would make sense that a homomorphism sending i to i would be the preferred one, it requires some work to see if that's valid. For instance, you'd have to distinguish it from
> {{{
> CyclotomicField(4).extension(x^2+3, 'i')(QQ.extension(x^2+1, 'i').gen())
> }}}
> I'm not sure we can fix this easily.

I see your point. So a conversion in general is difficult.

However, we could focus on (special) coercions (in contrast to conversions): If we have two bases `A` and `B` where `B` has a coercion map from `A`, then `B.extensions(f, 'i')` should have a coercion map from `A.extension(f, 'i')` for I guess all `f`.


---

Comment by dkrenn created at 2018-10-19 08:45:02

Changing status from new to needs_review.


---

Comment by dkrenn created at 2018-10-19 08:45:02

I've made some changes that do what I expected from this ticket. Please have a look (as I am no expert on the insights of the implementation of number fields in SageMath).
----
New commits:


---

Comment by jipilab created at 2019-09-03 18:38:08

While working on polyhedron over algebraic numbers, we struggled around something that might (or not) be related. But in anycase is something similar.

vdelecroix might have good pointers about this.


---

Comment by vdelecroix created at 2019-09-03 19:27:25

What you ask for is not a well defined operation! The answer could equally be `i` or `-i`. You should specify what you actually want.

The current (clean but tedious) way to do it is

```
sage: K = CyclotomicField(3).extension(x^2+1, 'i')
sage: L = QQ.extension(x^2+1, 'i')
sage: f = Hom(L, K)([K.gen()])
sage: f
Ring morphism:
  From: Number Field in i with defining polynomial x^2 + 1
  To:   Number Field in i with defining polynomial x^2 + 1 over its base field
  Defn: i |--> i
sage: f(L.gen())
i
```



---

Comment by vdelecroix created at 2019-09-03 19:29:01

This is even more true if you specify complex embedding for your number fields! The conversion that you implemented ("the obvious algebraic one") might not be the one the user expect...


---

Comment by vdelecroix created at 2020-02-22 22:45:21

Changing status from needs_review to needs_info.


---

Comment by mkoeppe created at 2020-05-01 04:28:42

Moving tickets to milestone sage-9.2 based on a review of last modification date, branch status, and severity.


---

Comment by mkoeppe created at 2021-04-02 20:21:54

Moving this ticket to 9.4, as it seems unlikely that it will be merged in 9.3, which is in the release candidate stage


---

Comment by mkoeppe created at 2021-07-19 00:44:56

Setting a new milestone for this ticket based on a cursory review.


---

Comment by mkoeppe created at 2021-12-18 19:53:12

Stalled in `needs_review` or `needs_info`; likely won't make it into Sage 9.5.
