# Issue 14822: Morphisms cannot be applied to too-simple elements of a multivariate power series ring

Issue created by migration from https://trac.sagemath.org/ticket/15059

Original creator: darij

Original creation time: 2013-08-18 12:48:32

CC:  simonking niles

Keywords: rings, power series


```
sage: M.<u,v> = PowerSeriesRing(GF(5))
sage: s = M.hom([u, u+v])     
sage: s(M.one())
---------------------------------------------------------------------------
AttributeError                            Traceback (most recent call last)
<ipython-input-4-754f257583fc> in <module>()
----> 1 s(M.one())

/home/darij/sage-5.11.beta3/local/lib/python2.7/site-packages/sage/categories/map.so in sage.categories.map.Map.__call__ (sage/categories/map.c:4018)()

/home/darij/sage-5.11.beta3/local/lib/python2.7/site-packages/sage/rings/morphism.so in sage.rings.morphism.RingHomomorphism_im_gens._call_ (sage/rings/morphism.c:7481)()

/home/darij/sage-5.11.beta3/local/lib/python2.7/site-packages/sage/rings/multi_power_series_ring_element.pyc in _im_gens_(self, codomain, im_gens)
    611             x + 2*y + 12*x*y^2 + O(x, y)^5
    612         """
--> 613         return codomain(self(*im_gens))
    614 
    615     def __getitem__(self,n):

/home/darij/sage-5.11.beta3/local/lib/python2.7/site-packages/sage/rings/multi_power_series_ring_element.pyc in __call__(self, *x, **kwds)
    462         else:
    463             newprec = self.prec()*min(valn_list)
--> 464         return self._value().subs(sub_dict).add_bigoh(newprec)
    465 
    466     def _subs_formal(self, *x, **kwds):

/home/darij/sage-5.11.beta3/local/lib/python2.7/site-packages/sage/structure/element.so in sage.structure.element.Element.__getattr__ (sage/structure/element.c:3871)()

/home/darij/sage-5.11.beta3/local/lib/python2.7/site-packages/sage/structure/misc.so in sage.structure.misc.getattr_from_other_class (sage/structure/misc.c:1696)()

AttributeError: 'sage.rings.finite_rings.integer_mod.IntegerMod_int' object has no attribute 'add_bigoh'
```


(Alternatively, the same error can be caught by calling `M.one()._im_gens_(M, [u,u+v])` without ever defining `s`.)

Note that `s(u)` and `s(v)` work fine.


---

Attachment


---

Attachment

Fixed. The patch was uploaded twice due to connection issues; it's one and the same file nevertheless.

The issue at hand was that the `__call__` method of class `MPowerSeries` (elements of multivariate power series rings) calls the `subs` method of polynomials, but this method behaves somewhat unpredictably as concerning the parent of its output: If the input is a constant polynomial, it does not change the base ring (even if the substitution should send polynomials from ZZ to polynomials from ZZ/5ZZ):


```
sage: K.<x,y> = PolynomialRing(ZZ)
sage: T.<u,v> = PolynomialRing(Integers(5))
sage: parent(x.subs(x=u, y=v))
Multivariate Polynomial Ring in u, v over Ring of integers modulo 5
sage: parent(K.one().subs(x=u, y=v))
Integer Ring
```


Note that this issue only appears with multivariate polynomials. Univariate ones substitute fine.

Is my fix misguided in that it fixes the symptom rather than the cause?

patchbot:

apply trac_15059-multivariate_fix-dg.patchâ€‹


---

Comment by darij created at 2013-08-18 13:11:14

Changing keywords from "rings, power series" to "rings, power series, polynomials".


---

Comment by darij created at 2013-08-18 13:11:14

Changing status from new to needs_review.


---

Comment by pbruin created at 2014-05-05 17:54:45

Changing status from needs_review to positive_review.


---

Comment by pbruin created at 2014-05-05 17:54:45

Looks good; the patch applied without conflicts, I only converted it into a Git branch to delete trailing whitespace.  It fixes the bug and passes all tests.  I don't want to think about deciding where the result of `subs()` should live in general...


---

Comment by darij created at 2014-05-05 17:59:20

Thank you! I'm just hoping it doesn't conflict with the ongoing category revamp...


---

Comment by vbraun created at 2014-05-06 23:03:11

Resolution: fixed
