# Issue 24058: inverse of integer matrix is rational

Issue created by migration from Trac.

Original creator: galipnik

Original creation time: 2017-11-28 17:07:32

CC:  behackl slelievre

Keywords: matrix, inverse


```
sage: type(identity_matrix(ZZ, 2).inverse())
<type 'sage.matrix.matrix_rational_dense.Matrix_rational_dense'>
```


This seems to be counter-intuitive, the result should be an integer matrix again if possible.


---

Comment by jdemeyer created at 2017-11-28 19:06:35

This really is a feature, not a bug. It is consistent with other uses of inversion in Sage.


---

Comment by galipnik created at 2017-11-28 20:16:18

What is the feature here? If you work in the matrix space over ZZ, you would not expect - and you would not want - the inverse to be rational, am I wrong?


---

Comment by jdemeyer created at 2017-11-29 08:10:29

Imagina that we implement things your way.

Now, suppose that you are inverting many matrices over ZZ which all give a result over QQ (since they are not defined over ZZ). If suddenly one of those inverse matrices happens to be defined over ZZ by accident, then that matrix would have a different parent. That is inconsistent and we really value consistency.


---

Comment by jdemeyer created at 2017-11-29 08:13:39

Replying to [comment:3 galipnik]:
> If you work in the matrix space over ZZ

...then use the `inverse_of_unit()` method instead of `inverse()`.


---

Comment by jdemeyer created at 2017-11-29 08:13:39

Resolution: invalid


---

Comment by slelievre created at 2017-12-02 01:25:37

This could be reopened as "Mention inverse_of_unit in the documentation of inverse".

The documentation could say something like:

```
The inverse of a ring element is returned as an element in the fraction field.

To get the inverse within the ring, use `:meth:inverse_of_element`::

    sage: m = identity_matrix(ZZ, 2)
    sage: sage_input(m)
    matrix(ZZ, [[1, 0], [0, 1]])
    sage: mi = m.inverse()
    sage: sage_input(mi)
    matrix(QQ, [[1, 0], [0, 1]])
    sage: mm = m.inverse_of_unit()
    sage: sage_input(mm)
    matrix(ZZ, [[1, 0], [0, 1]])
```

