# Issue 27660: sqrt(abs(1+I)^2 + 14) evaluates to sqrt(16) instead of 4

archive/issues_027660.json:
```json
{
    "body": "Keywords: sqrt,abs,complex,hold,holding\n\nThere is some weird undesirable \"holding\" going on:\n\n\n```\nsage: sqrt(abs(1+I)^2 + 14)\nsqrt(16)\n```\n\n\nFound in [Ask SageMath question #46698: Sagemath not evaluating complicated expression](https://ask.sagemath.org/question/46698/sagemath-not-evaluating-complicated-expression/).\n\nIssue created by migration from https://trac.sagemath.org/ticket/27897\n\n",
    "created_at": "2019-05-30T15:16:39Z",
    "labels": [
        "symbolics",
        "major",
        "bug"
    ],
    "title": "sqrt(abs(1+I)^2 + 14) evaluates to sqrt(16) instead of 4",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/27660",
    "user": "rburing"
}
```
Keywords: sqrt,abs,complex,hold,holding

There is some weird undesirable "holding" going on:


```
sage: sqrt(abs(1+I)^2 + 14)
sqrt(16)
```


Found in [Ask SageMath question #46698: Sagemath not evaluating complicated expression](https://ask.sagemath.org/question/46698/sagemath-not-evaluating-complicated-expression/).

Issue created by migration from https://trac.sagemath.org/ticket/27897





---

archive/issue_comments_390543.json:
```json
{
    "body": "It looks like there is some double wrapping happening here:\n\n```\nsage: (1+I).pyobject().parent()\nNumber Field in I with defining polynomial x^2 + 1\nsage: abs(1+I).pyobject().parent()\nSymbolic Ring\nsage: (abs(1+I)^2).pyobject().parent()\nSymbolic Ring\n```\n\nhere things seem to be still reasonable. However, this last result is \"double wrapped\":\n\n```\nsage: (abs(1+I)^2).pyobject().pyobject().parent()\nRational Field\n```\n\nand it looks like that's too deep for `sqrt` to see through. It doesn't happen for this case:\n\n```\nsage: (abs(sqrt(2))^2).pyobject().parent()\nInteger Ring\n```\n\n----\nthat could be a red herring, though:\n\n```\nsage: b=(1+I)*(1-I)+14\nsage: b.pyobject().parent() #this is appropriate\nNumber Field in I with defining polynomial x^2 + 1\nsage: sqrt(b)\nsqrt(16)\nsage: sqrt(b.pyobject())\n4\n```\n\nIt means that\n\n```\nsage: a=sqrt(abs((1+I))^2+14)\nsage: b=sqrt(norm(1+I)+14)\n```\n\nboth lead to unexpectedly \"held\" expressions, but with different structures:\n\n```\nsage: a.operands()[0].pyobject().parent()\nSymbolic Ring\nsage: a.operands()[0].pyobject().pyobject().parent()\nRational Field\nsage: b.operands()[0].pyobject().parent()\nNumber Field in I with defining polynomial x^2 + 1\n```\n\nwhere\n\n```\nsage: b.operands()[0].pyobject().sqrt()\n4\n```\n\nso perhaps both problems are solved if `sqrt` on an `SR` element would look a little deeper.",
    "created_at": "2019-05-30T16:50:34Z",
    "issue": "https://github.com/sagemath/sagetest/issues/27660",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/27660#issuecomment-390543",
    "user": "nbruin"
}
```

It looks like there is some double wrapping happening here:

```
sage: (1+I).pyobject().parent()
Number Field in I with defining polynomial x^2 + 1
sage: abs(1+I).pyobject().parent()
Symbolic Ring
sage: (abs(1+I)^2).pyobject().parent()
Symbolic Ring
```

here things seem to be still reasonable. However, this last result is "double wrapped":

```
sage: (abs(1+I)^2).pyobject().pyobject().parent()
Rational Field
```

and it looks like that's too deep for `sqrt` to see through. It doesn't happen for this case:

```
sage: (abs(sqrt(2))^2).pyobject().parent()
Integer Ring
```

----
that could be a red herring, though:

```
sage: b=(1+I)*(1-I)+14
sage: b.pyobject().parent() #this is appropriate
Number Field in I with defining polynomial x^2 + 1
sage: sqrt(b)
sqrt(16)
sage: sqrt(b.pyobject())
4
```

It means that

```
sage: a=sqrt(abs((1+I))^2+14)
sage: b=sqrt(norm(1+I)+14)
```

both lead to unexpectedly "held" expressions, but with different structures:

```
sage: a.operands()[0].pyobject().parent()
Symbolic Ring
sage: a.operands()[0].pyobject().pyobject().parent()
Rational Field
sage: b.operands()[0].pyobject().parent()
Number Field in I with defining polynomial x^2 + 1
```

where

```
sage: b.operands()[0].pyobject().sqrt()
4
```

so perhaps both problems are solved if `sqrt` on an `SR` element would look a little deeper.



---

archive/issue_comments_390544.json:
```json
{
    "body": "As the Sage-8.8 release milestone is pending, we should delete the sage-8.8 milestone for tickets that are not actively being worked on or that still require significant work to move forward.  If you feel that this ticket should be included in the next Sage release at the soonest please set its milestone to the next release milestone (sage-8.9).",
    "created_at": "2019-06-14T14:55:02Z",
    "issue": "https://github.com/sagemath/sagetest/issues/27660",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/27660#issuecomment-390544",
    "user": "embray"
}
```

As the Sage-8.8 release milestone is pending, we should delete the sage-8.8 milestone for tickets that are not actively being worked on or that still require significant work to move forward.  If you feel that this ticket should be included in the next Sage release at the soonest please set its milestone to the next release milestone (sage-8.9).



---

archive/issue_comments_390545.json:
```json
{
    "body": "I think the problem is gone:\n\n```\nsage: sqrt(abs(1+I)^2 + 14)                                                  \n4\n```\n\nThis is with 9.3b6 on MacOS 10.15.7, but I get `sqrt(16)` with 9.2 on `CoCalc`, so something seems to have changed since then.\n\nThe PR adds a doctest. If the patchbots turn green, then I think we can close this ticket. \n----\nNew commits:",
    "created_at": "2021-01-24T01:24:52Z",
    "issue": "https://github.com/sagemath/sagetest/issues/27660",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/27660#issuecomment-390545",
    "user": "@DaveWitteMorris"
}
```

I think the problem is gone:

```
sage: sqrt(abs(1+I)^2 + 14)                                                  
4
```

This is with 9.3b6 on MacOS 10.15.7, but I get `sqrt(16)` with 9.2 on `CoCalc`, so something seems to have changed since then.

The PR adds a doctest. If the patchbots turn green, then I think we can close this ticket. 
----
New commits:



---

archive/issue_comments_390546.json:
```json
{
    "body": "Changing status from new to needs_review.",
    "created_at": "2021-01-24T01:24:52Z",
    "issue": "https://github.com/sagemath/sagetest/issues/27660",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/27660#issuecomment-390546",
    "user": "@DaveWitteMorris"
}
```

Changing status from new to needs_review.



---

archive/issue_comments_390547.json:
```json
{
    "body": "I don't have 9.3beta6 here, but I think the definition/parent of `I` has changed, which may well have hidden this bug instead of fixing it. Could you please check `sqrt(abs(1+SR(I))^2 + 14)`? The doctest would have to take this form (or similar) as well.",
    "created_at": "2021-01-24T11:02:06Z",
    "issue": "https://github.com/sagemath/sagetest/issues/27660",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/27660#issuecomment-390547",
    "user": "rburing"
}
```

I don't have 9.3beta6 here, but I think the definition/parent of `I` has changed, which may well have hidden this bug instead of fixing it. Could you please check `sqrt(abs(1+SR(I))^2 + 14)`? The doctest would have to take this form (or similar) as well.



---

archive/issue_comments_390548.json:
```json
{
    "body": "Branch pushed to git repo; I updated commit sha1. New commits:",
    "created_at": "2021-01-24T17:33:46Z",
    "issue": "https://github.com/sagemath/sagetest/issues/27660",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/27660#issuecomment-390548",
    "user": "git"
}
```

Branch pushed to git repo; I updated commit sha1. New commits:



---

archive/issue_comments_390549.json:
```json
{
    "body": "You're right -- thanks for catching this!  With 9.3b6, we still have:\n\n```\nsage: sqrt(abs(1 + SR.I())^2 + 14)\nsqrt(16)\n```\n\nTicket #18036 changed the parent of I to be a number field.",
    "created_at": "2021-01-24T17:35:12Z",
    "issue": "https://github.com/sagemath/sagetest/issues/27660",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/27660#issuecomment-390549",
    "user": "@DaveWitteMorris"
}
```

You're right -- thanks for catching this!  With 9.3b6, we still have:

```
sage: sqrt(abs(1 + SR.I())^2 + 14)
sqrt(16)
```

Ticket #18036 changed the parent of I to be a number field.



---

archive/issue_comments_390550.json:
```json
{
    "body": "Changing status from needs_review to needs_work.",
    "created_at": "2021-01-24T17:35:12Z",
    "issue": "https://github.com/sagemath/sagetest/issues/27660",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/27660#issuecomment-390550",
    "user": "@DaveWitteMorris"
}
```

Changing status from needs_review to needs_work.
