# Issue 11762: Symbolic simplification error

Issue created by migration from Trac.

Original creator: mjo

Original creation time: 2011-10-17 19:17:55

Assignee: burcin

I ran into this today with a real function. Sorry I don't have a shorter test case. The attached file should show a simplification which, as far as I can tell, is invalid.


---

Attachment

A sage file that displays and attempts to plot the simplification


---

Comment by kcrisman created at 2011-10-18 02:45:45

Can you be more specific about the invalidity?    I think the plot errors are because of the imaginary pieces.  Remember, these simplifications are not supposed to be 100 percent valid at all times; especially with roots there are branch issues, unfortunately.  The `f` in question is pretty long - any sense as to where it might simplify in an unusual way?


---

Comment by mjo created at 2011-10-18 02:59:47

Replying to [comment:1 kcrisman]:
> Can you be more specific about the invalidity?

This seems to be the root of the problem. My function is real, the simplification is not:


```
sage: n(f(x=-0.5))
0.0175781250000000

sage: n(f.full_simplify()(x=-0.5))
0.0175781250000000 - 1.27567374911183e-18*I
```


I realize that the imaginary part is basically zero, but one of the simplifications has overstepped its bounds somewhere in that the expression is verifiably different pre- and post-simplification.


---

Comment by jdemeyer created at 2011-11-03 16:14:43

Milestone sage-4.7.3 deleted


---

Comment by mjo created at 2012-03-24 00:29:55

This really depends on #12737, but for the patch to apply nicely, #12322 should go in first.


---

Comment by mjo created at 2012-03-24 00:29:55

Changing status from new to needs_review.


---

Comment by kcrisman created at 2013-06-12 20:06:07

Changing status from needs_review to needs_info.


---

Comment by kcrisman created at 2013-06-12 20:06:07

I'm questioning whether this really is fixing anything.   First, it's still there with `simplify_radical`.

```
sage: f = sqrt(-8*(4*sqrt(2) - 7)*x^4 + 16*(3*sqrt(2) - 5)*x^3)
sage: f.subs(x=-1/2).n()
1.47861134210963
sage: f.simplify_radical().subs(x=-1/2).n()
1.47861134210963 - 9.05388323648765e-17*I
```

Secondly, the problem is really this.  Notice I'm not simplifying anything at all here.

```
sage: h = I*x^(1/2)
sage: h(x=-1/2)
I*sqrt(-1/2)
sage: h(x=-1/2).n()
-0.707106781186548 + 4.32978028117747e-17*I
```

Needs work/info, but not because of your patch or #12737, but rather because this doesn't really treat the underlying issue.  This could just be some floating point thing that is inherently impossible to avoid once one allows complex numbers (and since your original example is complex sometimes, the answers are going to be complex, unfortunately).


---

Comment by mjo created at 2013-06-16 03:43:22

Replying to [comment:6 kcrisman]:
> Needs work/info, but not because of your patch or #12737, but rather because this doesn't really treat the underlying issue.  This could just be some floating point thing that is inherently impossible to avoid once one allows complex numbers (and since your original example is complex sometimes, the answers are going to be complex, unfortunately).

There aren't any floating point issues if you don't call `n()` on anything. The issue is still there with `simplify_radical()`, but that's because `simplify_radical()` is broken by design: it chooses a branch arbitrarily for the square root. This is what `radcan()` in Maxima is documented to do, but if you re-brand it as a simplification, it's a bug.

Plain `simplify()` works:


```
sage: f = sqrt(-8*(4*sqrt(2) - 7)*x^4 + 16*(3*sqrt(2) - 5)*x^3)
sage: f.simplify()
sqrt(-8*(4*sqrt(2) - 7)*x^4 + 16*(3*sqrt(2) - 5)*x^3)
```


As does `simplify_trig()`:


```
sage: f.simplify_trig()
sqrt(-8*(4*sqrt(2) - 7)*x^4 + 16*(3*sqrt(2) - 5)*x^3)
```


And `simplify_rational()`:


```
sage: f.simplify_rational()
sqrt(-8*(4*sqrt(2) - 7)*x^4 + 16*(3*sqrt(2) - 5)*x^3)
```


And `simplify_log()`:


```
sage: f.simplify_log()
sqrt(-8*(4*sqrt(2) - 7)*x^4 + 16*(3*sqrt(2) - 5)*x^3)
```


It's only `simplify_radical()` that messes everything up (note I haven't called `n()` anywhere, so there are no numerical issues):


```
sage: f.simplify_radical()
2*I*sqrt((4*sqrt(2) - 7)*x - 6*sqrt(2) + 10)*sqrt(2)*x^(3/2)
```


I don't want a random branch of the square root when I ask for a simplification. I want a simplification, but only if possible! Without more information, you can't simplify that expression. The rest of the simplify functions don't do anything, but that's the correct thing to do here.


---

Attachment

Doctest for a subexpression of the one in the ticket


---

Comment by mjo created at 2013-08-17 01:42:48

I just uploaded a slightly better doctest now that this is fixed.


---

Comment by mjo created at 2013-08-17 01:42:48

Changing status from needs_info to needs_review.


---

Comment by jdemeyer created at 2013-12-07 08:34:30

Resolution: fixed


---

Comment by jdemeyer created at 2013-12-07 08:34:30

This doesn't seem to depend on #12322 at all.


---

Comment by mjo created at 2013-12-07 16:13:47

Replying to [comment:10 jdemeyer]:
> This doesn't seem to depend on #12322 at all.

Both tickets add a doctest in exactly the same spot, so I added the dep to avoid fuzzing the patches. But you're right, the changes themselves are independent.
