# Issue 30849: Fix tensor product of dense matrix by sparse matrix

archive/issues_030849.json:
```json
{
    "body": "CC:  @slel\n\nKeywords: matrix, tensor_product, dense, sparse\n\nThe tensor product of a dense matrix by a sparse matrix\nfails for some base rings including cyclotomic fields.\nEverything works fine over `ZZ` or `QQ`.\n\nIllustration in Sage 9.3.beta4:\n\n```\nsage: k = CyclotomicField(3)\nsage: I = identity_matrix(k, 2)\nsage: J = identity_matrix(k, 2, sparse=True)\nsage: J.tensor_product(J)\n[1 0|0 0]\n[0 1|0 0]\n[---+---]\n[0 0|1 0]\n[0 0|0 1]\nsage: J.tensor_product(I)\n[1 0|0 0]\n[0 1|0 0]\n[---+---]\n[0 0|1 0]\n[0 0|0 1]\nsage: I.tensor_product(I)\n[1 0|0 0]\n[0 1|0 0]\n[---+---]\n[0 0|1 0]\n[0 0|0 1]\nsage: I.tensor_product(J)\nTraceback (most recent call last)\n...\nAttributeError: 'sage.matrix.matrix_generic_sparse.Matrix_generic_sparse'\nobject has no attribute '_rational_matrix'\n```\n\n\nInitial report by Will Orrick at\n\n- [Ask Sage question 54762](https://ask.sagemath.org/question/54762)\n\nIssue created by migration from https://trac.sagemath.org/ticket/31086\n\n",
    "created_at": "2020-12-20T02:31:48Z",
    "labels": [
        "component: linear algebra",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-9.8",
    "title": "Fix tensor product of dense matrix by sparse matrix",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/30849",
    "user": "https://github.com/slel"
}
```
CC:  @slel

Keywords: matrix, tensor_product, dense, sparse

The tensor product of a dense matrix by a sparse matrix
fails for some base rings including cyclotomic fields.
Everything works fine over `ZZ` or `QQ`.

Illustration in Sage 9.3.beta4:

```
sage: k = CyclotomicField(3)
sage: I = identity_matrix(k, 2)
sage: J = identity_matrix(k, 2, sparse=True)
sage: J.tensor_product(J)
[1 0|0 0]
[0 1|0 0]
[---+---]
[0 0|1 0]
[0 0|0 1]
sage: J.tensor_product(I)
[1 0|0 0]
[0 1|0 0]
[---+---]
[0 0|1 0]
[0 0|0 1]
sage: I.tensor_product(I)
[1 0|0 0]
[0 1|0 0]
[---+---]
[0 0|1 0]
[0 0|0 1]
sage: I.tensor_product(J)
Traceback (most recent call last)
...
AttributeError: 'sage.matrix.matrix_generic_sparse.Matrix_generic_sparse'
object has no attribute '_rational_matrix'
```


Initial report by Will Orrick at

- [Ask Sage question 54762](https://ask.sagemath.org/question/54762)

Issue created by migration from https://trac.sagemath.org/ticket/31086





---

archive/issue_comments_440433.json:
```json
{
    "body": "Setting new milestone based on a cursory review of ticket status, priority, and last modification date.",
    "created_at": "2021-02-13T20:51:01Z",
    "issue": "https://github.com/sagemath/sagetest/issues/30849",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/30849#issuecomment-440433",
    "user": "https://github.com/mkoeppe"
}
```

Setting new milestone based on a cursory review of ticket status, priority, and last modification date.
