# Issue 30724: multiple bugs in NumberField element constructor

archive/issues_030724.json:
```json
{
    "body": "Lists of elements with arbitrary parents are accepted:\n\n```\nsage: x = SR.var('x')\nsage: QQi = i.parent()\nsage: QQi((x,x))\n(I + 1)*x\n```\n\n\nHowever, some lists that arguably should be accepted for consistency are not:\n\n```\nsage: QQi(\"1\")\n1\nsage: QQi((\"1\", \"2\"))\n...\nTypeError: can't multiply sequence by non-int of type 'sage.rings.number_field.number_field_element_quadratic.NumberFieldElement_gaussian'\n```\n\n\nAdditionally, lists and vector inputs behave differently for no clear reason:\n\n```\nsage: QQi(RR(1))\n1\nsage: QQi((RR(1), RR(2)))\n1.00000000000000 + 2.00000000000000*I\nsage: _.parent()\nComplex Field with 53 bits of precision\nsage: QQi(vector((RR(1), RR(2))))\n...\nTypeError: unable to convert (1.00000000000000, 2.00000000000000) to Number Field in I with defining polynomial x^2 + 1 with I = 1*I\n```\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/30961\n\n",
    "created_at": "2020-11-25T15:17:09Z",
    "labels": [
        "component: number fields",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-9.3",
    "title": "multiple bugs in NumberField element constructor",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/30724",
    "user": "https://github.com/mezzarobba"
}
```
Lists of elements with arbitrary parents are accepted:

```
sage: x = SR.var('x')
sage: QQi = i.parent()
sage: QQi((x,x))
(I + 1)*x
```


However, some lists that arguably should be accepted for consistency are not:

```
sage: QQi("1")
1
sage: QQi(("1", "2"))
...
TypeError: can't multiply sequence by non-int of type 'sage.rings.number_field.number_field_element_quadratic.NumberFieldElement_gaussian'
```


Additionally, lists and vector inputs behave differently for no clear reason:

```
sage: QQi(RR(1))
1
sage: QQi((RR(1), RR(2)))
1.00000000000000 + 2.00000000000000*I
sage: _.parent()
Complex Field with 53 bits of precision
sage: QQi(vector((RR(1), RR(2))))
...
TypeError: unable to convert (1.00000000000000, 2.00000000000000) to Number Field in I with defining polynomial x^2 + 1 with I = 1*I
```


Issue created by migration from https://trac.sagemath.org/ticket/30961





---

archive/issue_comments_438717.json:
```json
{
    "body": "New commits:",
    "created_at": "2020-11-25T15:25:48Z",
    "issue": "https://github.com/sagemath/sagetest/issues/30724",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/30724#issuecomment-438717",
    "user": "https://github.com/mezzarobba"
}
```

New commits:



---

archive/issue_comments_438718.json:
```json
{
    "body": "Changing status from new to needs_review.",
    "created_at": "2020-11-25T15:25:48Z",
    "issue": "https://github.com/sagemath/sagetest/issues/30724",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/30724#issuecomment-438718",
    "user": "https://github.com/mezzarobba"
}
```

Changing status from new to needs_review.



---

archive/issue_comments_438719.json:
```json
{
    "body": "These are welcome fixes.",
    "created_at": "2020-12-01T12:47:47Z",
    "issue": "https://github.com/sagemath/sagetest/issues/30724",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/30724#issuecomment-438719",
    "user": "https://github.com/slel"
}
```

These are welcome fixes.



---

archive/issue_comments_438720.json:
```json
{
    "body": "Changing status from needs_review to positive_review.",
    "created_at": "2020-12-01T12:47:47Z",
    "issue": "https://github.com/sagemath/sagetest/issues/30724",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/30724#issuecomment-438720",
    "user": "https://github.com/slel"
}
```

Changing status from needs_review to positive_review.



---

archive/issue_comments_438721.json:
```json
{
    "body": "merci !",
    "created_at": "2020-12-01T13:18:18Z",
    "issue": "https://github.com/sagemath/sagetest/issues/30724",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/30724#issuecomment-438721",
    "user": "https://github.com/mezzarobba"
}
```

merci !



---

archive/issue_comments_438722.json:
```json
{
    "body": "Resolution: fixed",
    "created_at": "2020-12-06T12:49:24Z",
    "issue": "https://github.com/sagemath/sagetest/issues/30724",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/30724#issuecomment-438722",
    "user": "https://github.com/vbraun"
}
```

Resolution: fixed
