# Issue 11422: Symbolic integration of abs() failure

Issue created by migration from Trac.

Original creator: mjo

Original creation time: 2011-07-13 18:05:20

Assignee: burcin

Originally posted to the mailing list by Pedro Cruz (I hope no one minds me collecting these?):

http://groups.google.com/group/sage-support/browse_thread/thread/4a24ce95e940820e

Actual result:


```
sage: integrate(abs(x^2 - 1), x, -2, 2)
integrate(abs(x^2 - 1), x, -2, 2)
```


Expected result:


```
sage: integrate(x^2 - 1, x, -2, -1) + integrate(1 - x^2, x, -1, 1) + integrate(x^2 - 1, x, 1, 2)
4
```


If it's helpful, we can change the limits of integration to avoid the roots. This seems to appease the integrate function:


```
sage: integrate(x^2, x, -1, 1)
2/3
```



---

Comment by burcin created at 2011-07-14 07:32:00

Changing keywords from "" to "integrate".


---

Comment by burcin created at 2011-07-14 07:32:00

Replying to [ticket:11594 mjo]:
> Originally posted to the mailing list by Pedro Cruz (I hope no one minds me collecting these?):

Not at all. I appreciate any effort in this direction. Please make sure that these are not duplicates of already existing tickets though. We started making a list of symbolics tickets on [this page](symbolics). It should make it easier to check the new tickets (also #11591 and #11590) against existing ones.

I am at a conference right now and don't have much time for this.

Note that the patch attached to #8624 loads the `abs_integrate` package in maxima which might help with some of these issues involving `abs()`. Unfortunately that patch won't apply any more, since the maxima interface changed quite a bit during the switch to use libECL.


---

Comment by kcrisman created at 2011-07-29 18:14:18

See #11483 for where that issue is currently standing.

I think that the OP meant the following (Maxima) in the last line:

```

(%i2) integrate(abs(x^2-1),x,-1,1);
                                       4
(%o2)                                  -
                                       3
```


This would indeed be fixed by the `abs_integrate` package.

```

(%i3) load(abs_integrate);
STYLE-WARNING: redefining SIMP-ISREAL-P in DEFUN
(%o3) /Users/.../maxima-5.24.0/share/contrib/integrat\
ion/abs_integrate.mac
(%i4) integrate(abs(x^2-1),x,-2,2);
(%o4)                                  4
```



---

Comment by kcrisman created at 2012-01-28 02:12:56

Changing status from new to needs_review.


---

Comment by kcrisman created at 2012-01-28 02:12:56

This is in fact fixed and documented in #11483, so I guess this ticket can be closed?  Since it's actually done, not really invalid per se, I will put an author as well as reviewer, but if the release manager or someone else disagrees with this analysis they can change those fields.


---

Comment by kcrisman created at 2012-01-28 02:14:48

Changing status from needs_review to positive_review.


---

Comment by mjo created at 2012-01-28 02:19:25

There's a doctest for this in #11638. I was thinking I'd move it to the proper place (in one of the Maxima files) either tomorrow or the next day.

It doesn't matter to me on which ticket I do it, though.


---

Comment by kcrisman created at 2012-01-28 02:38:48

Well, I already gave #11483 _nearly_ positive review... I mean, there are now two different tests for this.


---

Comment by mjo created at 2012-01-28 03:16:21

Oh, ok. I forgot there was a test in #11483 (I'm fixing it now). This can safely be closed.


---

Comment by jdemeyer created at 2012-02-07 13:30:27

Resolution: duplicate
