# Issue 13298: vector norm doesn't work with python integers

Issue created by migration from Trac.

Original creator: jason

Original creation time: 2012-09-17 15:06:49

Assignee: jason, was

CC:  rbeezer

Since there is a (1/p) calculation in the Cython file, if p is a python integer, that (1/p) is 0 (since 1 is also a python integer).

This fix is to make the 1 in 1/p actually a Sage integer, which does the right thing.  The 1 is cached at the module level.

Example of wrong behavior:


```
sage: v = vector(QQ, [1,2])
sage: v.norm(int(2))
1
```



---

Comment by jason created at 2012-09-17 15:11:43

By the way, this also seems to speed up the norm calculation too:

Before:

```
sage: sage: v=vector((1.71964708011116, 1.94742583018281))
sage: sage: timeit('v.norm(2)')
625 loops, best of 3: 66.9 µs per loop
sage: sage: timeit('v.norm(int(2))')
625 loops, best of 3: 39.6 µs per loop
```


After

```
sage: v=vector((1.71964708011116, 1.94742583018281))
sage: timeit('v.norm(2)')
625 loops, best of 3: 64.6 µs per loop
sage: timeit('v.norm(int(2))')
625 loops, best of 3: 31.7 µs per loop
```



---

Comment by rbeezer created at 2012-09-17 15:35:41

Replying to [comment:1 jason]:

How about having a Trac number in the relevant doctest?


---

Attachment

better?


---

Comment by rbeezer created at 2012-09-17 20:41:32

Replying to [comment:3 jason]:
> better?

Yup.  ;-)  I'll try to run tests tonight.


---

Comment by rbeezer created at 2012-09-18 03:40:49

Changing status from new to needs_review.


---

Comment by rbeezer created at 2012-09-18 03:43:36

Problem confirmed, and solved with patch.  Passes tests on 5.4.beta1.  Documentation looks fine.

Positive review.


---

Comment by rbeezer created at 2012-09-18 03:43:36

Changing status from needs_review to positive_review.


---

Comment by kcrisman created at 2012-09-19 01:05:44

Nice work!


---

Comment by jdemeyer created at 2012-09-26 07:47:11

Resolution: fixed
