# Issue 28338: asking base ring of polynomial ring to inject variables does not inject the correct variable names

Issue created by migration from https://trac.sagemath.org/ticket/28575

Original creator: saliola

Original creation time: 2019-10-08 01:33:32

CC:  dimpase @mwageringel @antonleykin

Keywords: IMA Coding Sprint, polynomial rings, quotients, injecting variables

Let's define a polynomial ring over a base ring that is a quotient of a polynomial ring. Then ask the base ring to inject the variables: 

```
sage: R = PolynomialRing(QQ, 'x,y')
sage: Q = R.quotient('x^2 - y')
sage: P = PolynomialRing(Q, 's,t')
sage: P.base_ring().inject_variables()
Defining xbar, ybar
```

This looks great, since `xbar` and `ybar` are the variable names of the base ring.

But now try it again, using a base ring that is a quotient ring in which we explicitly name the variables.

```
sage: R = PolynomialRing(QQ, 'x,y')
sage: Q = R.quotient('x^2 - y', names='x, y')
sage: P = PolynomialRing(Q, 's,t')
sage: P.base_ring().inject_variables()    # should define x, y
Defining xbar, ybar
```

This is very strange since the variable names in the base ring are `x,y`:

```
sage: Q.gens()
(x, y)
```


Now, exit and relaunch sage and run the two above blocks in the reverse order:

```
sage: R = PolynomialRing(QQ, 'x,y')
sage: Q = R.quotient('x^2 - y', names='x, y')
sage: P = PolynomialRing(Q, 's,t')
sage: P.base_ring().inject_variables()
Defining x, y

sage: Q = R.quotient('x^2 - y')
sage: P = Q['s,t']
sage: P.base_ring().inject_variables()  # should define xbar, ybar
Defining x, y
sage: Q.gens()
(xbar, ybar)

sage: Q = R.quotient('x^2 - y', names='a, b')
sage: P = Q['s,t']
sage: P.base_ring().inject_variables()  # should define a, b
Defining x, y
sage: Q.gens()
(a, b)
```






---

Comment by saliola created at 2019-10-08 02:00:37

Upon further explotation, the problem seems to be related `UniqueRepresentation` of polynomial rings:

```
sage: R = PolynomialRing(QQ, 'x,y')
sage: Q1 = R.quotient('x^2 - y', names='x, y')
sage: P1 = PolynomialRing(Q1, 's,t')
sage: Q2 = R.quotient('x^2 - y', names='a, b')
sage: P2 = PolynomialRing(Q2, 's,t')
sage: P1 is P2
True
```

The two ideals above are equal in the sense that `Q1 == Q2` is `True`, and so both calls to the polynomial ring constructor actually return the same object.

Not sure how to fix this. Note that quotient rings do not have `UniqueRepresentation`, so changing that might be one way to fix this problem, except perhaps there is a good reason why quotient rings are not unique(?).


---

Comment by embray created at 2020-01-06 14:10:03

Ticket retargeted after milestone closed


---

Comment by mkoeppe created at 2020-05-01 04:28:42

Moving tickets to milestone sage-9.2 based on a review of last modification date, branch status, and severity.
