# Issue 14709: is_abelian method for finitely presented groups

Issue created by migration from Trac.

Original creator: dshurbert

Original creation time: 2013-07-20 02:45:21

CC:  rbeezer vbraun mmarco

Keywords: group presentations

This method wraps the GAP function `IsAbelian` for finitely presented groups. 

```
sage: F = FreeGroup(2)
sage: G = F / [F([1,2,-1,-2])]
sage: G.is_abelian()
True
```


__Apply__


1 [attachment:trac_149_is_abelian.patch]


---

Attachment

Patch


---

Comment by vbraun created at 2013-07-20 02:51:23

This is already implemented in `GroupMixinLibGAP`, you probably just have to include it in the base classes for finitely presented groups (the mixin was added later to Sage).


---

Comment by dshurbert created at 2013-07-20 03:35:21

I see, my fault for not having a new enough release. I'm still waiting on my machine to finish building 5.11.beta3, as I am still on 5.10 at home. I will make the necessary changes as soon as possible.


---

Comment by dshurbert created at 2013-07-20 19:16:05

Just changed the patch from wrapping GAP's IsAbelian. `GroupMixinLibGAP` has been added to the class declaration for `FinitelyPresentedGroups` and works as intended.


---

Comment by dshurbert created at 2013-07-20 19:17:06

Changing status from new to needs_review.


---

Comment by vbraun created at 2013-07-26 02:41:59

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2013-07-26 02:41:59

Looks good to me.


---

Comment by dshurbert created at 2013-07-27 03:01:00

I discovered the following behavior while writing doctests for a direct_product function for finitely presented groups.

```
sage: from sage.groups.finitely_presented import wrap_FpGroup
sage: F = FreeGroup("a")
sage: G = FreeGroup("b")
sage: C4 = F / [F.0^4]
sage: C3 = G / [G.0^3]

sage: C12 = wrap_FpGroup(libgap.DirectProduct([C3.gap(), C4.gap()]))
sage: C12
Finitely presented group < f1, f2 | f1^3, f2^4, f1^-1*f2^-1*f1*f2 >
sage: C12.is_isomorphic(F / [F.0^12])
False
sage: C12.as_permutation_group().is_isomorphic(CyclicPermutationGroup(12))
True

# Again, constructing C12 by hand as C3 x C4.
sage: K = FreeGroup(2)
sage: C_12 = K / [K.0^4, K.1^3, K([-1,-2,1,2])]
sage: C_12
Finitely presented group < x0, x1 | x0^4, x1^3, x0^-1*x1^-1*x0*x1 >
sage: C_12.is_isomorphic(F / [F.0^12])
False
sage: C_12.as_permutation_group().is_isomorphic(CyclicPermutationGroup(12))
True
```

To replicate this behavior you must apply the patch attached to this ticket, #14913.

This failure of the `is_isomorphic` call seems to recur in similar instances of cyclic groups being constructed as a direct product. I'm not sure if I should make a new ticket for this apparent bug, but at the very least it seems as though it should halt this ticket.


---

Comment by dshurbert created at 2013-07-27 03:04:43

Changing status from positive_review to needs_work.


---

Comment by vbraun created at 2013-07-27 03:22:39

You also need to add the `check=<bool>` argument to the finitely presented group ctor:

```
sage: list(C12)
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)
...
/home/vbraun/opt/sage-5.11.beta3/local/lib/python2.7/site-packages/sage/groups/finitely_presented.pyc in _element_constructor_(self, *args, **kwds)
    697         if P is self._free_group:
    698             return self.element_class(x.Tietze(), parent=self, **kwds)
--> 699         return self.element_class(x, parent=self, **kwds)
    700 
    701     `@`cached_method

TypeError: __init__() got an unexpected keyword argument 'check'
```



---

Comment by vbraun created at 2013-07-27 03:52:30

The failure to find the isomorphism between the finitely presented groups looks like a GAP bug. I've reported it at http://tracker.gap-system.org/issues/424


---

Comment by dshurbert created at 2013-07-31 21:39:17

Added `check=True` as last argument for `FinitelyPresentedGroupElement` python constructor. Adding this argument to `__init__` for `FinitelyPresentedGroup` did not appear to have the desired affect. The examples below now run smoothly.

```
sage: G = FreeGroup("a")
sage: F = G / [G([1,1,1,1,1])]
sage: F.is_abelian()
True
sage: F.order()
5
sage: [i for i in F]
[1, a, a^-1, a^2, a^-2]
sage: F([1,1,1]).inverse()         
a^-3
sage: F([1,1,1]).inverse() in F
True
```

Is this what you meant by adding the `check=<bool>` argument? If so then ready for review.


---

Comment by dshurbert created at 2013-07-31 21:39:53

Changing status from needs_work to needs_review.


---

Comment by vbraun created at 2013-07-31 21:51:03

Yes, thats what I meant: the element constructor needs to accept a dummy check argument.

Upstream has targeted the bug for the next minor release.


---

Comment by vbraun created at 2013-07-31 21:52:09

Patchbot: 
apply  trac_14913_fpgroups_GroupMixinLibGAP.patchâ€‹


---

Comment by vbraun created at 2013-07-31 22:38:52

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2013-07-31 22:38:52

Looks good to me


---

Comment by jdemeyer created at 2013-08-17 07:44:52

Changing status from positive_review to needs_work.


---

Comment by jdemeyer created at 2013-08-17 07:44:52

This needs to be rebased to #14519.


---

Comment by dshurbert created at 2013-08-28 02:01:36

Rebased to #14519, ready for review.


---

Comment by dshurbert created at 2013-08-28 02:01:36

Changing status from needs_work to needs_review.


---

Comment by dshurbert created at 2013-08-28 02:05:22

Replacement patch, rebased to #14519


---

Attachment

Applies cleanly for me and all tests pass, so I'm setting this back to positive review.


---

Comment by tscrim created at 2013-08-30 22:37:50

Changing status from needs_review to positive_review.


---

Comment by jdemeyer created at 2013-09-04 08:06:42

Resolution: fixed
