# Issue 21790: Simplifying 0**x gives 0, with no assumptions on x

archive/issues_021790.json:
```json
{
    "body": "Keywords: simplify\n\nCheck this:\n\n```python\nsage: simplify(0**x)\n0\n```\n\nbut\n\n```python\nsage: 0**0\n1\n```\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/22027\n\n",
    "created_at": "2016-12-06T12:57:16Z",
    "labels": [
        "symbolics",
        "major",
        "bug"
    ],
    "title": "Simplifying 0**x gives 0, with no assumptions on x",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/21790",
    "user": "pelegm"
}
```
Keywords: simplify

Check this:

```python
sage: simplify(0**x)
0
```

but

```python
sage: 0**0
1
```


Issue created by migration from https://trac.sagemath.org/ticket/22027





---

archive/issue_comments_302277.json:
```json
{
    "body": "That is a Maxima bug.",
    "created_at": "2017-01-14T08:08:54Z",
    "issue": "https://github.com/sagemath/sagetest/issues/21790",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/21790#issuecomment-302277",
    "user": "rws"
}
```

That is a Maxima bug.



---

archive/issue_comments_302278.json:
```json
{
    "body": "Are we ok with sage returning 1 for 0^0? This is the case in Python, but in Maxima is it undefined.\n\nIs maxima under active development? Should we report that issue there?\n\nNote that sympy handles this properly:\n\n```\nIn [6]: sympy.simplify(0**x)\nOut[6]: 0**x\n```\n",
    "created_at": "2018-06-29T14:32:14Z",
    "issue": "https://github.com/sagemath/sagetest/issues/21790",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/21790#issuecomment-302278",
    "user": "pelegm"
}
```

Are we ok with sage returning 1 for 0^0? This is the case in Python, but in Maxima is it undefined.

Is maxima under active development? Should we report that issue there?

Note that sympy handles this properly:

```
In [6]: sympy.simplify(0**x)
Out[6]: 0**x
```




---

archive/issue_comments_302279.json:
```json
{
    "body": "Singular says `0^n = 0` (where `n` must be an integer):\n\n```\nCanonicalForm\npower ( const CanonicalForm & f, int n )\n{\n  ASSERT( n >= 0, \"illegal exponent\" );\n\n  if ( f.isZero() )\n    return CanonicalForm(0L);\n  ...\n```\n\nI would say this is clearly wrong: `x^0` needs to be `1` for all `x` if the exponent is an integer variable.",
    "created_at": "2021-02-26T03:18:59Z",
    "issue": "https://github.com/sagemath/sagetest/issues/21790",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/21790#issuecomment-302279",
    "user": "@DaveWitteMorris"
}
```

Singular says `0^n = 0` (where `n` must be an integer):

```
CanonicalForm
power ( const CanonicalForm & f, int n )
{
  ASSERT( n >= 0, "illegal exponent" );

  if ( f.isZero() )
    return CanonicalForm(0L);
  ...
```

I would say this is clearly wrong: `x^0` needs to be `1` for all `x` if the exponent is an integer variable.



---

archive/issue_comments_302280.json:
```json
{
    "body": "[Ask Sage question 61400](https://ask.sagemath.org/question/61400) makes me raise the priority of this one.\n\nOne should note that\n\n- Sympy does not give an explicit 1 and returns the sum unevaluated\n- Giac returns `undef`\n- Mathematica raises an error claiming that `0^0` is indeterminate\n\nFurthermore:\n\n```\nsage: sum(x^j/factorial(j),j,0,oo)\ne^x\nsage: sum(x^j/factorial(j),j,0,oo).limit(x=0)\n1\nsage: sum(x^j/factorial(j),j,0,oo).subs(x=0)\n1\n```\n\n\nBut, indeed:\n\n\n```\nsage: with assuming(j, \"integer\", j >= 0): 0^j\n0^j\nsage: with assuming(j, \"integer\", j >= 0): (0^j).simplify()\n0\n```\n\n\nSince `simplify` does its work by passing its argument to Maxima,\nand uses the returned value as a result, the ball is well in Maxima's camp...",
    "created_at": "2022-03-05T14:44:10Z",
    "issue": "https://github.com/sagemath/sagetest/issues/21790",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/21790#issuecomment-302280",
    "user": "charpent"
}
```

[Ask Sage question 61400](https://ask.sagemath.org/question/61400) makes me raise the priority of this one.

One should note that

- Sympy does not give an explicit 1 and returns the sum unevaluated
- Giac returns `undef`
- Mathematica raises an error claiming that `0^0` is indeterminate

Furthermore:

```
sage: sum(x^j/factorial(j),j,0,oo)
e^x
sage: sum(x^j/factorial(j),j,0,oo).limit(x=0)
1
sage: sum(x^j/factorial(j),j,0,oo).subs(x=0)
1
```


But, indeed:


```
sage: with assuming(j, "integer", j >= 0): 0^j
0^j
sage: with assuming(j, "integer", j >= 0): (0^j).simplify()
0
```


Since `simplify` does its work by passing its argument to Maxima,
and uses the returned value as a result, the ball is well in Maxima's camp...



---

archive/issue_comments_302281.json:
```json
{
    "body": "Changing priority from major to critical.",
    "created_at": "2022-03-05T14:44:10Z",
    "issue": "https://github.com/sagemath/sagetest/issues/21790",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/21790#issuecomment-302281",
    "user": "charpent"
}
```

Changing priority from major to critical.



---

archive/issue_comments_302282.json:
```json
{
    "body": "The \"maxima-discuss\" mailing list had a thread last month\nabout zero to the zero:\n\n- https://sourceforge.net/p/maxima/mailman/message/37606840/\n\n(from there click \"View entire thread\").",
    "created_at": "2022-03-06T00:38:12Z",
    "issue": "https://github.com/sagemath/sagetest/issues/21790",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/21790#issuecomment-302282",
    "user": "slelievre"
}
```

The "maxima-discuss" mailing list had a thread last month
about zero to the zero:

- https://sourceforge.net/p/maxima/mailman/message/37606840/

(from there click "View entire thread").
