# Issue 28615: Make continued_fraction_list accept float argument

archive/issues_028615.json:
```json
{
    "body": "CC:  vdelecroix\n\nKeywords: continued_fraction\n\nIn Sage 9.0.beta8, for a float, `continued_fraction` works\nbut `continued_fraction_list` does not:\n\n```\nsage: set_random_seed(0)\nsage: x = random()\nsage: x\n0.111439293741037\nsage: continued_fraction(x)\n[0; 8, 1, 36, 1, 2, 1, 2, 3, 2, 6, 1, 12, 1, 1, 10, 1, 4]\nsage: continued_fraction_list(x)\nTraceback (most recent call last)\n...\nAttributeError: 'float' object has no attribute 'parent'\n```\n\n\nOne would expect:\n\n```\nsage: continued_fraction_list(x)\n[0, 8, 1, 36, 1, 2, 1, 2, 3, 2, 6, 1, 12, 1, 1, 10, 1, 4]\n```\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/28852\n\n",
    "created_at": "2019-12-07T18:56:54Z",
    "labels": [
        "basic arithmetic",
        "major",
        "enhancement"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-9.8",
    "title": "Make continued_fraction_list accept float argument",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/28615",
    "user": "slelievre"
}
```
CC:  vdelecroix

Keywords: continued_fraction

In Sage 9.0.beta8, for a float, `continued_fraction` works
but `continued_fraction_list` does not:

```
sage: set_random_seed(0)
sage: x = random()
sage: x
0.111439293741037
sage: continued_fraction(x)
[0; 8, 1, 36, 1, 2, 1, 2, 3, 2, 6, 1, 12, 1, 1, 10, 1, 4]
sage: continued_fraction_list(x)
Traceback (most recent call last)
...
AttributeError: 'float' object has no attribute 'parent'
```


One would expect:

```
sage: continued_fraction_list(x)
[0, 8, 1, 36, 1, 2, 1, 2, 3, 2, 6, 1, 12, 1, 1, 10, 1, 4]
```


Issue created by migration from https://trac.sagemath.org/ticket/28852





---

archive/issue_comments_403861.json:
```json
{
    "body": "The simplest would be to start with the conversion of the argument with `py_scalar_to_element` (from `sage.structure.coerce`).",
    "created_at": "2019-12-07T22:58:52Z",
    "issue": "https://github.com/sagemath/sagetest/issues/28615",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/28615#issuecomment-403861",
    "user": "vdelecroix"
}
```

The simplest would be to start with the conversion of the argument with `py_scalar_to_element` (from `sage.structure.coerce`).



---

archive/issue_comments_403862.json:
```json
{
    "body": "Ticket retargeted after milestone closed",
    "created_at": "2020-01-06T14:10:03Z",
    "issue": "https://github.com/sagemath/sagetest/issues/28615",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/28615#issuecomment-403862",
    "user": "embray"
}
```

Ticket retargeted after milestone closed



---

archive/issue_comments_403863.json:
```json
{
    "body": "Moving tickets to milestone sage-9.2 based on a review of last modification date, branch status, and severity.",
    "created_at": "2020-05-01T04:28:42Z",
    "issue": "https://github.com/sagemath/sagetest/issues/28615",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/28615#issuecomment-403863",
    "user": "mkoeppe"
}
```

Moving tickets to milestone sage-9.2 based on a review of last modification date, branch status, and severity.



---

archive/issue_comments_403864.json:
```json
{
    "body": "Moving this ticket to 9.4, as it seems unlikely that it will be merged in 9.3, which is in the release candidate stage",
    "created_at": "2021-04-02T20:21:54Z",
    "issue": "https://github.com/sagemath/sagetest/issues/28615",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/28615#issuecomment-403864",
    "user": "mkoeppe"
}
```

Moving this ticket to 9.4, as it seems unlikely that it will be merged in 9.3, which is in the release candidate stage
