# Issue 27449: Fix digraphs.nauty_directg or the documentation

Issue created by migration from https://trac.sagemath.org/ticket/27686

Original creator: slelievre

Original creation time: 2019-04-17 06:55:16

CC:  dcoudert slelievre vklein

Keywords: digraphs, nauty

The [documentation for nauty_directg](http://doc.sagemath.org/html/en/reference/graphs/sage/graphs/digraph_generators.html#sage.graphs.digraph_generators.DiGraphGenerators.nauty_directg) currently has this example:


```python
sage: gen = graphs.nauty_geng("-c 3")
sage: dgs = list(digraphs.nauty_directg(gen))
sage: len(dgs)
13
sage: dgs[0]
Digraph on 3 vertices
sage: dgs[0]._bit_vector()
'001001000'
sage: len(list(digraphs.nauty_directg(graphs.PetersenGraph(), options="-o")))
324
```

but in Sage 8.6 or 8.7 one needs to use `sage.graphs.digraph_generators.digraphs.nauty_directg`
instead of just `digraphs.nauty_directg`.

We should either fix the documentation or fix Sage to conform to the documentation.


---

Comment by slelievre created at 2019-04-18 18:42:38

Changing keywords from "digraphs, nauty" to "digraphs, nauty, digraphs".


---

Comment by slelievre created at 2019-04-18 18:42:57

Changing keywords from "digraphs, nauty, digraphs" to "digraphs, nauty, directg".


---

Comment by dcoudert created at 2019-04-18 20:40:31

I don't have this issue. Could it be caused by something else ?

```
┌────────────────────────────────────────────────────────────────────┐
│ SageMath version 8.8.beta2, Release Date: 2019-04-14               │
│ Using Python 2.7.15. Type "help()" for help.                       │
└────────────────────────────────────────────────────────────────────┘
┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓
┃ Warning: this is a prerelease version, and it may be unstable.     ┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛
sage: gen = graphs.nauty_geng("-c 3")
sage: dgs = list(digraphs.nauty_directg(gen))
sage: len(dgs)
13
```



---

Comment by slelievre created at 2019-04-18 21:43:44

Not sure what happened, now it works for me too with

```
sage: version()
'SageMath version 8.8.beta2, Release Date: 2019-04-14'
sage: sys.version_info[:3]
(3, 7, 3)
```


Please review the "invalid/wontfix" milestone and this can then be closed.


---

Comment by slelievre created at 2019-04-18 21:43:44

Changing status from new to needs_review.


---

Comment by vdelecroix created at 2019-04-18 22:14:50

Resolution: invalid
