# Issue 10789: reset() doesn't quite forget()

Issue created by migration from Trac.

Original creator: dsm

Original creation time: 2011-02-26 18:03:58

Assignee: burcin


```
sage: help(reset)
...
   Delete all user defined variables, reset all globals variables
    back to their default state, and reset all interfaces to other
    computer algebra systems.
...
sage: assumptions()
[]
sage: x
x
sage: bool(x > 3)
False
sage: assume(x > 4)
sage: assumptions()
[x > 4]
sage: bool(x > 3)
True
sage: reset()
sage: assumptions()
[x > 4]
sage: # still assumed! but fortunately
sage: bool(x > 3)
False
```




---

Attachment


---

Comment by dsm created at 2011-03-04 13:15:41

Changing status from new to needs_review.


---

Comment by burcin created at 2011-03-06 15:29:58

Changing status from needs_review to positive_review.


---

Comment by burcin created at 2011-03-06 15:29:58

Looks good to me.


---

Comment by kcrisman created at 2011-03-08 14:51:57

Nice!  Good catch.


---

Comment by jdemeyer created at 2011-03-17 19:23:37

Resolution: fixed
