# Issue 15704: Incorrect matrix vector multiplication with real interval field RIF elements

Issue created by migration from Trac.

Original creator: tcoffee

Original creation time: 2014-03-14 16:22:24

CC:  jakobkroeker

Keywords: RIF matrix vector

Occurs when elements are RealIntervalField intervals containing zero.


```
sage: matrix(((1,0),(0,1)))*vector((RIF(-1,1),RIF(-1,1)))
(0, 0)
sage: _ == vector((RIF(0), RIF(0)))
True
```


Seems likely this is due to applying a zero test that is not valid for interval terms.

It is not a coercion issue: the above behaves identically when the matrix elements are made explicitly RIF.


---

Comment by dimpase created at 2022-10-13 12:46:07

works for me in 9.8beta1

```
sage: matrix(((1,0),(0,1)))*vector((RIF(-1,1),RIF(-1,1)))
(0.?, 0.?)
sage: _ == vector((RIF(0), RIF(0)))
False
```



---

Comment by dimpase created at 2022-10-13 12:46:07

Changing status from new to needs_review.


---

Comment by dimpase created at 2022-10-13 12:46:15

Changing status from needs_review to positive_review.


---

Comment by mkoeppe created at 2022-11-14 19:36:43

Resolution: invalid
