# Issue 22683: Maxima library interface is broken for symbolic sums and products

Issue created by migration from Trac.

Original creator: charpent

Original creation time: 2017-05-01 16:51:42

CC:  rws

Keywords: symbolics


```sage
sage: var("j,p", domain="integer")
(j, p)
sage: X=function("X")
```

Compare :

```sage
sage: foo=sum(X(j),j,1,p);foo
sum(X(j), j, 1, p)
sage: bar=maxima("sum(X(j),j,1,p)").sage();bar
sum(X(j), j, 1, p)
sage: bool(foo==bar)
True
```

with

```sage
sage: gee=X(j).maxima_methods().sum(j,1,p);gee
p*X(j)                   ## Nonsense...
sage: bool(foo==gee)
False
```


The problem also exists with products, but there is currently (Sage 8.0.beta4) no Sage function creating a symbolic product. Compare :

```
sage: maxima("prod(X(j),j,1,p)")
'product(X(j),j,1,p)
sage: X(j).maxima_methods().prod(j,1,p)
X(j)^p
```

#22914 aims at fixing the product "problem", which is larger (and maybe different).


---

Comment by rws created at 2017-05-02 05:26:36

The product part is #17502.
