# Issue 11671: Bug in trivial abelian group

Issue created by migration from Trac.

Original creator: wuthrich

Original creation time: 2011-09-24 10:37:27

Assignee: joyner

Keywords: S-class group, trivial abelian group

The following code


```
K.<t> = NumberField(x^2+17)
I = K.ideal(3,t+1)
S = K.primes_above(11)
A = K.S_class_group(S)
A(I)
```


produces the error


```
TypeError: unsupported operand parent(s) for '*': 'Ambient free module
of rank 1 over the principal ideal domain Integer Ring' and 'Full
MatrixSpace of 0 by 0 dense matrices over Integer Ring'
```


The same error can be obtained by


```
A.identity()
```


The problem seems to arise only when the abelian group is trivial.

I imagine this is not a problem of the class group implementation, but one of (trivial) abelian group.


---

Comment by wuthrich created at 2013-05-14 08:53:08

Changing status from new to needs_review.


---

Comment by wuthrich created at 2013-05-14 08:53:08

This is no longer a problem in 5.9. This ticket can be closed now:


```
sage: K.<t> = NumberField(x^2+17)
sage: I = K.ideal(3,t+1)
sage: S = K.primes_above(11)
sage: A = K.S_class_group(S)
sage: A(I)
Trivial S-ideal class
sage: A.identity()
Trivial S-ideal class
```


(Sorry that I can't remember what to do with a ticket like this. I just put it to need_review ...


---

Comment by wuthrich created at 2013-05-14 16:25:56

... and then to positive_review). Sorry if I do the wrong thing. In any case the ticket can be closed without further action.


---

Comment by wuthrich created at 2013-05-14 16:25:56

Changing status from needs_review to positive_review.


---

Comment by jdemeyer created at 2013-05-16 07:33:16

Resolution: worksforme
