# Issue 32726: RealDoubleField: Exponentiation should not raise exceptions

archive/issues_032726.json:
```json
{
    "body": "CC:  tmonteil @dimpase @videlec @tscrim @slel\n\n(from #32779)\n\n`RDF` contains infinities and NaNs, which can appear as results of arithmetic operations.\n\n```\nsage: RDF(1.0)/RDF(0.0)\n+infinity\nsage: RDF(0.0)/RDF(0.0)\nNaN\n```\n\nThis is consistent with `RR`:\n\n```\nsage: RR(1.0)/RR(0.0)\n+infinity\nsage: RR(0.0)/RR(0.0)\nNaN\n```\n\n\nHowever, `RealDoubleElement_gsl.__pow__` raises exceptions:\n\n```\nsage: RDF(0).__pow__(RDF(-1))\nZeroDivisionError: 0.0 cannot be raised to a negative power\nsage: RDF(-1).__pow__(RDF(0.5))\nValueError: negative number cannot be raised to a fractional power\n```\n\n... in contrast to the other arithmetic operations and in contrast to `RR`:\n\n```\nsage: RR(0).__pow__(RR(-1))\n+infinity\nsage: RR(-1).__pow__(RR(0.5))\n6.12323399573677e-17 + 1.00000000000000*I\n```\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/32963\n\n",
    "created_at": "2021-12-04T01:34:07Z",
    "labels": [
        "basic arithmetic",
        "major",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-9.8",
    "title": "RealDoubleField: Exponentiation should not raise exceptions",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/32726",
    "user": "@mkoeppe"
}
```
CC:  tmonteil @dimpase @videlec @tscrim @slel

(from #32779)

`RDF` contains infinities and NaNs, which can appear as results of arithmetic operations.

```
sage: RDF(1.0)/RDF(0.0)
+infinity
sage: RDF(0.0)/RDF(0.0)
NaN
```

This is consistent with `RR`:

```
sage: RR(1.0)/RR(0.0)
+infinity
sage: RR(0.0)/RR(0.0)
NaN
```


However, `RealDoubleElement_gsl.__pow__` raises exceptions:

```
sage: RDF(0).__pow__(RDF(-1))
ZeroDivisionError: 0.0 cannot be raised to a negative power
sage: RDF(-1).__pow__(RDF(0.5))
ValueError: negative number cannot be raised to a fractional power
```

... in contrast to the other arithmetic operations and in contrast to `RR`:

```
sage: RR(0).__pow__(RR(-1))
+infinity
sage: RR(-1).__pow__(RR(0.5))
6.12323399573677e-17 + 1.00000000000000*I
```


Issue created by migration from https://trac.sagemath.org/ticket/32963





---

archive/issue_comments_466786.json:
```json
{
    "body": "`@`mkoeppe, did you mean to set this to \"needs review\"?\n----\nNew commits:",
    "created_at": "2021-12-14T05:41:02Z",
    "issue": "https://github.com/sagemath/sagetest/issues/32726",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/32726#issuecomment-466786",
    "user": "@slel"
}
```

`@`mkoeppe, did you mean to set this to "needs review"?
----
New commits:



---

archive/issue_comments_466787.json:
```json
{
    "body": "No, it's not quite ready yet. I think there are still some corner cases, and test coverage should be improved. Any help is welcome",
    "created_at": "2021-12-14T17:43:49Z",
    "issue": "https://github.com/sagemath/sagetest/issues/32726",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/32726#issuecomment-466787",
    "user": "@mkoeppe"
}
```

No, it's not quite ready yet. I think there are still some corner cases, and test coverage should be improved. Any help is welcome
