# Issue 11636: MPC complex numbers and the symbolic i cannot be added

Issue created by migration from https://trac.sagemath.org/ticket/11808

Original creator: jpflori

Original creation time: 2011-09-16 08:57:34

Assignee: tbd

CC:  leif slelievre

Keywords: mpc complex numbers multiprecision.org

With the current interface to the MPC library, you cannot add the symbolic i and complex numbers:


```
sage: from sage.rings.complex_mpc import MPComplexField
sage: MPC = MPComplexField()
sage: MPC(1)+i
...
TypeError: unsupported operand parent(s) for '+': 'Complex Field with 53 bits of precision' and 'Symbolic Ring'

```

This work with "usual" complex numbers:


```
sage: CC(1)+i
1.00000000000000 + 1.00000000000000*I

```



---

Comment by jdemeyer created at 2015-09-10 12:21:14

Changing assignee from tbd to robertwb.


---

Comment by jdemeyer created at 2015-09-10 12:21:14

Changing component from packages: optional to coercion.


---

Comment by slelievre created at 2021-04-29 11:05:40

Updating ticket description after #18036 was merged in 9.3.beta2.

This, which was failing in the original report, now works:

```
sage: MPC(1) + i
1.00000000000000 + 1.00000000000000*I
```

but this still fails:

```
sage: MPC(1) + SR(i)
```

