# Issue 24117: RBF(expr) has the wrong parent

Issue created by migration from Trac.

Original creator: mmezzarobba

Original creation time: 2017-12-09 19:45:40

CC:  slelievre


```
sage: RBF(psi(1,1/3)).parent()
Symbolic Ring
```



---

Comment by mmezzarobba created at 2020-11-25 15:54:40

Changing status from new to needs_review.


---

Comment by mmezzarobba created at 2020-11-25 15:54:40

Now raises an error (thanks to #28517, I think). That's okay, though it would be even better to have a mechanism that makes this evaluation boil down to something like `RBF(CBF(1/3).psi(1))`.


---

Comment by vdelecroix created at 2021-01-23 16:48:32

The generic symbolic evaluation is making at least two mistakes here. The code is at lines 1562-1568 of expression.pyx

```
try:
    res = self.operator()(*[R(a) for a in args])
except (TypeError, ValueError):
    pass
else:
    if res.parent() is R:
        return res
```


With the input provided in the ticket description, it produces

```
sage: from sage.functions.gamma import psi2
sage: psi2(RBF(1), RBF(1/3))
psi(1.000000000000000, [0.3333333333333333 +/- 7.04e-17])
```

This is bad since the proper way to make the call should have been `psi(1, RBF(1/3))`.

Secondly, `psi(1, RBF(1/3))` is broken as it should produce a ball

```
sage: from sage.functions.gamma import psi2
sage: psi2(1, RBF(1/3))
psi(1, [0.3333333333333333 +/- 7.04e-17])
```


Is there a ticket to improve the `RBF(expression)`?


---

Comment by mmezzarobba created at 2021-01-23 17:35:12

Replying to [comment:2 vdelecroix]:
> Is there a ticket to improve the `RBF(expression)`?

None that I know of. (I started fixing the worst issues in #28517 and its dependencies, but didn't have the courage to handle all cases.)


---

Comment by slelievre created at 2021-08-21 15:06:28

Should we close this ticket as invalid
or repurpose it to improve `RBF(expr)`?


---

Comment by slelievre created at 2021-08-21 15:06:28

Changing component from PLEASE CHANGE to numerical.


---

Comment by mmezzarobba created at 2021-09-18 09:44:37

Replying to [comment:4 slelievre]:
> Should we close this ticket as invalid
> or repurpose it to improve `RBF(expr)`?

Close it, IMO. Improving `RBF(expr)` will take several tickets, and this one provides no clear roadmap.


---

Comment by chapoton created at 2022-02-14 19:49:47

Resolution: invalid


---

Comment by tmonteil created at 2022-02-14 20:27:46

Some comments of this ticket show wrong behaviours, i think specific related tickets should be created before this one is closed or we will lose that information.


---

Comment by tmonteil created at 2022-02-14 20:27:53

By the way, the following seems to work:


```
sage: RBF(RIF(psi(1,1/3)))
[10.09559712542709 +/- 4.20e-15]
```



---

Comment by mmezzarobba created at 2022-02-15 08:33:26

Replying to [comment:8 tmonteil]:
> By the way, the following seems to work:
> 
> {{{
> sage: RBF(RIF(psi(1,1/3)))
> [10.09559712542709 +/- 4.20e-15]
> }}}

...Because it replaces the intervals with points:

```
sage: RIF(psi(RIF(0.99,1.01),1/3))
10.095597125427095?
```

(So the bug is that it works.)


---

Comment by chapoton created at 2022-02-15 09:18:23

pouvez re-ouvrir le ticket si vous voulez, hein
