# Issue 10838: inverse() method for permutation group elements

Issue created by migration from https://trac.sagemath.org/ticket/10911

Original creator: rbeezer

Original creation time: 2011-03-10 19:13:09

Assignee: joyner

CC:  kcrisman

Patch aims to resolve the following inconsistency, by providing a `.inverse()` method for permutation group elements.


```
sage: S = SymmetricGroup(4)
sage: s = S("(1,2,3)")
sage: type(s)
<type
'sage.groups.perm_gps.permgroup_element.PermutationGroupElement'>
sage: s^-1
(1,3,2)
sage: s.inverse()
(1,3,2)

sage: A = AlternatingGroup(4)
sage: a = A("(1,2,3)")
sage: type(a)
<type
'sage.groups.perm_gps.permgroup_element.PermutationGroupElement'>
sage: a^-1
(1,3,2)
sage: a.inverse()
---------------------------------------------------------------------------
AttributeError                            Traceback (most recent call last)
<snip>
AttributeError:
'sage.groups.perm_gps.permgroup_element.PermutationGroupElement' object has no attribute 'inverse' 
```


Some discussion at http://groups.google.com/group/sage-devel/browse_thread/thread/683315261a6c6def


---

Attachment


---

Comment by rbeezer created at 2011-03-10 19:16:39

Changing status from new to needs_review.


---

Comment by robertwb created at 2011-03-10 19:38:00

Calling `self.__invert__()` is slow, use `~self` instead. Other than that, looks good.


---

Comment by robertwb created at 2011-03-10 19:38:00

Changing status from needs_review to needs_work.


---

Comment by rbeezer created at 2011-03-11 04:18:57

Changing status from needs_work to needs_review.


---

Attachment

Replying to [comment:3 robertwb]:
> Calling `self.__invert__()` is slow, use `~self` instead. 

Thanks, Robert.  v2 patch has the suggested change.

Rob


---

Comment by robertwb created at 2011-03-11 05:58:41

Looks good to me.


---

Comment by robertwb created at 2011-03-11 05:58:41

Changing status from needs_review to positive_review.


---

Comment by jdemeyer created at 2011-03-28 07:18:30

Resolution: fixed
