# Issue 15210: implement evaluation of PARI closures

Issue created by migration from https://trac.sagemath.org/ticket/15447

Original creator: pbruin

Original creation time: 2013-11-22 19:06:56

Keywords: pari closure

It would be nice to be able to call PARI closures from Sage.  Currently, calling a PARI object assumes that it is a polynomial:

```
sage: T = pari('n->n+1')
sage: T.type()
't_CLOSURE'
sage: T(3)
Traceback (most recent call last):
...
PariError: incorrect type in poleval
```



---

Comment by jdemeyer created at 2013-11-22 22:15:50

Last 10 new commits:


---

Comment by jdemeyer created at 2013-11-22 22:15:50

Changing component from packages: standard to interfaces.


---

Comment by git created at 2013-11-22 22:36:34

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by pbruin created at 2013-11-22 22:40:24

Changing status from new to needs_review.


---

Comment by jdemeyer created at 2013-11-27 07:35:27

I think you should also implement `getattr()` using closures, see [http://pari.math.u-bordeaux1.fr/archives/pari-dev-1311/msg00015.html](http://pari.math.u-bordeaux1.fr/archives/pari-dev-1311/msg00015.html)`


---

Comment by git created at 2013-12-13 22:08:21

Branch pushed to git repo; I updated commit sha1. This was a forced push. Recent commits:


---

Comment by pbruin created at 2013-12-13 22:10:14

Now that the `t0GEN` stuff is done, this does not depend on #15185 anymore.


---

Comment by jdemeyer created at 2013-12-17 13:43:13

New commit needs review. I merged in #15461 since that has positive_review anyway and I didn't want to risk merge conflicts.
----
Last 10 new commits:


---

Comment by pbruin created at 2013-12-18 16:35:59

PARI allows default values for arguments; without the arity check one can do

```
sage: f = pari('(x, y=3) -> x/y')
sage: f(2)
2/3
```

On the other hand, omitting the arity check altogether is not an option since passing too many arguments gives unexpected results (and moreover a look at the source code of `closure_callgenvec` suggests that this could lead to memory corruption):

```
sage: f(1,2,3,4,5)
4/5
```

Figuring out the default values from the `t_CLOSURE` doesn't seem worth the trouble, leaving two reasonable options:
- either don't bother supporting PARI default values
- or check for `nargs <= arity` and allow PARI to substitute default values, including its convention to set any unspecified arguments to 0
I don't have a strong preference.


---

Comment by jdemeyer created at 2013-12-18 16:48:27

Replying to [comment:13 pbruin]:
> check for `nargs <= arity` and allow PARI to substitute default values, including its convention to set any unspecified arguments to 0

This is actually what GP does, so I'll go with that.


---

Comment by git created at 2013-12-18 17:16:35

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by pbruin created at 2013-12-18 22:31:40

The last commit makes a small addition to the documentation: mention in the documentation of `eval()` that `f(x) == f.eval(x)`, before the examples that use this.
----
New commits:


---

Comment by pbruin created at 2013-12-18 22:35:49

Replying to [comment:6 jdemeyer]:
> I think you should also implement `getattr()` using closures, see [http://pari.math.u-bordeaux1.fr/archives/pari-dev-1311/msg00015.html](http://pari.math.u-bordeaux1.fr/archives/pari-dev-1311/msg00015.html)`
I forgot to say here that this is now #15518.


---

Comment by jdemeyer created at 2013-12-19 08:05:28

positive_review from me. If you agree, you can set the ticket to positive_review.


---

Comment by pbruin created at 2013-12-19 12:58:43

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2013-12-21 12:16:01

Resolution: fixed
