# Issue 28975: format symbolic expression

Issue created by migration from https://trac.sagemath.org/ticket/29212

Original creator: vdelecroix

Original creation time: 2020-02-17 08:20:42

CC:  dimpase

The following used to work with 8.9 but does not work in 9.0

```
sage: "{:5}".format(pi)
Traceback (most recent call last)
...
TypeError: unsupported format string passed to
sage.symbolic.expression.Expression.__format__
```


See also [this sage-devel thread](https://groups.google.com/forum/#!topic/sage-devel/6Ms-kNluZyo).


---

Comment by dimpase created at 2020-02-17 08:39:11

maybe it's just py3 thing. Perhaps it still works with py2-Sage 9.0.


---

Comment by vdelecroix created at 2020-02-17 09:45:52

Whatever it is, it is broken!


---

Comment by egourgoulhon created at 2020-02-17 13:11:36

The issue is not limited to symbolic expressions; Sage numbers also suffer from it:
- with Python2-Sage 8.9:

```
sage: "{:5}".format(RR(2))
'2.00000000000000'
sage: "{:5}".format(QQ(2))
'2    '
```

- with Python3-Sage 9.0:

```
sage: "{:5}".format(RR(2))
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)
<ipython-input-4-b12c61e97381> in <module>()
----> 1 "{:5}".format(RR(Integer(2)))

TypeError: unsupported format string passed to sage.rings.real_mpfr.RealNumber.__format__

sage: "{:5}".format(QQ(2))
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)
<ipython-input-5-c85334e7455d> in <module>()
----> 1 "{:5}".format(QQ(Integer(2)))

TypeError: unsupported format string passed to sage.rings.rational.Rational.__format__
```



---

Comment by dimpase created at 2020-02-21 08:55:47

`ZZ` works, as `src/sage/rings/integer.pyx` has an explicit `__format__` function, I suppose. It would be rather unfortunate if every class needed such an explicit `__format__`.


---

Comment by vdelecroix created at 2020-02-22 07:51:29

Replying to [comment:7 dimpase]:
> `ZZ` works, as `src/sage/rings/integer.pyx` has an explicit `__format__` function, I suppose. It would be rather unfortunate if every class needed such an explicit `__format__`.

It does: `return int(self).__format__(*args, **kwargs)`. What about implenting a generic `__format__` in `SageObject` or `CategoryObject` then?


---

Comment by dimpase created at 2020-02-25 10:34:15

I have no idea how this could be done.


---

Comment by @mwageringel created at 2020-03-04 18:33:56

In Python 2, the default implementation of `__format__` implicitly converted the argument to string. In Python 3, one needs to convert explicitly. This was changed because otherwise it would be very difficult to implement `__format__` for an existing class in a backward compatible way because a valid format spec for strings may not be a valid format spec for other classes. See https://bugs.python.org/issue7994. Therefore, implementing a generic `__format__` in `SageObject` by converting to string might not be desirable. Instead, explicitly convert to string:


```
sage: "{!s:5}".format(pi)
'pi   '
sage: "{:5}".format(str(pi))
'pi   '
```


In principle, `__format__` should depend on the type of an object and thus should be implemented for specific classes. For example, I would expect this to work for floating point numbers:


```
sage: "{:.3f}".format(RR(1/3))  # py3
...
TypeError: unsupported format string passed to sage.rings.real_mpfr.RealNumber.__format__
sage: "{:.3f}".format(RR(1/3))  # py2
...
ValueError: Unknown format code 'f' for object of type 'str'
```

For real numbers, this could be implemented by delegating to `Decimal` which is what [Sympy](https://github.com/sympy/sympy/blob/9aa14250cfcc7b9a62c4c41fa00f90e9f1ce4cfc/sympy/core/numbers.py#L1496) does. For other classes like symbolic expressions, it is less clear what to do.


---

Comment by jhpalmieri created at 2020-03-04 19:03:55

See also https://ask.sagemath.org/question/50152/sage-doesnt-support-completely-modern-string-formatting/. If we manage to fix `"{:.3f}".format(RR(1/3))`, will that also fix `a = RR(1/3); f"{a:.3f}"`?


---

Comment by @mwageringel created at 2020-03-04 19:14:11

Replying to [comment:11 jhpalmieri]:
> If we manage to fix `"{:.3f}".format(RR(1/3))`, will that also fix `a = RR(1/3); f"{a:.3f}"`?
Yes, that should work then.


---

Comment by jhpalmieri created at 2020-03-04 19:19:23

We could start with this, using Sage's `_repr_` as a model:

```diff
diff --git a/src/sage/structure/sage_object.pyx b/src/sage/structure/sage_object.pyx
index 140e2defef..7271ac0002 100644
--- a/src/sage/structure/sage_object.pyx
+++ b/src/sage/structure/sage_object.pyx
@@ -197,6 +197,12 @@ cdef class SageObject:
         # Allow _repr_ to return unicode on Python 2
         return result.encode('utf-8')
 
+    def __format__(self, format_spec=None):
+        try:
+            return self._format_(format_spec)
+        except AttributeError:
+            return str(self)
+
     def _ascii_art_(self):
         r"""
         Return an ASCII art representation.
```

Then redefine the `__format__` method for integers as `_format_`, and define a `_format_` method for `RR` and some others.


---

Comment by @mwageringel created at 2020-03-04 19:46:21

Instead of hiding the error we could also raise a `NotImplementedError` with a more useful message, suggesting to convert to string explicitly, for the time being.


---

Comment by nbruin created at 2020-03-05 17:31:49

Replying to [comment:13 jhpalmieri]:
> Then redefine the `__format__` method for integers as `_format_`, and define a `_format_` method for `RR` and some others.

What's the benefit of doing that over just relying on inheritance and overriding `__format__` to achieve exactly the same? It seems to me it's just less efficient: you need to look further up the inheritance tree to retrieve the first `__format__`, and then you need to look up again to find `_format_`; possibly have an expensive failure (do absences of attribute lookups get cached in python?), and then take action.

I know that indirections like `__add__ -> _add_` are required to have the coercion framework hook in, but I'm less sure that `_repr_` and other similar functions have a need. Before copying that design you'd probably first want to have a good reason why it's required.


---

Comment by vdelecroix created at 2020-03-05 17:37:17

Replying to [comment:15 nbruin]:
> Replying to [comment:13 jhpalmieri]:
> > Then redefine the `__format__` method for integers as `_format_`, and define a `_format_` method for `RR` and some others.
> 
> What's the benefit of doing that over just relying on inheritance and overriding `__format__` to achieve exactly the same? It seems to me it's just less efficient: you need to look further up the inheritance tree to retrieve the first `__format__`, and then you need to look up again to find `_format_`; possibly have an expensive failure (do absences of attribute lookups get cached in python?), and then take action.
> 
> I know that indirections like `__add__ -> _add_` are required to have the coercion framework hook in, but I'm less sure that `_repr_` and other similar functions have a need. Before copying that design you'd probably first want to have a good reason why it's required.

In the case of `__repr__` this is to support `.rename()`

```
sage: p = Partition([3,2,1])
sage: p
[3, 2, 1]
sage: p.rename("Hello Nils")
sage: p
Hello Nils
```



---

Comment by egourgoulhon created at 2020-03-05 17:46:23

Replying to [comment:14 gh-mwageringel]:
> Instead of hiding the error we could also raise a `NotImplementedError` with a more useful message, suggesting to convert to string explicitly, for the time being.

+1 for this. I remember having been hit in py2-Sage while formatting an element of `RR`, with the surprising error message `ValueError: Unknown format code 'f' for object of type 'str'`, which made me wondering which string was referred to... At that time, in haste, I did not investigate the issue further and simply recast the `RR` element to a `float`.


---

Comment by jhpalmieri created at 2020-03-05 18:06:22

Replying to [comment:15 nbruin]:
> Replying to [comment:13 jhpalmieri]:
> > Then redefine the `__format__` method for integers as `_format_`, and define a `_format_` method for `RR` and some others.
> 
> What's the benefit of doing that over just relying on inheritance and overriding `__format__` to achieve exactly the same? It seems to me it's just less efficient: you need to look further up the inheritance tree to retrieve the first `__format__`, and then you need to look up again to find `_format_`; possibly have an expensive failure (do absences of attribute lookups get cached in python?), and then take action.
> 
> I know that indirections like `__add__ -> _add_` are required to have the coercion framework hook in, but I'm less sure that `_repr_` and other similar functions have a need. Before copying that design you'd probably first want to have a good reason why it's required.

I don't really care, you can do it how you think is best.


---

Comment by nbruin created at 2020-03-05 19:08:49

Replying to [comment:16 vdelecroix]:
> In the case of `__repr__` this is to support `.rename()`

Ah good. point. That's a bit of a misfeature in the presence of uniquerepresentation objects, though:


```
sage: M=matrix([[1,2],[3,4]])
sage: f=M.charpoly()
sage: f.parent()
Univariate Polynomial Ring in x over Integer Ring
sage: R=ZZ['x'] #this ring is constructed completely independently
sage: R.rename("Arrr")
sage: f.parent() 
Arrr
```


Spooky action at a distance ...


---

Comment by mkoeppe created at 2020-04-14 19:41:51

Batch modifying tickets that will likely not be ready for 9.1, based on a review of the ticket title, branch/review status, and last modification date.


---

Comment by @mwageringel created at 2020-06-13 17:57:48

See also #29514 which implements `__format__` for `RDF` and `CDF`. In the long run, it would be nice to implement this for all numeric types, as it could be used to customize the number of digits to display.


---

Comment by @jcamp0x2a created at 2020-09-02 19:42:38

Replying to [comment:21 gh-mwageringel]:
> See also #29514 which implements `__format__` for `RDF` and `CDF`. In the long run, it would be nice to implement this for all numeric types, as it could be used to customize the number of digits to display.

+1. Encountered this problem in #28974. The preparser turns numeric literals like `3.14` and `5j` into `RealNumber('3.14')` and `ComplexNumber(0, '5')`. Unfortunately, neither has a `__format__` method, so something like `f'{3.14159:.2f}'` will raise an error.


---

Comment by @mwageringel created at 2020-09-02 19:53:11

Replying to [comment:23 gh-jcamp0x2a]:
> Unfortunately, neither has a `__format__` method, so something like `f'{3.14159:.2f}'` will raise an error.

I see, that looks like a problem indeed (though, maybe this is example is not that relevant in practice). See also #27788.


---

Comment by @jcamp0x2a created at 2020-09-02 21:42:10

Replying to [comment:24 gh-mwageringel]:
> Replying to [comment:23 gh-jcamp0x2a]:
> > Unfortunately, neither has a `__format__` method, so something like `f'{3.14159:.2f}'` will raise an error.
> 
> I see, that looks like a problem indeed (though, maybe this is example is not that relevant in practice). See also #27788.

Thank you! I missed that ticket in my search. I'll keep an eye on it as well.


---

Comment by mkoeppe created at 2021-02-13 20:51:01

Setting new milestone based on a cursory review of ticket status, priority, and last modification date.
