# Issue 28335: conversion of quotient rings to macaulay2

Issue created by migration from https://trac.sagemath.org/ticket/28572

Original creator: saliola

Original creation time: 2019-10-07 17:19:43

CC:  dimpase @mwageringel @antonleykin

Keywords: IMA Coding Sprint, macaulay2, interfaces

Currently, conversion of quotient rings to M2 is not supported; we add this functionality:

```
sage: R.<x,y> = PolynomialRing(QQ)
sage: I = R.ideal([x^2 - y])
sage: macaulay2(R.quotient_ring(I))
```


This also improves the conversion of ideals by moving the `MPolynomialIdeal_macaulay2_repr._macaulay2_` to `Ideal_generic._macaulay2_init_`; for example, the following now work but didn't before (see the doctests for examples):
- ideals in univariate polynomial rings

```
sage: R.<x> = PolynomialRing(ZZ)
sage: macaulay2(R.ideal(x^2))
```

- ideals in PIDs

```
sage: macaulay2(ideal(5))
```



---

Comment by saliola created at 2019-10-07 17:23:08

Changing status from new to needs_review.


---

Comment by git created at 2019-10-07 19:34:39

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by git created at 2019-10-07 20:02:43

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by git created at 2019-10-07 20:20:11

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by git created at 2019-10-07 21:01:28

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by git created at 2019-10-07 22:29:54

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by git created at 2019-10-07 22:31:58

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by git created at 2019-10-08 00:25:03

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by @mwageringel created at 2019-10-08 01:46:26

The following does not work yet (not even with #28574):

```
sage: R = QQ['x,y'].quotient('x^2-y')['z,t']
sage: f = R.base_ring()('x')^2 - R('z^2')
sage: macaulay2(f)  # fails
```

This fails because the variable names in the quotient ring are named `xbar,ybar` in Sage, but `x,y` in Macaulay2. The conversion routine for polynomials does not currently take this into account when the base ring is a quotient ring.

Other than that, everything looks good to me up until here.


---

Comment by git created at 2019-10-10 16:22:07

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by saliola created at 2019-10-10 16:26:39

I added a dependency to #28567 because this did not merge cleanly on top of it (and I merged it into this branch).


---

Comment by @mwageringel created at 2019-10-10 19:07:18

Changing status from needs_review to positive_review.


---

Comment by @mwageringel created at 2019-10-10 19:07:18

Ok.


---

Comment by vbraun created at 2019-10-15 22:45:28

Changing status from positive_review to needs_work.


---

Comment by vbraun created at 2019-10-15 22:45:28

Merge conflict (please merge in next beta)


---

Comment by dimpase created at 2019-10-22 21:34:20

rebased on top of the branch of #28591
----
Last 10 new commits:


---

Comment by dimpase created at 2019-10-22 21:34:20

Changing status from needs_work to positive_review.


---

Comment by vbraun created at 2019-10-29 23:41:57

Resolution: fixed
