# Issue 12036: LU decomposition gives wrong results on cyclotomic matrices

Issue created by migration from https://trac.sagemath.org/ticket/12208

Original creator: dimpase

Original creation time: 2011-12-21 03:55:15

Assignee: jason, was

CC:  rbeezer jason

create a cyclotomic matrix: (in this case it's even with all integer entries)

```
sage: tgg=SymmetricGroup(5).character_table()
sage: type(tgg)
<type 'sage.matrix.matrix_cyclo_dense.Matrix_cyclo_dense'>
sage: tgg.rank()
7
sage: p,l,u=tgg.LU()
sage: (l*u).rank()
5
```

indeed, u is wrong:

```

sage: u
[ 1 -1  1  1 -1 -1  1]
[ 0 -2  0  1  1  0 -1]
[ 0  0  1 -1 -1  1  0]
[ 0  0  0  0  0  0  1]
[ 0  0  0  0  1 -1  0]
[ 0  0  0  0  0  0 -1]
[ 0  0  0  0  0  0  1]
sage: u.rank()
5
```

Converting tgg into int() works for this particular case, but in general this will be not possible.


---

Comment by dimpase created at 2011-12-21 03:56:02

Changing type from PLEASE CHANGE to defect.


---

Comment by rbeezer created at 2011-12-21 05:15:37

Works for me.  Obviously, I get a very different `u` matrix.  Very curious.  Any ideas on what could be different?

This is on 64-bit Ubuntu 11.04, built from source.


```
----------------------------------------------------------------------
----------------------------------------------------------------------
**********************************************************************
*                                                                    *
* Warning: this is a prerelease version, and it may be unstable.     *
*                                                                    *
**********************************************************************
sage: tgg=SymmetricGroup(5).character_table()
sage: p,l,u = tgg.LU()
sage: (p*l*u - tgg).norm()
0.0
sage: (l*u).rank()
7
sage: u
[   6    0   -2    0    0    0    1]
[   0   -2  4/3    1    1    0 -5/3]
[   0    0 10/3 -1/2  3/2   -1 -5/3]
[   0    0    0 12/5 -6/5  4/5   -2]
[   0    0    0    0   -3    2    0]
[   0    0    0    0    0   -2  5/2]
[   0    0    0    0    0    0    5]
```



---

Comment by rbeezer created at 2011-12-21 06:54:35

Dear Dima,

The code for this does not use any libraries, nor anything too advanced.  For the most part it is just field operations.

Just as an experiment, you could try the `pivot` options with your example.  `pivot='partial'` would basically bypass a call to `abs()`.  Results are cached, so be aware of that when testing.

Rob


---

Comment by dimpase created at 2011-12-21 15:05:05

Replying to [comment:4 rbeezer]:
> Dear Dima,
> 
> The code for this does not use any libraries, nor anything too advanced.  For the most part it is just field operations.
> 
> Just as an experiment, you could try the `pivot` options with your example.  `pivot='partial'` would basically bypass a call to `abs()`.  Results are cached, so be aware of that when testing.
> 

Hi Rob,

`pivot='partial'` gives the wrong result, while `pivot='nonzero'` computes the things correctly.

Dima


> Rob


---

Comment by rbeezer created at 2011-12-21 18:01:09

Replying to [comment:5 dimpase]:
> Replying to [comment:4 rbeezer]:
> >  `pivot='partial'` would basically bypass a call to `abs()`
> `pivot='partial'` gives the wrong result, while `pivot='nonzero'` computes the things correctly.

OK, I had it backwards (it was late!) and your results I think might point out the root cause.

It looks to me like the `abs()` of a number field elements are MPFR real numbers.  So while searching for a "largest" element in a column, there may be some zero/nonzero confusion?

Perhaps we should check that the return value of the absolute value function lives in the fraction field of the base ring before allowing partial pivoting?  In other words, we need an exact result to proceed.  The implementation is really only designed for this case.  Does that sound like a reasonable solution to you?

Or maybe there is a better function to be using for the "magnitude" of an element of an arbitrary ring/field?  Maybe a question for sage-devel - I can't think of the answer.

Rob


---

Comment by rbeezer created at 2011-12-21 18:26:47

For information purposes only, not intended as real fix


---

Attachment

Replying to [comment:6 rbeezer]:
> Or maybe there is a better function to be using for the "magnitude" of an element of an arbitrary ring/field?  Maybe a question for sage-devel - I can't think of the answer.

Answering my own question.  Maybe the `norm()` function (or method) is a better choice.  For a negative rational, it returns the negative value, which I find odd (but maybe appropriate?).

With test patch, I only get one doctest failure (a permutation matrix changes) and the original example still gives the same `U` matrix.

Dima - would you like to try out the test patch (built on 4.8.alpha3)?  I'm not sure yet it is the best solution, but it could be.

Rob


---

Comment by dimpase created at 2011-12-26 17:38:40

Replying to [comment:7 rbeezer]:
> Replying to [comment:6 rbeezer]:
> > Or maybe there is a better function to be using for the "magnitude" of an element of an arbitrary ring/field?  Maybe a question for sage-devel - I can't think of the answer.
> 
> Answering my own question.  Maybe the `norm()` function (or method) is a better choice.  For a negative rational, it returns the negative value, which I find odd (but maybe appropriate?).
> 
> With test patch, I only get one doctest failure (a permutation matrix changes) and the original example still gives the same `U` matrix.
> 
> Dima - would you like to try out the test patch (built on 4.8.alpha3)?  I'm not sure yet it is the best solution, but it could be.

yes, this fixes the problem.

Dima

> 
> Rob


---

Comment by dimpase created at 2011-12-30 06:11:23

Replying to [comment:8 dimpase]:
> Replying to [comment:7 rbeezer]:
> > Replying to [comment:6 rbeezer]:
> > > Or maybe there is a better function to be using for the "magnitude" of an element of an arbitrary ring/field?  Maybe a question for sage-devel - I can't think of the answer.
> > 
> > Answering my own question.  Maybe the `norm()` function (or method) is a better choice.  For a negative rational, it returns the negative value, which I find odd (but maybe appropriate?).
> > 
> > With test patch, I only get one doctest failure (a permutation matrix changes) and the original example still gives the same `U` matrix.
> > 
> > Dima - would you like to try out the test patch (built on 4.8.alpha3)?  I'm not sure yet it is the best solution, but it could be.
> 
> yes, this fixes the problem.

I tried digging deeper into the problem, and I found that the original (unpatched) code does not work on MacOSX, because the condition in `if entry > max_entry:` on the line 9338 of matrix2.pyx is never True. This means that the comparison between 
`entry` of  type `sage.rings.real_mpfr.RealNumber`  and `max_entry` of   type `sage.rings.number_field.number_field_element.NumberFieldElement_absolute` (the latter is initially set to `F(0)`) is broken. 

Indeed, on MacOSX

```
sage: F = RealField()
sage: k.<i> = NumberField(x^3 +x + 1)
sage: F(1).abs() > 0*i
```

prints False, and on Linux it prints True!


By the way, if I replace `max_entry = zero` on line 9334 with `max_entry = zero.abs()` then the code works, as this does the right type of coersion. 

Overall, this looks like a  bug in number fields part of Sage one has to dig up.

Dima


---

Comment by dimpase created at 2011-12-30 06:11:23

Changing status from new to needs_info.


---

Comment by rbeezer created at 2011-12-30 06:52:28

Replying to [comment:9 dimpase]:

Dima - excellent detective work.  And excellent timing, I was just sitting down to look at this again.

> By the way, if I replace `max_entry = zero` on line 9334 with `max_entry = zero.abs()` then the code works, as this does the right type of coersion. 
> 
> Overall, this looks like a  bug in number fields part of Sage one has to dig up.

I like the idea of applying `abs()` to the zero element to get the types to line up.  I will watch the sage-devel thread to see what transpires, and then write a short patch, likely with your example from above as a test.

Thanks,
Rob


---

Comment by dimpase created at 2011-12-30 08:54:28

Replying to [comment:10 rbeezer]:
> Replying to [comment:9 dimpase]:
> 
> Dima - excellent detective work.  And excellent timing, I was just sitting down to look at this again.
> 
> > By the way, if I replace `max_entry = zero` on line 9334 with `max_entry = zero.abs()` then the code works, as this does the right type of coersion. 
> > 
> > Overall, this looks like a  bug in number fields part of Sage one has to dig up.
> 
> I like the idea of applying `abs()` to the zero element to get the types to line up.  I will watch the sage-devel thread to see what transpires, and then write a short patch, likely with your example from above as a test.
> 
 
Hi Rob, 

if abs() is only used to select pivots, it should be perfectly all right to do so.
This would be a 1-line patch then.

Dima


---

Attachment


---

Comment by rbeezer created at 2011-12-30 13:28:02

Patch takes absolute value of initial maximum column value before searching for a bigger entry, thus creating objects of the same type for subsequent comparisons.

(a) Used the `abs()` function, since that was used in the prior test for its use being possible.

(b) Added Dima's character table example as a test in the docstring.

Passes tests in sage/matrix on 4.8.alpha3 on Linux.


---

Comment by rbeezer created at 2011-12-30 13:28:02

Changing status from needs_info to needs_review.


---

Comment by dimpase created at 2011-12-30 18:19:43

Changing status from needs_review to positive_review.


---

Comment by dimpase created at 2011-12-30 18:19:43

Replying to [comment:12 rbeezer]:
> Patch takes absolute value of initial maximum column value before searching for a bigger entry, thus creating objects of the same type for subsequent comparisons.
> 
> (a) Used the `abs()` function, since that was used in the prior test for its use being possible.
> 
> (b) Added Dima's character table example as a test in the docstring.
> 
> Passes tests in sage/matrix on 4.8.alpha3 on Linux.

OK, works on MacOSX too. Good.


---

Comment by rbeezer created at 2011-12-30 18:50:30

Replying to [comment:13 dimpase]:
> OK, works on MacOSX too. Good.

Great!  Glad to hear it solves the OSX problem, and overall it should have been this way from the start.  Thanks for sticking with this one.

Rob


---

Comment by jdemeyer created at 2011-12-31 10:35:52

Resolution: fixed
