# Issue 20509: Pushout for real embedded number fields

archive/issues_020509.json:
```json
{
    "body": "CC:  jdemeyer tscrim\n\nKeywords: days74\n\nImplement the following pushout\n\n```\nsage: K.<a> = NumberField(x^2 - 3, embedding=AA(3)**(1/2))\nsage: L.<b> = NumberField(x^2 - 2, embedding=AA(2)**(1/2))\nsage: a+b\n3.146264369941973?\nsage: parent(_)\nAlgebraic Real Field\n```\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/20746\n\n",
    "created_at": "2016-06-01T10:28:19Z",
    "labels": [
        "number fields",
        "major",
        "enhancement"
    ],
    "title": "Pushout for real embedded number fields",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/20509",
    "user": "vdelecroix"
}
```
CC:  jdemeyer tscrim

Keywords: days74

Implement the following pushout

```
sage: K.<a> = NumberField(x^2 - 3, embedding=AA(3)**(1/2))
sage: L.<b> = NumberField(x^2 - 2, embedding=AA(2)**(1/2))
sage: a+b
3.146264369941973?
sage: parent(_)
Algebraic Real Field
```


Issue created by migration from https://trac.sagemath.org/ticket/20746





---

archive/issue_comments_283251.json:
```json
{
    "body": "Changing status from new to needs_review.",
    "created_at": "2016-06-01T10:29:10Z",
    "issue": "https://github.com/sagemath/sagetest/issues/20509",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/20509#issuecomment-283251",
    "user": "vdelecroix"
}
```

Changing status from new to needs_review.



---

archive/issue_comments_283252.json:
```json
{
    "body": "New commits:",
    "created_at": "2016-06-01T10:29:10Z",
    "issue": "https://github.com/sagemath/sagetest/issues/20509",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/20509#issuecomment-283252",
    "user": "vdelecroix"
}
```

New commits:



---

archive/issue_comments_283253.json:
```json
{
    "body": "Changing status from needs_review to needs_work.",
    "created_at": "2016-06-01T11:23:15Z",
    "issue": "https://github.com/sagemath/sagetest/issues/20509",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/20509#issuecomment-283253",
    "user": "pbruin"
}
```

Changing status from needs_review to needs_work.



---

archive/issue_comments_283254.json:
```json
{
    "body": "Isn't it a bit drastic to declare `AA` to be the pushout rather than to create a suitable number field?  I think a better solution would be to use the existing `composite_fields()` method, which respects embeddings:\n\n```diff\n--- a/src/sage/rings/number_field/number_field_base.pyx\n+++ b/src/sage/rings/number_field/number_field_base.pyx\n@@ -350,3 +350,7 @@ cdef class NumberField(Field):\n         else:\n             raise ValueError(\"No embedding set. You need to specify a a real embedding.\")\n \n+    def _pushout_(self, other):\n+        if (isinstance(other, NumberField) and self._embedded_real and\n+            (<NumberField>other)._embedded_real):\n+            return self.composite_fields(other)[0]\n```\n\nThis makes the examples in the current branch work just as well (you can see the numerical values after coercing into `AA`).",
    "created_at": "2016-06-01T11:23:15Z",
    "issue": "https://github.com/sagemath/sagetest/issues/20509",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/20509#issuecomment-283254",
    "user": "pbruin"
}
```

Isn't it a bit drastic to declare `AA` to be the pushout rather than to create a suitable number field?  I think a better solution would be to use the existing `composite_fields()` method, which respects embeddings:

```diff
--- a/src/sage/rings/number_field/number_field_base.pyx
+++ b/src/sage/rings/number_field/number_field_base.pyx
@@ -350,3 +350,7 @@ cdef class NumberField(Field):
         else:
             raise ValueError("No embedding set. You need to specify a a real embedding.")
 
+    def _pushout_(self, other):
+        if (isinstance(other, NumberField) and self._embedded_real and
+            (<NumberField>other)._embedded_real):
+            return self.composite_fields(other)[0]
```

This makes the examples in the current branch work just as well (you can see the numerical values after coercing into `AA`).



---

archive/issue_comments_283255.json:
```json
{
    "body": "Fair enough. Though it is more expensive.",
    "created_at": "2016-06-01T12:00:57Z",
    "issue": "https://github.com/sagemath/sagetest/issues/20509",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/20509#issuecomment-283255",
    "user": "vdelecroix"
}
```

Fair enough. Though it is more expensive.



---

archive/issue_comments_283256.json:
```json
{
    "body": "And this is order dependent\n\n```\nsage: K.<a> = NumberField(x^2 - 3, embedding=AA(3)**(1/2))\nsage: L.<b> = NumberField(x^2 - 2, embedding=AA(2)**(1/2))\nsage: a+b\nab^3 - 10*ab\n```\n\nversus\n\n```\nsage: K.<a> = NumberField(x^2 - 3, embedding=AA(3)**(1/2))\nsage: L.<b> = NumberField(x^2 - 2, embedding=AA(2)**(1/2))\nsage: b+a\n-ba^3 + 10*ba\n```\n",
    "created_at": "2016-06-01T12:08:05Z",
    "issue": "https://github.com/sagemath/sagetest/issues/20509",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/20509#issuecomment-283256",
    "user": "vdelecroix"
}
```

And this is order dependent

```
sage: K.<a> = NumberField(x^2 - 3, embedding=AA(3)**(1/2))
sage: L.<b> = NumberField(x^2 - 2, embedding=AA(2)**(1/2))
sage: a+b
ab^3 - 10*ab
```

versus

```
sage: K.<a> = NumberField(x^2 - 3, embedding=AA(3)**(1/2))
sage: L.<b> = NumberField(x^2 - 2, embedding=AA(2)**(1/2))
sage: b+a
-ba^3 + 10*ba
```




---

archive/issue_comments_283257.json:
```json
{
    "body": "Changing status from needs_work to needs_review.",
    "created_at": "2016-06-02T04:20:05Z",
    "issue": "https://github.com/sagemath/sagetest/issues/20509",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/20509#issuecomment-283257",
    "user": "vdelecroix"
}
```

Changing status from needs_work to needs_review.



---

archive/issue_comments_283258.json:
```json
{
    "body": "This coercion has its advantages:\n\n- makes it possible to do arithmetic operations with elements with two different `NumberFields` as parents. Right now returns a TypeError:\n\n\n```\n    sage: J = NumberField(x^2 - 2,'s')\n    sage: s = J.gens()[0]\n    sage: K = NumberField(x^3 - 2,'t')\n    sage: t = K.gens()[0]\n    sage: s * t\n    Traceback (most recent call last):\n    ...\n    TypeError: unsupported operand parent(s) for *: ...\n```\n\n- It is lazy, it does have to compute the join.\n\nDepending on the usage, one may want to get the join of the fields using `composite_field`, this introduces another variable and is order dependant. I guess that if one wants to do computations on the long run with that field, one would already use the right field from start.\n\nIMHO, this ticket already fixes an operation that one would naturally want to have at hand. So, I would make this a positive review.",
    "created_at": "2017-03-05T23:33:56Z",
    "issue": "https://github.com/sagemath/sagetest/issues/20509",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/20509#issuecomment-283258",
    "user": "jipilab"
}
```

This coercion has its advantages:

- makes it possible to do arithmetic operations with elements with two different `NumberFields` as parents. Right now returns a TypeError:


```
    sage: J = NumberField(x^2 - 2,'s')
    sage: s = J.gens()[0]
    sage: K = NumberField(x^3 - 2,'t')
    sage: t = K.gens()[0]
    sage: s * t
    Traceback (most recent call last):
    ...
    TypeError: unsupported operand parent(s) for *: ...
```

- It is lazy, it does have to compute the join.

Depending on the usage, one may want to get the join of the fields using `composite_field`, this introduces another variable and is order dependant. I guess that if one wants to do computations on the long run with that field, one would already use the right field from start.

IMHO, this ticket already fixes an operation that one would naturally want to have at hand. So, I would make this a positive review.



---

archive/issue_comments_283259.json:
```json
{
    "body": "Changing status from needs_review to positive_review.",
    "created_at": "2017-03-05T23:34:10Z",
    "issue": "https://github.com/sagemath/sagetest/issues/20509",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/20509#issuecomment-283259",
    "user": "jipilab"
}
```

Changing status from needs_review to positive_review.



---

archive/issue_comments_283260.json:
```json
{
    "body": "Changing keywords from \"days74\" to \"days74, days84\".",
    "created_at": "2017-03-05T23:35:01Z",
    "issue": "https://github.com/sagemath/sagetest/issues/20509",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/20509#issuecomment-283260",
    "user": "jipilab"
}
```

Changing keywords from "days74" to "days74, days84".



---

archive/issue_comments_283261.json:
```json
{
    "body": "Resolution: fixed",
    "created_at": "2017-03-08T18:45:56Z",
    "issue": "https://github.com/sagemath/sagetest/issues/20509",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/20509#issuecomment-283261",
    "user": "vbraun"
}
```

Resolution: fixed
