# Issue 15158: Wrong limit for squence involving Fibonacci sequence, 0 instead of golden ratio

archive/issues_015158.json:
```json
{
    "body": "CC:  @kcrisman jakobkroeker\n\nKeywords: limit,golden_ratio\n\nI tried to define Fibonacci sequence using golden ratio in two ways, using values:\n\n```\nsage: value_1 = 1-golden_ratio\nsage: value_2 = -golden_ratio^(-1)\nsage: bool(value_1 == value_2)\ntrue\n```\n\n(gives true, so two definitions, F1 and F2 below should be equal, even though they are not according to Sage)\n\n```\nsage: F1(k) = (golden_ratio^k-(value_1)^(k))/sqrt(5)\nsage: F2(k) = (golden_ratio^k-(value_2)^(k))/sqrt(5)\nsage: bool(F1(k) != F2(k))\ntrue\n```\n\nWhen simplified everything seems to be equal at least for first 10 or 1000 elements:\n\n```\nsage: [(F1(j)-F2(j)).full_simplify() for j in range(10)]\n[0, 0, 0, 0, 0, 0, 0, 0, 0, 0]\n```\n\n\nAnyway, now to the error: limit for F1 gives wrong result:\n\n```\nsage: limit(F1(k+1)/F1(k), k=oo)\n0\n```\n\nand for F2 works OK:\n\n```\nsage: limit(F2(k+1)/F2(k), k=oo)\n1/2*sqrt(5) + 1/2\n```\n\n\nI've tested it with Sage 5.12 and 5.11, with same result. This can be as simple as some thing with how golden ratio is handled, or something far more involved maybe?\n\nIssue created by migration from https://trac.sagemath.org/ticket/15395\n\n",
    "created_at": "2013-11-10T12:21:04Z",
    "labels": [
        "component: calculus",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-9.8",
    "title": "Wrong limit for squence involving Fibonacci sequence, 0 instead of golden ratio",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/15158",
    "user": "https://trac.sagemath.org/admin/accounts/users/aginiewicz"
}
```
CC:  @kcrisman jakobkroeker

Keywords: limit,golden_ratio

I tried to define Fibonacci sequence using golden ratio in two ways, using values:

```
sage: value_1 = 1-golden_ratio
sage: value_2 = -golden_ratio^(-1)
sage: bool(value_1 == value_2)
true
```

(gives true, so two definitions, F1 and F2 below should be equal, even though they are not according to Sage)

```
sage: F1(k) = (golden_ratio^k-(value_1)^(k))/sqrt(5)
sage: F2(k) = (golden_ratio^k-(value_2)^(k))/sqrt(5)
sage: bool(F1(k) != F2(k))
true
```

When simplified everything seems to be equal at least for first 10 or 1000 elements:

```
sage: [(F1(j)-F2(j)).full_simplify() for j in range(10)]
[0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
```


Anyway, now to the error: limit for F1 gives wrong result:

```
sage: limit(F1(k+1)/F1(k), k=oo)
0
```

and for F2 works OK:

```
sage: limit(F2(k+1)/F2(k), k=oo)
1/2*sqrt(5) + 1/2
```


I've tested it with Sage 5.12 and 5.11, with same result. This can be as simple as some thing with how golden ratio is handled, or something far more involved maybe?

Issue created by migration from https://trac.sagemath.org/ticket/15395





---

archive/issue_comments_194377.json:
```json
{
    "body": "I don't know when it happened, but in 6.4.1 the limit works:\n\n\n```\nsage: limit(F1(k+1)/F1(k), k=oo)\n1/2*sqrt(5) + 1/2\n```\n\n\nbut the comparison\n\n\n```\nsage: F1(k) = (golden_ratio^k-(value_1)^(k))/sqrt(5)\nsage: F2(k) = (golden_ratio^k-(value_2)^(k))/sqrt(5)\nsage: bool(F1(k) != F2(k))\ntrue\n```\n\n\nis still wrong. Slightly minified example:\n\n\n```\nsage: value_1 = 1-golden_ratio\nsage: value_2 = -golden_ratio^(-1)\nsage: bool(value_1 == value_2)\nTrue\nsage: bool(value_1^x != value_2^x)\nTrue\n```\n",
    "created_at": "2015-04-10T20:26:25Z",
    "issue": "https://github.com/sagemath/sagetest/issues/15158",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/15158#issuecomment-194377",
    "user": "https://trac.sagemath.org/admin/accounts/users/aginiewicz"
}
```

I don't know when it happened, but in 6.4.1 the limit works:


```
sage: limit(F1(k+1)/F1(k), k=oo)
1/2*sqrt(5) + 1/2
```


but the comparison


```
sage: F1(k) = (golden_ratio^k-(value_1)^(k))/sqrt(5)
sage: F2(k) = (golden_ratio^k-(value_2)^(k))/sqrt(5)
sage: bool(F1(k) != F2(k))
true
```


is still wrong. Slightly minified example:


```
sage: value_1 = 1-golden_ratio
sage: value_2 = -golden_ratio^(-1)
sage: bool(value_1 == value_2)
True
sage: bool(value_1^x != value_2^x)
True
```




---

archive/issue_comments_194378.json:
```json
{
    "body": "Unchanged after #30063 Maxima 5.44.0",
    "created_at": "2020-08-29T18:39:49Z",
    "issue": "https://github.com/sagemath/sagetest/issues/15158",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/15158#issuecomment-194378",
    "user": "https://github.com/mkoeppe"
}
```

Unchanged after #30063 Maxima 5.44.0



---

archive/issue_comments_194379.json:
```json
{
    "body": "Thanks very much for checking up on all these old tickets.",
    "created_at": "2020-08-29T20:36:31Z",
    "issue": "https://github.com/sagemath/sagetest/issues/15158",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/15158#issuecomment-194379",
    "user": "https://github.com/kcrisman"
}
```

Thanks very much for checking up on all these old tickets.



---

archive/issue_comments_194380.json:
```json
{
    "body": "Sage development has entered the release candidate phase for 9.3. Setting a new milestone for this ticket based on a cursory review.",
    "created_at": "2021-04-07T19:29:15Z",
    "issue": "https://github.com/sagemath/sagetest/issues/15158",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/15158#issuecomment-194380",
    "user": "https://github.com/mkoeppe"
}
```

Sage development has entered the release candidate phase for 9.3. Setting a new milestone for this ticket based on a cursory review.
