# Issue 31912: implement magnitude for posets

Issue created by migration from https://trac.sagemath.org/ticket/32149

Original creator: chapoton

Original creation time: 2021-07-07 08:02:13

CC:  tscrim slelievre @kliem

as a useful numerical/topological invariant


---

Comment by chapoton created at 2021-07-07 08:03:15

New commits:


---

Comment by chapoton created at 2021-07-07 08:03:15

Changing status from new to needs_review.


---

Comment by git created at 2021-07-07 08:06:51

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by chapoton created at 2021-07-08 06:31:03

green bot, please review


---

Comment by @kliem created at 2021-07-08 08:01:29

Nice. Perhaps we could document the additivity/multiplicativity with a random doctest?


```
sage: P1 = posets.RandomPoset(20, 0.05)                                                                                                                                             
sage: P2 = posets.RandomPoset(20, 0.05)                                                                                                                                             
sage: m1 = P1.magnitude()                                                                                                                                                          
sage: m2 = P2.magnitude()                                                                                                                                                           
sage: U = P1.disjoint_union(P2)                                                                                                                                                     
sage: P = P1.product(P2)                                                                                                                                                           
sage: U.magnitude() == m1 + m2                                                                                                                                                       
True
sage: P.magnitude() == m1*m2                                                                                                                                                         
True
```



---

Comment by git created at 2021-07-08 11:22:06

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by chapoton created at 2021-07-08 11:42:33

good idea, thanks. Done

I was wondering if one could compute magnitude in a more efficient way, but did not find any better way for the moment. Good enough for a first implementation, maybe ?


---

Comment by @kliem created at 2021-07-08 12:40:26

Changing status from needs_review to positive_review.


---

Comment by @kliem created at 2021-07-08 12:40:26

LGTM.

I think it is good enough for a first implementation. We can always optimize or find a good algorithm later.


---

Comment by vbraun created at 2021-07-23 23:39:39


```
**********************************************************************
File "src/sage/combinat/posets/posets.py", line 3643, in sage.combinat.posets.posets.FinitePoset.Integer
Failed example:
    P.magnitude() == m1*m2
Expected nothing
Got:
    True
**********************************************************************
1 item had failures:
   1 of  18 in sage.combinat.posets.posets.FinitePoset.Integer
    [1452 tests, 1 failure, 3.10 s]
----------------------------------------------------------------------
sage -t --long --warn-long 45.1 --random-seed=0 src/sage/combinat/posets/posets.py  # 1 doctest failed
----------------------------------------------------------------------
```



---

Comment by vbraun created at 2021-07-23 23:39:39

Changing status from positive_review to needs_work.


---

Comment by git created at 2021-07-27 08:07:21

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by chapoton created at 2021-07-27 08:08:25

Changing status from needs_work to needs_review.


---

Comment by chapoton created at 2021-07-27 08:08:25

sorry for that mistake. Back to needs review.


---

Comment by mantepse created at 2021-07-27 10:30:15

This is http://www.findstat.org/StatisticsDatabase/St000914, in case this is of interest (I should add "magnitude" and the references there).  Clicking on "search for values" exhibits a connection to an Euler characteristic of graphs.


---

Comment by chapoton created at 2021-07-29 08:01:51

given the trivial new commit, I will allow myself to set this back to positive


---

Comment by chapoton created at 2021-07-29 08:01:51

Changing status from needs_review to positive_review.


---

Comment by chapoton created at 2021-07-30 16:56:39

Thanks for the comment.

This is also related to the chain polynomial, namely equal to

```
1 - P.chain_polynomial()(-1)
```

according to Example 2.3.c of the given reference.

EDIT: and therefore also equal to 

```
P.zeta_polynomial()(1)
```


EDIT:

your `FindStat` remark can be seen a consequence of the property that

```
sage: g = P.incomparability_graph().complement()                                  
sage: g.clique_polynomial()
```

gives the chain_polynomial of P.


---

Comment by vbraun created at 2021-08-31 22:00:41

Resolution: fixed
