# Issue 34204: ZZ.variable_names() should be an empty list, not ('x',)

Issue created by migration from https://trac.sagemath.org/ticket/34441

Original creator: @DaveWitteMorris

Original creation time: 2022-08-26 18:07:39

CC:  tscrim mantepse

Keywords: variable names, ring

As pointed out in ticket:34383#comment:28 and ticket:34383#comment:30, the following are not right:

```
sage: ZZ.variable_names()
('x',)
sage: QQ.variable_names()
('x',)
```

Presumably each of these should be an empty list, as for `RR`:

```
sage: RR.variable_names()
()
sage: CC.variable_names()
('I',)
```

An empty list would also be a good answer for `NN`, instead of giving an error:

```
sage: NN.variable_names()
...
File .../src/sage/structure/category_object.pyx:474, in sage.structure.category_object.CategoryObject.variable_names()
    472     if self._names is not None:
    473         return self._names
--> 474     raise ValueError("variable names have not yet been set using self._assign_names(...)")
    475 
    476 def variable_name(self):

ValueError: variable names have not yet been set using self._assign_names(...)
```



---

Comment by tscrim created at 2022-08-27 08:14:07

I would actually vote for an error in all cases as this is consistent with other rings/objects that do not implement variable names.

Cf. `variable_names_recursive`:

```
sage: ZZ.variable_names_recursive()
AttributeError: 'sage.rings.integer_ring.IntegerRing_class' object has no attribute 'variable_names_recursive'
```

