# Issue 24096: Wrong computations for reflection groups

archive/issues_024096.json:
```json
{
    "body": "CC:  @nthiery @tscrim @fchapoton\n\nKeywords: gap3, reflection group\n\nWe currently use intensively the reflection group code in Sage. Here we report bugs that are there because the connections to other pars of Sage are broken. We will update when we find further issues.\n\n* `absolute_length` and `canonical_matrix` was broken but recently fixed, thanks (we realized only after not using my collaborators old Sage version).\n\n* the reflection group element cycle type gives you the cycle type in the permutation representation on the roots. This is *not* the cycle type of the reflection group element\n\n* the Cartan type for dihedral types is broken:\n\n```\nsage: W = ReflectionGroup(['I',5])\nsage: W.cartan_type()\n['I', 2]\n```\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/24333\n\n",
    "created_at": "2017-12-07T09:55:49Z",
    "labels": [
        "component: combinatorics",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-8.2",
    "title": "Wrong computations for reflection groups",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/24096",
    "user": "https://trac.sagemath.org/admin/accounts/users/stumpc5"
}
```
CC:  @nthiery @tscrim @fchapoton

Keywords: gap3, reflection group

We currently use intensively the reflection group code in Sage. Here we report bugs that are there because the connections to other pars of Sage are broken. We will update when we find further issues.

* `absolute_length` and `canonical_matrix` was broken but recently fixed, thanks (we realized only after not using my collaborators old Sage version).

* the reflection group element cycle type gives you the cycle type in the permutation representation on the roots. This is *not* the cycle type of the reflection group element

* the Cartan type for dihedral types is broken:

```
sage: W = ReflectionGroup(['I',5])
sage: W.cartan_type()
['I', 2]
```


Issue created by migration from https://trac.sagemath.org/ticket/24333





---

archive/issue_comments_337234.json:
```json
{
    "body": "The last problem is with the `cartan_type` of `ReflectionGroup`:\n\n```\nct = self._type[0]\nreturn CartanType([ct['series'], ct['rank']])\n```\n\nwhereas it should use more of the information in `self._type` (at least for I<sub>2</sub>(m)).",
    "created_at": "2017-12-07T12:29:19Z",
    "issue": "https://github.com/sagemath/sagetest/issues/24096",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/24096#issuecomment-337234",
    "user": "https://github.com/tscrim"
}
```

The last problem is with the `cartan_type` of `ReflectionGroup`:

```
ct = self._type[0]
return CartanType([ct['series'], ct['rank']])
```

whereas it should use more of the information in `self._type` (at least for I<sub>2</sub>(m)).



---

archive/issue_comments_337235.json:
```json
{
    "body": "Not quite a bug, but an issue to check: computing the eigenvalues of the reflection group elements currently calls `gap3` and needs (for no good reason, I believe) all conjugacy classes representatives to be known already. Instead calling `to_matrix().minpoly()` seems to be much faster, we would then only need to check how to parse it to some cyclotomic field.",
    "created_at": "2017-12-08T18:24:12Z",
    "issue": "https://github.com/sagemath/sagetest/issues/24096",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/24096#issuecomment-337235",
    "user": "https://trac.sagemath.org/admin/accounts/users/stumpc5"
}
```

Not quite a bug, but an issue to check: computing the eigenvalues of the reflection group elements currently calls `gap3` and needs (for no good reason, I believe) all conjugacy classes representatives to be known already. Instead calling `to_matrix().minpoly()` seems to be much faster, we would then only need to check how to parse it to some cyclotomic field.



---

archive/issue_comments_337236.json:
```json
{
    "body": "What about doing the computation over the UCF and then possibly converting to the appropriate cyclotomic field? Or is there a theorem about what roots of unity we can expect?",
    "created_at": "2017-12-09T13:03:56Z",
    "issue": "https://github.com/sagemath/sagetest/issues/24096",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/24096#issuecomment-337236",
    "user": "https://github.com/tscrim"
}
```

What about doing the computation over the UCF and then possibly converting to the appropriate cyclotomic field? Or is there a theorem about what roots of unity we can expect?



---

archive/issue_comments_337237.json:
```json
{
    "body": "I see the following two problems:\n\n1. finding roots of a polynomial over the UCF does not seem to be implemented.\n2. concerning the output, we currently have a list of rationals `k/h` representing `E(h)^k`. This would also be the optimal way of representing the eigenvalues.\n2. the minpoly is not implemented for matrices over the UCF.",
    "created_at": "2017-12-09T15:34:31Z",
    "issue": "https://github.com/sagemath/sagetest/issues/24096",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/24096#issuecomment-337237",
    "user": "https://trac.sagemath.org/admin/accounts/users/stumpc5"
}
```

I see the following two problems:

1. finding roots of a polynomial over the UCF does not seem to be implemented.
2. concerning the output, we currently have a list of rationals `k/h` representing `E(h)^k`. This would also be the optimal way of representing the eigenvalues.
2. the minpoly is not implemented for matrices over the UCF.



---

archive/issue_comments_337238.json:
```json
{
    "body": "At least on some simple testing I have been able to get the `minpoly`:\n\n```\nsage: W = ReflectionGroup(29)\nsage: x = prod(W.gens()).matrix()\nsage: x\n\n[      1/2 -1/2*E(4)       1/2 -1/2*E(4)]\n[      1/2  1/2*E(4)       1/2  1/2*E(4)]\n[-1/2*E(4)       1/2  1/2*E(4)      -1/2]\n[ 1/2*E(4)       1/2 -1/2*E(4)      -1/2]\nsage: x.minpoly()\nx^4 - E(4)*x^3 - x^2 + E(4)*x + 1\n```\n\nAlthough it is quite possible this will fail for only certain elements because of the call to `factor` in `minpoly` if it gets past the `is_squarefree`. Although to get the eigenvalues with multiplicities, we would need to factor the `charpoly`, and at least in that case, we could brute force search the coefficients and find the \"minimal\" cyclotomic field we would need, convert to that, and then call the factorization. Then we could either: convert back to UCF and then extract the data or manually extract the data (if we still wanted the list of rationals format).",
    "created_at": "2017-12-09T23:11:15Z",
    "issue": "https://github.com/sagemath/sagetest/issues/24096",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/24096#issuecomment-337238",
    "user": "https://github.com/tscrim"
}
```

At least on some simple testing I have been able to get the `minpoly`:

```
sage: W = ReflectionGroup(29)
sage: x = prod(W.gens()).matrix()
sage: x

[      1/2 -1/2*E(4)       1/2 -1/2*E(4)]
[      1/2  1/2*E(4)       1/2  1/2*E(4)]
[-1/2*E(4)       1/2  1/2*E(4)      -1/2]
[ 1/2*E(4)       1/2 -1/2*E(4)      -1/2]
sage: x.minpoly()
x^4 - E(4)*x^3 - x^2 + E(4)*x + 1
```

Although it is quite possible this will fail for only certain elements because of the call to `factor` in `minpoly` if it gets past the `is_squarefree`. Although to get the eigenvalues with multiplicities, we would need to factor the `charpoly`, and at least in that case, we could brute force search the coefficients and find the "minimal" cyclotomic field we would need, convert to that, and then call the factorization. Then we could either: convert back to UCF and then extract the data or manually extract the data (if we still wanted the list of rationals format).



---

archive/issue_comments_337239.json:
```json
{
    "body": "Ah, I see the problem. We may not have a large enough cyclotomic field just by considering the one for the coefficient ring. With the example above:\n\n```\nsage: p = x.minpoly()\nsage: p\nx^4 - E(4)*x^3 - x^2 + E(4)*x + 1\nsage: p.change_ring(CyclotomicField(4)).factor()\nx^4 - zeta4*x^3 - x^2 + zeta4*x + 1\nsage: p.change_ring(CyclotomicField(4)).roots()\n[]\n\nsage: p.change_ring(CyclotomicField(20)).factor()\n(x + zeta20) * (x - zeta20^3) * (x - zeta20^7) * (x + zeta20^7 - zeta20^5 + zeta20^3 - zeta20)\nsage: p.change_ring(CyclotomicField(20)).roots()\n[(-zeta20, 1),\n (zeta20^3, 1),\n (zeta20^7, 1),\n (-zeta20^7 + zeta20^5 - zeta20^3 + zeta20, 1)]\nsage: for rt, m in p.change_ring(CyclotomicField(20)).roots():\n....:     UCF(rt)\n-E(20)\n-E(20)^13\n-E(20)^17\n-E(20)^9\n```\n\nThere probably is a smarter way than just increasing `k` in the cyclotomic field C(km) until the number of roots equals the degree. Although this would work and I believe avoid calls to gap (well, up to whatever the cyclotomic fields do).",
    "created_at": "2017-12-09T23:19:44Z",
    "issue": "https://github.com/sagemath/sagetest/issues/24096",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/24096#issuecomment-337239",
    "user": "https://github.com/tscrim"
}
```

Ah, I see the problem. We may not have a large enough cyclotomic field just by considering the one for the coefficient ring. With the example above:

```
sage: p = x.minpoly()
sage: p
x^4 - E(4)*x^3 - x^2 + E(4)*x + 1
sage: p.change_ring(CyclotomicField(4)).factor()
x^4 - zeta4*x^3 - x^2 + zeta4*x + 1
sage: p.change_ring(CyclotomicField(4)).roots()
[]

sage: p.change_ring(CyclotomicField(20)).factor()
(x + zeta20) * (x - zeta20^3) * (x - zeta20^7) * (x + zeta20^7 - zeta20^5 + zeta20^3 - zeta20)
sage: p.change_ring(CyclotomicField(20)).roots()
[(-zeta20, 1),
 (zeta20^3, 1),
 (zeta20^7, 1),
 (-zeta20^7 + zeta20^5 - zeta20^3 + zeta20, 1)]
sage: for rt, m in p.change_ring(CyclotomicField(20)).roots():
....:     UCF(rt)
-E(20)
-E(20)^13
-E(20)^17
-E(20)^9
```

There probably is a smarter way than just increasing `k` in the cyclotomic field C(km) until the number of roots equals the degree. Although this would work and I believe avoid calls to gap (well, up to whatever the cyclotomic fields do).



---

archive/issue_comments_337240.json:
```json
{
    "body": "All roots will be in the cyclotomic field of the order of the element, so\n\n```\nsage: W = ReflectionGroup(29)\nsage: w = W.coxeter_element()\nsage: x = w.to_matrix()\nsage: p = x.charpoly()\nsage: p.change_ring(CyclotomicField(w.order())).roots()\n[(-zeta20, 1),\n (zeta20^3, 1),\n (zeta20^7, 1),\n (-zeta20^7 + zeta20^5 - zeta20^3 + zeta20, 1)]\n```\n\nworks in this case. So we have to check that this really always works and is implemented, check its speed, and parse it back to a better format, preferably `a/b)` for `E(a)^b`.\nObserve for example that\n\n```\nsage: zeta20 = CyclotomicField(20).gen()\nsage: a = -zeta20^7 + zeta20^5 - zeta20^3 + zeta20\nsage: UCF = UniversalCyclotomicField()\nsage: UCF(a)\n-E(20)^9\n```\n",
    "created_at": "2017-12-10T07:26:21Z",
    "issue": "https://github.com/sagemath/sagetest/issues/24096",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/24096#issuecomment-337240",
    "user": "https://trac.sagemath.org/admin/accounts/users/stumpc5"
}
```

All roots will be in the cyclotomic field of the order of the element, so

```
sage: W = ReflectionGroup(29)
sage: w = W.coxeter_element()
sage: x = w.to_matrix()
sage: p = x.charpoly()
sage: p.change_ring(CyclotomicField(w.order())).roots()
[(-zeta20, 1),
 (zeta20^3, 1),
 (zeta20^7, 1),
 (-zeta20^7 + zeta20^5 - zeta20^3 + zeta20, 1)]
```

works in this case. So we have to check that this really always works and is implemented, check its speed, and parse it back to a better format, preferably `a/b)` for `E(a)^b`.
Observe for example that

```
sage: zeta20 = CyclotomicField(20).gen()
sage: a = -zeta20^7 + zeta20^5 - zeta20^3 + zeta20
sage: UCF = UniversalCyclotomicField()
sage: UCF(a)
-E(20)^9
```

