# Issue 12511: Inappropriate comparison of method

archive/issues_012511.json:
```json
{
    "body": "Assignee: AlexGhitza\n\nKeywords: rich comparison\n\n\n```\nsage: z = 3+4j\nsage: z.real < 0\nTrue\n\n```\n\nIt is very easy to encounter this when importing working python scripts into Sage.  But it can be a bear to fix since there is no indication of any problem, other than wrong answers.\n\nThere is no meaningful sense in which the method z.real should be considered less than the number 0.  So this comparison should return NotImplemented.  In fact, I would suggest that every comparison between a method and any other object should return NotImplemented.\n\nIssue created by migration from https://trac.sagemath.org/ticket/12683\n\n",
    "created_at": "2012-03-17T16:37:40Z",
    "labels": [
        "basic arithmetic",
        "major",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-6.4",
    "title": "Inappropriate comparison of method",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/12511",
    "user": "culler"
}
```
Assignee: AlexGhitza

Keywords: rich comparison


```
sage: z = 3+4j
sage: z.real < 0
True

```

It is very easy to encounter this when importing working python scripts into Sage.  But it can be a bear to fix since there is no indication of any problem, other than wrong answers.

There is no meaningful sense in which the method z.real should be considered less than the number 0.  So this comparison should return NotImplemented.  In fact, I would suggest that every comparison between a method and any other object should return NotImplemented.

Issue created by migration from https://trac.sagemath.org/ticket/12683





---

archive/issue_comments_148214.json:
```json
{
    "body": "An even better solution would be to raise a TypeError, as would happen in Python 3.",
    "created_at": "2012-03-17T16:58:49Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12511",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12511#issuecomment-148214",
    "user": "culler"
}
```

An even better solution would be to raise a TypeError, as would happen in Python 3.



---

archive/issue_comments_148215.json:
```json
{
    "body": "This is a python issue:\n\n\n```\nsage: class bla: \n....:     def f(self): pass\n....: \nsage: \nsage: x = bla()\nsage: x.f < int(0)\nFalse\n```\n\n\nI believe this should be fixed in python 3.0:\nhttp://docs.python.org/release/3.0.1/whatsnew/3.0.html#ordering-comparisons",
    "created_at": "2012-05-09T20:32:30Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12511",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12511#issuecomment-148215",
    "user": "tscrim"
}
```

This is a python issue:


```
sage: class bla: 
....:     def f(self): pass
....: 
sage: 
sage: x = bla()
sage: x.f < int(0)
False
```


I believe this should be fixed in python 3.0:
http://docs.python.org/release/3.0.1/whatsnew/3.0.html#ordering-comparisons



---

archive/issue_comments_148216.json:
```json
{
    "body": "fixed?",
    "created_at": "2015-08-25T17:50:00Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12511",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12511#issuecomment-148216",
    "user": "jakobkroeker"
}
```

fixed?



---

archive/issue_comments_148217.json:
```json
{
    "body": "The original behavior still persists in sage 6.8, although the value of the comparison has been reversed:\n\nsage: z = 3-4j\nsage: z.imag > 0\nTrue\n\nAlso, it is still true that the behavior is inherited from python.  In python 2.7.9 one has:\n\n>>> class bla:\n...   def f(self):\n...     pass\n... \n>>> x = bla()\n>>> x.f > 0\nTrue\n\nNonetheless, that does not make it a desirable behavior in Sage.\n\nAnyway, as far as I can see, nothing has changed.",
    "created_at": "2015-08-25T18:55:08Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12511",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12511#issuecomment-148217",
    "user": "culler"
}
```

The original behavior still persists in sage 6.8, although the value of the comparison has been reversed:

sage: z = 3-4j
sage: z.imag > 0
True

Also, it is still true that the behavior is inherited from python.  In python 2.7.9 one has:

>>> class bla:
...   def f(self):
...     pass
... 
>>> x = bla()
>>> x.f > 0
True

Nonetheless, that does not make it a desirable behavior in Sage.

Anyway, as far as I can see, nothing has changed.
