# Issue 13352: vector(RR, QQ) stalls

Issue created by migration from https://trac.sagemath.org/ticket/13556

Original creator: eviatarbach

Original creation time: 2012-10-01 07:36:01

Assignee: jason, was

The command vector(RR, QQ) never finishes executing.


---

Comment by fwclarke created at 2012-10-01 09:02:46

The reason this takes for ever is that Sage is trying to create the infinite vector 

```
(0.000000000000000, 1.00000000000000, -1.00000000000000, 0.500000000000000, -0.500000000000000, 2.00000000000000, -2.00000000000000, 0.333333333333333, -0.333333333333333, 3.00000000000000, -3.00000000000000, 0.666666666666667, -0.666666666666667, 1.50000000000000, ... ) 
```

whose entries are an enumeration of the rationals.  It's line 504 of `sage/structure/sequence.py` (sage-5.3):

```
            x = [universe(t) for t in x]
```

in which `universe` is `RR` and `x` is `QQ`, that's hanging.

An initial segment of this vector can created as

```
sage: vector(RR, QQ.range_by_height(3))
(0.000000000000000, 1.00000000000000, -1.00000000000000, 0.500000000000000, -0.500000000000000, 2.00000000000000, -2.00000000000000)
```



---

Comment by tscrim created at 2012-11-16 21:00:30

To the best of my knowledge, sage currently does not handle infinite sequences. So the following also run indefinitely

```
sage: list(QQ)
sage: tuple(QQ)
sage: Sequence((1..))
sage: Sequence(ZZ)
sage: Sequence(Partitons())
```

I've started a thread on sage-devel about how to proceed.

https://groups.google.com/forum/?fromgroups=#!topic/sage-devel/Pl14P2mr8N8


---

Comment by mkoeppe created at 2020-07-08 16:56:59

Still hasn't finished after 8 years


---

Comment by mkoeppe created at 2021-03-27 02:13:38

Sage development has entered the release candidate phase for 9.3. Setting a new milestone for this ticket based on a cursory review of ticket status, priority, and last modification date.
