# Issue 14796: Wrong limit value of expression involving gamma function

Issue created by migration from Trac.

Original creator: JGuzman

Original creation time: 2013-08-11 08:53:53

CC:  jguzman

Keywords: maxima, gamma, limit

When computing the limit of the following function:


```
sage: f(x) = gamma(x+1/2)/gamma(x)/sqrt(x)
sage: limit(f,x=oo)
```


*Sage returns 0* in stead of *one*. See for example:


```
sage: plot(y,x,1,50)
```


or how the value approaches to one:


```
sage : for x in range(1, 20, 2):
sage :     print("f(%2d)=%f" %(i, f(i).n() )  )
```




```
f( 1)=0.886227
f( 3)=0.959369
f( 5)=0.975350
f( 7)=0.982316
f( 9)=0.986214
f(11)=0.988705
f(13)=0.990433
f(15)=0.991703
f(17)=0.992675
f(19)=0.993443
```


As described in [sage-support mailing list](https://groups.google.com/forum/#!topic/sage-support/y9UnyWbUagY), this is probably a bug in Maxima, and it has been reported [here](http://sourceforge.net/p/maxima/bugs/2621/)

Tested in sage-5.8


---

Comment by pbruin created at 2014-05-17 14:26:09

This is bizarre.  With Sage 6.2:

```
sage: f(x) = gamma(x+1/2)/gamma(x)/sqrt(x)
sage: limit(f,x=oo)
x |--> 0
```

[Edit: this depends on the "domain: complex" setting.  With "domain: real", Maxima 5.29.1 (in Sage 6.2) returns infinity, and only after asking whether -8 log(2)^2 and 8 log(2)^2 are integers.]

After #13973:

```
sage: f(x) = gamma(x+1/2)/gamma(x)/sqrt(x)
sage: sage.calculus.calculus.maxima('domain: real')  # takes forever otherwise
real
sage: limit(f,x=oo)
x |--> +Infinity
```

And indeed in Maxima 5.33.0:

```
(%i1) f: gamma(x+1/2)/gamma(x)/sqrt(x);
                                           1
                                 gamma(x + -)
                                           2
(%o1)                          ----------------
                               sqrt(x) gamma(x)
(%i2) limit(f, x, inf);
(%o2)                                 inf
```

So we go from one incorrect answer to another...


---

Comment by JGuzman created at 2014-05-17 14:59:05

I didn't heard from the developers of Maxima so far...


---

Comment by pbruin created at 2014-05-17 20:18:47

After some Maxima debugging, it seems that the limit is evaluated via `limit(g, x, inf)`, where `g` can be defined by

```
g: 1/sqrt(x)*exp(x*log(2*x-1)-(x-1/2)*log(x-1)-1/2)/2^x;
```

The fact that the two limits are equal follows from Stirling's approximation.  And in fact this limit is also calculated incorrectly.  In Maxima 5.33.0:

```
(%i1) g: 1/sqrt(x)*exp(x*log(2*x-1)-(x-1/2)*log(x-1)-1/2)/2^x;
                   x log(2 x - 1) - (x - 1/2) log(x - 1) - 1/2
                 %e
(%o1)            ---------------------------------------------
                                           x
                                  sqrt(x) 2
(%i2) limit(g, x, inf);
(%o2)                                 inf
```

The correct value is 1 (as it is for `f`).

Another strange (but possibly related) thing is that if you simplify `g` to

```
g1: 1/sqrt(x)*exp(x*log(x-1/2)-(x-1/2)*log(x-1)-1/2);
```

then Maxima seems to be unable to compute the limit.  [Edit: after a few minutes it actually returns the wrong result `inf`.]


---

Comment by pbruin created at 2014-05-20 14:08:25

I found the reason for the bug and uploaded a patch to the [Maxima bug tracking page](https://sourceforge.net/p/maxima/bugs/2621/).


---

Comment by kcrisman created at 2014-05-27 18:33:34

> I found the reason for the bug and uploaded a patch to the [Maxima bug tracking page](https://sourceforge.net/p/maxima/bugs/2621/).
Apparently it's just been committed!


---

Comment by pbruin created at 2014-05-27 18:43:48

Replying to [comment:7 kcrisman]:
> > I found the reason for the bug and uploaded a patch to the [Maxima bug tracking page](https://sourceforge.net/p/maxima/bugs/2621/).
> Apparently it's just been committed!
Indeed; it's too late to add it to #13973, but should we maybe temporarily add this commit as a patch in our `build/pkgs/maxima/patches` directory until the next time we upgrade Maxima?


---

Comment by kcrisman created at 2014-05-28 00:01:04

> > > I found the reason for the bug and uploaded a patch to the [Maxima bug tracking page](https://sourceforge.net/p/maxima/bugs/2621/).
> > Apparently it's just been committed!
> Indeed; it's too late to add it to #13973, but should we maybe temporarily add this commit as a patch in our `build/pkgs/maxima/patches` directory until the next time we upgrade Maxima?
I don't see why not, since it's already accepted upstream.   Add a doctest and you'd be good to go.


---

Comment by pbruin created at 2014-05-28 00:58:08

Replying to [comment:9 kcrisman]:
> > Indeed; it's too late to add it to #13973, but should we maybe temporarily add this commit as a patch in our `build/pkgs/maxima/patches` directory until the next time we upgrade Maxima?
> I don't see why not, since it's already accepted upstream.   Add a doctest and you'd be good to go.
Hmm, it looks like the same `domain: complex` slowness issue as in #13973 is going to hit us again.  Trying this in Maxima 5.33.0 with the patch applied, the computation takes a few minutes with `domain: complex`, but less than a second with `domain: real`.  (It does correctly return 1 in both cases.)  Maybe we should try to find out if we can disable this `domain: complex` setting in Sage for some things...


---

Comment by pbruin created at 2014-05-28 01:51:06

This branch adds the upstream patch and a doctest.  The doctest temporarily switches to `domain: real` to avoid the slowness caused by `domain: complex`.


---

Comment by pbruin created at 2014-05-28 01:51:06

Changing status from new to needs_review.


---

Comment by git created at 2014-06-11 22:35:01

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by kcrisman created at 2014-08-15 07:22:42

Changing status from needs_review to positive_review.


---

Comment by kcrisman created at 2014-08-15 07:22:42

Boy are you right about the `domain:complex` slowness...  Okay, this is good to go.  Thanks!


---

Comment by vbraun created at 2014-08-16 09:32:33

Resolution: fixed
