# Issue 11683: Hilbert series, Hilbert functions of a given ideal

Issue created by migration from Trac.

Original creator: dangtuanhiep

Original creation time: 2011-09-27 13:33:48

Assignee: malb

CC:  burcin simonking

Keywords: sd34

This patch adds the methods Hilbert series and Hilbert functions to multivariate polynomial ideals.


---

Comment by malb created at 2011-09-27 13:43:27

Huh, it's already there.


```
----------------------------------------------------------------------
----------------------------------------------------------------------
sage: K.<w> = GF(27)
sage: P.<x, y> = PolynomialRing(K, 2, order='lex')
sage: I = Ideal([ x^8 + y + 2, y^6 + x*y^5 + x^2 ])
sage: I.hi
I.hilbert_polynomial  I.hilbert_series  
```



---

Attachment

Replying to [comment:1 malb]:
> Huh, it's already there.
> 
 {{{
 ----------------------------------------------------------------------
 | Sage Version 4.7.1, Release Date: 2011-08-11                       |
 | Type notebook() for the GUI, and license() for information.        |
 ----------------------------------------------------------------------
 sage: K.<w> = GF(27)
 sage: P.<x, y> = PolynomialRing(K, 2, order='lex')
 sage: I = Ideal([ x^8 + y + 2, y^6 + x*y^5 + x^2 ])
 sage: I.hi
 I.hilbert_polynomial  I.hilbert_series  
 }}}

The return value of the existing function is a fraction field element, not a power series.


```
sage: I.hilbert_series()
(-t - 1)/(t - 1)
sage: type(I.hilbert_series())
<type 'sage.rings.fraction_field_element.FractionFieldElement'>
```


Singular cannot represent power series in its interpreter, but we can. :)


---

Comment by burcin created at 2011-09-27 13:54:10

Changing type from enhancement to defect.


---

Comment by malb created at 2011-09-28 09:30:12

The patch adds a second hilbert_series function instead of the changing the one that exists already. Also, the old one has some advantages over this new one: `@`require field, more extensive docs, test whether the ideal is homogeneous.


---

Comment by SimonKing created at 2011-09-28 13:28:20

Replying to [comment:5 malb]:
> The patch adds a second hilbert_series function instead of the changing the one that exists already

Yes. Clearly it is a bad idea to implement another hilbert_series method from scratch. Obviously, if one wants hilber_series to return a power series, then one should modify the existing hilbert_serie method.

Moreover, I think we don't want it to return a power series. Isn't a power series in Sage an object with a finite precision? Hence, while a quotient (i.e., fraction field element) of two polynomials generates _all_ (infinitely many) terms of the Hilbert series, a power series can only provide finitely many terms, isn't it?

So, I am against that change. I could only imagine that one has an optional parameter "as_power_series" (default False). Then, `I.hilber_series()` would return the _full_ Hilbert series (namely as a quotient of two polynomials), while `I.hilbert_series(as_power_series=True)` would return a (truncated) power series.


---

Comment by SimonKing created at 2011-09-28 13:30:04

Sorry for the misprints in my previous post. "hilber_series" and "hilbert_serie" should have been "hilbert_series"...


---

Comment by chapoton created at 2018-04-30 08:44:38

Let us close this old one. Conversion is easy:

```
sage: t = polygen(QQ,'t')
sage: QQ[This is the Trac macro *'t'* that was inherited from the migration](https://trac.sagemath.org/wiki/WikiMacros#'t'-macro)(1/(1-t))
1 + t + t^2 + t^3 + t^4 + t^5 + t^6 + t^7 + t^8 + t^9 + t^10 + t^11 + t^12 + t^13 + t^14 + t^15 + t^16 + t^17 + t^18 + t^19 + O(t^20)
```



---

Comment by chapoton created at 2018-04-30 08:44:38

Changing status from new to needs_review.


---

Comment by mmezzarobba created at 2018-06-01 12:37:43

Changing status from needs_review to positive_review.


---

Comment by embray created at 2018-11-08 16:04:41

Resolution: worksforme
