# Issue 30601: Generators for homology of simplicial complexes

Issue created by migration from https://trac.sagemath.org/ticket/30838

Original creator: jhpalmieri

Original creation time: 2020-10-29 17:43:48

CC:  tscrim

This is a followup to #6100. If `K` is a simplicial complex, the `generators` argument to `K.homology(...)` does nothing: `K.homology(...)` calls the `homology` method for generic cell complexes, which in turn calls `_homology_` for simplicial complexes, and that method ignores the `generators` keyword.

There is an easy solution: in the generic `homology` method, if `generators` is True, then don't call `_homology_`, just continue in that method. This will give information about chain complex generators. It is possible, although obscure, to extract the simplicial complex information from that.

A better solution: actually do the obscure work, don't force the users to figure it out. That is:
- call `K.chain_complex(generators=True)`, and
- use `K._n_cells_sorted()` to convert the chain complex generators (which are just vectors in the corresponding free module over the base ring) to actual chains in the simplicial complex.


---

Comment by jhpalmieri created at 2020-10-29 22:43:16

New commits:


---

Comment by jhpalmieri created at 2020-10-29 22:43:16

Changing status from new to needs_review.


---

Comment by git created at 2020-10-29 22:44:18

Branch pushed to git repo; I updated commit sha1. This was a forced push. New commits:


---

Comment by git created at 2020-10-29 22:46:30

Branch pushed to git repo; I updated commit sha1. This was a forced push. New commits:


---

Comment by jhpalmieri created at 2020-10-29 22:53:51

Before this branch:

```
sage: simplicial_complexes.Sphere(2).homology(generators=True)                                                        
{0: 0, 1: 0, 2: Z}
sage: cubical_complexes.Sphere(2).homology(generators=True)                                                        
{0: [], 1: [], 2: [(Z, Chain(2:(1, -1, 1, -1, 1, -1)))]}
sage: simplicial_sets.Sphere(2).homology(generators=True)                                 
{0: [], 1: 0, 2: [(Z, Chain(2:(1)))]}
```


Note that no generators are given at all in the simplicial complex case. In the other cases, the answers are given in terms of the chain groups.

After:

```
sage: simplicial_complexes.Sphere(2).homology(generators=True)                            
{0: [], 1: [], 2: [(Z, (0, 1, 2) - (0, 1, 3) + (0, 2, 3) - (1, 2, 3))]}
sage: cubical_complexes.Sphere(2).homology(generators=True)                               
{0: [],
 1: [],
 2: [(Z,
   [0,0] x [0,1] x [0,1] - [0,1] x [0,0] x [0,1] + [0,1] x [0,1] x [0,0] - [0,1] x [0,1] x [1,1] + [0,1] x [1,1] x [0,1] - [1,1] x [0,1] x [0,1])]}
sage: simplicial_sets.Sphere(2).homology(generators=True)                                 
{0: [], 1: 0, 2: [(Z, sigma_2)]}
```



---

Comment by tscrim created at 2020-10-31 07:20:26

Changing status from needs_review to positive_review.


---

Comment by tscrim created at 2020-10-31 07:20:26

LGTM.


---

Comment by jhpalmieri created at 2020-10-31 17:10:02

Thanks very much.


---

Comment by vbraun created at 2020-11-07 16:23:34

Resolution: fixed
