# Issue 10876: Get Maxima to easily accept flag values

archive/issues_010876.json:
```json
{
    "body": "Assignee: @burcin\n\nCC:  @robert-marik @burcin @nbruin @jasongrout @wdjoyner\n\nKeywords: maxima, calculus, flag, radexpand\n\nMaxima relatively recently decided that 1/sqrt(x) is not sqrt(1/x), for good reasons (1/sqrt(-1)=-i but sqrt(1/-1)=i in usual discussion).  So for the following integral, they note that it depends on how you input it:\n\n```\nsage: integrate(sqrt(1/x^2+x),x)\nintegrate(sqrt(x + 1/x^2), x)\nsage: integrate(1/sqrt(x^2+x),x)\nlog(2*x + 2*sqrt(x^2 + x) + 1)\n```\nFine.  Then they suggest using the flag `radexpand:all` to make the first one behave.  But I can't figure out how to get it to evaluate.\n\n```\nsage: sage.calculus.calculus.maxima('radexpand:all')\nall\nsage: integrate(sqrt(1/x^2+x),x)\nintegrate(sqrt(x + 1/x^2), x)\n```\nTrying maxima.eval only changes that I get 'all' instead of all.  We should make this work, since this is the *calculus* instance of Sage!\n\nIssue created by migration from https://trac.sagemath.org/ticket/10955\n\n",
    "closed_at": "2014-05-29T14:51:26Z",
    "created_at": "2011-03-17T15:48:39Z",
    "labels": [
        "component: calculus",
        "trivial"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-6.3",
    "title": "Get Maxima to easily accept flag values",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/10876",
    "user": "https://github.com/kcrisman"
}
```
Assignee: @burcin

CC:  @robert-marik @burcin @nbruin @jasongrout @wdjoyner

Keywords: maxima, calculus, flag, radexpand

Maxima relatively recently decided that 1/sqrt(x) is not sqrt(1/x), for good reasons (1/sqrt(-1)=-i but sqrt(1/-1)=i in usual discussion).  So for the following integral, they note that it depends on how you input it:

```
sage: integrate(sqrt(1/x^2+x),x)
integrate(sqrt(x + 1/x^2), x)
sage: integrate(1/sqrt(x^2+x),x)
log(2*x + 2*sqrt(x^2 + x) + 1)
```
Fine.  Then they suggest using the flag `radexpand:all` to make the first one behave.  But I can't figure out how to get it to evaluate.

```
sage: sage.calculus.calculus.maxima('radexpand:all')
all
sage: integrate(sqrt(1/x^2+x),x)
integrate(sqrt(x + 1/x^2), x)
```
Trying maxima.eval only changes that I get 'all' instead of all.  We should make this work, since this is the *calculus* instance of Sage!

Issue created by migration from https://trac.sagemath.org/ticket/10955





---

archive/issue_comments_115405.json:
```json
{
    "body": "Works for me on some flavour of 5.13.beta0\n\n```\nsage: integrate(sqrt(1/x^2+x),x)\nintegrate(sqrt(x + 1/x^2), x)\nsage: sage.calculus.calculus.maxima('radexpand:all')\nall\nsage: integrate(sqrt(1/x^2+x),x)\n2/3*sqrt(x^3 + 1) - 1/3*log(sqrt(x^3 + 1) + 1) + 1/3*log(sqrt(x^3 + 1) - 1)\n```\nI didn't check if the answer makes sense, but at least setting the flag has effect.",
    "created_at": "2013-11-01T16:28:58Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10876",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10876#issuecomment-115405",
    "user": "https://github.com/nbruin"
}
```

Works for me on some flavour of 5.13.beta0

```
sage: integrate(sqrt(1/x^2+x),x)
integrate(sqrt(x + 1/x^2), x)
sage: sage.calculus.calculus.maxima('radexpand:all')
all
sage: integrate(sqrt(1/x^2+x),x)
2/3*sqrt(x^3 + 1) - 1/3*log(sqrt(x^3 + 1) + 1) + 1/3*log(sqrt(x^3 + 1) - 1)
```
I didn't check if the answer makes sense, but at least setting the flag has effect.



---

archive/issue_comments_115406.json:
```json
{
    "body": "Works for me too; here is a doctest.",
    "created_at": "2014-05-21T21:41:59Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10876",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10876#issuecomment-115406",
    "user": "https://github.com/pjbruin"
}
```

Works for me too; here is a doctest.



---

archive/issue_comments_115407.json:
```json
{
    "body": "Changing priority from minor to trivial.",
    "created_at": "2014-05-21T21:41:59Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10876",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10876#issuecomment-115407",
    "user": "https://github.com/pjbruin"
}
```

Changing priority from minor to trivial.



---

archive/issue_comments_115408.json:
```json
{
    "body": "Changing status from new to needs_review.",
    "created_at": "2014-05-21T21:41:59Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10876",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10876#issuecomment-115408",
    "user": "https://github.com/pjbruin"
}
```

Changing status from new to needs_review.



---

archive/issue_comments_115409.json:
```json
{
    "body": "Changing type from defect to task.",
    "created_at": "2014-05-21T21:41:59Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10876",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10876#issuecomment-115409",
    "user": "https://github.com/pjbruin"
}
```

Changing type from defect to task.



---

archive/issue_events_028401.json:
```json
{
    "actor": "https://github.com/pjbruin",
    "created_at": "2014-05-21T21:41:59Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/10876",
    "milestone": "sage-6.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/10876#event-28401"
}
```



---

archive/issue_comments_115410.json:
```json
{
    "body": "Changing status from needs_review to positive_review.",
    "created_at": "2014-05-28T20:59:16Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10876",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10876#issuecomment-115410",
    "user": "https://github.com/kcrisman"
}
```

Changing status from needs_review to positive_review.



---

archive/issue_comments_115411.json:
```json
{
    "body": "As far as I can tell this is fine.  I have no idea why this didn't work before.  Passes tests, does right thing.  \n\n---\nWow, I am just now noticing that the suggestion made earlier was pretty bogus.\n\n```\nsage: integrate(1/sqrt(x^2+x),x)\nlog(2*x + 2*sqrt(x^2 + x) + 1)\n```\nTotally not the same thing as `sqrt(1/x^2+x)`!  Should have been\n\n```\nsage: integrate(1/sqrt(x^2+x),x)\nlog(2*x + 2*sqrt(x^2 + x) + 1)\nsage: integrate(sqrt(1/(x^2+x)),x)\nlog(sqrt(x + 1)/sqrt(x) + 1) - log(sqrt(x + 1)/sqrt(x) - 1)\n```\nwhich also happens to be affected by `radexpand:all`.",
    "created_at": "2014-05-28T20:59:16Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10876",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10876#issuecomment-115411",
    "user": "https://github.com/kcrisman"
}
```

As far as I can tell this is fine.  I have no idea why this didn't work before.  Passes tests, does right thing.  

---
Wow, I am just now noticing that the suggestion made earlier was pretty bogus.

```
sage: integrate(1/sqrt(x^2+x),x)
log(2*x + 2*sqrt(x^2 + x) + 1)
```
Totally not the same thing as `sqrt(1/x^2+x)`!  Should have been

```
sage: integrate(1/sqrt(x^2+x),x)
log(2*x + 2*sqrt(x^2 + x) + 1)
sage: integrate(sqrt(1/(x^2+x)),x)
log(sqrt(x + 1)/sqrt(x) + 1) - log(sqrt(x + 1)/sqrt(x) - 1)
```
which also happens to be affected by `radexpand:all`.



---

archive/issue_events_028402.json:
```json
{
    "actor": "https://github.com/vbraun",
    "created_at": "2014-05-29T14:51:26Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/10876",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/10876#event-28402"
}
```



---

archive/issue_comments_115412.json:
```json
{
    "body": "Resolution: fixed",
    "created_at": "2014-05-29T14:51:26Z",
    "issue": "https://github.com/sagemath/sagetest/issues/10876",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/10876#issuecomment-115412",
    "user": "https://github.com/vbraun"
}
```

Resolution: fixed
