# Issue 13367: Matrix Entries Can Be Callable Objects not tested

Issue created by migration from Trac.

Original creator: startakovsky

Original creation time: 2012-10-05 02:53:22

Assignee: tbd

In the documentation, http://www.sagemath.org/doc/reference/sage/matrix/constructor.html,

it states that matrices can pass in callable objects, though there is no example or test of this here.  Is there documentation at least showing a test of this functionality?  If not, it probably should be added, if not for the end user, at least to ensure it doesn't break.

In the meanwhile, any tip on getting a matrix like:

['apple', 'frog']
[[3,2]   , 3      ]


---

Comment by startakovsky created at 2012-10-05 02:59:06

Changing type from PLEASE CHANGE to defect.


---

Comment by startakovsky created at 2012-10-05 02:59:06

Changing priority from major to minor.


---

Comment by mhansen created at 2012-10-06 15:19:39

Resolution: invalid


---

Comment by mhansen created at 2012-10-06 15:19:39

It gives examples of passing in a callable object:


```

sage: m = matrix(QQ, 3, 3, lambda i, j: i+j); m
[0 1 2]
[1 2 3]
[2 3 4]
sage: m = matrix(3, lambda i,j: i-j); m
[ 0 -1 -2]
[ 1  0 -1]
[ 2  1  0]
sage: matrix(QQ,2,3,lambda x, y: x+y)
[0 1 2]
[1 2 3]
sage: matrix(QQ,3,2,lambda x, y: x+y)
[0 1]
[1 2]
[2 3]
```


It is impossible to get a *matrix* like 

```
['apple', 'frog']
[[3,2]  , 3     ]
```

since a matrix requires that the entries be elements of a ring (so things like multiplication and addition are defined).  You could either use a list of lists or a numpy array like


```
sage: import numpy as np
sage: a = np.array([['apple', 'frog'],[[3,2], 3]], dtype=object); a
array([[apple, frog],
       [[3, 2], 3]], dtype=object)
sage: a[1,0]
[3, 2]
sage: a.transpose()
array([This is the Trac macro *apple, [3, 2* that was inherited from the migration](https://trac.sagemath.org/wiki/WikiMacros#apple, [3, 2-macro),
       [frog, 3]], dtype=object)
```

