# Issue 10307: bug in genus of ideal on 64 bits

Issue created by migration from Trac.

Original creator: lftabera

Original creation time: 2010-11-22 08:20:07

Assignee: was

Keywords: genus, Singular, 64bits

The following problem was discovered by Victor Miller in Sage-support

http://groups.google.com/group/sage-support/browse_thread/thread/e30af8c695b6a912


```
sage: T.<t1,t2,u1,u2> = QQ[] 
sage: TJ = Ideal([t1^2 + u1^2 - 1,t2^2 + u2^2 - 1, (t1-t2)^2 + (u1-u2)^2 -1]) 
sage: TJ.genus() 
4294967295 
sage: TJ.dimension() 
1 
```


I can confirm the bug in debian 64bits. Howeber, in debian 32 bits the anser is


```
sage: TJ.genus()
-1
```


So it seems to be a problem with 2**32-1 in 32 vs 64 bits.


---

Comment by lftabera created at 2012-06-22 17:54:03

Changing status from new to needs_review.


---

Attachment

It seems to me that the bug is solved in linux 64 bits with newer versions of Sage.

I attach a doctest for the record.


---

Comment by jdemeyer created at 2012-07-27 20:42:10

Please fill in your real name as Author.


---

Comment by pbruin created at 2013-07-05 19:31:22

The bug does not appear to be present in 5.11.beta3, the patch applies and the tests that it introduces run correctly.  Note that the answer `-1` is really the (geometric) genus, not an error code (as one could be led to suspect by the sage-support discussion cited above).


---

Comment by pbruin created at 2013-07-05 19:31:22

Changing status from needs_review to positive_review.


---

Comment by jdemeyer created at 2013-07-31 12:53:18

Resolution: fixed
