# Issue 28087: Error computing images of homomorphisms from permutation groups to Galois groups

Issue created by migration from https://trac.sagemath.org/ticket/28324

Original creator: pbruin

Original creation time: 2019-08-05 12:43:29

CC:  slelievre

Keywords: gap Galois group

In SageMath 8.7:

```
sage: R.<x> = QQ[]
sage: f = x^4 + x^2 - 3
sage: L.<a> = f.splitting_field()
sage: G = L.galois_group()
sage: D4 = DihedralGroup(4)
sage: h = D4.isomorphism_to(G)
sage: h.image(D4)
Traceback (most recent call last):
...
TypeError: subgroup() got an unexpected keyword argument 'gap_group'

sage: r, s = D4.gens()
sage: h.image(r)
Traceback (most recent call last):
...
TypeError: subgroup() got an unexpected keyword argument 'gap_group'
```



---

Comment by embray created at 2019-12-30 14:48:17

Ticket retargeted after milestone closed


---

Comment by mkoeppe created at 2020-05-01 04:28:42

Moving tickets to milestone sage-9.2 based on a review of last modification date, branch status, and severity.


---

Comment by mkoeppe created at 2021-05-10 17:42:09

Moving to 9.4, as 9.3 has been released.


---

Comment by @DaveWitteMorris created at 2021-07-15 05:59:18

This was fixed, presumably by #31489. Related ticket: #30685.

```
sage: R.<x> = QQ[]
....: f = x^4 + x^2 - 3
....: L.<a> = f.splitting_field()
....: G = L.galois_group()
....: D4 = DihedralGroup(4)
....: h = D4.isomorphism_to(G)
....: h.image(D4)
Subgroup generated by [(1,5)(2,6)(3,7)(4,8), (1,7,4,6)(2,8,3,5)] of (Galois group 8T4 ([4]2) with order 8 of x^8 + 4*x^7 + 12*x^6 + 22*x^5 + 23*x^4 + 14*x^3 + 28*x^2 + 24*x + 16)
sage: r, s = D4.gens()
....: h.image(r)
(1,7,4,6)(2,8,3,5)
```

So I think we should close this as a duplicate.


---

Comment by @DaveWitteMorris created at 2021-07-15 05:59:18

Changing status from new to needs_review.


---

Comment by slelievre created at 2021-07-16 21:09:15

Would it make sense to add a doctest?


---

Comment by pbruin created at 2021-07-17 07:27:25

Replying to [comment:6 slelievre]:
> Would it make sense to add a doctest?
Yes, that would be useful.


---

Comment by slelievre created at 2021-07-17 08:23:16

Changing status from needs_review to needs_work.


---

Comment by pbruin created at 2021-07-17 18:13:52

Changing status from needs_work to needs_review.


---

Comment by slelievre created at 2021-07-24 16:04:02

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2021-07-25 13:27:07

Resolution: fixed


---

Comment by @kliem created at 2021-09-16 15:12:12

This ticket added doctests with random output:


```
sage -t --long --random-seed=57152364599577893294791356849402008532 src/sage/groups/perm_gps/permgroup_morphism.py
**********************************************************************
File "src/sage/groups/perm_gps/permgroup_morphism.py", line 120, in sage.groups.perm_gps.permgroup_morphism.PermutationGroupMorphism.image
Failed example:
    h.image(D4)
Expected:
    Subgroup generated by [(1,2)(3,4)(5,7)(6,8), (1,6,4,7)(2,5,3,8)] of (Galois group 8T4 ([4]2) with order 8 of x^8 + 4*x^7 + 12*x^6 + 22*x^5 + 23*x^4 + 14*x^3 + 28*x^2 + 24*x + 16)
Got:
    Subgroup generated by [(1,7,4,6)(2,8,3,5), (1,8)(2,7)(3,6)(4,5)] of (Galois group 8T4 ([4]2) with order 8 of x^8 + 4*x^7 + 12*x^6 + 22*x^5 + 23*x^4 + 14*x^3 + 28*x^2 + 24*x + 16)
**********************************************************************
File "src/sage/groups/perm_gps/permgroup_morphism.py", line 123, in sage.groups.perm_gps.permgroup_morphism.PermutationGroupMorphism.image
Failed example:
    h.image(r)
Expected:
    (1,6,4,7)(2,5,3,8)
Got:
    (1,7,4,6)(2,8,3,5)
**********************************************************************
1 item had failures:
   2 of  22 in sage.groups.perm_gps.permgroup_morphism.PermutationGroupMorphism.image
    [91 tests, 2 failures, 0.49 s]
----------------------------------------------------------------------
sage -t --long --random-seed=57152364599577893294791356849402008532 src/sage/groups/perm_gps/permgroup_morphism.py  # 2 doctests failed
```



---

Comment by @kliem created at 2021-09-16 15:20:08

In #29935 I'm going to modify the test (assuming this is fine, if no one speaks up):


```diff
-            sage: h.image(D4)
-            Subgroup generated by [(1,2)(3,4)(5,7)(6,8), (1,6,4,7)(2,5,3,8)] of (Galois group 8T4 ([4]2) with order 8 of x^8 + 4*x^7 + 12*x^6 + 22*x^5 + 23*x^4 + 14*x^3 + 28*x^2 + 24*x + 16)
-            sage: r, s = D4.gens()
-            sage: h.image(r)
-            (1,6,4,7)(2,5,3,8)
+            sage: h.image(D4).is_isomorphic(G)
+            True
+            sage: all(h.image(g) in G for g in D4.gens())
+            True
```



---

Comment by pbruin created at 2021-09-17 07:25:41

Fine with me!


---

Comment by slelievre created at 2021-09-17 17:30:31

Fine with me too!


---

Comment by @kliem created at 2021-09-17 19:20:35

Thanks for the quick reply.
