# Issue 14420: Failure in Singular upon division with remainder for a multivariate polynomial ring over a univariate fraction field

archive/issues_014420.json:
```json
{
    "body": "Assignee: malb\n\nCC:  simonking\n\n\n```\nsage: M = PolynomialRing(QQ['a'].fraction_field(), ['x','y'])\nsage: x,y = M.gens()\nsage: a = M(M.base_ring().gen())\nsage: a.quo_rem(x)\nTraceback (most recent call last):\n...\n/opt/sage-5.10.beta2/local/lib/python2.7/site-packages/sage/interfaces/singular.pyc in eval(self, x, allow_semicolon, strip, **kwds)\n    588 \n    589         if s.find(\"error\") != -1 or s.find(\"Segment fault\") != -1:\n--> 590             raise SingularError('Singular error:\\n%s'%s)\n    591 \n    592         if get_verbose() > 0:\n\nTypeError: Singular error:\n   ? division(`number`,`poly`) failed\n   ? error occurred in or before STDIN line 101850: `def sage38517=division(sage38515,sage38516);`\n```\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/14624\n\n",
    "created_at": "2013-05-21T18:31:31Z",
    "labels": [
        "commutative algebra",
        "major",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-6.4",
    "title": "Failure in Singular upon division with remainder for a multivariate polynomial ring over a univariate fraction field",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/14420",
    "user": "nthiery"
}
```
Assignee: malb

CC:  simonking


```
sage: M = PolynomialRing(QQ['a'].fraction_field(), ['x','y'])
sage: x,y = M.gens()
sage: a = M(M.base_ring().gen())
sage: a.quo_rem(x)
Traceback (most recent call last):
...
/opt/sage-5.10.beta2/local/lib/python2.7/site-packages/sage/interfaces/singular.pyc in eval(self, x, allow_semicolon, strip, **kwds)
    588 
    589         if s.find("error") != -1 or s.find("Segment fault") != -1:
--> 590             raise SingularError('Singular error:\n%s'%s)
    591 
    592         if get_verbose() > 0:

TypeError: Singular error:
   ? division(`number`,`poly`) failed
   ? error occurred in or before STDIN line 101850: `def sage38517=division(sage38515,sage38516);`
```


Issue created by migration from https://trac.sagemath.org/ticket/14624





---

archive/issue_comments_182323.json:
```json
{
    "body": "First question: Why is this operation using the singular pexpect interface, and not libsingular?\n\nSecond question: Why is `a._singular_init_()` returning `\"a\"` and not `\"poly(a)\"` or so? As a result, we have\n\n```\nsage: M = PolynomialRing(QQ['a'].fraction_field(), ['x','y'])\nsage: x,y = M.gens()\nsage: a = M(M.base_ring().gen())\nsage: singular(a).typeof()\nnumber\nsage: singular(\"a\").typeof()\nnumber\nsage: singular(\"poly(a)\").typeof()\npoly\n```\n",
    "created_at": "2013-05-21T20:28:50Z",
    "issue": "https://github.com/sagemath/sagetest/issues/14420",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/14420#issuecomment-182323",
    "user": "SimonKing"
}
```

First question: Why is this operation using the singular pexpect interface, and not libsingular?

Second question: Why is `a._singular_init_()` returning `"a"` and not `"poly(a)"` or so? As a result, we have

```
sage: M = PolynomialRing(QQ['a'].fraction_field(), ['x','y'])
sage: x,y = M.gens()
sage: a = M(M.base_ring().gen())
sage: singular(a).typeof()
number
sage: singular("a").typeof()
number
sage: singular("poly(a)").typeof()
poly
```




---

archive/issue_comments_182324.json:
```json
{
    "body": "I guess we have to look at `sage.rings.polynomial.polynomial_singular_interface._singular_init_func`, where the use of the string representation without adding `\"poly(...)\"` is hardcoded.",
    "created_at": "2013-05-21T20:35:20Z",
    "issue": "https://github.com/sagemath/sagetest/issues/14420",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/14420#issuecomment-182324",
    "user": "SimonKing"
}
```

I guess we have to look at `sage.rings.polynomial.polynomial_singular_interface._singular_init_func`, where the use of the string representation without adding `"poly(...)"` is hardcoded.
