# Issue 22156: sage_input for SR

Issue created by migration from Trac.

Original creator: mkoeppe

Original creation time: 2017-02-20 02:03:05

CC:  vbraun rws


```
sage: var('x')
x
sage: sage_input(x)
ValueError: Can't convert x to sage_input form
```




---

Comment by tmonteil created at 2017-04-20 02:46:25

I fear this is not enough for wilder symbolic expressions:


```
sage: a = SR(Zmod(4)(5))
sage: a
1
sage: a.parent()
Symbolic Ring
sage: a*6
2
sage: SR(repr(a)) * 6
6
```

