# Issue 12416: abs(pi*i) bug (wrong result)

Issue created by migration from https://trac.sagemath.org/ticket/12588

Original creator: dkrenn

Original creation time: 2012-02-26 12:48:17

Assignee: burcin

CC:  kcrisman

Keywords: absolute value, symbolic

We have

```
sage: abs(pi*I)
I*pi
```

which is wrong. The result should be `pi`.

This was reported by Clemens Heuberger in [sage-devel](http://groups.google.com/group/sage-support/browse_thread/thread/28bbd04a78dadb57/01168722573ff736).


---

Comment by dkrenn created at 2012-02-26 12:50:45

The diskussion in [sage-devel](http://groups.google.com/group/sage-support/browse_thread/thread/28bbd04a78dadb57/01168722573ff736) says that it is related to #6132, #7160 and #10064. Applying the patches from #7160 and #10064 do not solve the problem described above, so I opened this ticket.


---

Comment by kcrisman created at 2014-11-13 16:38:29

See also https://groups.google.com/forum/#!topic/sage-devel/6j-LcC6tpkE


---

Comment by rws created at 2015-05-05 08:55:47

This is now https://github.com/pynac/pynac/issues/37

Note also

```
sage: abs(2*pi)
abs(2*pi)
sage: abs(2.*pi)
abs(2.00000000000000*pi)
```

which is a different issue (in Pynac/`abs_eval` the nonnegative case is already handled but obviously does not work here). This is https://github.com/pynac/pynac/issues/39


---

Comment by rws created at 2015-05-08 14:22:58

Resolved in pynac master:

```
sage: abs(pi*I)
pi
sage: abs(pi*I*catalan)
catalan*pi
sage: abs(pi*catalan*x)
catalan*pi*abs(x)
sage: abs(pi*I*catalan*x)
catalan*pi*abs(I*x)
sage: abs(1.0j*pi)
1.00000000000000*pi
```



---

Comment by rws created at 2015-05-28 14:16:47

New commits:


---

Comment by rws created at 2015-05-28 14:16:47

Changing status from new to needs_review.


---

Comment by git created at 2015-05-28 15:11:50

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by kcrisman created at 2015-05-28 15:33:53

I note that this doesn't change

```
sage: abs(i*x)
abs(I*x)
```

(see [this long discussion](https://groups.google.com/forum/#!topic/sage-devel/6j-LcC6tpkE) as to connections to derivatives).  As long as that's intentional, fine.

In the original [discussion leading to this ticket](https://groups.google.com/forum/#!topic/sage-support/KLvQSnja21c), we have this example, which is still around.

```
sage: abs(log(2)*I) 
abs(I*log(2))
sage: abs(log(2.)*I)
0.693147180559945
```

Again, just wondering if that is intentional, should be another ticket, belongs here... etc.  It seems to relate to whether something is a "constant" or just in SR.

```
sage: abs(euler_gamma*I)
euler_gamma
sage: abs(5*I)
5
sage: abs(e^5*I)
abs(I*e^5)
```

I guess this would, in principle, belong to this ticket as well, though I understand not wanting to hold up on #18537 since these are sort of intertwined.  I don't have any other objections to this, though.


---

Comment by kcrisman created at 2015-05-28 15:33:53

Changing status from needs_review to needs_info.


---

Comment by rws created at 2015-05-29 06:57:39

Replying to [comment:17 kcrisman]:
> {{{
> sage: abs(i*x)
> abs(I*x)
> }}}
That's because the product's factors are separated into real constants and the rest. If the rest is constant, take `abs` of it, else `abs().hold()`. Then multiply together. Here `I*x` has symbols so it is held.

> {{{
> sage: abs(log(2)*I) 
> abs(I*log(2))
> }}}
This is because `log(2)` is a function expression.
> {{{
> abs(I*e^5)
> }}}
Here `exp(5)` is just printed as `e^5` but is a function expression as well.

I haven't thought about how to efficiently determine if an expression with held function values is constant, but I have opened https://github.com/pynac/pynac/issues/56. However I'd suggest not to hold up this ticket for this.


---

Comment by rws created at 2015-05-29 06:57:39

Changing status from needs_info to needs_review.


---

Comment by dkrenn created at 2015-05-29 07:14:35

Replying to [comment:18 rws]:
> Replying to [comment:17 kcrisman]:
> > {{{
> > sage: abs(i*x)
> > abs(I*x)
> > }}}
> That's because the product's factors are separated into real constants and the rest. If the rest is constant, take `abs` of it, else `abs().hold()`. Then multiply together. Here `I*x` has symbols so it is held.
> [...] However I'd suggest not to hold up this ticket for this.

Anyhow, since `abs(I)` already in current Sage gives `1`, the expression `abs(I*x)` should be simplified to `abs(x)`.


---

Comment by rws created at 2015-05-29 09:21:35

Changing status from needs_review to needs_work.


---

Comment by rws created at 2015-06-06 14:43:06

New code in Pynac master is now able to do:

```
sage: abs(I*x)
abs(x)
sage: abs(I*pi)
pi
sage: abs(I*log(2))
log(2)
sage: abs(I*e^5)
e^5
sage: abs(log(1/2))
-log(1/2)
sage: abs(log(1/2)*log(1/3))
log(1/2)*log(1/3)
sage: abs(log(1/2)*log(1/3)*log(1/4))
-log(1/2)*log(1/3)*log(1/4)
sage: abs(log(1/2)*log(1/3)*log(1/4)*i)
-log(1/2)*log(1/3)*log(1/4)
sage: abs(log(1/pi))
-log(1/pi)
sage: abs(log(x))
abs(log(x))
sage: abs(zeta(I))
abs(zeta(I))

```



---

Comment by git created at 2015-06-10 15:08:40

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by git created at 2015-06-10 15:15:04

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by rws created at 2015-06-10 15:15:39

Changing status from needs_work to needs_review.


---

Comment by kcrisman created at 2015-07-08 14:33:15

Since apparently Volker has merged #18537, does this now just need checking that tests pass?  (And possibly it doesn't need the new Pynac package stuff?)  Thanks for responding about https://groups.google.com/forum/#!topic/sage-devel/CVrS4S3AefM


---

Comment by rws created at 2015-07-08 14:58:31

After the new development release I'll go through all dependent tickets and adapt/commit the resp. doctests.


---

Comment by vdelecroix created at 2015-09-17 03:09:02

This is just a documentation commit that illustrate all the issues raised in the comments. I set to positive review.


---

Comment by vdelecroix created at 2015-09-17 03:09:02

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2015-09-17 11:40:32

Resolution: fixed
