# Issue 20699: Adding conversion for Divide and Product class in Sage/M2 interface

Issue created by migration from Trac.

Original creator: zonova

Original creation time: 2016-07-04 17:26:16

Keywords: Macaulay2, interface

This adds the method sage_prodstring(), which is similar to sage_polystring, except that it is for properly converting the macaulay2 Product object to a string following python's math programming conventions, so that I could add conversion of Product objects from M2 in the to_sage() function

There were also additions to the to_sage() function. I added an elif statement for converting Product objects, and an elif for converting Divide objects from M2 to Sage. Both of their outputs are as strings. 


---

Comment by zonova created at 2016-07-04 17:31:34

Changing status from new to needs_review.


---

Attachment


---

Comment by dimpase created at 2016-07-04 22:08:06

I think you should create a proper git branch, based on the current beta, rather than this.


---

Comment by zonova created at 2016-07-06 19:41:50

Does that work? 
----
New commits:


---

Comment by dimpase created at 2016-07-06 20:31:21

Why do you **remove** `from __future__ import print_function` and revert Python3-compatible `print` statements back to old form? Did you work with an old file?
You should merge your work with the current beta.


---

Comment by zonova created at 2016-07-07 01:58:20

New commits:


---

Comment by git created at 2016-07-07 02:18:46

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by git created at 2016-07-07 02:22:29

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by zonova created at 2016-07-07 02:24:10

After a bunch of git based atrocities(my own lack of experience), I think I finally fixed it. Does it look okay? Do I need to add more comments anywhere? I didn't know if I had to include my name with the edit in the comments. Thanks for the patience.


---

Comment by dimpase created at 2016-07-07 13:59:47

You should test your changes using Sage's doctesting framework. (`sage -t`). With your branch I get

```
sage -t src/sage/interfaces/macaulay2.py
    Error: TAB character found at lines 840,856,857,858,1190
    [28 tests, 0.04 s]
----------------------------------------------------------------------
sage -t src/sage/interfaces/macaulay2.py  # Tab character found
```

Do not use tabs, only use spaces for formatting (it should be easy to tell your editor to map tab key to 4 spaces).


---

Comment by dimpase created at 2016-07-07 13:59:47

Changing status from needs_review to needs_work.


---

Comment by git created at 2016-07-09 19:42:00

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by zonova created at 2016-07-10 23:12:01

Changing status from needs_work to needs_review.


---

Comment by zonova created at 2016-07-15 03:02:39

How does it look?


---

Comment by dimpase created at 2016-07-20 08:39:16

It seems you have broken some working parts, e.g.:

```
sage: macaulay2('5/4').to_sage()
5/4
sage: type(macaulay2('5/4').to_sage())
<type 'sage.rings.rational.Rational'>
```

makes perfect sense, while your patch makes this result a string.


---

Comment by zonova created at 2016-08-31 03:39:03

So, I've realized that M2 has a function, toString, that can be used to convert the ASCII art version of a polynomial into a polynomial following python's math syntax. Given this new knowledge, do you think that I should just delete this branch and perhaps later try writing a version that converts objects of the Divide and Product class into elements of SR in Sage? Or would it still be worth it to fix this version that converts it to strings? I can't think of a reason why, but if you can think of one, I'm happy to do it.


---

Comment by dimpase created at 2016-08-31 08:41:02

one way or another, I don't see why you ever want an interface to Sage SR objects rather than to its multivariate polynomial arithmetic. E.g. you would be stuck if on M2 side the Divide or the Product object you want to convert is defined over a field of positive characteristic, something that SR does not handle.


---

Comment by zonova created at 2016-08-31 15:11:18

Hmm, okay. How would I check if the object is defined over a field of positive characteristic in Macaulay? Or, would converting it into a multivariate polynomial do that automatically? I guess my question is, why does it work with MPA but not with SR?


---

Comment by dimpase created at 2016-08-31 15:18:27

Replying to [comment:18 zonova]:
> Hmm, okay. How would I check if the object is defined over a field of positive characteristic in Macaulay? Or, would converting it into a multivariate polynomial do that automatically? I guess my question is, why does it work with MPA but not with SR? 

SR only works in characteristic 0, by design. Why do you even need SR?


---

Comment by zonova created at 2016-09-01 13:37:41

I was basing it off of this:
https://groups.google.com/forum/#!topic/sage-support/oVXR3fURslY

But, you are right, it would make more sense to leave it at the first two steps you show in that post rather than changing it to SR. I had just assumed that using SR would have made it easier to treat it as a function, but that is likely my ignorance. 

Replying to [comment:15 dimpase]:
> It seems you have broken some working parts, e.g.:
> {{{
> sage: macaulay2('5/4').to_sage()
> 5/4
> sage: type(macaulay2('5/4').to_sage())
> <type 'sage.rings.rational.Rational'>
> }}}
> makes perfect sense, while your patch makes this result a string.

I don't understand why rationals like that have cls_str == "Divide", instead of having cls_str == "QQ"... The numerator and denomenator don't have properly defined repr_str's. Should I simply make run a search for a variable if it has cls_Str == "Divide", to differentiate between rational polynomials and rational numbers?


---

Comment by zonova created at 2016-09-02 16:37:46

Also, bigger question, how exactly is a rational function supposed to be a polynomial? Because, if it's a Divide type object in M2, then the numerator and denominator may be polynomials, but the whole thing certainly isn't, as far as I know...


---

Comment by dimpase created at 2016-09-02 19:46:29

of course a rational function need not be a polynomial. Here is an example:

```
sage: R.<x,y>=GF(5)[]
sage: x^2/y
x^2/y
sage: type(x^2/y)
<type 'sage.rings.fraction_field_element.FractionFieldElement'>
sage: R.fraction_field()
Fraction Field of Multivariate Polynomial Ring in x, y over Finite Field of size 5
sage: x^2 in R.fraction_field()
True
sage: x^2/y in R.fraction_field()
True
sage: x^2/y in R
False
```


so you get two polynomials p and q from M2, numerator and denominator of a Divide object, p/q, construct in Sage a polynomial ring R containing p and q, and then p/q is an element of R.fractional_field(). This is the plan.


---

Comment by chapoton created at 2017-03-13 07:21:11

Changing status from needs_review to needs_work.


---

Comment by chapoton created at 2017-03-13 07:21:11

indentation is incorrect in the new method.
