# Issue 33749: Unexpected exponent overflow with LaurentPolynomial_mpair

archive/issues_033749.json:
```json
{
    "body": "Keywords: LaurentPolynomial_mpair\n\nThe internal representation of `LaurentPolynomial_mpair` is not simplified when\npossible leading to unexpected exponents overflow:\n\n\n```\nsage: R = LaurentPolynomialRing(QQ,'x,y')\nsage: f = (R.gen(0)**40000/R.gen(0)**39999); f\nx\nsage: f.subs({R.gen(0):R.gen(0)**2})\n---------------------------------------------------------------------------\nTypeError                                 Traceback (most recent call last)\n...\nOverflowError: exponent overflow (80000)\n```\n\n\nThis happens because\n\n```\nsage: f._fraction_pair()\n(x^40000, x^39999)\n```\n\n\nFor comparison in the univariate world things work better:\n\n```\nsage: R = LaurentPolynomialRing(QQ,'x')\nsage: f = (R.gen(0)**40000/R.gen(0)**39999); f\nx\nsage: f.subs({R.gen(0):R.gen(0)**2})\nx^2\nsage: f._fraction_pair()\n(x, 1)\n```\n\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/33986\n\n",
    "created_at": "2022-06-13T09:26:19Z",
    "labels": [
        "algebra",
        "minor",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-9.8",
    "title": "Unexpected exponent overflow with LaurentPolynomial_mpair",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/33749",
    "user": "etn40ff"
}
```
Keywords: LaurentPolynomial_mpair

The internal representation of `LaurentPolynomial_mpair` is not simplified when
possible leading to unexpected exponents overflow:


```
sage: R = LaurentPolynomialRing(QQ,'x,y')
sage: f = (R.gen(0)**40000/R.gen(0)**39999); f
x
sage: f.subs({R.gen(0):R.gen(0)**2})
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)
...
OverflowError: exponent overflow (80000)
```


This happens because

```
sage: f._fraction_pair()
(x^40000, x^39999)
```


For comparison in the univariate world things work better:

```
sage: R = LaurentPolynomialRing(QQ,'x')
sage: f = (R.gen(0)**40000/R.gen(0)**39999); f
x
sage: f.subs({R.gen(0):R.gen(0)**2})
x^2
sage: f._fraction_pair()
(x, 1)
```



Issue created by migration from https://trac.sagemath.org/ticket/33986


