# Issue 23674: abs(-RDF(0)) should give 0.0 and not -0.0

Issue created by migration from https://trac.sagemath.org/ticket/23911

Original creator: zimmerma

Original creation time: 2017-09-21 11:48:36

CC:  jdemeyer

consider the following with Sage 8.0:

```
sage: abs(-RDF(0))
-0.0
sage: abs(-RR(0))
0.000000000000000
```

This is inconsistent. The second result seems to be the correct one:

```
$ cat e.c
#include <stdio.h>
#include <math.h>

int main()
{
  double x = 0.0, y = -x, z = fabs (y);
  printf ("x=%f y=%f z=%f\n", x, y, z);
}
zimmerma@tomate:/tmp$ gcc e.c -lm && ./a.out 
x=0.000000 y=-0.000000 z=0.000000
```



---

Comment by jdemeyer created at 2017-09-21 13:33:52

New commits:


---

Comment by jdemeyer created at 2017-09-21 13:33:52

Changing status from new to needs_review.


---

Comment by rws created at 2017-09-22 05:42:46

LGTM and patchbot is go.


---

Comment by rws created at 2017-09-22 05:42:46

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2017-09-24 13:04:06

Resolution: fixed


---

Comment by zimmerma created at 2018-05-16 15:39:13

however we still have in 8.2:

```
sage: (-RDF(0)).abs()
-0.0
sage: (-RR(0)).abs()
0.000000000000000
```

Should I open a new ticket for that?
