# Issue 13996: Add shortcut to add multiple variables with different names

Issue created by migration from Trac.

Original creator: tscrim

Original creation time: 2013-02-27 21:45:15

Assignee: tscrim

CC:  billey

Keywords: polynomials, variables

People have been asking me for an easy/automated way to create polynomial rings in two sets of varibles such as `x0, x1, x2, x3, y0, y1, y2, y3`. This patch provides a way to do so:

```
sage: PolynomialRing(ZZ, 3, var_array=['x','y'])
Multivariate Polynomial Ring in x0, y0, x1, y1, x2, y2 over Integer Ring
sage: PolynomialRing(ZZ, 3, var_array='a,b')
Multivariate Polynomial Ring in a0, b0, a1, b1, a2, b2 over Integer Ring
sage: PolynomialRing(ZZ, 2, 3, var_array='m')
Multivariate Polynomial Ring in m00, m01, m02, m10, m11, m12 over Integer Ring
sage: PolynomialRing(ZZ, 2, var_array='m')
Multivariate Polynomial Ring in m00, m01, m10, m11, over Integer Ring
```



---

Attachment


---

Comment by tscrim created at 2013-02-27 21:48:55

Changing status from new to needs_review.


---

Comment by billey created at 2013-03-01 02:58:54

Changing status from needs_review to positive_review.


---

Comment by jdemeyer created at 2013-03-04 07:39:06

Resolution: fixed
