# Issue 14685: Equality in PowerSeriesRing can be unpredictable

Issue created by migration from https://trac.sagemath.org/ticket/14889

Original creator: darij

Original creation time: 2013-07-13 20:00:35

Assignee: AlexGhitza

Keywords: power series, halting problem, discreteness, equality

I know this is unavoidable, but I'd say it should be better documented...

Over a finite field:


```
sage: K.<u> = PowerSeriesRing(GF(5))
sage: u = K.gen()
sage: u ** 25
u^25
sage: u ** 25 == 0
False
sage: (1 + u) ** 25
1 + u^25
sage: (1 + u) ** 25 == 1
False
sage: (1 / (1 - u)) ** 25     
1 + O(u^20)
sage: (1 / (1 - u)) ** 25 == 1
True
```


I suspect the last ``True`` is due to ``(1 / (1 - u)) ** 25`` being a dense series, which leads to Sage keeping precision at O(u^20) rather than moving to a higher exponent. But this seems not to be the whole story, since no such bull happens over the rationals:


```
sage: K.<u> = PowerSeriesRing(QQ)   
sage: u = K.gen()
sage: u ** 25 == 0
False
sage: (1 + u) ** 25 == 1
False
sage: (1 / (1 - u)) ** 25 == 1
False
```



---

Comment by vbraun created at 2013-07-13 20:34:07

The power series ring tries to keep arbitrary precision if possible, and only switches to series expansion if necessary. So `u^25` is kept as exact, even though it is zero to the `default_prec=20`.

For interactive use, I think this is what one would want. However, for non-interactive use an "always approximate" mode where `u^25` is immediately zero would be nice. I have written lots of code where many lines end in `+O(u^prec)` to get the precision back down.
