# Issue 27910: Remove _derivative from Polynomial_template

Issue created by migration from https://trac.sagemath.org/ticket/28147

Original creator: bruno

Original creation time: 2019-07-09 18:07:48

Keywords: polynomial

Right now, the class `Polynomial_template` contains a method `_derivative`, called from the generic `derivative` (from `Polynomial`) through the function `multi_derivative` of `misc/derivative.pyx`. This method is quite badly written, with at least the following consequences:

- It is **really** slow:


```python
sage: R.<x> = GF(65537)[]
sage: p = R.random_element(10^4)
sage: %time _ = p.derivative()
CPU times: user 6.91 s, sys: 3.7 ms, total: 6.91 s
Wall time: 6.91 s
```


- It breaks the differentiation of power series, cf #26844. 


After removing it, I see no problem, #26844 is not a problem anymore, and we have a more reasonable computation time for the above example:


```python
sage: R.<x> = GF(65537)[]
sage: p = R.random_element(10^4)
sage: %time _ = p.derivative()
CPU times: user 48.5 ms, sys: 145 Âµs, total: 48.7 ms
Wall time: 48.3 ms
```



---

Comment by git created at 2019-07-10 07:47:19

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by bruno created at 2019-07-10 07:58:15

I tried to detect potential problems with the removal of this method, but I didn't find any. Feel free to suggest where to look at!


---

Comment by bruno created at 2019-07-10 07:58:15

Changing status from new to needs_review.


---

Comment by mmezzarobba created at 2019-07-23 17:31:20

Hi Bruno,

I think you may want to adapt some of the doctests you are removing. Otherwise lgtm...


---

Comment by git created at 2019-08-19 16:58:58

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by bruno created at 2019-08-19 17:04:36

Hi Marc, 

I imported the removed doctests, and had errors... I had to change the error message when one tries to differentiate with respect to something "weird". In my view, this improves the current situation. In particular I do not find the following doctest (that I changed) very satisfying:


```
In the following example, it doesn't recognise 2\*x as the
generator, so it tries to differentiate each of the coefficients
with respect to 2\*x, which doesn't work because the integer
coefficients don't have a _derivative() method::

    sage: f._derivative(2*x)
    Traceback (most recent call last):
    ...
    AttributeError: 'sage.rings.integer.Integer' object has no attribute '_derivative'
```


The new doctest seems more reasonable to me:


```
It is not possible to differentiate with respect to 2\*x for instance::

    sage: f._derivative(2*x)
    Traceback (most recent call last):
    ...
    ValueError: cannot differentiate with respect to 2*x
```



---

Comment by mmezzarobba created at 2019-08-21 07:57:11

Thank you!


---

Comment by mmezzarobba created at 2019-08-21 07:57:11

Changing status from needs_review to positive_review.


---

Comment by bruno created at 2019-08-21 09:21:38

Thank you for the review. Could you have a quick look to #26844 to confirm that the bug is indeed fixed by the current ticket?


---

Comment by vbraun created at 2019-08-29 20:02:12

Resolution: fixed
