# Issue 11480: MPolynomial_libsingular reports the wrong degree

Issue created by migration from https://trac.sagemath.org/ticket/11652

Original creator: saraedum

Original creation time: 2011-08-05 17:12:01

Assignee: malb

Keywords: singular, polynomial, degree

On sage-4.7: In the following example, the degree with respect to _p_ should be 1 and the degree with respect to _q_ should be 2.


```
sage: R.<p,q,t> = ZZ[]
sage: poly = p+q^2+t^3
sage: poly = poly.polynomial(t)[0]
sage: poly
q^2 + p
sage: poly.degree(p)
2
sage: poly.degree(q)
1
```


The issue can be easily worked around:


```
sage: poly.degree(poly.parent(p))
1
```


(originally reported on sage-support, see http://groups.google.com/group/sage-support/browse_thread/thread/608bc46e92da2f49/feb54d2384cef583?lnk=gst&q=polynomial#feb54d2384cef583)


---

Comment by saraedum created at 2011-12-21 01:08:39

In sage-4.8.alpha3 both calls produce degree 1.


---

Attachment

fixes detection of generators


---

Comment by saraedum created at 2011-12-21 15:23:04

Changing keywords from "singular, polynomial, degree" to "singular, polynomial, degree, sd35".


---

Comment by saraedum created at 2011-12-21 15:35:17

Changing status from new to needs_review.


---

Comment by was created at 2011-12-22 19:01:18

apply this instead of trac_11652.patch -- it's a rewrite


---

Attachment

I was going to referee this, but instead ended up improving the documentation (a lot) and rewriting the logic a bit.    saraedum can you referee the new patch?


---

Comment by zimmerma created at 2012-01-11 16:54:28

all doctests pass on top of sage-4.8.alpha6 on x64, however:

```
sage: R.<p,q,t> = ZZ[]
sage: poly = p+q^2+t^3
sage: poly = poly.polynomial(t)[0]
sage: poly.degree(p)
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)
...
TypeError: argument must canonically coerce to parent
```

I don't understand since the documentation says:

```
sage: poly.degree?
...
Definition:     poly.degree(self, x=None, std_grading=False)
...
       Return the maximal degree of this polynomial in "x", where "x" must
       be one of the generators for the parent of this polynomial.
```

Indeed `p` is one of those generators:

```
sage: p in poly.parent().gens()
True
```

Thus either the code or the documentation has to be fixed.

Paul


---

Comment by zimmerma created at 2012-01-11 16:54:28

Changing status from needs_review to needs_work.


---

Comment by zimmerma created at 2012-01-11 16:54:28

Changing keywords from "singular, polynomial, degree, sd35" to "singular, polynomial, degree, sd35, sd35.5".


---

Comment by saraedum created at 2012-07-19 23:00:43

The output for the example in the ticket description has changed. However, it's still wrong.


```
sage: poly
q^2 + p
sage: poly.degree(p)
1
sage: poly.degree(q)
1
```



---

Attachment

Apply trac_11652-rewrite.patch trac_11652_review.patch


---

Comment by saraedum created at 2012-07-19 23:31:13

Replying to [comment:5 zimmerma]:
> I don't understand since the documentation says:
> {{{
>        Return the maximal degree of this polynomial in "x", where "x" must
>        be one of the generators for the parent of this polynomial.
> }}}
> Indeed `p` is one of those generators:
> {{{
> sage: p in poly.parent().gens()
> True
> }}}

I tried to make the `INPUT` section a little more precise. But I believe that writing that `x` `'is'` a generator and not only that `x` `'=='` a generator would be overdoing it.

Is it acceptable for you this way?


---

Comment by saraedum created at 2012-07-19 23:31:13

Changing status from needs_work to needs_review.


---

Comment by roed created at 2012-10-15 08:42:46

This looks fine to me.


---

Comment by roed created at 2012-10-15 08:42:46

Changing status from needs_review to positive_review.


---

Comment by jdemeyer created at 2012-10-30 08:14:41

Are the "work issues" still relevant?  If not, please remove them.


---

Comment by zimmerma created at 2012-10-30 08:25:57

> Are the "work issues" still relevant? If not, please remove them.

I don't know. However the following in the description seems wrong:

```
sage: poly.degree(poly.parent(q))
1
```

since I get `2` with Sage 5.1.

Paul


---

Comment by jdemeyer created at 2012-11-01 17:30:29

Changing status from positive_review to needs_info.


---

Comment by roed created at 2012-11-01 19:17:30

Changing status from needs_info to needs_review.


---

Comment by roed created at 2012-11-01 19:19:39

I've removed the work issues, changed the ticket description and marked it as positive review again.  However, Paul originally objected to the documentation, so if he wants to request additional changes he should feel free to return the ticket to needs work.  I just marked it as positive review since I thought that his concerns had been addressed and there hadn't been any comments for a few months.


---

Comment by roed created at 2012-11-01 19:19:39

Changing status from needs_review to positive_review.


---

Comment by zimmerma created at 2012-11-02 07:53:23

I tried the patch on top of Sage 5.3 and got:

```
sage: R.<p,q,t> = ZZ[]
sage: poly = p+q^2+t^3
sage: poly = poly.polynomial(t)[0]
sage: poly
q^2 + p
sage: poly.degree(p)
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)

/tmp/<ipython console> in <module>()

/usr/local/sage-5.3/sage/local/lib/python2.7/site-packages/sage/rings/polynomial/multi_polynomial_libsingular.so in sage.rings.polynomial.multi_polynomial_libsingular.MPolynomial_libsingular.degree (sage/rings/polynomial/multi_polynomial_libsingular.cpp:17832)()

TypeError: argument must canonically coerce to parent
```

Is that normal?

Paul


---

Comment by roed created at 2012-11-02 17:14:02

Yes, that's correct.  `p` is in `Z[p,q,t]`, `poly` is in `Z[p,q]` and there's no coercion from `Z[p,q,t]` to `Z[p,q]`.


---

Comment by zimmerma created at 2012-11-02 17:50:44

David, for the **variables** p and q, there is a trivial conversion...

Anyway the issue raised in comment [comment:5] is still there:

```
sage: poly.degree?
...
       Return the maximal degree of this polynomial in "x", where "x" must
       be one of the generators for the parent of this polynomial.
sage: poly.parent().gens()
(p, q)
sage: poly.degree(p)
...
TypeError: argument must canonically coerce to parent
```

According to the documentation, this should work.


---

Comment by zimmerma created at 2012-11-02 17:50:44

Changing status from positive_review to needs_work.


---

Comment by saraedum created at 2014-02-26 01:08:28

Replying to [comment:18 zimmerma]:
> David, for the **variables** p and q, there is a trivial conversion...
> 
> Anyway the issue raised in comment [comment:5] is still there:
> {{{
> sage: poly.degree?
> ...
>        Return the maximal degree of this polynomial in "x", where "x" must
>        be one of the generators for the parent of this polynomial.
> sage: poly.parent().gens()
> (p, q)
> sage: poly.degree(p)
> ...
> TypeError: argument must canonically coerce to parent
> }}}
> According to the documentation, this should work.
Probably you did not have the latest patch applied. With the latest patch I get:

```
   * "x" - (default: "None") a multivariate polynomial which is (or
     coerces to) a generator of the parent of self. If "x" is "None",
     return the total degree, which is the maximum degree of any
     monomial. Note that a matrix term ordering alters the grading of
     the generators of the ring; see the tests below.  To avoid this
     behavior, use either "exponents()" for the exponents themselves,
     or the optional argument "std_grading=False".
```



---

Comment by saraedum created at 2014-02-26 01:08:40

Changing status from needs_work to needs_review.


---

Comment by saraedum created at 2014-02-26 01:11:43

Sorry, you were referring to the summary and not to the parameter description. I believe it is acceptable that the summary is slightly imprecise; that's what the parameters' description is for.
----
New commits:


---

Comment by zimmerma created at 2014-02-26 15:45:21

Changing status from needs_review to positive_review.


---

Comment by zimmerma created at 2014-02-26 15:45:21

all tests pass on top of Sage 6.0 (except one which seems unrelated).
Thus a positive review for me.

Paul


---

Comment by vbraun created at 2014-03-03 18:55:35

Resolution: fixed
