# Issue 10525: Coercion problem for vectors from polynomial rings over GF(2)

Issue created by migration from Trac.

Original creator: jonhanke

Original creation time: 2011-01-09 22:19:10

Assignee: jason, was

CC:  jonhanke@gmail.com robertwb

Keywords: GF(2), coerce, polynomial ring, vector

This causes a segfault in Sage-4.6:


```
sage: F = GF(2)
sage: PR = PolynomialRing(F, 'y')
sage:         y = PR.gen()
sage: v1 = vector([PR(F.random_element())  for i in range(4)])
sage: v1
(0, 0, 0, 0)
sage: vector(F, v1)


------------------------------------------------------------
Unhandled SIGSEGV: A segmentation fault occurred in Sage.
This probably occurred because a *compiled* component
of Sage has a bug in it (typically accessing invalid memory)
or is not properly wrapped with _sig_on, _sig_off.
You might want to run Sage under gdb with 'sage -gdb' to debug this.
Sage will now terminate (sorry).
------------------------------------------------------------
```




---

Comment by dimpase created at 2011-01-11 04:47:39

this is due to the call to mod 2 in 

```
 mzd_write_bit(self._entries, 0, i, x[i]%2)            
```

(modules/vector_mod2_dense.pyx":166), where x[i]'s are the coordinates of the vector v1. The latter are in fact polynomials, and taking polynomial mod 2 produces a crash, as 
this low-level thing cannot be applied to Sage polynomials.

The following (coersing x[i] to int before computing modulo 2) appears to cure the problem, although I am not sure whether 
this is the right fix:


```
diff -r 777e70039438 sage/modules/vector_mod2_dense.pyx
--- a/sage/modules/vector_mod2_dense.pyx	Fri Dec 24 16:22:56 2010 +0100
+++ b/sage/modules/vector_mod2_dense.pyx	Mon Jan 10 20:39:38 2011 -0800
`@``@` -163,7 +163,8 `@``@`
                     # the if/else statement is because in some compilers, (-1)%2 is -1
                     mzd_write_bit(self._entries, 0, i, 0 if xi%2==0 else 1)
                 else:
-                    mzd_write_bit(self._entries, 0, i, x[i]%2)
+                    xi = x[i]
+                    mzd_write_bit(self._entries, 0, i, xi%2)
             return
         if x != 0:
             raise TypeError("can't initialize vector from nonzero non-list")
```



---

Comment by dimpase created at 2011-01-11 04:47:39

Changing status from new to needs_info.


---

Comment by wjp created at 2011-01-11 19:48:00

Shorter reproduction recipe:


```
sage: R.<x> = GF(2)[]
sage: vector(GF(2), vector([x]))
```



---

Comment by wjp created at 2011-01-11 22:19:35

Even simpler:


```
sage: R.<x> = GF(2)[]
sage: x % 2r
```



---

Comment by wjp created at 2011-01-12 05:32:49

Similarly,


```
sage: R.<x> = GF(2)[]
sage: x // 2r
```


and


```
sage: R.<x> = GF(2)[]
sage: x.quo_rem(2r)
```


both crash, and things like `gcd(x,2)` give `TypeErrors` instead of trying to coerce.

It looks like adding ``@`coerce_binop` to a lot of methods in `Polynomial_template` (`__mod__, __floordiv__, quo_rem, gcd...`) might work, but for `x // 2r` and `x % 2r` that doesn't help, while strangely `x.__mod__(2r)` and `x.__floordiv__(2r)` don't crash anymore.


---

Comment by wjp created at 2011-01-13 05:02:36

I'm attaching a patch that uses ``@`coerce_binop` where available, and uses `structure.element.bin_op` for `__mod__` and `__floordiv`. (Thanks to robertwb for pointing out its existence.)

`__mod__` and `__floordiv__` can't use the decorator approach because the operator slots don't get updated when the decorator updates the `__mod__` attribute of a cython class.


---

Attachment


---

Comment by wjp created at 2011-01-13 05:24:00

Changing status from needs_info to needs_review.


---

Comment by dimpase created at 2011-01-13 19:06:55

Changing status from needs_review to positive_review.


---

Comment by dimpase created at 2011-01-13 19:06:55

I tried this, it does not break any doctests (I tried the whole sage -t on MacOSX).
It looks as being just the right fix. Positive review.


---

Comment by jdemeyer created at 2011-01-26 22:28:46

Resolution: fixed
