# Issue 31923: Integrate of function which contains (x - floor(x))

Issue created by migration from https://trac.sagemath.org/ticket/32160

Original creator: @daju1

Original creation time: 2021-07-08 03:12:45

CC:  charpent slelievre frederichan @mwageringel parisse

Lets try to integrate the following function which contains (x - floor(x))



```
f = (2*(x - floor(x))^3 - 3*(x - floor(x))^2 + x - floor(x))*(10*x^3/(x^2 + 1)^6 - 3*x/(x^2 + 1)^5)
```





```
ans_sage = integrate(f, x, 1, +Infinity)
ans_sage
```



3/128*pi - 5/128



```
ans_sage.n()
```



0.0345685778185108

seems like ans_sage is wrong



```
from scipy import integrate
ans_scipy = integrate.quad(f, 1, +Infinity)
```




```
ans_scipy[0]
```


0.0009945480575073787

seems like ans_scipy is true


---

Attachment


---

Attachment

[https://git.sagemath.org/sage.git/commit/?h=u/gh-daju1/integrate_of_function_which_contains__x___floor_x__](https://git.sagemath.org/sage.git/commit/?h=u/gh-daju1/integrate_of_function_which_contains__x___floor_x__)
----
New commits:


---

Comment by @daju1 created at 2021-07-11 21:18:29

Set assignee to @daju1.


---

Comment by @daju1 created at 2021-07-11 21:18:52

Changing status from new to needs_review.


---

Comment by @daju1 created at 2021-07-12 06:32:38

Using my commit I have 



```
sage: f = (2*(x - floor(x))^3 - 3*(x - floor(x))^2 + x - floor(x))*(10*x^3/(x^2 + 1)^6 - 3*x/(x^2 + 1)^5)
```





```
sage: ans_sage = integrate(f, x, 1, +Infinity)
sage: ans_sage
```





```
integrate((7*x^2 - 3)*(2*x - 2*floor(x) - 1)*(x - floor(x))*(x - floor(x) - 1)*x/(x^2 + 1)^6, x, 1, +Infinity)
```





```
sage: ans_sage.n()
```





```
0.0009945490551909021
```


which is close to ans_scipy


```
0.0009945480575073787
```



---

Comment by mkoeppe created at 2021-07-12 18:36:16

Needs doctests - â€‹https://www.sagemath.org/git-developer-guide/coding_basics.html#writing-testable-examples


---

Comment by mkoeppe created at 2021-07-12 18:36:33

Changing status from needs_review to needs_work.


---

Comment by git created at 2021-07-15 21:03:24

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by @daju1 created at 2021-07-15 21:04:19

Changing status from needs_work to needs_review.


---

Comment by slelievre created at 2021-07-24 16:52:02

Needs rebase on Sage 9.4.beta5.

This change would make the example clearer:

```diff
     Check that :trac:`32160` is fixed::
 
-        sage: f = (2*(x - floor(x))^3 - 3*(x - floor(x))^2 + x - floor(x))*(10*x^3/(x^2 + 1)^6 - 3*x/(x^2 + 1)^5)
+        sage: g = x - floor(x)
+        sage: h = x^2 + 1
+        sage: f = (2*g^3 - 3*g^2 + g)*(10*x^3/h^6 - 3*x/h^5)
         sage: ans_sage = integrate(f, x, 1, +Infinity)
         sage: ans_sage
```



---

Comment by slelievre created at 2021-07-24 16:52:02

Changing keywords from "" to "integral".


---

Comment by slelievre created at 2021-07-24 17:15:59

Changing status from needs_review to needs_work.


---

Comment by slelievre created at 2021-07-24 17:15:59

Testing `src/sage/symbolic/integration/integral.py`
with the proposed changes (rebased on Sage 9.4.beta5)
fails for me:


```
$ sage -t --long src/sage/symbolic/integration/integral.py
too many failed tests, not using stored timings
Running doctests with ID 2021-07-24-18-43-49-44924a2f.
Git branch: 32160
Using --optional=build,dochtml,gap_packages,homebrew,libsemigroups,pip,sage,sage_spkg
Doctesting 1 file.
sage -t --long --random-seed=0 src/sage/symbolic/integration/integral.py
**********************************************************************
File "src/sage/symbolic/integration/integral.py", line 1017, in sage.symbolic.integration.integral.integrate
Failed example:
    ans_scipy = integrate.quad(f, 1, +Infinity)
Expected nothing
Got:
    doctest:warning
      File "/opt/s/sage9a/src/bin/sage-runtests", line 144, in <module>
        err = DC.run()
      File "/opt/s/sage9a/local/lib/python3.9/site-packages/sage/doctest/control.py", line 1207, in run
        self.run_doctests()
      File "/opt/s/sage9a/local/lib/python3.9/site-packages/sage/doctest/control.py", line 909, in run_doctests
        self.dispatcher.dispatch()
      File "/opt/s/sage9a/local/lib/python3.9/site-packages/sage/doctest/forker.py", line 2044, in dispatch
        self.parallel_dispatch()
      File "/opt/s/sage9a/local/lib/python3.9/site-packages/sage/doctest/forker.py", line 1939, in parallel_dispatch
        w.start()  # This might take some time
      File "/opt/s/sage9a/local/lib/python3.9/site-packages/sage/doctest/forker.py", line 2211, in start
        super(DocTestWorker, self).start()
      File "/usr/local/Cellar/python@3.9/3.9.6/Frameworks/Python.framework/Versions/3.9/lib/python3.9/multiprocessing/process.py", line 121, in start
        self._popen = self._Popen(self)
      File "/usr/local/Cellar/python@3.9/3.9.6/Frameworks/Python.framework/Versions/3.9/lib/python3.9/multiprocessing/context.py", line 224, in _Popen
        return _default_context.get_context().Process._Popen(process_obj)
      File "/usr/local/Cellar/python@3.9/3.9.6/Frameworks/Python.framework/Versions/3.9/lib/python3.9/multiprocessing/context.py", line 277, in _Popen
        return Popen(process_obj)
      File "/usr/local/Cellar/python@3.9/3.9.6/Frameworks/Python.framework/Versions/3.9/lib/python3.9/multiprocessing/popen_fork.py", line 19, in __init__
        self._launch(process_obj)
      File "/usr/local/Cellar/python@3.9/3.9.6/Frameworks/Python.framework/Versions/3.9/lib/python3.9/multiprocessing/popen_fork.py", line 71, in _launch
        code = process_obj._bootstrap(parent_sentinel=child_r)
      File "/usr/local/Cellar/python@3.9/3.9.6/Frameworks/Python.framework/Versions/3.9/lib/python3.9/multiprocessing/process.py", line 315, in _bootstrap
        self.run()
      File "/opt/s/sage9a/local/lib/python3.9/site-packages/sage/doctest/forker.py", line 2183, in run
        task(self.options, self.outtmpfile, msgpipe, self.result_queue)
      File "/opt/s/sage9a/local/lib/python3.9/site-packages/sage/doctest/forker.py", line 2512, in __call__
        doctests, extras = self._run(runner, options, results)
      File "/opt/s/sage9a/local/lib/python3.9/site-packages/sage/doctest/forker.py", line 2559, in _run
        result = runner.run(test)
      File "/opt/s/sage9a/local/lib/python3.9/site-packages/sage/doctest/forker.py", line 910, in run
        return self._run(test, compileflags, out)
      File "/opt/s/sage9a/local/lib/python3.9/site-packages/sage/doctest/forker.py", line 718, in _run
        self.compile_and_execute(example, compiler, test.globs)
      File "/opt/s/sage9a/local/lib/python3.9/site-packages/sage/doctest/forker.py", line 1137, in compile_and_execute
        exec(compiled, globs)
      File "<doctest sage.symbolic.integration.integral.integrate[166]>", line 1, in <module>
        ans_scipy = integrate.quad(f, Integer(1), +Infinity)
      File "/opt/s/sage9a/local/lib/python3.9/site-packages/scipy/integrate/quadpack.py", line 351, in quad
        retval = _quad(func, a, b, args, full_output, epsabs, epsrel, limit,
      File "/opt/s/sage9a/local/lib/python3.9/site-packages/scipy/integrate/quadpack.py", line 465, in _quad
        return _quadpack._qagie(func,bound,infbounds,args,full_output,epsabs,epsrel,limit)
      File "/opt/s/sage9a/local/lib/python3.9/site-packages/sage/misc/superseded.py", line 99, in deprecation
        warning(trac_number, message, DeprecationWarning, stacklevel)
      File "/opt/s/sage9a/local/lib/python3.9/site-packages/sage/misc/superseded.py", line 145, in warning
        warn(message, warning_class, stacklevel)
      File "/usr/local/Cellar/python@3.9/3.9.6/Frameworks/Python.framework/Versions/3.9/lib/python3.9/warnings.py", line 109, in _showwarnmsg
        sw(msg.message, msg.category, msg.filename, msg.lineno,
    :
    DeprecationWarning: Substitution using function-call syntax and unnamed arguments is deprecated and will be removed from a future release of Sage; you can use named arguments instead, like EXPR(x=..., y=...)
    See http://trac.sagemath.org/5930 for details.
**********************************************************************
File "src/sage/symbolic/integration/integral.py", line 1018, in sage.symbolic.integration.integral.integrate
Failed example:
    ans_scipy[0]
Expected:
    0.0009945480575073787
Got:
    0.0009945480575073791
**********************************************************************
1 item had failures:
   2 of 169 in sage.symbolic.integration.integral.integrate
    [229 tests, 2 failures, 826.72 s]
----------------------------------------------------------------------
sage -t --long --random-seed=0 src/sage/symbolic/integration/integral.py  # 2 doctests failed
----------------------------------------------------------------------
Total time for all tests: 826.9 seconds
    cpu time: 804.2 seconds
    cumulative wall time: 826.7 seconds
Pytest is not installed, skip checking tests that rely on it.
```


Not sure how to deal with the deprecation warning.

For the other failure, either use an ellipsis for
the last few digits:

```diff
     sage: ans_scipy[0]
-    0.0009945480575073787
+    0.00099454805750737...
```

or add a tolerance indication, either absolute:

```diff
-    sage: ans_scipy[0]
+    sage: ans_scipy[0]  # abs tol 1e-15
     0.0009945480575073787
```

or relative:

```diff
-    sage: ans_scipy[0]
+    sage: ans_scipy[0]  # rel tol 1e-11
     0.0009945480575073787
```



---

Comment by @daju1 created at 2021-07-26 09:59:34

Hi, slelievre

If you want to make the example more clearer, I can provide the part of my work related with two dimensional Euler-Maclarin formula


```

sage: x,y = var("x,y")                                                                                                                                                           
sage: f = (x^2 + y^2)^(-2)                                                                                                                                                       
sage: p = 3                                                                                                                                                                      
sage: f_diff_x_p = f.diff(x, p)                                                                                                                                                  
sage: f_diff_x_p                                                                                                                                                                 
-192*x^3/(x^2 + y^2)^5 + 72*x/(x^2 + y^2)^4
sage: P = lambda x, p : bernoulli_polynomial(x - floor(x), p)                                                                                                                    
sage: poly = P(x=x,p=p)/factorial(p)                                                                                                                                             
sage: poly                                                                                                                                                                       
1/6*(x - floor(x))^3 - 1/4*(x - floor(x))^2 + 1/12*x - 1/12*floor(x)
sage: assume(y>0)                                                                                                                                                                
sage: Rpx = (-1)^(p+1)*integrate(f_diff_x_p*poly, x, 1, Infinity)                                                                                                                
sage: Rpx                                                                                                                                                                        
-2*integrate((2*(x - floor(x))^3 - 3*(x - floor(x))^2 + x - floor(x))*(8*x^3/(x^2 + y^2)^5 - 3*x/(x^2 + y^2)^4), x, 1, +Infinity)
sage: k = 2                                                                                                                                                                      
sage: g = bernoulli(k)/factorial(k) * Rpx.diff(y, k-1)                                                                                                                           
sage: g                                                                                                                                                                          
4/3*integrate((2*(x - floor(x))^3 - 3*(x - floor(x))^2 + x - floor(x))*(10*x^3*y/(x^2 + y^2)^6 - 3*x*y/(x^2 + y^2)^5), x, 1, +Infinity)
sage: g.subs(y == 1)                                                                                                                                                             
1/32*pi - 5/96
sage: g.subs(y == 1).n()                                                                                                                                                         
0.0460914370913477
```


the obtained value is wrong, because



```
sage: from scipy import integrate as scipy_integrate                                                                                                                             
sage: ans_scipy = (-1)^(p+1) * bernoulli(k)/factorial(k) * scipy_integrate.quad((f_diff_x_p*poly).diff(y,k-1).subs(y == 1), 1, Infinity)[0]                                      
sage: ans_scipy                                                                                                                                                                  
0.001326061994802289
```



---

Comment by slelievre created at 2021-07-26 10:06:57

Note that `frac(x)` is a nicer way to write `x - floor(x)`.


---

Comment by git created at 2021-07-28 14:32:17

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by @daju1 created at 2021-07-28 14:33:53

Changing status from needs_work to needs_review.


---

Comment by git created at 2021-08-17 10:58:35

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by git created at 2021-08-17 21:05:50

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by tscrim created at 2021-08-18 06:19:02

Could we break the long output line into multiple lines (say at `+`)?


---

Comment by chapoton created at 2021-11-02 17:17:05

I have truncated the doctest.
----
New commits:


---

Comment by chapoton created at 2021-11-12 10:35:23

Changing status from needs_review to needs_work.


---

Comment by chapoton created at 2021-11-12 10:35:23

now integration is using libgiac rather than giac, so the proposed fix no longer works


---

Comment by git created at 2022-07-23 20:46:42

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by @mwageringel created at 2022-07-24 11:21:00

This seems to be an error in Giac itself as the antiderivative is not correct. It would be best to report it to Giac upstream, so that it can be fixed there.

In particular, this is not caused by one of the integration bounds being infinity, and not caused by the switch of integration algorithms from giac to libgiac.

For a smaller example, consider just the left factor of the original example.

```sage
sage: g = 2*(frac(x))^3 - 3*(frac(x))^2 + frac(x)     # g is continuous
sage: G = g.integral(x, algorithm='libgiac'); G       # Tested with Giac 1.9.0
// Giac share root-directory:/usr/share/giac/
// Giac share root-directory:/usr/share/giac/
Added 0 synonyms
Warning, integration of abs or sign assumes constant sign by intervals (correct if the argument is real):
Check [sign(sageVARx)]
Warning, integration of abs or sign assumes constant sign by intervals (correct if the argument is real):
Check [sign(sageVARx)]
Warning, integration of abs or sign assumes constant sign by intervals (correct if the argument is real):
Check [sign(sageVARx)]
1/2*x^4 - x^3 - x*floor(x*sgn(x))*sgn(x) + 1/2*x^2
```

This antiderivative is only correct for `0 < x < 1`. For the whole real line, the antiderivative should instead be (I think):

```
frac(x)^4/2 - frac(x)^3 + frac(x)^2/2
```

Giac did issue some warnings which are a hint that the result might be wrong, but our argument _is_ real, so I am not sure what to make of it.


---

Comment by @mwageringel created at 2022-07-24 11:21:00

Changing keywords from "integral" to "integral, giac, libgiac".


---

Comment by @daju1 created at 2022-07-31 06:48:50

First of all I see that in giac online

[https://www.xcasenligne.fr/giac_online/demoGiacPhp.php](https://www.xcasenligne.fr/giac_online/demoGiacPhp.php)


```
frac(x)
```


means


```
x-sign(x)floor(xsign(x))
```



---

Comment by slelievre created at 2022-08-01 09:30:30

Oh dear, both Giac and Sage return `-0.25` for `frac(-1.25)`.


---

Comment by tscrim created at 2022-08-03 08:02:05

The definition is a little different. In Sage for `RR` elements, it uses mpfr and satisfies `x == x.trunc() + x.frac()`:

```
sage: x = -1.25
sage: x.trunc()
-1
sage: x.frac()
-0.250000000000000
```

This is at odds with the `frac()` function definition.


---

Comment by slelievre created at 2022-08-30 14:41:53

So currently (Sage 9.6) the following mismatches are puzzling:

```
sage: frac(-1.25)
-0.250000000000000
sage: frac(x).subs({x: -1.25})
0.750000000000000
```


```
sage: frac(-1.25r)
-0.25
sage: frac(x).subs({x: -1.25r})
0.75
```


```
sage: frac(RDF(-1.25))
-0.25
sage: frac(x).subs({x: RDF(-1.25)})
0.75
```


```
sage: plot(frac, (-5, 5), aspect_ratio=1)
Launched png viewer for Graphics object consisting of 1 graphics primitive
```

Rationals behave well:

```
{{{
sage: frac(-5/4)
3/4
sage: frac(x).subs({x: -5/4})
3/4
}}}
