# Issue 12182: Preparse matrix literals of the form [a,b;c,d]

Issue created by migration from Trac.

Original creator: robertwb

Original creation time: 2012-01-25 08:47:37

Assignee: jason, was

CC:  kini kcrisman

E.g. 


```
sage: [1,2;3,4]
[1 2]
[3 4]
sage: [1,2;3,4].parent()
Full MatrixSpace of 2 by 2 dense matrices over Integer Ring
sage: [1, 2; 3, 1/2].parent()
Full MatrixSpace of 2 by 2 dense matrices over Rational Field
sage: [1, 2; 3, pi].parent()
Full MatrixSpace of 2 by 2 dense matrices over Symbolic Ring
```



---

Attachment


---

Comment by jason created at 2012-01-25 22:41:21

Of course, a big change like this should at least have a vote and discussion on sage-devel.

Rob Beezer points out the preparser doesn't deal so well with newlines, so this patch breaks this valid python syntax:


```
sage: ["1","2","\n;"
....: "2","4"]
....: 
....: 
....: 
....: 
```


and it never quits.


---

Comment by jason created at 2012-01-25 22:46:42

See #11699 for another take on using this syntax in the regular matrix constructor.
