# Issue 23943: Canonical label, document parameters

Issue created by migration from Trac.

Original creator: jmantysalo

Original creation time: 2017-11-09 16:48:58

Let's continue #19517. We shall include the code to Sage after 8.1 is out, but we can write it before that.

What is the definition of "canonical form with restrictions"? Maybe something like

"Canonical labeling is actually defined by some injective function that maps graphs to integers, and canonical form is the permutation of vertices that minimizes the function.

Both `partition` and `edge_labels` restrict possible permutations. That is, `g.canonical_label(partition=[[1,2],[3,4],[5,6]])` tries only swapping pairs 1/2, 3/4 and 5/6 and see what permutation out of 8 possible gives smallest value by the canonicality function. See below for examples."



---

Comment by jmantysalo created at 2017-12-14 11:45:50

What should `edge_labels` actually do? I tried with


```
sage: C5 = graphs.CycleGraph(5)
sage: C = C5+C5
sage: C.set_edge_label(0, 1, 'a')
sage: C.set_edge_label(1, 2, 'b')
sage: C.set_edge_label(2, 3, 'c')
sage: C.set_edge_label(3, 4, 'd')
sage: C.set_edge_label(4, 0, 'e')
sage: C.canonical_label(algorithm='sage', edge_labels=True).show()
```


and do not understand. I assumed to get a ring 0-1-2-3-4-0 (and another with 5-8-7-6-9-5), but got a ring 0-1-2-4-3-0.


---

Comment by dcoudert created at 2017-12-15 07:58:54

What is important is that the following will display the same graph, i.e., the canonical labeling is unique for this isomorphism class.

```
sage: D = C.relabel(perm=Permutations(C.vertices()).random_element(), inplace=False)
sage: D.canonical_label(algorithm='sage', edge_labels=True).show()
```



---

Comment by jmantysalo created at 2017-12-18 10:37:21

Replying to [comment:2 dcoudert]:
> What is important is that the following will display the same graph, i.e., the canonical labeling is unique for this isomorphism class.
> {{{
> sage: D = C.relabel(perm=Permutations(C.vertices()).random_element(), inplace=False)
> sage: D.canonical_label(algorithm='sage', edge_labels=True).show()
> }}}

That works, but even totally ignoring `edge_labels` would satisfy that. It seems to work and the parameter is not ignored, but I do not understand what is the meaning of paramater.


---

Comment by dcoudert created at 2017-12-18 17:34:47

Well, I don't know how to explain it properly. You should read https://en.wikipedia.org/wiki/Graph_canonization


---

Comment by jmantysalo created at 2018-03-28 07:17:59

Changing status from new to needs_review.


---

Comment by jmantysalo created at 2018-03-28 07:17:59

I think I did not understood the explanation, so this one can be closed.


---

Comment by chapoton created at 2018-05-30 19:28:43

Changing status from needs_review to positive_review.


---

Comment by chapoton created at 2018-05-30 19:28:43

let us close that one


---

Comment by embray created at 2018-11-08 16:10:49

Resolution: wontfix
