# Issue 12416: abs(pi*i) bug (wrong result)

archive/issues_012416.json:
```json
{
    "body": "Assignee: @burcin\n\nCC:  @kcrisman\n\nKeywords: absolute value, symbolic\n\nWe have\n\n```\nsage: abs(pi*I)\nI*pi\n```\n\nwhich is wrong. The result should be `pi`.\n\nThis was reported by Clemens Heuberger in [sage-devel](http://groups.google.com/group/sage-support/browse_thread/thread/28bbd04a78dadb57/01168722573ff736).\n\nIssue created by migration from https://trac.sagemath.org/ticket/12588\n\n",
    "created_at": "2012-02-26T12:48:17Z",
    "labels": [
        "symbolics",
        "major",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-6.8",
    "title": "abs(pi*i) bug (wrong result)",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/12416",
    "user": "@dkrenn"
}
```
Assignee: @burcin

CC:  @kcrisman

Keywords: absolute value, symbolic

We have

```
sage: abs(pi*I)
I*pi
```

which is wrong. The result should be `pi`.

This was reported by Clemens Heuberger in [sage-devel](http://groups.google.com/group/sage-support/browse_thread/thread/28bbd04a78dadb57/01168722573ff736).

Issue created by migration from https://trac.sagemath.org/ticket/12588





---

archive/issue_comments_146673.json:
```json
{
    "body": "The diskussion in [sage-devel](http://groups.google.com/group/sage-support/browse_thread/thread/28bbd04a78dadb57/01168722573ff736) says that it is related to #6132, #7160 and #10064. Applying the patches from #7160 and #10064 do not solve the problem described above, so I opened this ticket.",
    "created_at": "2012-02-26T12:50:45Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12416",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12416#issuecomment-146673",
    "user": "@dkrenn"
}
```

The diskussion in [sage-devel](http://groups.google.com/group/sage-support/browse_thread/thread/28bbd04a78dadb57/01168722573ff736) says that it is related to #6132, #7160 and #10064. Applying the patches from #7160 and #10064 do not solve the problem described above, so I opened this ticket.



---

archive/issue_comments_146674.json:
```json
{
    "body": "See also https://groups.google.com/forum/#!topic/sage-devel/6j-LcC6tpkE",
    "created_at": "2014-11-13T16:38:29Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12416",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12416#issuecomment-146674",
    "user": "@kcrisman"
}
```

See also https://groups.google.com/forum/#!topic/sage-devel/6j-LcC6tpkE



---

archive/issue_comments_146675.json:
```json
{
    "body": "This is now https://github.com/pynac/pynac/issues/37\n\nNote also\n\n```\nsage: abs(2*pi)\nabs(2*pi)\nsage: abs(2.*pi)\nabs(2.00000000000000*pi)\n```\n\nwhich is a different issue (in Pynac/`abs_eval` the nonnegative case is already handled but obviously does not work here). This is https://github.com/pynac/pynac/issues/39",
    "created_at": "2015-05-05T08:55:47Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12416",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12416#issuecomment-146675",
    "user": "@rwst"
}
```

This is now https://github.com/pynac/pynac/issues/37

Note also

```
sage: abs(2*pi)
abs(2*pi)
sage: abs(2.*pi)
abs(2.00000000000000*pi)
```

which is a different issue (in Pynac/`abs_eval` the nonnegative case is already handled but obviously does not work here). This is https://github.com/pynac/pynac/issues/39



---

archive/issue_comments_146676.json:
```json
{
    "body": "Resolved in pynac master:\n\n```\nsage: abs(pi*I)\npi\nsage: abs(pi*I*catalan)\ncatalan*pi\nsage: abs(pi*catalan*x)\ncatalan*pi*abs(x)\nsage: abs(pi*I*catalan*x)\ncatalan*pi*abs(I*x)\nsage: abs(1.0j*pi)\n1.00000000000000*pi\n```\n",
    "created_at": "2015-05-08T14:22:58Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12416",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12416#issuecomment-146676",
    "user": "@rwst"
}
```

Resolved in pynac master:

```
sage: abs(pi*I)
pi
sage: abs(pi*I*catalan)
catalan*pi
sage: abs(pi*catalan*x)
catalan*pi*abs(x)
sage: abs(pi*I*catalan*x)
catalan*pi*abs(I*x)
sage: abs(1.0j*pi)
1.00000000000000*pi
```




---

archive/issue_comments_146677.json:
```json
{
    "body": "New commits:",
    "created_at": "2015-05-28T14:16:47Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12416",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12416#issuecomment-146677",
    "user": "@rwst"
}
```

New commits:



---

archive/issue_comments_146678.json:
```json
{
    "body": "Changing status from new to needs_review.",
    "created_at": "2015-05-28T14:16:47Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12416",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12416#issuecomment-146678",
    "user": "@rwst"
}
```

Changing status from new to needs_review.



---

archive/issue_comments_146679.json:
```json
{
    "body": "Branch pushed to git repo; I updated commit sha1. New commits:",
    "created_at": "2015-05-28T15:11:50Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12416",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12416#issuecomment-146679",
    "user": "git"
}
```

Branch pushed to git repo; I updated commit sha1. New commits:



---

archive/issue_comments_146680.json:
```json
{
    "body": "I note that this doesn't change\n\n```\nsage: abs(i*x)\nabs(I*x)\n```\n\n(see [this long discussion](https://groups.google.com/forum/#!topic/sage-devel/6j-LcC6tpkE) as to connections to derivatives).  As long as that's intentional, fine.\n\nIn the original [discussion leading to this ticket](https://groups.google.com/forum/#!topic/sage-support/KLvQSnja21c), we have this example, which is still around.\n\n```\nsage: abs(log(2)*I) \nabs(I*log(2))\nsage: abs(log(2.)*I)\n0.693147180559945\n```\n\nAgain, just wondering if that is intentional, should be another ticket, belongs here... etc.  It seems to relate to whether something is a \"constant\" or just in SR.\n\n```\nsage: abs(euler_gamma*I)\neuler_gamma\nsage: abs(5*I)\n5\nsage: abs(e^5*I)\nabs(I*e^5)\n```\n\nI guess this would, in principle, belong to this ticket as well, though I understand not wanting to hold up on #18537 since these are sort of intertwined.  I don't have any other objections to this, though.",
    "created_at": "2015-05-28T15:33:53Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12416",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12416#issuecomment-146680",
    "user": "@kcrisman"
}
```

I note that this doesn't change

```
sage: abs(i*x)
abs(I*x)
```

(see [this long discussion](https://groups.google.com/forum/#!topic/sage-devel/6j-LcC6tpkE) as to connections to derivatives).  As long as that's intentional, fine.

In the original [discussion leading to this ticket](https://groups.google.com/forum/#!topic/sage-support/KLvQSnja21c), we have this example, which is still around.

```
sage: abs(log(2)*I) 
abs(I*log(2))
sage: abs(log(2.)*I)
0.693147180559945
```

Again, just wondering if that is intentional, should be another ticket, belongs here... etc.  It seems to relate to whether something is a "constant" or just in SR.

```
sage: abs(euler_gamma*I)
euler_gamma
sage: abs(5*I)
5
sage: abs(e^5*I)
abs(I*e^5)
```

I guess this would, in principle, belong to this ticket as well, though I understand not wanting to hold up on #18537 since these are sort of intertwined.  I don't have any other objections to this, though.



---

archive/issue_comments_146681.json:
```json
{
    "body": "Changing status from needs_review to needs_info.",
    "created_at": "2015-05-28T15:33:53Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12416",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12416#issuecomment-146681",
    "user": "@kcrisman"
}
```

Changing status from needs_review to needs_info.



---

archive/issue_comments_146682.json:
```json
{
    "body": "Replying to [comment:17 kcrisman]:\n> {{{\n> sage: abs(i*x)\n> abs(I*x)\n> }}}\nThat's because the product's factors are separated into real constants and the rest. If the rest is constant, take `abs` of it, else `abs().hold()`. Then multiply together. Here `I*x` has symbols so it is held.\n\n> {{{\n> sage: abs(log(2)*I) \n> abs(I*log(2))\n> }}}\nThis is because `log(2)` is a function expression.\n> {{{\n> abs(I*e^5)\n> }}}\nHere `exp(5)` is just printed as `e^5` but is a function expression as well.\n\nI haven't thought about how to efficiently determine if an expression with held function values is constant, but I have opened https://github.com/pynac/pynac/issues/56. However I'd suggest not to hold up this ticket for this.",
    "created_at": "2015-05-29T06:57:39Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12416",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12416#issuecomment-146682",
    "user": "@rwst"
}
```

Replying to [comment:17 kcrisman]:
> {{{
> sage: abs(i*x)
> abs(I*x)
> }}}
That's because the product's factors are separated into real constants and the rest. If the rest is constant, take `abs` of it, else `abs().hold()`. Then multiply together. Here `I*x` has symbols so it is held.

> {{{
> sage: abs(log(2)*I) 
> abs(I*log(2))
> }}}
This is because `log(2)` is a function expression.
> {{{
> abs(I*e^5)
> }}}
Here `exp(5)` is just printed as `e^5` but is a function expression as well.

I haven't thought about how to efficiently determine if an expression with held function values is constant, but I have opened https://github.com/pynac/pynac/issues/56. However I'd suggest not to hold up this ticket for this.



---

archive/issue_comments_146683.json:
```json
{
    "body": "Changing status from needs_info to needs_review.",
    "created_at": "2015-05-29T06:57:39Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12416",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12416#issuecomment-146683",
    "user": "@rwst"
}
```

Changing status from needs_info to needs_review.



---

archive/issue_comments_146684.json:
```json
{
    "body": "Replying to [comment:18 rws]:\n> Replying to [comment:17 kcrisman]:\n> > {{{\n> > sage: abs(i*x)\n> > abs(I*x)\n> > }}}\n> That's because the product's factors are separated into real constants and the rest. If the rest is constant, take `abs` of it, else `abs().hold()`. Then multiply together. Here `I*x` has symbols so it is held.\n> [...] However I'd suggest not to hold up this ticket for this.\n\nAnyhow, since `abs(I)` already in current Sage gives `1`, the expression `abs(I*x)` should be simplified to `abs(x)`.",
    "created_at": "2015-05-29T07:14:35Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12416",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12416#issuecomment-146684",
    "user": "@dkrenn"
}
```

Replying to [comment:18 rws]:
> Replying to [comment:17 kcrisman]:
> > {{{
> > sage: abs(i*x)
> > abs(I*x)
> > }}}
> That's because the product's factors are separated into real constants and the rest. If the rest is constant, take `abs` of it, else `abs().hold()`. Then multiply together. Here `I*x` has symbols so it is held.
> [...] However I'd suggest not to hold up this ticket for this.

Anyhow, since `abs(I)` already in current Sage gives `1`, the expression `abs(I*x)` should be simplified to `abs(x)`.



---

archive/issue_comments_146685.json:
```json
{
    "body": "Changing status from needs_review to needs_work.",
    "created_at": "2015-05-29T09:21:35Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12416",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12416#issuecomment-146685",
    "user": "@rwst"
}
```

Changing status from needs_review to needs_work.



---

archive/issue_comments_146686.json:
```json
{
    "body": "New code in Pynac master is now able to do:\n\n```\nsage: abs(I*x)\nabs(x)\nsage: abs(I*pi)\npi\nsage: abs(I*log(2))\nlog(2)\nsage: abs(I*e^5)\ne^5\nsage: abs(log(1/2))\n-log(1/2)\nsage: abs(log(1/2)*log(1/3))\nlog(1/2)*log(1/3)\nsage: abs(log(1/2)*log(1/3)*log(1/4))\n-log(1/2)*log(1/3)*log(1/4)\nsage: abs(log(1/2)*log(1/3)*log(1/4)*i)\n-log(1/2)*log(1/3)*log(1/4)\nsage: abs(log(1/pi))\n-log(1/pi)\nsage: abs(log(x))\nabs(log(x))\nsage: abs(zeta(I))\nabs(zeta(I))\n\n```\n",
    "created_at": "2015-06-06T14:43:06Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12416",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12416#issuecomment-146686",
    "user": "@rwst"
}
```

New code in Pynac master is now able to do:

```
sage: abs(I*x)
abs(x)
sage: abs(I*pi)
pi
sage: abs(I*log(2))
log(2)
sage: abs(I*e^5)
e^5
sage: abs(log(1/2))
-log(1/2)
sage: abs(log(1/2)*log(1/3))
log(1/2)*log(1/3)
sage: abs(log(1/2)*log(1/3)*log(1/4))
-log(1/2)*log(1/3)*log(1/4)
sage: abs(log(1/2)*log(1/3)*log(1/4)*i)
-log(1/2)*log(1/3)*log(1/4)
sage: abs(log(1/pi))
-log(1/pi)
sage: abs(log(x))
abs(log(x))
sage: abs(zeta(I))
abs(zeta(I))

```




---

archive/issue_comments_146687.json:
```json
{
    "body": "Branch pushed to git repo; I updated commit sha1. New commits:",
    "created_at": "2015-06-10T15:08:40Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12416",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12416#issuecomment-146687",
    "user": "git"
}
```

Branch pushed to git repo; I updated commit sha1. New commits:



---

archive/issue_comments_146688.json:
```json
{
    "body": "Branch pushed to git repo; I updated commit sha1. New commits:",
    "created_at": "2015-06-10T15:15:04Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12416",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12416#issuecomment-146688",
    "user": "git"
}
```

Branch pushed to git repo; I updated commit sha1. New commits:



---

archive/issue_comments_146689.json:
```json
{
    "body": "Changing status from needs_work to needs_review.",
    "created_at": "2015-06-10T15:15:39Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12416",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12416#issuecomment-146689",
    "user": "@rwst"
}
```

Changing status from needs_work to needs_review.



---

archive/issue_comments_146690.json:
```json
{
    "body": "Since apparently Volker has merged #18537, does this now just need checking that tests pass?  (And possibly it doesn't need the new Pynac package stuff?)  Thanks for responding about https://groups.google.com/forum/#!topic/sage-devel/CVrS4S3AefM",
    "created_at": "2015-07-08T14:33:15Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12416",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12416#issuecomment-146690",
    "user": "@kcrisman"
}
```

Since apparently Volker has merged #18537, does this now just need checking that tests pass?  (And possibly it doesn't need the new Pynac package stuff?)  Thanks for responding about https://groups.google.com/forum/#!topic/sage-devel/CVrS4S3AefM



---

archive/issue_comments_146691.json:
```json
{
    "body": "After the new development release I'll go through all dependent tickets and adapt/commit the resp. doctests.",
    "created_at": "2015-07-08T14:58:31Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12416",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12416#issuecomment-146691",
    "user": "@rwst"
}
```

After the new development release I'll go through all dependent tickets and adapt/commit the resp. doctests.



---

archive/issue_comments_146692.json:
```json
{
    "body": "This is just a documentation commit that illustrate all the issues raised in the comments. I set to positive review.",
    "created_at": "2015-09-17T03:09:02Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12416",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12416#issuecomment-146692",
    "user": "@videlec"
}
```

This is just a documentation commit that illustrate all the issues raised in the comments. I set to positive review.



---

archive/issue_comments_146693.json:
```json
{
    "body": "Changing status from needs_review to positive_review.",
    "created_at": "2015-09-17T03:09:02Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12416",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12416#issuecomment-146693",
    "user": "@videlec"
}
```

Changing status from needs_review to positive_review.



---

archive/issue_comments_146694.json:
```json
{
    "body": "Resolution: fixed",
    "created_at": "2015-09-17T11:40:32Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12416",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12416#issuecomment-146694",
    "user": "@vbraun"
}
```

Resolution: fixed
