# Issue 23091: Undefined limit product $INF * $ZEROB in lim-times

Issue created by migration from https://trac.sagemath.org/ticket/23328

Original creator: pelegm

Original creation time: 2017-06-26 15:39:16

Keywords: limit,maxima

Trying to calculate a limit of some (not too) complicated function brings some kind of console which reports some error/warning.  Using `algorithm=sympy' is ok, so this is probably a `maxima` issue.


```python
sage: (x*(4/log(x))^(2*log(x)/log(log(x)))).limit(x=infinity)

Condition of type: SIMPLE-CONDITION
Undefined limit product $INF * $ZEROB in lim-times
Available restarts:

1. (CONTINUE) Return from BREAK.

Top level.
>
0
sage: (x*(4/log(x))^(2*log(x)/log(log(x)))).limit(x=infinity, algorithm='sympy')
0
```


Tested in SageMath version 8.0.beta5, Release Date: 2017-05-04.


---

Comment by kcrisman created at 2017-06-26 15:46:28

Huh.  Using `sage -maxima`:

```
Maxima 5.39.0 http://maxima.sourceforge.net
using Lisp ECL 16.1.2
Distributed under the GNU Public License. See the file COPYING.
Dedicated to the memory of William Schelter.
The function bug_report() provides bug reporting information.
(%i1) limit((x*(4/log(x))^(2*log(x)/log(log(x)))),x,inf);
(%o1)                                  0
(%i2) domain:complex;
(%o2)                               complex
(%i3) limit((x*(4/log(x))^(2*log(x)/log(log(x)))),x,inf);

Condition of type: SIMPLE-CONDITION
Undefined limit product $INF * $ZEROB in lim-times

Available restarts:

1. (CONTINUE) Return from BREAK.
2. (MACSYMA-QUIT) Maxima top-level

Top level.
```

So this is an issue in Maxima for sure.  Workaround is to set `maxima("domain:real")`, I guess.
