# Issue 15594: implement SR.next_variable()

archive/issues_015594.json:
```json
{
    "body": "CC:  @eviatarbach\n\nKeywords: variable\n\nIdea by ppurka in #14403. Something like this, not necessarily digit suffixes:\n\n```\nsage: SR.next_variable('x') # suppose x, x0, x1 are already defined\nx2\nsage: SR.next_variable('x2')\nx3\nsage: SR.next_variable('x0y') # suppose that x0y is not yet defined.\nx0y\n```\n\n\nThis would be better than\n\n```\nsage: SR.symbol()\nsymbol161\nsage: SR.symbol()\nsymbol164\n```\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/15831\n\n",
    "created_at": "2014-02-18T10:59:43Z",
    "labels": [
        "symbolics",
        "major",
        "enhancement"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-6.4",
    "title": "implement SR.next_variable()",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/15594",
    "user": "@rwst"
}
```
CC:  @eviatarbach

Keywords: variable

Idea by ppurka in #14403. Something like this, not necessarily digit suffixes:

```
sage: SR.next_variable('x') # suppose x, x0, x1 are already defined
x2
sage: SR.next_variable('x2')
x3
sage: SR.next_variable('x0y') # suppose that x0y is not yet defined.
x0y
```


This would be better than

```
sage: SR.symbol()
symbol161
sage: SR.symbol()
symbol164
```


Issue created by migration from https://trac.sagemath.org/ticket/15831


