# Issue 17270: wrong output from definite_integral()

Issue created by migration from https://trac.sagemath.org/ticket/17507

Original creator: rws

Original creation time: 2014-12-15 10:27:22

CC:  kcrisman

There appear to be two problems:

```
sage: from sage.symbolic.integration.integral import definite_integral, indefinite_integral
sage: definite_integral(x*y,x,0,1,hold=True)
integrate(x*y, x, 0, 1)
sage: _.n()
ValueError: Integrand has wrong number of parameters

sage: integrate(x*y,(x,0,1))
1/2*y
sage: definite_integral(x*y,(x,0,1),hold=True)
TypeError: Symbolic function integrate takes exactly 4 arguments (2 given)
```



---

Comment by rws created at 2014-12-15 14:16:06

Changing status from new to needs_review.


---

Comment by rws created at 2014-12-15 14:16:06

This should be fixed with #2787 so this is a duplicate.


---

Comment by rws created at 2014-12-15 14:16:56

Changing status from needs_review to positive_review.


---

Comment by rws created at 2014-12-15 15:14:11

To be more exact, this ticket is just about the `n()`


---

Comment by rws created at 2014-12-15 15:14:11

Changing status from positive_review to needs_work.


---

Comment by rws created at 2014-12-15 15:14:11

Changing priority from major to minor.


---

Comment by kcrisman created at 2014-12-15 15:18:02

What kind of error would you suggest?  `InputError`, `ValueError` ... ?


---

Comment by rws created at 2014-12-31 16:10:38

I cannot find documentation about `InputError`, so `ValueError` is fine. Looking at the trigger condition however

```
                if len(params) + 1 != len(vars):
                    raise ValueError, "Integrand has wrong number of parameters"
```

suggests this is meant to catch problems with the `params` argument to `numerical_integral`. This is not given by the calling `_evalf_` so maybe that should be checked upstream too to honor untold preconditions of `numerical_integral`.
----
New commits:


---

Comment by rws created at 2014-12-31 16:11:05

Changing status from needs_work to needs_review.


---

Comment by ncohen created at 2015-01-15 11:01:05

Changing status from needs_review to needs_info.


---

Comment by ncohen created at 2015-01-15 11:01:05

Hello !

I think that this branch is ready to go, but I have a couple of questions to ask (I am new to this code):

- What would you think of an alternative error message: "The function to be integrated depends on 2 variables (x,y), and so cannot be integrated in one dimension. Please fix additional variables with the 'params' argument".

  It took me some time to understand what exactly the problem was with the current error message, because I did not understand what 'parameters' meant.

- It seems dangerous to me that `params` is a list but not a dictionary. It seems difficult for the user to know for sure which variable will receive which value. Isn't that a problem ? Sorry, I really do not know the code.

If you agree to change the error message to the one I proposed, tell me and I will write a commit.

Nathann


---

Comment by rws created at 2015-01-15 17:31:19

As to the message, please go ahead. The `expression.variables()` returns a lexically sorted list but the `function.arguments()` returns the arguments as they are given. This can get really confusing:

```
sage: f(x,a) = 1/(a+x^2)
sage: f.variables()
(a, x)
sage: f.arguments()
(x, a)
sage: numerical_integral(f, 1, 2, max_points=100, params=[10])
(0.08148091340506758, 9.046198612979459e-16)
sage: numerical_integral(1/(a+x^2), 1, 2, max_points=100, params=[10])
(0.00985229644301163, 1.0938246356464044e-16)
```

OTOH, giving a dictionary always involves the user more than a list. So maybe we should at least put a warning in the documentation about this. If you feel up to it, cvould you please?


---

Comment by ncohen created at 2015-01-16 04:36:18

Changing status from needs_info to needs_review.


---

Comment by ncohen created at 2015-01-16 04:36:18

Hello,

> As to the message, please go ahead.

It is in the new commit.

> The `expression.variables()` returns a lexically sorted list but the `function.arguments()` returns the arguments as they are given. This can get really confusing:
>
> OTOH, giving a dictionary always involves the user more than a list.

What would you think of that: `numerical_integral(x*y,0,1,y=3)` ?

The 'dictionary' can also be built from `**args`.

This being said, perhaps the "most simple and clean" prototype would be to refuse input with more than one variables, and ask the user to input:


```
sage: numerical_integral((x*y).subs(y=4),0,1)
(2.0, 2.220446049250313e-14)
```


This would not be very welcoming for beginners, though `:-/`

> So maybe we should at least put a warning in the documentation about this. If you feel up to it, cvould you please?

I would like to fix it, but I do not know if this 'param' argument is not used in other places of the symbolic functions, in which case it would call for a global change. I will write to sage-devel about that in a second.

I set the ticket in its current state as `needs_review`: if we change the way to fix variables in this functions we will do so in another ticket.

Thanks,

Nathann
----
New commits:


---

Comment by ncohen created at 2015-01-16 05:20:44

https://groups.google.com/d/topic/sage-devel/WusgmcihVbg/discussion


---

Comment by rws created at 2015-01-16 09:07:00

Replying to [comment:10 ncohen]:
> This being said, perhaps the "most simple and clean" prototype would be to refuse input with more than one variables, and ask the user to input:
> 
> {{{
> sage: numerical_integral((x*y).subs(y=4),0,1)
> (2.0, 2.220446049250313e-14)
> }}}
> 
> This would not be very welcoming for beginners, though `:-/`
Oh I don't think so at all. I like this very much.

Ticket looks good, tests ok. I take the liberty to fill in the fields.


---

Comment by rws created at 2015-01-16 09:07:00

Changing status from needs_review to positive_review.


---

Comment by ncohen created at 2015-01-16 09:14:52

Thanks `:-)`


---

Comment by vbraun created at 2015-01-24 23:51:43

Resolution: fixed
