# Issue 15960: provide function expansions of power series (from Pari)

Issue created by migration from Trac.

Original creator: rws

Original creation time: 2014-04-21 15:00:39

Keywords: function, series expansion

Not the same as `SR.taylor()`.

```
sage: R.<x> = PowerSeriesRing(ZZ)
sage: sqrt(1-4*x^2)
1 - 2*x^2 - 2*x^4 - 4*x^6 - 10*x^8 - 28*x^10 - 84*x^12 - 264*x^14 - 858*x^16 - 2860*x^18 + O(x^20)
sage: sin(1+4*x^2)
...
TypeError: cannot coerce arguments: no canonical coercion from Power Series Ring in x over Integer Ring to Symbolic Ring
sage: var('X')
X
sage: ex=sin(1+4*X^2)
sage: ex.series()
...
TypeError: series() takes exactly 2 positional arguments (0 given)
```

What is missing and can be had from Pari:
* `acos`, `acosh`, `agm`, `asin`, `asinh`, `atan`, `atanh`, `cos`, `cosh`, `cotanh`, `dilog`, `gamma`, `intformal`, `lngamma`, `psi`, `sin`, `sinh`, `tan`, `tanh`
For example:

```
? atan(4*x^2+1)
%1 = 0.78539816339744830961566084581987572105 + 2*x^2 - 4*x^4 + 16/3*x^6 - 128/5*x^10 + 256/3*x^12 - 1024/7*x^14 + O(x^16)
```



---

Comment by kcrisman created at 2014-04-21 15:57:38

Similarly to my other comment on this, I don't know if we want `n(pi/4)` in here or not...

Also, the regular `SR` one works fine:

```
sage: ex.series(X,16)
(sin(1)) + (4*cos(1))*X^2 + (-8*sin(1))*X^4 + (-32/3*cos(1))*X^6 + (32/3*sin(1))*X^8 + (128/15*cos(1))*X^10 + (-256/45*sin(1))*X^12 + (-1024/315*cos(1))*X^14 + Order(X^16)
```

so I'm not sure why you referenced it, though I agree that the error you get for power series rings is not ideal.   Is there a way to either use SR for this (perhaps not "correct" for power series rings though?) or to get Pari to return a symbolic constant term?

```
sage: atan(4*X^2+1)
arctan(4*X^2 + 1)
sage: _.series(X,16)
(1/4*pi) + 2*X^2 + (-4)*X^4 + 16/3*X^6 + (-128/5)*X^10 + 256/3*X^12 + (-1024/7)*X^14 + Order(X^16)
```

What if the coefficients weren't rationals?  Or integers?  Note that in your example there is a 16/3 coefficient, which presumably isn't in the power series ring over integers.  These may be dumb questions, but I'm just trying to explore what is really the desired behavior - certainly wrapping more Pari stuff is not a bad idea!


---

Comment by rws created at 2014-04-21 16:10:14

Pari's symblic is not up to this. I'd consider it a bug that there is no default precision to SR series results (like with `PowerSeries`), so yes, if your last example would work without the `16` this ticket would rather be about my example `sin(1+4*x^2)`---it should simply work like `series()` and give back one instead of SR.

The rest of the ticket concerns possibly missing functions and I will move this to another ticket.


---

Comment by kcrisman created at 2014-04-22 00:21:08

> Pari's symblic is not up to this. I'd consider it a bug that there is no default precision to SR series results (like with `PowerSeries`), so yes, if your last example would work without the `16` this ticket would rather be about my example `sin(1+4*x^2)`---it should simply work like `series()` and give back one instead of SR.
Hmm, that's an interesting suggestion.  One could imagine it's a bug the other way around, but I have no vested interest in this - I think a default for either one could be useful, in principle, and (importantly) wouldn't be backward-incompatible.   But what would the default be?  It's hard to imagine one non-arbitrary... hmm.  What do Mathematica and/or Maple and/or Magma do with this?  If there is a standard one could use that.


---

Comment by rws created at 2014-04-22 06:48:16

I wrote earlier:
> The rest of the ticket concerns possibly missing functions and I will move this to another ticket.
Nothing missing there except the a.g.m., fortunately.

Replying to [comment:3 kcrisman]:
> Hmm, that's an interesting suggestion.  One could imagine it's a bug the other way around, but I have no vested interest in this - I think a default for either one could be useful, in principle, and (importantly) wouldn't be backward-incompatible.   But what would the default be?  It's hard to imagine one non-arbitrary... hmm.
This is now #16201
> What do Mathematica and/or Maple and/or Magma do with this?  If there is a standard one could use that.
If I ask for "cosine power series" in Wolfram Alpha I get `1-x<sup>2/2+x</sup>4/24-x<sup>6/720+O(x</sup>7)`


---

Comment by rws created at 2014-04-22 16:49:28

Edit: my copy of another comment was unrelated so I deleted it


---

Comment by rws created at 2014-07-20 09:01:05

Changing status from new to needs_review.


---

Comment by rws created at 2014-07-20 09:01:05

Closing as wontfix since all issues mentioned have their own tickets.


---

Comment by kcrisman created at 2014-07-21 13:30:48

I only see one ticket mentioned.  Just for completeness, can you mention them (if there are others)?


---

Comment by rws created at 2014-07-21 13:46:16

Default symbolic expression series precision is #16201, and symbolic agm function is #16202.


---

Comment by kcrisman created at 2014-07-21 13:46:48

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2014-07-21 17:43:50

Resolution: duplicate
