# Issue 31895: Wrong gyration orbit length

Issue created by migration from https://trac.sagemath.org/ticket/32132

Original creator: @kliem

Original creation time: 2021-07-05 08:53:50

CC:  â€‹vdelecroix

Keywords: alternative sign matrices, gyration


```
sage -t --long --random-seed=103314966111765381642554237852288942819 src/sage/combinat/alternating_sign_matrix.py
**********************************************************************
File "src/sage/combinat/alternating_sign_matrix.py", line 609, in sage.combinat.alternating_sign_matrix.?.gyration
Failed example:
    a == a0
Expected:
    True
Got:
    False
**********************************************************************
1 item had failures:
   1 of  17 in sage.combinat.alternating_sign_matrix.?.gyration
    [313 tests, 1 failure, 0.83 s]
```


The claim of the doctest is that the orbit length of `gyration` on `AlternatingSignMatrices(5)` is a divisor of 10, which appears to be incorrect:


```
sage: def test_orbit_length(n): 
....:     a0 = a = AlternatingSignMatrices(n).random_element()    
....:     for i in range(10000): 
....:         a = a.gyration() 
....:         if a == a0: 
....:             return i + 1 
....:                                                                                                                                 
sage: lcm(foo(5) for _ in range(1000))                                                                                                
20
```



---

Comment by @kliem created at 2021-07-05 08:59:55

New commits:


---

Comment by @kliem created at 2021-07-05 08:59:55

Changing status from new to needs_review.


---

Comment by chapoton created at 2021-07-05 16:02:43

but see table 3.1 on page 6 of

http://www-users.math.umn.edu/~reiner/REU/CloningerDavidowitz2007.pdf


---

Comment by @kliem created at 2021-07-05 16:06:20

But this is exactly what the table states. The orbit can be of length 2,4,5,10. The lowest common multiple being 20.

Thanks for the pointer. I didn't know where to look for this. So this isn't a bug apparently.


---

Comment by chapoton created at 2021-07-05 16:15:07

the data of this table can be confirmed using

```
sage: def ma(M): 
....:     return matrix(ZZ,5,5, 
....:     M._matrix, immutable=True) 
....:                                                                           
sage: dg=DiGraph([(ma(x),ma(x.gyration())) for x in A])                         
sage: set(dg.connected_components_sizes())                                      
{2, 4, 5, 10}
```



---

Comment by chapoton created at 2021-07-05 16:16:09

ok, good to go


---

Comment by chapoton created at 2021-07-05 16:16:09

Changing status from needs_review to positive_review.


---

Comment by @kliem created at 2021-07-05 16:16:23

Thank you.


---

Comment by vbraun created at 2021-07-24 15:28:24

Resolution: fixed
