# Issue 17491: Infinity norm of real interval vectors

Issue created by migration from https://trac.sagemath.org/ticket/17728

Original creator: f.poloni

Original creation time: 2015-02-04 11:30:00

CC:  jakobkroeker

As documented in http://www.sagemath.org/doc/reference/rings_numerical/sage/rings/real_mpfi.html#sage.rings.real_mpfi.RealIntervalFieldElement.max, `max(I,J)` does not do the correct thing for real intervals, and `I.max(J)` has to be used instead.

When computing the infinity norm of a vector of real intervals, the wrong version of `max` gets used, though:



```
sage: x = RIF(1,2)
sage: y = RIF(0,4)
sage: print "Wrong max: ", max(x,y).endpoints()
Wrong max:  (1.00000000000000, 2.00000000000000)
sage: print "Correct max: ", x.max(y).endpoints()
Correct max:  (1.00000000000000, 4.00000000000000)
sage: 
sage: v = vector([x,y])
sage: print "Computed infinity norm: ", v.norm(Infinity).endpoints()
Computed infinity norm:  (1.00000000000000, 2.00000000000000)
```




---

Comment by f.poloni created at 2015-02-04 11:40:16

Random thought: would it be possible to alter the behaviour of `max(x,y)`, to have it do the right thing or at least return error? It's a Python built-in, so I suspect the answer is "no, or we would have done it long ago".


---

Comment by f.poloni created at 2015-02-04 11:56:46

Changing type from PLEASE CHANGE to defect.


---

Comment by f.poloni created at 2015-02-04 11:56:46

Changing priority from major to trivial.


---

Comment by jakobkroeker created at 2017-03-04 02:53:19

If the behaviour of max cannot be changed, 
can it be forbidden in sage (e.g. by preparsing or whatever)
to use pythons max()?
