# Issue 18358: Big Oh terms and equality

Issue created by migration from Trac.

Original creator: behackl

Original creation time: 2015-06-02 22:48:50

CC:  dkrenn

Keywords: powerseries, asymptotics

The following should **not** happen:


```
sage: PSR.<x> = PowerSeriesRing(ZZ)
sage: x + O(x^2) == x
True
sage: O(x) == 0
True
```


Also, currently it is not easy to check whether a power series contains an O-term (except by comparing representation strings...).


---

Comment by rws created at 2015-06-07 15:57:16

Changing component from symbolics to commutative algebra.


---

Comment by nbruin created at 2015-06-07 22:28:56

It is not clear to me why the behaviour illustrated in the ticket is not desirable. It is certainly consistent with p-adics and with arithmetic:

```
sage: PSR.<x> = PowerSeriesRing(ZZ)
sage: a=x
sage: b=a+O(x^2)
sage: (a-b).is_zero()
True
sage: a==b
True
```

so changing the current behaviour would also require that `O(x^2) != 0`.

Also, checking whether an O-term is present is quite straightforward:

```
sage: (x+O(x^2)).precision_absolute()
2
sage: (x).precision_absolute()
+Infinity
```

I'd think close as Invalid. Please comment if you think otherwise.


---

Comment by behackl created at 2015-06-07 23:12:54

I'll probably have to provide some more context. When I'm thinking of O-notation, I have http://en.wikipedia.org/wiki/Big_O_notation#Equals_sign in mind, that is I think of `O(f(x))` as the class of functions `g(x)` such that `|g(x)| <= C |f(x)|` holds for `x -> oo`. By abuse of notation, `g(x) = O(f(x))` then actually means `g(x) \in O(f(x))` -- and this leads to the problem that I do not agree with


```
sage: (x + (-x + O(x^2))).is_zero()
True
```


because while `0 = O(x^2)` (mathematically) translates to `0 \in O(x^2)`, which is true -- the converse, `O(x^2) = 0`, is not.

Unfortunately, I think this "one-way equality" cannot be modeled by `==` -- or can it? Or would this even be desireable?

However, apart from that, do you think that `is_zero` really shoud evaluate to `True` for `O(x)` and other "approximate" terms? Maybe this is not the best comparion, but consider the real interval field:

```
sage: RIF(0).is_zero()
True
sage: RIF((-0.1, 0.1)).is_zero()
False
```

This is more like the behavior I would expect from `O(x).is_zero()`. What do you think?

(Also: thanks for pointing me towards `precision_absolute()`, this (more or less) solves my original problem!)


---

Comment by nbruin created at 2015-06-08 04:30:01

Replying to [comment:3 behackl]:
> I'll probably have to provide some more context. When I'm thinking of O-notation, I have http://en.wikipedia.org/wiki/Big_O_notation#Equals_sign in mind, that is I think of `O(f(x))` as the class of functions `g(x)` such that `|g(x)| <= C |f(x)|` holds for `x -> oo`. By abuse of notation, `g(x) = O(f(x))` then actually means `g(x) \in O(f(x))` -- and this leads to the problem that I do not agree with

Yes, I don't think that's a very useful way of thinking about the big-oh used for power series approximations, and not the one that comes naturally from their algebra. If anything, the big-oh is with respect to limits for x->0 when applicable, although actual convergence is irrelevant for formal power series arithmetic -- there's no problem taking power series with coefficients over finite fields, for instance. What kind of limit would you be taking?

With that limit interpretation, we see that O(x<sup>2</sup>) would consist of all those power series (ignoring convergence issues) for which lim_{x->0} f(x)/x<sup>2</sup> is finite. That would include 0.

> {{{
> sage: RIF(0).is_zero()
> True
> sage: RIF((-0.1, 0.1)).is_zero()
> False
> }}}
> This is more like the behavior I would expect from `O(x).is_zero()`. What do you think?

That's a very good parallel and it is exactly the behaviour we have. If you want to do it using calculus-type limits, you should consider lim_{x->0}, though.

*EDIT:* I am sorry, I misread the output from RIF. I have to adjust my answer. That's a pretty good parallel and the choice taken in power series is different. You can indeed think of a power series approximation as an "interval". It's quite common that in power series arithmetic (and in p-adic arithmetic) to take two elements "equal" if their representing "intervals" overlap--conveniently, this implies that one of the intervals is contained in the other.

Algebraically, you get a much nicer definition. There `ZZ[This is the Trac macro *x* that was inherited from the migration](https://trac.sagemath.org/wiki/WikiMacros#x-macro) = limproj_{n->oo} Z[x]/(x^n)` and O(x<sup>n</sup>) can then be identified with the kernel of the homomorphism `ZZ[This is the Trac macro *x* that was inherited from the migration](https://trac.sagemath.org/wiki/WikiMacros#x-macro)-> Z[x]/(x^n)`. If you're not already familiar with projective limits you might have to do some reading to get familiar with them and if you're not interested in the underlying algebraic theory you might not find it particularly enlightening to do so.


---

Comment by behackl created at 2015-06-08 06:43:32

Replying to [comment:4 nbruin]:
> Replying to [comment:3 behackl]:
> > I'll probably have to provide some more context. When I'm thinking of O-notation, I have http://en.wikipedia.org/wiki/Big_O_notation#Equals_sign in mind, that is I think of `O(f(x))` as the class of functions `g(x)` such that `|g(x)| <= C |f(x)|` holds for `x -> oo`. By abuse of notation, `g(x) = O(f(x))` then actually means `g(x) \in O(f(x))` -- and this leads to the problem that I do not agree with
> 
> Yes, I don't think that's a very useful way of thinking about the big-oh used for power series approximations, and not the one that comes naturally from their algebra. If anything, the big-oh is with respect to limits for x->0 when applicable, although actual convergence is irrelevant for formal power series arithmetic -- there's no problem taking power series with coefficients over finite fields, for instance. What kind of limit would you be taking?
> 
> With that limit interpretation, we see that O(x<sup>2</sup>) would consist of all those power series (ignoring convergence issues) for which lim_{x->0} f(x)/x<sup>2</sup> is finite. That would include 0.
> 

Well -- mea culpa. I meant to write `x -> 0`; for `x -> oo` everything is exactly the other way around (e.g. `x + O(x^2)` reduces to `O(x^2)`; there the O term can absorb smaller terms).

So, the interpretation I have in mind and the limit interpretation coincide. Sorry.

Of course, the limit definition only works when the point of approximation is an inner point; and that also exactly how these O terms that I think of are defined, for example, here: http://algo.inria.fr/flajolet/Publications/AnaCombi/book.pdf (p. 722).

> > {{{
> > sage: RIF(0).is_zero()
> > True
> > sage: RIF((-0.1, 0.1)).is_zero()
> > False
> > }}}
> > This is more like the behavior I would expect from `O(x).is_zero()`. What do you think?
> 
> That's a very good parallel and it is exactly the behaviour we have. If you want to do it using calculus-type limits, you should consider lim_{x->0}, though.
> 


```
sage: R.<x> = PowerSeriesRing(ZZ)
sage: R(0).is_zero()
True
sage: O(x).is_zero()
True
```


Following the behavior of RIF, I still would expect `O(x).is_zero()` to return False, because I see `0 + O(x)` like `RIF((-0.1, 0.1))`: an "approximate" zero.

> Algebraically, you get a much nicer definition. There `ZZ[This is the Trac macro *x* that was inherited from the migration](https://trac.sagemath.org/wiki/WikiMacros#x-macro) = limproj_{n->oo} Z[x]/(x^n)` and O(x<sup>n</sup>) can then be identified with the kernel of the homomorphism `ZZ[This is the Trac macro *x* that was inherited from the migration](https://trac.sagemath.org/wiki/WikiMacros#x-macro)-> Z[x]/(x^n)`. If you're not already familiar with projective limits you might have to do some reading to get familiar with them and if you're not interested in the underlying algebraic theory you might not find it particularly enlightening to do so.

I have to admit that this definition of formal power series is new for me; but I think I understand. I agree that within `ZZ[x]/(x)`, `O(x).is_zero()` should yield `True`. But in `ZZ[This is the Trac macro *x* that was inherited from the migration](https://trac.sagemath.org/wiki/WikiMacros#x-macro)` too?

And finally: what about the following:

```
sage: O(x) == O(x^2)
True
```

Does this equality make sense to you?


---

Comment by nbruin created at 2015-06-08 07:07:16

Replying to [comment:5 behackl]:
> And finally: what about the following:
> {{{
> sage: O(x) == O(x^2)
> True
> }}}
> Does this equality make sense to you?

Yes: the two "intervals" (neighbourhoods is perhaps a better term) overlap, so they could be representing the same element.

The advantage of this lax form of equality is that if you do computations with sufficient precision to tell all distinct elements you'll encounter apart, then you can use the conventional algorithms to arrive at an answer. That means that you can for instance do linear algebra with power series using normal tools, provided you start with enough precision. This works fairly well in practice and you'll usually discover a catastrophic loss of precision by not having any terms left. Of course, for serious applications you do have to use proper numerical methods anyway, but then you won't be using equality tests anyway.
