# Issue 24941: I should not be allowed as a symbolic variable name

Issue created by migration from Trac.

Original creator: vdelecroix

Original creation time: 2018-04-16 09:03:05

CC:  rws slelievre @spaghettisalat

This behavior is confusing

```
sage: SR('I') ** 2   # complex imaginary
-1
sage: SR.var('I')
I
sage: SR('I') ** 2   # now a variable!
I^2
```



---

Comment by moritz created at 2018-04-16 09:12:53

I am not sure if this is really so bad. It is the same for other constants:


```
sage: SR('e').n()   # Euler's constant
2.71828182845905
sage: SR.var('e')   
e
sage: SR('e').n()   # now a variable
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)

TypeError: cannot evaluate symbolic expression numerically
```

But I can imagine that it would be very useful to use `e` sometimes as a symbolic variable (e.g. when using `a`, `b`, `c` and `d` before..)


---

Comment by jdemeyer created at 2018-04-16 09:46:50

I agree that this is not a bug. `I` is just a variable with a default value of `sqrt(-1)`, but that value can be changed.


---

Comment by vdelecroix created at 2018-04-16 09:50:56

My complaint is about the way `SR(whatever)` is interpreting its argument. When I do `SR.var('my_name')` I clearly want a new variable name. But the behavior of `SR(whatever)` depends on the variables created at a given time. It is easy to imagine

```
def f():
    a,b,c,d,e = SR.var('a,b,c,d,e')
    # now using the symbolic variables

m = f()
e = SR('e')  # this is not anymore exp(1)!!
```



---

Comment by moritz created at 2018-04-16 10:41:10

What do you propose to do? What behavior do you want to have? Should `SR.var('a,b,c,d,e')` raise an error? 

I think a line like `a,b,c,d,e = SR.var('a,b,c,d,e')` or `a,b,c,d,e = var('a,b,c,d,e')' is very natural. In fact:


```
sage: search_src("var\('a, b, c, d, e")
tensor/coordinate_patch.py:230:            sage: a, b, c, d, e = var('a, b, c, d, e')
tests/french_book/nonlinear_doctest.py:64:    sage: a, b, c, d, e, f, x = var('a, b, c, d, e, f, x')
matrix/special.py:3625:        sage: matrix.hankel(SR.var('a, b, c, d, e'))
matrix/special.py:3634:        sage: matrix.hankel(SR.var('a, b, c, d, e'), SR.var('f, g, h, i'))
```



---

Comment by vdelecroix created at 2018-04-16 11:04:30

- option 1: keep `SR.var('e')` (variable creation) and make `SR('e')` always return `exp(1)` for consistency
- option 2: forbid standard variable names (`e`, `pi`, `cos`, etc)


---

Comment by tmonteil created at 2018-04-16 21:52:39

One option could be to have `SR.I()`, `SR.e()`, etc working the same way as the existing `SR.pi()`, and let `SR(string)` return/inject a symbolic variable.


---

Comment by slelievre created at 2018-04-17 08:55:19

I don't see how

```
sage: SR('I') ** 2   # complex imaginary
-1
sage: SR.var('I')
I
sage: SR('I') ** 2   # now a variable!
I^2
```

is any more confusing than

```
sage: exp(1)         # exponential
e
sage: exp = log
sage: exp(1)         # now logarithm!
0
```



---

Comment by vdelecroix created at 2018-04-17 09:28:33

Replying to [comment:9 slelievre]:
> I don't see how
> {{{
> sage: SR('I') ** 2   # complex imaginary
> -1
> sage: SR.var('I')
> I
> sage: SR('I') ** 2   # now a variable!
> I^2
> }}}
> is any more confusing than
> {{{
> sage: exp(1)         # exponential
> e
> sage: exp = log
> sage: exp(1)         # now logarithm!
> 0
> }}}

See [comment:3].


---

Comment by vdelecroix created at 2018-04-17 09:29:37

More precisely

```
def f():
    exp = log
    SR.var('e')
f()
exp(x)  # still exp(x)
SR('e') # e is a variable here
```



---

Comment by slelievre created at 2018-04-17 09:35:55

I get it now. The changed behaviour would be expected after

```
sage: I = SR.var('I')
```

but not after

```
sage: SR.var('I')
```



---

Comment by vdelecroix created at 2018-05-12 15:27:02

Replying to [comment:7 tmonteil]:
> One option could be to have `SR.I()`, `SR.e()`, etc working the same way as the existing `SR.pi()`, and let `SR(string)` return/inject a symbolic variable.

Indeed.


---

Comment by vdelecroix created at 2018-08-03 19:20:18

update milestone 8.3 -> 8.4
