# Issue 34609: differentiation is broken in PowerSeriesRing

Issue created by migration from https://trac.sagemath.org/ticket/34846

Original creator: @maxale

Original creation time: 2022-12-14 02:07:53

The following code


```
K.<z> = PolynomialRing(QQ)
R.<x,y> = PowerSeriesRing(K)
x.exp().derivative(x)
```


gives the error:

> TypeError: Argument 'var' has incorrect type (expected sage.rings.polynomial.multi_polynomial_libsingular.MPolynomial_libsingular, got MPolynomial_polydict)



---

Comment by mantepse created at 2022-12-14 08:15:53

It does work in the `LazyPowerSeriesRing` and the univariate `PowerSeriesRing`, so the issue is specific to the ring at hand. 

```
sage: K.<z> = PolynomialRing(QQ)
sage: R.<x,y> = LazyPowerSeriesRing(K)
sage: x.exp().derivative(x)
1 + x + 1/2*x^2 + 1/6*x^3 + 1/24*x^4 + 1/120*x^5 + O(x,y)^6
```



---

Comment by mantepse created at 2022-12-14 08:41:49

The problem is likely in `multi_power_series_ring_element.py`, line 1567ff:

```
    def derivative(self, *args):
...
        from sage.misc.derivative import derivative_parse
        R = self.parent()
        variables = [ x.polynomial() for x in derivative_parse(args) ]
        deriv = self.polynomial().derivative(variables)
        new_prec = max(self.prec()-len(variables), 0)
        return R(deriv) + R.O(new_prec)
```

`x.polynomial` yields a multivariate polynomial here, instead of a variable.

Note to myself: `.derivative` calls `sage.misc.derivative.multi_derivative`, which processes the variables using `derivative_parse` again.  So, we probably should not be calling `derivative_parse` before, but just coerce each polynomial in args to a generator of the polynomial ring or an integer, or `None`.


---

Comment by mantepse created at 2022-12-14 08:53:55

I don't know how to go from

```
sage: R.<x,y> = PowerSeriesRing(K)
sage: type(x.polynomial())
<class 'sage.rings.polynomial.multi_polynomial_element.MPolynomial_polydict'>
```

to
`sage.rings.polynomial.multi_polynomial_libsingular.MPolynomial_libsingular`


---

Comment by mantepse created at 2022-12-14 09:16:57

I see now that there is something very strange going on:

```
sage: type(exp(x).polynomial())
<class 'sage.rings.polynomial.multi_polynomial_libsingular.MPolynomial_libsingular'>
sage: type(sin(x).polynomial())
<class 'sage.rings.polynomial.multi_polynomial_element.MPolynomial_polydict'>
```

