# Issue 32797: Bug in integral

Issue created by migration from https://trac.sagemath.org/ticket/33034

Original creator: jvarona

Original creation time: 2021-12-16 23:11:10

CC:  slelievre kcrisman

Keywords: bug, integral, maxima

See this example:

f(x)=(x+sin(3*x))*exp(-3*x*I)

g(x)=f(x).expand()

integral(f(x)-g(x),(x,0,2*pi))

The answer is I*pi, but it should be 0 (we are integrating the constant function = 0).

Many other examples (related to Fourier coefficients) give similar errors. For instance:

f(x)=(x+cos(x))*exp(-x*I)

g(x)=f(x).expand()

integral(f(x)-g(x),(x,0,2*pi))

The answer is -pi, and it should be 0.

It is clear that this is a bug "provided" by maxima.


---

Comment by chapoton created at 2022-01-19 09:05:46

This should be reported upstream, please


---

Comment by kcrisman created at 2022-01-19 14:07:56

This must be newish, as I can't reproduce it in my somewhat old Sage.  (Note [here](https://github.com/sagemath/sage/blob/develop/src/sage/interfaces/maxima_lib.py#L172) for the `domain` business.)

```
┌────────────────────────────────────────────────────────────────────┐
│ SageMath version 9.0, Release Date: 2020-01-01                     │
│ Using Python 3.7.3. Type "help()" for help.                        │
└────────────────────────────────────────────────────────────────────┘
sage: f = (x + sin(3*x)) * exp(-3*x*I)
sage: h = f.expand()
sage: f-h
(x + sin(3*x))*e^(-3*I*x) - x*e^(-3*I*x) - e^(-3*I*x)*sin(3*x)
sage: integrate(f-h,x,0,2*pi)
0
sage: (f-h)._maxima_()
%e^-(3*%i*_SAGE_VAR_x)*(sin(3*_SAGE_VAR_x)+_SAGE_VAR_x)-%e^-(3*%i*_SAGE_VAR_x)*sin(3*_SAGE_VAR_x)-_SAGE_VAR_x*%e^-(3*%i*_SAGE_VAR_x)
sage: maxima_console()
;;; Loading #P"/Applications/SageMath-9.0.app/Contents/Resources/sage/local/lib/ecl/sb-bsd-sockets.fas"
;;; Loading #P"/Applications/SageMath-9.0.app/Contents/Resources/sage/local/lib/ecl/sockets.fas"
;;; Loading #P"/Applications/SageMath-9.0.app/Contents/Resources/sage/local/lib/ecl/defsystem.fas"
;;; Loading #P"/Applications/SageMath-9.0.app/Contents/Resources/sage/local/lib/ecl/cmp.fas"
Maxima 5.42.2 http://maxima.sourceforge.net
using Lisp ECL 16.1.2
Distributed under the GNU Public License. See the file COPYING.
Dedicated to the memory of William Schelter.
The function bug_report() provides bug reporting information.
(%i1) domain;
(%o1)                                real
(%i2) domain:complex;
(%o2)                               complex
(%i3) f:%e^-(3*%i*x)*(sin(3*x)+x)-%e^-(3*%i*x)*sin(3*x)-x*%e^-(3*%i*x);
          - 3 %i x                    - 3 %i x                - 3 %i x
(%o3)   %e         (sin(3 x) + x) - %e         sin(3 x) - x %e
(%i5) integrate(f,x,0,2*%pi);
(%o5)                                  0
```

However, in my somewhat more recent Sage 9.4 beta:

```
Maxima 5.44.0 http://maxima.sourceforge.net
using Lisp ECL 21.2.1
Distributed under the GNU Public License. See the file COPYING.
Dedicated to the memory of William Schelter.
The function bug_report() provides bug reporting information.
(%i1) domain:complex;
(%o1)                               complex
(%i2) f:%e^-(3*%i*x)*(sin(3*x)+x)-%e^-(3*%i*x)*sin(3*x)-x*%e^-(3*%i*x);
          - 3 %i x                    - 3 %i x                - 3 %i x
(%o2)   %e         (sin(3 x) + x) - %e         sin(3 x) - x %e
(%i3) integrate(f,x,0,2*%pi);
(%o3)                               %i %pi
```

This will help them track it down, I hope.  Note that there is clearly a branch cut issue, or worse:

```
(%i3) integrate(f,x,0,2);        
(%o3)                                  0
(%i4) integrate(f,x,0,1);
(%o4)                                  0
(%i5) integrate(f,x,0,2*%pi);
(%o5)                               %i %pi
(%i6) integrate(f,x,0,-%pi);
                                     %i %pi
(%o6)                              - ------
                                       3
(%i7) integrate(f,x,0,3*%pi);
                                   4 %i %pi
(%o7)                              --------
                                      3
(%i8) integrate(f,x,-%pi,%pi);
(%o8)                                  0
(%i9) integrate(f,x,-%pi,2*%pi);
                                   4 %i %pi
(%o9)                              --------
(%i10) integrate(f,x,-1,1);
(%o10)                                 0
```



---

Comment by kcrisman created at 2022-01-19 14:07:56

Changing status from new to needs_info.


---

Comment by kcrisman created at 2022-01-21 02:20:11

Looks like it can be narrowed down fairly well between a few Maxima releases.


---

Comment by kcrisman created at 2022-01-24 14:37:13

Quick work by Robert D :-)
