# Issue 14608: p-adic root finding broken (mathematically incorrect answer)

archive/issues_014608.json:
```json
{
    "body": "Assignee: @roed314\n\nKeywords: padics, roots\n\nThis is a huge problem:\n\n\n```\nsage: x = polygen(QQ)\nsage: f = x^5 + x^4 - 4*x^2 - x + 3\nsage: \nsage: f.roots()\n[(-1, 1), (1, 2)]\nsage: f.roots(Qp(3))\n[(2 + 2*3 + 2*3^2 + 2*3^3 + 2*3^4 + 2*3^5 + 2*3^6 + 2*3^7 + 2*3^8 + 2*3^9 + 2*3^10 + 2*3^11 + 2*3^12 + 2*3^13 + 2*3^14 + 2*3^15 + 2*3^16 + 2*3^17 + 2*3^18 + 2*3^19 + O(3^20), 1), (1 + 3 + 2*3^3 + 2*3^4 + 2*3^6 + 3^7 + 2*3^8 + 2*3^9 + 2*3^10 + 3^12 + 2*3^14 + 3^15 + 2*3^16 + 3^17 + 3^19 + O(3^20), 1), (3 + 2*3^2 + 2*3^5 + 3^7 + 2*3^11 + 3^12 + 2*3^13 + 3^15 + 3^17 + 3^18 + O(3^20), 1)]\nsage: f.base_extend(Qp(3)).factor()\n((1 + O(3^20))*x + (1 + O(3^20))) * ((1 + O(3^20))*x + (2 + 3 + 2*3^2 + 2*3^5 + 3^7 + 2*3^11 + 3^12 + 2*3^13 + 3^15 + 3^17 + 2*3^18 + 3^19 + O(3^20))) * ((1 + O(3^20))*x + (2*3 + 2*3^3 + 2*3^4 + 2*3^6 + 3^7 + 2*3^8 + 2*3^9 + 2*3^10 + 3^12 + 2*3^14 + 3^15 + 2*3^16 + 3^17 + 3^18 + 2*3^19 + O(3^20))) * ((1 + O(3^20))*x^2 + (1 + 2*3 + 2*3^2 + 2*3^3 + 2*3^4 + 2*3^5 + 2*3^6 + 2*3^7 + 2*3^8 + 2*3^9 + 2*3^10 + 2*3^11 + 2*3^12 + 2*3^13 + 2*3^14 + 2*3^15 + 2*3^16 + 2*3^17 + 3^18 + 3^19 + O(3^20))*x + (1 + 3^18 + O(3^20)))\n```\n\n\nThe p-adic roots are quit wrong! It's such a crazy answer, I keep feeling like I'm the problem, but I tried this on two copies of sage 5.9 on my computer as well as on sage 5.10 on the cloud. Note for instance that the polynomial x<sup>2</sup> + 2x + 3 has discriminant -8, which is a square mod 3 and so there should be five roots in Qp(3) (and of course 1 should be a root with multiplicity 2).\n\nIssue created by migration from https://trac.sagemath.org/ticket/14812\n\n",
    "created_at": "2013-06-25T01:07:04Z",
    "labels": [
        "component: padics",
        "blocker",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-duplicate/invalid/wontfix",
    "title": "p-adic root finding broken (mathematically incorrect answer)",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/14608",
    "user": "https://github.com/rharron"
}
```
Assignee: @roed314

Keywords: padics, roots

This is a huge problem:


```
sage: x = polygen(QQ)
sage: f = x^5 + x^4 - 4*x^2 - x + 3
sage: 
sage: f.roots()
[(-1, 1), (1, 2)]
sage: f.roots(Qp(3))
[(2 + 2*3 + 2*3^2 + 2*3^3 + 2*3^4 + 2*3^5 + 2*3^6 + 2*3^7 + 2*3^8 + 2*3^9 + 2*3^10 + 2*3^11 + 2*3^12 + 2*3^13 + 2*3^14 + 2*3^15 + 2*3^16 + 2*3^17 + 2*3^18 + 2*3^19 + O(3^20), 1), (1 + 3 + 2*3^3 + 2*3^4 + 2*3^6 + 3^7 + 2*3^8 + 2*3^9 + 2*3^10 + 3^12 + 2*3^14 + 3^15 + 2*3^16 + 3^17 + 3^19 + O(3^20), 1), (3 + 2*3^2 + 2*3^5 + 3^7 + 2*3^11 + 3^12 + 2*3^13 + 3^15 + 3^17 + 3^18 + O(3^20), 1)]
sage: f.base_extend(Qp(3)).factor()
((1 + O(3^20))*x + (1 + O(3^20))) * ((1 + O(3^20))*x + (2 + 3 + 2*3^2 + 2*3^5 + 3^7 + 2*3^11 + 3^12 + 2*3^13 + 3^15 + 3^17 + 2*3^18 + 3^19 + O(3^20))) * ((1 + O(3^20))*x + (2*3 + 2*3^3 + 2*3^4 + 2*3^6 + 3^7 + 2*3^8 + 2*3^9 + 2*3^10 + 3^12 + 2*3^14 + 3^15 + 2*3^16 + 3^17 + 3^18 + 2*3^19 + O(3^20))) * ((1 + O(3^20))*x^2 + (1 + 2*3 + 2*3^2 + 2*3^3 + 2*3^4 + 2*3^5 + 2*3^6 + 2*3^7 + 2*3^8 + 2*3^9 + 2*3^10 + 2*3^11 + 2*3^12 + 2*3^13 + 2*3^14 + 2*3^15 + 2*3^16 + 2*3^17 + 3^18 + 3^19 + O(3^20))*x + (1 + 3^18 + O(3^20)))
```


The p-adic roots are quit wrong! It's such a crazy answer, I keep feeling like I'm the problem, but I tried this on two copies of sage 5.9 on my computer as well as on sage 5.10 on the cloud. Note for instance that the polynomial x<sup>2</sup> + 2x + 3 has discriminant -8, which is a square mod 3 and so there should be five roots in Qp(3) (and of course 1 should be a root with multiplicity 2).

Issue created by migration from https://trac.sagemath.org/ticket/14812





---

archive/issue_comments_185546.json:
```json
{
    "body": "Yikes.  This is a precision problem:\n\n```\nsage: x = polygen(ZZ)\nsage: f = x^5 + x^4 - 4*x^2 - x + 3\nsage: R = Qp(3,print_mode='digits')\nsage: fQp = f.base_extend(R)\nsage: h = [a[0] for a in fQp.factor()]\nsage: h\n[(...1)*x + (...1),\n (...1)*x + (...12101021200010200212),\n (...1)*x + (...21121201022212022020),\n (...1)*x^2 + (...11222222222222222221)*x + (...1000000000000000001)]\nsage: h[1]*h[2]\n(...1)*x^2 + (...11000000000000000002)*x + (...20000000000000000010)\nsage: h[3].discriminant().valuation()\n19\nsage: prod(h) == fQp\nTrue\n```\n\n\nIf you cut off the precision at some point then there are multiple valid factorizations, and this one has the unfortunate feature that it doesn't find all the roots.  `h[3]` is very close to `(x-1)^2`, but its discriminant is 3<sup>19</sup>, which is not a square.\n\nNote the sensitivity to the precision of the input:\n\n```\nsage: R19 = Qp(3,19,print_mode='digits',print_pos=False)\nsage: fQp19 = f.base_extend(R19)\nsage: [a[0] for a in fQp19.factor()]\n[(...1)*x + (...1),\n (...1)*x + (...121202120222222222),\n (...1)*x + (...1001020101222222222),\n (...1)*x + (...2201021200010200212),\n (...1)*x + (...1121201022212022020)]\n```\n\nThe precision on the two roots near `-1` is a bit disturbing.  I'm curious how things go with #12561 applied, but don't have time to check at the moment.",
    "created_at": "2013-06-25T05:43:24Z",
    "issue": "https://github.com/sagemath/sagetest/issues/14608",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/14608#issuecomment-185546",
    "user": "https://github.com/roed314"
}
```

Yikes.  This is a precision problem:

```
sage: x = polygen(ZZ)
sage: f = x^5 + x^4 - 4*x^2 - x + 3
sage: R = Qp(3,print_mode='digits')
sage: fQp = f.base_extend(R)
sage: h = [a[0] for a in fQp.factor()]
sage: h
[(...1)*x + (...1),
 (...1)*x + (...12101021200010200212),
 (...1)*x + (...21121201022212022020),
 (...1)*x^2 + (...11222222222222222221)*x + (...1000000000000000001)]
sage: h[1]*h[2]
(...1)*x^2 + (...11000000000000000002)*x + (...20000000000000000010)
sage: h[3].discriminant().valuation()
19
sage: prod(h) == fQp
True
```


If you cut off the precision at some point then there are multiple valid factorizations, and this one has the unfortunate feature that it doesn't find all the roots.  `h[3]` is very close to `(x-1)^2`, but its discriminant is 3<sup>19</sup>, which is not a square.

Note the sensitivity to the precision of the input:

```
sage: R19 = Qp(3,19,print_mode='digits',print_pos=False)
sage: fQp19 = f.base_extend(R19)
sage: [a[0] for a in fQp19.factor()]
[(...1)*x + (...1),
 (...1)*x + (...121202120222222222),
 (...1)*x + (...1001020101222222222),
 (...1)*x + (...2201021200010200212),
 (...1)*x + (...1121201022212022020)]
```

The precision on the two roots near `-1` is a bit disturbing.  I'm curious how things go with #12561 applied, but don't have time to check at the moment.



---

archive/issue_comments_185547.json:
```json
{
    "body": "Changing priority from blocker to critical.",
    "created_at": "2013-07-21T21:56:50Z",
    "issue": "https://github.com/sagemath/sagetest/issues/14608",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/14608#issuecomment-185547",
    "user": "https://github.com/jdemeyer"
}
```

Changing priority from blocker to critical.



---

archive/issue_comments_185548.json:
```json
{
    "body": "Duplicate of #15422 which needs review.",
    "created_at": "2013-11-22T14:11:38Z",
    "issue": "https://github.com/sagemath/sagetest/issues/14608",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/14608#issuecomment-185548",
    "user": "https://github.com/jdemeyer"
}
```

Duplicate of #15422 which needs review.



---

archive/issue_comments_185549.json:
```json
{
    "body": "Resolution: duplicate",
    "created_at": "2013-11-22T14:11:38Z",
    "issue": "https://github.com/sagemath/sagetest/issues/14608",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/14608#issuecomment-185549",
    "user": "https://github.com/jdemeyer"
}
```

Resolution: duplicate



---

archive/issue_events_042527.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2013-11-22T14:11:38Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/14608",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/14608#event-42527"
}
```



---

archive/issue_events_042528.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2013-11-22T14:11:38Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/14608",
    "milestone": "sage-duplicate/invalid/wontfix",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/14608#event-42528"
}
```
