# Issue 29884: py3: Adapt Sage's range-like functions

Issue created by migration from https://trac.sagemath.org/ticket/30121

Original creator: slelievre

Original creation time: 2020-07-12 16:11:17

CC:  slelievre tscrim chapoton

Keywords: range

Python 2 had `range` (returning lists) and `xrange` (returning iterators).

Python 3 only has `range` which behaves like the old `xrange`.

This ticket is to rename or change our range-like functions accordingly.

Functions in the global name space:
- `ellipsis_range`
- `fibonacci_xrange`
- `mrange`
- `mrange_iter`
- `prime_range`
- `randrange`
- `range`
- `srange`
- `sxrange`
- `xmrange`
- `xmrange_iter`
- `xsrange`

See also:

- #18298: `prime_range` vs `primes`
- #29728: Meta-ticket: improve compatibility with the Python library


---

Comment by slelievre created at 2020-07-12 16:13:18

Initial list from a look at:


```sage
sage: [x for x in dir() if 'range' in x]
```



---

Comment by mkoeppe created at 2021-02-13 20:51:01

Setting new milestone based on a cursory review of ticket status, priority, and last modification date.


---

Comment by git created at 2021-08-18 13:12:24

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by chapoton created at 2021-08-18 16:44:47

Making srange an iterator almost break every single file. Any volunteer to handle the fixes ?


---

Comment by git created at 2021-08-18 16:47:56

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by git created at 2021-08-18 18:22:55

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by git created at 2021-08-19 07:01:16

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by chapoton created at 2021-08-19 07:03:30

We meet the following issue:

```
sage: A = srange(1,4)                                                            
sage: list(A)                                                                   
[1, 2, 3]
sage: list(A)                                                                   
[]
sage: B = range(1,4)                                                              
sage: list(B)                                                                   
[1, 2, 3]
sage: list(B)                                                                   
[1, 2, 3]
```



---

Comment by slelievre created at 2021-08-19 10:01:53

According to the [Python 3 documentation for range](https://docs.python.org/3/library/functions.html#func-range):

> Rather than being a
> function, [range](https://docs.python.org/3/library/stdtypes.html#range)
> is actually an immutable sequence type, as documented
> in [Ranges](https://docs.python.org/3/library/stdtypes.html#typesseq-range)
> and [Sequence Types â€” list, tuple, range](https://docs.python.org/3/library/stdtypes.html#typesseq).

Could we make `srange` an immutable sequence type too?


---

Comment by git created at 2021-08-19 13:03:27

Branch pushed to git repo; I updated commit sha1. This was a forced push. New commits:


---

Comment by git created at 2021-08-21 09:04:17

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by git created at 2021-08-21 12:04:15

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by git created at 2021-08-21 12:06:13

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by mkoeppe created at 2021-08-22 00:28:10

I agree with comment:14 - this is problematic. `srange` should really construct an object similar to range objects in python3


---

Comment by git created at 2021-08-22 07:53:58

Branch pushed to git repo; I updated commit sha1. This was a forced push. New commits:


---

Comment by git created at 2021-08-22 14:22:13

Branch pushed to git repo; I updated commit sha1. This was a forced push. New commits:


---

Comment by mkoeppe created at 2022-08-10 19:14:42

Can we just get rid of all `*mrange*` and replace its uses by `itertools.product`?
(I've opened #34337 for this.)


---

Comment by tscrim created at 2022-08-11 00:10:31

Replying to [comment:26 mkoeppe]:
> Can we just get rid of all `*mrange*` and replace its uses by `itertools.product`?
> (I've opened #34337 for this.)

I posted something on #34337 about somet hings to be careful about with doing the replacement.
