# Issue 18851: multi-line doctests fail when using angle notation (preparser)

Issue created by migration from Trac.

Original creator: dkrenn

Original creation time: 2015-08-25 18:24:09

CC:  @jcamp0x2a @kliem

The following fails

```
        sage: A.<n> = AsymptoticRing(growth_group='QQ^x * x^QQ * log(n)^QQ',
        ....:                         coefficient_ring=QQ); A
```

(used with the code of #17601, but is nothing specific about this code).

One gets:

```
    A.<n> = AsymptoticRing(growth_group='QQ^x * x^QQ * log(n)^QQ',
                           coefficient_ring=QQ); A
Exception raised:
    Traceback (most recent call last):
    ...
        A = AsymptoticRing(growth_group='QQ^x * x^QQ * log(n)^QQ',; (n,) = A._first_ngens(1)
                                                                  ^
    SyntaxError: invalid syntax
```




---

Comment by nbruin created at 2015-08-25 19:05:12

Perhaps a simpler example: compare

```
sage: preparse("""A.<a,b,c>=PolynomialRing(QQ)""")
"A = PolynomialRing(QQ, names=('a', 'b', 'c',)); (a, b, c,) = A._first_ngens(3)"
sage: preparse("""A.<a,b,c>=PolynomialRing(QQ\n)""")
'A = PolynomialRing(QQ; (a, b, c,) = A._first_ngens(3)\n)'
sage: preparse("A.<x>=QQ[]")
"A = QQ['x']; (x,) = A._first_ngens(1)"
sage: preparse("A.<x>=QQ[\n]")
'A = QQ[; (x,) = A._first_ngens(1)\n]'
```

As you can see, the newline completely throws off the substitution:
 - no "names" attribute is inserted
 - the binding of generators to given identifiers is inserted in the wrong spot (at the end of the first line instead of at the end of the command)

This is a tricky one: Usually in python, a newline terminates a command, so the place of insertion would usually be safe. However, if there is an unbalanced bracket, then the newline is just a whitespace. This is a condition that cannot be detected with a regex in general.


---

Comment by jdemeyer created at 2016-08-12 09:13:42

Changing component from doctest framework to misc.


---

Comment by slelievre created at 2021-03-22 21:09:59

Changing keywords from "" to "preparser, multiline".


---

Comment by slelievre created at 2021-03-22 21:09:59

This similar Sage extension of the Python syntax
to define symbolic functions also fails:

```
sage: T(r, t) = [r^2,
....:            t^2]
  File "<ipython-input-12-9f172b245c59>", line 1
    __tmp__=var("r,t"); T = symbolic_expression([r**Integer(2),).function(r,t)
                                                               ^
SyntaxError: closing parenthesis ')' does not match opening parenthesis '['
```



---

Comment by slelievre created at 2021-03-26 23:31:01

See also

- #30953: Implicit line continuation in callable symbolic expression
- #17404: Long time doctests in multiline code not detected
- #11621: Preparser could accommodate multiline input and continuation lines
