# Issue 19019: inconsistent numerics with RR/CC/CDF(pi,sqrt(2))

Issue created by migration from Trac.

Original creator: rws

Original creation time: 2015-09-20 15:06:11


```
sage: (CC(pi)-pi).n()
-3.10862446895044e-15
sage: (RR(pi)-pi).n()
0.000000000000000
sage: (CC(1/7)-1/7).n()
0.000000000000000
sage: (RR(1/7)-1/7).n()
0.000000000000000
sage: (CC(sqrt(2))-sqrt(2)).n()
-5.10702591327572e-15
sage: (RR(sqrt(2))-sqrt(2)).n()
0.000000000000000
```

Changing the precision of the expression makes a difference:

```
sage: (RR(pi.n(200))-pi.n(200)).n()
0.000000000000000
sage: (CC(pi.n(200))-pi.n(200)).n()
0.000000000000000
sage: (RR((sqrt(2)).n(200))-(sqrt(2)).n(200)).n()
0.000000000000000
sage: (CC((sqrt(2)).n(200))-(sqrt(2)).n(200)).n()
0.000000000000000
```



---

Comment by rws created at 2015-09-21 06:20:07

I'm not complaining about the problems with limited precision. I just think they should be consistent between `RR` and `CC`.


---

Comment by rws created at 2015-09-21 07:42:59

OK, both `RR(sqrt(2))` and `CC(sqrt(2))` lead to Pynac calling `PyNumber_Power(2.00000000000000,1/2)` but the first returns `1.41...10` and the second `1.41...09`.

EDIT:

```
sage: RR(2)^(1/2)
1.41421356237310
sage: CC(2)^(1/2)
1.41421356237309
}}} 

So the reason is because `CC.__pow__` uses the generic `exp(log(a)*b)` instead of `mpfr_pow` as in `RR.__pow__`.


---

Comment by rws created at 2015-09-21 13:23:09

Let's see what the patchbot says.
----
New commits:


---

Comment by rws created at 2015-09-21 13:23:09

Changing status from new to needs_review.


---

Comment by rws created at 2015-09-21 13:37:51

Changing status from needs_review to positive_review.


---

Comment by rws created at 2015-09-21 13:37:51

No, this is ridiculous. Can't be fixed.


---

Comment by vbraun created at 2015-09-25 08:27:28

Resolution: wontfix
