# Issue 15282: Wrong enclosing intervals for real algebraic numbers

archive/issues_015282.json:
```json
{
    "body": "Consider a polynomial with two close roots:\n\n```\nsage: x = polygen(QQ); pol = x^7-2*(10^20*x-1)^2\nsage: pol.roots(RIF)\n[(9.999999999999999999999999999999999999999999999999999999999999999999999?e-21,\n  1),\n (1.000000000000000000000000000000000000000000000000000000000000000000001?e-20,\n  1),\n (1.14869835499703500680?e8, 1)]\n```\n\nand represent one of these roots as an element of `AA`:\n\n```\nsage: a = AA.polynomial_root(pol, RIF((0.9e-20,1.0e-20)))\n```\n\nThen the upper bound stored internally is smaller than the actual root:\n\n```\nsage: a._descr._interval.upper()\n9.99999999999999946e-21\n```\n\nand indeed we have:\n\n```\nsage: pol(a._descr._interval.lower().exact_rational()).sign()\n-1\nsage: pol(a._descr._interval.lower().exact_rational()).sign()\n-1\nsage: sage: a.n(50)\n...\nValueError: Refining interval that does not bound unique root!\n```\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/15519\n\n",
    "created_at": "2013-12-15T10:31:49Z",
    "labels": [
        "number fields",
        "major",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-duplicate/invalid/wontfix",
    "title": "Wrong enclosing intervals for real algebraic numbers",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/15282",
    "user": "mmezzarobba"
}
```
Consider a polynomial with two close roots:

```
sage: x = polygen(QQ); pol = x^7-2*(10^20*x-1)^2
sage: pol.roots(RIF)
[(9.999999999999999999999999999999999999999999999999999999999999999999999?e-21,
  1),
 (1.000000000000000000000000000000000000000000000000000000000000000000001?e-20,
  1),
 (1.14869835499703500680?e8, 1)]
```

and represent one of these roots as an element of `AA`:

```
sage: a = AA.polynomial_root(pol, RIF((0.9e-20,1.0e-20)))
```

Then the upper bound stored internally is smaller than the actual root:

```
sage: a._descr._interval.upper()
9.99999999999999946e-21
```

and indeed we have:

```
sage: pol(a._descr._interval.lower().exact_rational()).sign()
-1
sage: pol(a._descr._interval.lower().exact_rational()).sign()
-1
sage: sage: a.n(50)
...
ValueError: Refining interval that does not bound unique root!
```


Issue created by migration from https://trac.sagemath.org/ticket/15519





---

archive/issue_comments_196582.json:
```json
{
    "body": "Stupid me forgot that the upper bound of `RealIntervalField(p)((.9e-20,1.e-20))` is actually the `double` closest to `1.0`, i.e. `9.999999999999999451532714542...e-21`. Sorry for the noise.",
    "created_at": "2013-12-18T07:28:06Z",
    "issue": "https://github.com/sagemath/sagetest/issues/15282",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/15282#issuecomment-196582",
    "user": "mmezzarobba"
}
```

Stupid me forgot that the upper bound of `RealIntervalField(p)((.9e-20,1.e-20))` is actually the `double` closest to `1.0`, i.e. `9.999999999999999451532714542...e-21`. Sorry for the noise.



---

archive/issue_comments_196583.json:
```json
{
    "body": "Changing status from new to needs_review.",
    "created_at": "2013-12-21T07:00:19Z",
    "issue": "https://github.com/sagemath/sagetest/issues/15282",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/15282#issuecomment-196583",
    "user": "tscrim"
}
```

Changing status from new to needs_review.



---

archive/issue_comments_196584.json:
```json
{
    "body": "Changing status from needs_review to positive_review.",
    "created_at": "2013-12-21T07:00:44Z",
    "issue": "https://github.com/sagemath/sagetest/issues/15282",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/15282#issuecomment-196584",
    "user": "tscrim"
}
```

Changing status from needs_review to positive_review.



---

archive/issue_comments_196585.json:
```json
{
    "body": "Resolution: invalid",
    "created_at": "2013-12-21T19:00:56Z",
    "issue": "https://github.com/sagemath/sagetest/issues/15282",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/15282#issuecomment-196585",
    "user": "vbraun"
}
```

Resolution: invalid
