# Issue 10006: Possibility of Inherit from FreeModule

Issue created by migration from https://trac.sagemath.org/ticket/10007

Original creator: nborie

Original creation time: 2010-09-24 20:27:25

Assignee: AlexGhitza

CC:  sage-combinat

When building a new class (strong algebraic structure of parent) which have a structure of module, one "can" only use CombinatorialFreeModule. It will be very very good to do that with FreeModule (speed, use all functionalities of FreeModule)

See that :

```
sage: class Bla_parent(sage.modules.free_module.FreeModule_generic):
....:         class Element(sage.modules.free_module_element.FreeModuleElement_generic_dense):
....:             pass
....: 
sage: F = Bla_parent(QQ,6,6)
sage: F
<class '__main__.Bla_parent_with_category'>
sage: p = F.Element(F,(1,2,3,4,5,6))
sage: p
(1, 2, 3, 4, 5, 6)
sage: p.__class__
<class '__main__.Element'>
sage: (p+p).__class__
<type 'sage.modules.free_module_element.FreeModuleElement_generic_dense'>
```



---

Comment by sbrandhorst created at 2017-10-06 07:08:03

Changing status from new to needs_review.


---

Comment by sbrandhorst created at 2017-10-06 07:08:03

This is long fixed. Probably due to the new coercion system.
I derived a subclass of FreeModule. See #23634. Please close.


---

Comment by tscrim created at 2017-10-09 04:38:14

Changing status from needs_review to positive_review.


---

Comment by tscrim created at 2017-10-09 04:38:14

No, this not a coercion problem, but related to the `_new_c` function and fixed by #17583.


---

Comment by embray created at 2017-12-12 08:23:33

Resolution: wontfix
