# Issue 16185: cancellation of two indefinite limits

Issue created by migration from Trac.

Original creator: dkrenn

Original creation time: 2014-06-01 10:58:50

CC:  jakobkroeker

Keywords: symbolic, cancellation, limit, indefinite

We get

```
sage: limit(cos(x),x=oo) - limit(sin(x),x=oo)
0
```


This comes from the fact that the return value of each limit is a symbolic variable:

```
sage: limit(sin(x), x=oo)
ind
sage: type(limit(sin(x), x=oo))
<type 'sage.symbolic.expression.Expression'>
sage: limit(sin(x), x=oo).variables()
(ind,)
```



---

Comment by nbruin created at 2014-06-01 19:53:59

This is an upstream problem (in maxima). It seems "ind" isn't a special symbol there either:

```
Maxima 5.29.1 http://maxima.sourceforge.net
using Lisp ECL 12.12.1
(%i3) limit(sin(x),x,inf)-limit(cos(x),x,inf);
(%o3)                                  0
```

We could intercept ind whenever it comes by (from limit) and raise an exception to limit the damage, but I imagine the bad simplifications could already happen internal to maxima.

This seems to happen with infinity as well, by the way:

```
(%i14) limit(1/x^2,x,0)-limit(1/x^4,x,0);
(%o14)                                 0
```


Sage catches those (when they happen in a way sage can see it happen), so perhaps we should recognize `ind` and a special value--leading to an exception if we can't do anything with it.


---

Comment by dkrenn created at 2015-04-16 20:09:52

Still there in 6.6.
