# Issue 15334: Incorrect zero test of complex symbolic expressions

archive/issues_015334.json:
```json
{
    "body": "Yet another example where symbolic expressions are abusively considered equivalent, even though `simplify()` has become a bit more careful.\n\n\n```\nsage: var('a,x')\n(a, x)\nsage: assume(a, 'complex')\nsage: assume(x, 'complex')\nsage: expr = a^(4*x) - (a^4)^x\nsage: expr.is_zero()\nTrue\nsage: expr(a=I, x=1/2)\n-2\n```\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/15571\n\n",
    "created_at": "2013-12-23T11:16:04Z",
    "labels": [
        "symbolics",
        "major",
        "bug"
    ],
    "title": "Incorrect zero test of complex symbolic expressions",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/15334",
    "user": "mmezzarobba"
}
```
Yet another example where symbolic expressions are abusively considered equivalent, even though `simplify()` has become a bit more careful.


```
sage: var('a,x')
(a, x)
sage: assume(a, 'complex')
sage: assume(x, 'complex')
sage: expr = a^(4*x) - (a^4)^x
sage: expr.is_zero()
True
sage: expr(a=I, x=1/2)
-2
```


Issue created by migration from https://trac.sagemath.org/ticket/15571





---

archive/issue_comments_197421.json:
```json
{
    "body": "Changing status from new to needs_review.",
    "created_at": "2015-01-31T16:46:08Z",
    "issue": "https://github.com/sagemath/sagetest/issues/15334",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/15334#issuecomment-197421",
    "user": "rws"
}
```

Changing status from new to needs_review.



---

archive/issue_comments_197422.json:
```json
{
    "body": "Appears to having been fixed and also already included in Sage.",
    "created_at": "2015-01-31T16:46:08Z",
    "issue": "https://github.com/sagemath/sagetest/issues/15334",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/15334#issuecomment-197422",
    "user": "rws"
}
```

Appears to having been fixed and also already included in Sage.



---

archive/issue_comments_197423.json:
```json
{
    "body": "Changing status from needs_review to needs_work.",
    "created_at": "2015-01-31T17:42:48Z",
    "issue": "https://github.com/sagemath/sagetest/issues/15334",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/15334#issuecomment-197423",
    "user": "rws"
}
```

Changing status from needs_review to needs_work.



---

archive/issue_comments_197424.json:
```json
{
    "body": "Changing status from needs_work to needs_review.",
    "created_at": "2015-02-02T09:32:39Z",
    "issue": "https://github.com/sagemath/sagetest/issues/15334",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/15334#issuecomment-197424",
    "user": "rws"
}
```

Changing status from needs_work to needs_review.



---

archive/issue_comments_197425.json:
```json
{
    "body": "New commits:",
    "created_at": "2015-02-02T09:32:39Z",
    "issue": "https://github.com/sagemath/sagetest/issues/15334",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/15334#issuecomment-197425",
    "user": "rws"
}
```

New commits:



---

archive/issue_comments_197426.json:
```json
{
    "body": "Changing status from needs_review to positive_review.",
    "created_at": "2015-02-03T03:05:21Z",
    "issue": "https://github.com/sagemath/sagetest/issues/15334",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/15334#issuecomment-197426",
    "user": "kcrisman"
}
```

Changing status from needs_review to positive_review.



---

archive/issue_comments_197427.json:
```json
{
    "body": "Indeed, one doesn't have to do any assumption at all to get the 'false' now.\n\n```\nsage: sage: var('a,x')\n(a, x)\nsage: (a, x)\n(a, x)\nsage: sage: expr = a^(4*x) - (a^4)^x\nsage: sage: expr.is_zero()\nFalse\n```\n\n\nIf you want to remove the second\n\n```\n+            sage: assume(a, 'complex')\n+            sage: assume(x, 'complex')\n```\n\nand then the `forget()` which I think is all superfluous, that would be great, but it's fine this way too.",
    "created_at": "2015-02-03T03:05:21Z",
    "issue": "https://github.com/sagemath/sagetest/issues/15334",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/15334#issuecomment-197427",
    "user": "kcrisman"
}
```

Indeed, one doesn't have to do any assumption at all to get the 'false' now.

```
sage: sage: var('a,x')
(a, x)
sage: (a, x)
(a, x)
sage: sage: expr = a^(4*x) - (a^4)^x
sage: sage: expr.is_zero()
False
```


If you want to remove the second

```
+            sage: assume(a, 'complex')
+            sage: assume(x, 'complex')
```

and then the `forget()` which I think is all superfluous, that would be great, but it's fine this way too.



---

archive/issue_comments_197428.json:
```json
{
    "body": "Resolution: fixed",
    "created_at": "2015-02-17T20:50:35Z",
    "issue": "https://github.com/sagemath/sagetest/issues/15334",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/15334#issuecomment-197428",
    "user": "vbraun"
}
```

Resolution: fixed
