# Issue 31307: ``primes`` treats start as stop when only start is given

Issue created by migration from https://trac.sagemath.org/ticket/31544

Original creator: saliola

Original creation time: 2021-03-23 13:16:18

Keywords: primes

`primes(start, stop=None)` is supposed to return an iterator over all primes between `start` and `stop-1`, but it confuses the two arguments when only one is given.


```
sage: list(primes(start=5, stop=10))    # this is OK
[5, 7]

sage: next(primes(start=5))    # should be 5
2

sage: list(primes(start=5))    # this should not terminate!
[2, 3]

sage: it = primes(start=25)
sage: [next(it) for _ in range(5)]    # this should be [29, 31, 37, 41, 43]
[2, 3, 5, 7, 11]
```




---

Comment by @DaveWitteMorris created at 2021-03-23 18:32:23

This is the intended behavior: the docstring says 'This command is like the Python 2 "xrange" command, except it only iterates over primes.' But either the documentation needs to be more clear or the behavior needs to be changed (with a deprecation period).

Related tickets: #18298 and #30121 (and #29760). Now that we are on python 3, the `prime_range` function should return an iterator instead of a list (and act like the `range` command). That means it would have the behavior currently produced by the `primes` function, so it might then make a lot of sense to change the `primes` function so that it behaves as suggested in the ticket description.


---

Comment by mkoeppe created at 2021-03-23 18:36:34

Clearly this behavior is meant for arguments given as positional arguments. I agree that when `start` is given as a keyword argument, it should never be taken as "stop".


---

Comment by @DaveWitteMorris created at 2021-03-23 19:38:10

The arguments are intended to be positional-only (as in the `range` and `xrange` commands), but those are not available before python 3.8, which implements [PEP 570](https://www.python.org/dev/peps/pep-0570/). If we want to do something about this in the meantime, probably we should do as suggested in the PEP "by accepting `(*args, **kwargs)` and parsing the arguments manually." Another option would be to change the keyword names `start` and `stop` to something better, but I don't have a good suggestion for that.


---

Comment by mkoeppe created at 2021-04-02 20:21:54

Moving this ticket to 9.4, as it seems unlikely that it will be merged in 9.3, which is in the release candidate stage
