# Issue 20886: monomials() and lt() for SymmetricFunctions over SymbolicRing broken

archive/issues_020886.json:
```json
{
    "body": "CC:  nthiery\n\nsmc user reported these inconsistencies related to listing monomials of a symmetric function:\n\n\n```\ne = SymmetricFunctions(SR).e()\nf = e([2]).expand(3)\nf\nf.monomials()\nf.lt()\n\nx0*x1 + x0*x2 + x1*x2\n[1]\nx0*x1 + x0*x2 + x1*x2\n```\n\n\ni.e. just `[1]` and the whole polynomial, while over `QQ`:\n\n\n```\ne = SymmetricFunctions(QQ).e()\nf = e([2]).expand(3)\nf\nf.monomials()\nf.lt()\n\nx0*x1 + x0*x2 + x1*x2\n[x0*x1, x0*x2, x1*x2]\nx0*x1\n```\n\n\nlists all three monomials and only one term for `lt()`.\n\nIssue created by migration from https://trac.sagemath.org/ticket/21123\n\n",
    "created_at": "2016-07-29T08:28:57Z",
    "labels": [
        "symbolics",
        "major",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-7.3",
    "title": "monomials() and lt() for SymmetricFunctions over SymbolicRing broken",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/20886",
    "user": "schilly"
}
```
CC:  nthiery

smc user reported these inconsistencies related to listing monomials of a symmetric function:


```
e = SymmetricFunctions(SR).e()
f = e([2]).expand(3)
f
f.monomials()
f.lt()

x0*x1 + x0*x2 + x1*x2
[1]
x0*x1 + x0*x2 + x1*x2
```


i.e. just `[1]` and the whole polynomial, while over `QQ`:


```
e = SymmetricFunctions(QQ).e()
f = e([2]).expand(3)
f
f.monomials()
f.lt()

x0*x1 + x0*x2 + x1*x2
[x0*x1, x0*x2, x1*x2]
x0*x1
```


lists all three monomials and only one term for `lt()`.

Issue created by migration from https://trac.sagemath.org/ticket/21123





---

archive/issue_comments_288773.json:
```json
{
    "body": "Most probably `SymmetricFunctions` should not allow `SR` as an argument. By right, \n\n```\ne = SymmetricFunctions(SR).e()\nf = e([2]).expand(3)\n```\n\nshould create `f` in `SR`, but it does something totally different:\n\n```\nsage: type(f)\n<class 'sage.rings.polynomial.multi_polynomial_element.MPolynomial_polydict'>\n```\n\nHowever it is possible to convert `f` into a symbolic expression:\n\n```\nsage: ff=SR(f)\nsage: type(ff)\n<type 'sage.symbolic.expression.Expression'>\nsage: ff.operands()\n[x0*x1, x0*x2, x1*x2]\n```\n\nSo the latter might be used as a workaround...",
    "created_at": "2016-07-29T11:03:02Z",
    "issue": "https://github.com/sagemath/sagetest/issues/20886",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/20886#issuecomment-288773",
    "user": "dimpase"
}
```

Most probably `SymmetricFunctions` should not allow `SR` as an argument. By right, 

```
e = SymmetricFunctions(SR).e()
f = e([2]).expand(3)
```

should create `f` in `SR`, but it does something totally different:

```
sage: type(f)
<class 'sage.rings.polynomial.multi_polynomial_element.MPolynomial_polydict'>
```

However it is possible to convert `f` into a symbolic expression:

```
sage: ff=SR(f)
sage: type(ff)
<type 'sage.symbolic.expression.Expression'>
sage: ff.operands()
[x0*x1, x0*x2, x1*x2]
```

So the latter might be used as a workaround...



---

archive/issue_comments_288774.json:
```json
{
    "body": "Nicolas, do you know who can comment on this, what would be a way to resolve this?",
    "created_at": "2016-07-29T11:05:40Z",
    "issue": "https://github.com/sagemath/sagetest/issues/20886",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/20886#issuecomment-288774",
    "user": "dimpase"
}
```

Nicolas, do you know who can comment on this, what would be a way to resolve this?



---

archive/issue_comments_288775.json:
```json
{
    "body": "This is actually not a problem with symmetric functions, but how coercion into a polynomial ring over `SR` works:\n\n```\nsage: R.<x,y,z> = PolynomialRing(ZZ)\nsage: p = x + y\nsage: S.<x,y,z> = PolynomialRing(SR)\nsage: f = S(p); f  # This is what is used in symmetric functions in expand()\nx + y\nsage: f.monomials()\n[1]\nsage: f.coefficients()\n[x + y]\nsage: S.coerce_map_from(R)(p).monomials()\n[1]\nsage: S.coerce_map_from(R)\nComposite map:\n  From: Multivariate Polynomial Ring in x, y, z over Integer Ring\n  To:   Multivariate Polynomial Ring in x, y, z over Symbolic Ring\n  Defn:   Conversion via _symbolic_ method map:\n          From: Multivariate Polynomial Ring in x, y, z over Integer Ring\n          To:   Symbolic Ring\n        then\n          Generic morphism:\n          From: Symbolic Ring\n          To:   Multivariate Polynomial Ring in x, y, z over Symbolic Ring\n```\n\nWe probably check to see if the input can be considered a coefficient first, then try variable to variable. I would think the latter is actually a faster check, but it is probably a lesser-used code path.",
    "created_at": "2016-07-30T14:43:43Z",
    "issue": "https://github.com/sagemath/sagetest/issues/20886",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/20886#issuecomment-288775",
    "user": "tscrim"
}
```

This is actually not a problem with symmetric functions, but how coercion into a polynomial ring over `SR` works:

```
sage: R.<x,y,z> = PolynomialRing(ZZ)
sage: p = x + y
sage: S.<x,y,z> = PolynomialRing(SR)
sage: f = S(p); f  # This is what is used in symmetric functions in expand()
x + y
sage: f.monomials()
[1]
sage: f.coefficients()
[x + y]
sage: S.coerce_map_from(R)(p).monomials()
[1]
sage: S.coerce_map_from(R)
Composite map:
  From: Multivariate Polynomial Ring in x, y, z over Integer Ring
  To:   Multivariate Polynomial Ring in x, y, z over Symbolic Ring
  Defn:   Conversion via _symbolic_ method map:
          From: Multivariate Polynomial Ring in x, y, z over Integer Ring
          To:   Symbolic Ring
        then
          Generic morphism:
          From: Symbolic Ring
          To:   Multivariate Polynomial Ring in x, y, z over Symbolic Ring
```

We probably check to see if the input can be considered a coefficient first, then try variable to variable. I would think the latter is actually a faster check, but it is probably a lesser-used code path.



---

archive/issue_comments_288776.json:
```json
{
    "body": "Replying to [comment:3 tscrim]:\n> This is actually not a problem with symmetric functions, but how coercion into a polynomial ring over `SR` works:\n[...]\n> We probably check to see if the input can be considered a coefficient first, then try variable to variable. I would think the latter is actually a faster check, but it is probably a lesser-used code path.\n\nTo me this all sounds strange. Shouldn't a polynomial ring over SR be in SR itself, or it least it should be possible to coerse it there? But one gets:\n\n```\nsage: S.<x,y,z> = PolynomialRing(SR)\nsage: p=x+y\nsage: p in SR\nFalse\nsage: SR(p)\n---------------------------------------------------------------------------\nTypeError                                 Traceback (most recent call last)\n[...]\nTypeError: not a constant polynomial\nsage: \n```\n",
    "created_at": "2016-08-09T11:37:26Z",
    "issue": "https://github.com/sagemath/sagetest/issues/20886",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/20886#issuecomment-288776",
    "user": "dimpase"
}
```

Replying to [comment:3 tscrim]:
> This is actually not a problem with symmetric functions, but how coercion into a polynomial ring over `SR` works:
[...]
> We probably check to see if the input can be considered a coefficient first, then try variable to variable. I would think the latter is actually a faster check, but it is probably a lesser-used code path.

To me this all sounds strange. Shouldn't a polynomial ring over SR be in SR itself, or it least it should be possible to coerse it there? But one gets:

```
sage: S.<x,y,z> = PolynomialRing(SR)
sage: p=x+y
sage: p in SR
False
sage: SR(p)
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)
[...]
TypeError: not a constant polynomial
sage: 
```




---

archive/issue_comments_288777.json:
```json
{
    "body": "See also #20454.",
    "created_at": "2016-08-10T06:43:16Z",
    "issue": "https://github.com/sagemath/sagetest/issues/20886",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/20886#issuecomment-288777",
    "user": "rws"
}
```

See also #20454.
