# Issue 17427: Fix underlying permutation group of decomposition group

Issue created by migration from https://trac.sagemath.org/ticket/17664

Original creator: pbruin

Original creation time: 2015-01-23 20:03:15

Keywords: Galois group decomposition permutation

Decomposition groups are sometimes represented as permutation groups on the wrong number of elements:

```
sage: L.<c> = NumberField(x^2 + 1)
sage: G = L.galois_group()
sage: P = L.primes_above(5)[0]
sage: H = G.decomposition_group(P)
sage: G.domain()
{1, 2}
sage: H.domain()
{1}               # should be {1, 2}
```

This causes

```
sage: G.artin_symbol(P)
Traceback (most recent call last):
...
PariError: incorrect type in permtopol [permutation] (t_VECSMALL)
```

Original report: https://groups.google.com/forum/#!topic/sage-nt/EuoNYq2KFnU


---

Comment by pbruin created at 2015-01-23 20:40:02

Changing status from new to needs_review.


---

Comment by chapoton created at 2015-05-02 16:34:37

Ok, looks good to me


---

Comment by chapoton created at 2015-05-02 16:34:37

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2015-05-02 23:48:39

Resolution: fixed
