# Issue 11790: mpc won't coerce to ComplexNumber

Issue created by migration from Trac.

Original creator: dsm

Original creation time: 2011-10-29 15:33:46

Assignee: tbd

CC:  leif

Came across this working on #1173:


```
sage: version()
'Sage Version 4.7.2.alpha3, Release Date: 2011-09-28'
sage: import mpmath
sage: 
sage: z = mpmath.mpf(2)
sage: z
mpf('2.0')
sage: RR(z)
2.00000000000000
sage: CC(z)
2.00000000000000
sage: 
sage: z = mpmath.mpc(2,3)
sage: z
mpc(real='2.0', imag='3.0')
sage: complex(z)
(2+3j)
sage: CC(z)
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)
[...]
TypeError: unable to coerce to a ComplexNumber: <type 'sage.libs.mpmath.ext_main.mpc'>
```





---

Comment by leif created at 2011-10-29 17:07:26

Changing assignee from tbd to was.


---

Comment by leif created at 2011-10-29 17:07:26

Changing component from PLEASE CHANGE to interfaces.


---

Comment by leif created at 2011-10-29 19:24:22

A trivial fix would be:

```diff

diff --git a/sage/rings/complex_number.pyx b/sage/rings/complex_number.pyx
--- a/sage/rings/complex_number.pyx
+++ b/sage/rings/complex_number.pyx
`@``@` -148,10 +148,11 `@``@`
             elif isinstance(real, list) or isinstance(real, tuple):
                 re, imag = real
                 real = re
-            elif isinstance(real, complex):
-                real, imag = real.real, real.imag
             else:
-                imag = 0
+                try:
+                    real, imag = real.real, real.imag
+                except AttributeError:
+                    imag = 0
         try:
             R = parent._real_field()
             rr = R(real)
```


But perhaps there are better ways.


---

Comment by jdemeyer created at 2011-11-03 16:14:43

Milestone sage-4.7.3 deleted


---

Comment by jdemeyer created at 2015-06-23 14:02:06

Changing component from interfaces to coercion.


---

Comment by jdemeyer created at 2015-06-23 14:02:06

Changing assignee from was to robertwb.


---

Comment by @sheerluck created at 2022-04-03 14:24:19


```diff
--- a/sage/rings/complex_mpfr.pyx
+++ b/sage/rings/complex_mpfr.pyx
`@``@` -56,6 +56,7 `@``@`
 from sage.libs.gsl.complex cimport *
 
 from sage.libs.mpmath.utils cimport mpfr_to_mpfval
+from mpmath import mpc as mpmath_extmpc
 from sage.rings.integer_ring import ZZ
 
 from sage.misc.superseded import deprecated_function_alias
`@``@` -961,7 +962,7 `@``@`
             elif isinstance(real, list) or isinstance(real, tuple):
                 re, imag = real
                 real = re
-            elif isinstance(real, complex):
+            elif isinstance(real, (complex, mpmath_extmpc)):
                 real, imag = real.real, real.imag
             elif type(real) is gmpy2.mpc:
                 real, imag = (<gmpy2.mpc>real).real, (<gmpy2.mpc>real).imag
```



```
sage: version()
'SageMath version 9.6.beta7, Release Date: 2022-04-02'
sage: import mpmath
sage: z = mpmath.mpc(2, 3)
....: z
mpc(real='2.0', imag='3.0')
sage: complex(z)
(2+3j)
sage: CC(z)
2.00000000000000 + 3.00000000000000*I
```

