# Issue 14489: Coercion of power series to symbolic ring

Issue created by migration from Trac.

Original creator: eviatarbach

Original creation time: 2013-06-05 20:05:43

Assignee: burcin

Coercing a power series to the symbolic ring doesn't work as expected:


```
sage: R.<t> = PowerSeriesRing(QQ)
sage: p = R([1,2,3])
sage: SR(p).variables()
()
sage: diff(SR(p))
0
```


Perhaps it could be converted to a polynomial first and then coerced to the symbolic ring?


```
sage: SR(p.polynomial()).variables()
(t,)
sage: diff(SR(p.polynomial()))      
6*t + 2
```



---

Comment by eviatarbach created at 2014-02-12 08:44:30

#15707 is related.


---

Comment by nbruin created at 2014-02-12 16:32:12

The examples here refer to conversion; not coercion. That fact that power series over "basic" ring types such as rationals or integers don't convert into SR is, I think, a shortcoming that can be fixed. The main thing is to find how to represent the relevant "big-Oh" in SR. Maxima does have power series, so there is at least one back-end that provides some support: [http://maxima.sourceforge.net/docs/manual/en/maxima_28.html#IDX1221](http://maxima.sourceforge.net/docs/manual/en/maxima_28.html#IDX1221). Linking up maxima's internal format with sage might need some work:

```
sage: F=maxima_calculus('taylor(sin(x),x,0,3)')
sage: F
x-x^3/6
sage: F.ecl()
<ECL: ((MRAT SIMP (((%SIN SIMP) $X) $X) (#:|sin(x)2136| #:X2137)
  (($X ((3 . 1)) 0 NIL #:X2137 . 2)) TRUNC)
 PS (#:X2137 . 2) ((3 . 1)) ((1 . 1) 1 . 1) ((3 . 1) -1 . 6))>
sage: F-x+x^3/6
+0
sage: (F-x+x^3/6).ecl()
<ECL: ((MRAT SIMP ($X) (#:X2145) (($X ((3 . 1)) 0 NIL #:X2145 . 1)) TRUNC) 0 . 1)>
```

(in maxima this prints with dots, so it knows it's a power series)


---

Comment by jakobkroeker created at 2016-07-09 15:05:57

Changing status from new to needs_info.


---

Comment by jakobkroeker created at 2016-07-09 15:05:57

seems fixed?
