# Issue 19170: Hom for matrix groups is too restrictive

Issue created by migration from Trac.

Original creator: tscrim

Original creation time: 2015-10-13 21:36:22

Assignee: tscrim

CC:  vbraun

We currently have the following inconsistency:

```
sage: G = GL(2, GF(3))
sage: H = GL(3, ZZ)
sage: Hom(H, H)
Set of Homomorphisms from General Linear Group of degree 3 over Integer Ring to General Linear Group of degree 3 over Integer Ring

sage: Hom(G, G)
Set of Homomorphisms from General Linear Group of degree 2 over Finite Field of size 3 to General Linear Group of degree 2 over Finite Field of size 3

sage: Hom(G, H)
Set of Morphisms from General Linear Group of degree 2 over Finite Field of size 3 to General Linear Group of degree 3 over Integer Ring in Category of groups

sage: Hom(H, G)
Set of Morphisms from General Linear Group of degree 3 over Integer Ring to General Linear Group of degree 2 over Finite Field of size 3 in Category of groups
```

This is due to the category check done in `MatrixGroup_generic._Hom_` is too restrictive.


---

Comment by tscrim created at 2015-10-13 21:48:28

I just removed this check altogether and let `Hom` construct the appropriate category and the `is_MatrixGroup` handle making sure we have a (matrix) group.

I also touched up some other aspects of the homset construction for (matrix) groups.
----
New commits:


---

Comment by tscrim created at 2015-10-13 21:48:28

Changing status from new to needs_review.


---

Comment by git created at 2015-10-15 16:46:41

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by vbraun created at 2015-10-31 16:37:09

Changing status from needs_review to positive_review.


---

Comment by tscrim created at 2015-10-31 16:52:07

Thanks for doing the review.


---

Comment by vbraun created at 2015-10-31 22:25:12

Resolution: fixed
