# Issue 21392: matrix norm fails

Issue created by migration from https://trac.sagemath.org/ticket/21629

Original creator: cnassau

Original creation time: 2016-10-03 14:20:30

CC:  tscrim

Keywords: matrix, norm, svd

This happens in [SageMath](SageMath) version 7.4.beta6:

```
sage: matrix.diagonal((0,0,0)).norm()
---------------------------------------------------------------------------
AttributeError                            Traceback (most recent call last)
...
AttributeError: 'sage.matrix.matrix_generic_sparse.Matrix_generic_sparse' object has no attribute 'SVD'
```



---

Comment by chapoton created at 2019-11-01 15:00:05

This is cause by sparseness.

```
sage: D = matrix.diagonal((0,0,0))
sage: D.dense_matrix().norm()
0.0
sage: D.dense_matrix().norm(p='frob')
0.0
```



---

Comment by chapoton created at 2019-11-01 16:18:19

The other error comes from here:

```
sage: D = matrix.diagonal((0,0,0))
sage: D.apply_map(abs)
```

and even from

```
sage: D = matrix.diagonal((0,0,0))
sage: D.apply_map(lambda t:t)
```



---

Comment by chapoton created at 2019-11-01 17:23:09

here is a fix for one of the 2 problems.
----
New commits:


---

Comment by @mwageringel created at 2020-03-18 17:32:57

Replying to [comment:4 chapoton]:
> here is a fix for one of the 2 problems.
> ----
> New commits:
> ||[446b3b1](https://git.sagemath.org/sage.git/commit?id=446b3b12cfbc2eebb81546dbf8a50410687c5346)||`trac 21629 fix for apply_map of empty sparse matrices`||

This has also been fixed in #29214, so only the first problem remains.
