# Issue 14398: Symbolic expression to number fields

Issue created by migration from https://trac.sagemath.org/ticket/14602

Original creator: vdelecroix

Original creation time: 2013-05-17 08:50:47

Assignee: davidloeffler

CC:  vdelecroix mkoeppe

The ticket stands to improve the `AlgebraicConverter` in `sage.symbolic.expression_converters` to work with number fields.

As mentioned on [ask](http://ask.sagemath.org/question/2581/convert-expression-to-quadraticfield) the following fails

```
sage: K = QuadraticField(3)
sage: K(sqrt(3))
Traceback (most recent call last):
...
TypeError: ...
```

But the following gives an answer with a wrong parent

```
sage: x = K(3)**(1/2); x
sqrt(3)
sage: a.parent()
Symbolic Ring
```

while it is possible to do

```
sage: y = K(3).sqrt(); y
a
sage: y == K.gen()
True
```

Finally, we hopefully have

```
sage: K.gen() == sqrt(3)
sqrt(3) == sqrt(3)
sage: bool(K.gen() == sqrt(3))
True
```



---

Comment by chapoton created at 2019-08-24 18:14:42

everything seems to work fine now (sage 8.9.b7)


---

Comment by vdelecroix created at 2019-08-24 22:22:27

Changing status from new to needs_review.


---

Comment by vdelecroix created at 2019-08-24 22:22:27

Indeed. The situation improved.


---

Comment by klui created at 2019-08-25 03:26:32

Changing status from needs_review to positive_review.


---

Comment by klui created at 2019-08-25 03:26:32

Yep.

Every example in the ticket text now works!


---

Comment by chapoton created at 2019-08-25 05:51:57

Is this doctested somewhere ?


---

Comment by klui created at 2019-08-25 06:34:38

Changing status from positive_review to needs_work.


---

Comment by klui created at 2019-08-25 06:34:38

Replying to [comment:10 chapoton]:
> Is this doctested somewhere ?
Not as far as I can tell. Good point. Forgot to check that.


---

Comment by @DaveWitteMorris created at 2021-01-24 02:08:41

The PR adds doctests. Note that we still have

```
sage: (K(3)^(1/2)).parent()                                                  
Symbolic Ring
```

That seems ok to me, but if the parent should be `K`, then I think another ticket should be opened. (The parent of `sqrt(K(3))` is `K`, and is one of the new doctests.)
----
New commits:


---

Comment by @DaveWitteMorris created at 2021-01-24 03:47:20

Changing status from needs_work to needs_review.


---

Comment by @DaveWitteMorris created at 2021-01-24 03:47:20

Changing priority from major to minor.


---

Comment by vdelecroix created at 2021-01-24 08:50:32

Could you also doctest the other embedding

```
sage: L = QuadraticField(3, embedding=-AA(3).sqrt())
sage: bool(L.gen() == -sqrt(3))
True
```



---

Comment by git created at 2021-01-24 17:39:43

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by @DaveWitteMorris created at 2021-01-24 17:41:57

Thanks for the suggestion. I added this doctest.


---

Comment by vdelecroix created at 2021-01-24 18:02:57

Thanks. Good to me. Waiting for the patchbot.


---

Comment by vdelecroix created at 2021-01-24 20:43:03

Changing status from needs_review to positive_review.


---

Comment by @DaveWitteMorris created at 2021-01-24 20:45:26

Thanks!


---

Comment by vbraun created at 2021-03-09 00:00:59

Resolution: fixed
