# Issue 14770: adding diff() and differentiate() aliases to polynomial rings for consistency

Issue created by migration from https://trac.sagemath.org/ticket/15007

Original creator: dkrenn

Original creation time: 2013-08-06 09:42:52

Keywords: diff, derivative, polynomial ring, beginner


```
sage: R.<y> = ZZ[]
sage: y.diff()
Traceback (click to the left of this block for traceback)
...
AttributeError:
'sage.rings.polynomial.polynomial_integer_dense_flint.Polynomial_integer\
_dense_flint' object has no attribute 'diff'
```

does not work. Neither does `y.differentiate()`. You can only do the desired operation with

```
sage: y.derivative()
1
```


In the symbolic ring all of the above is allowed:

```
sage: var('z')
z
sage: z.diff()
1
sage: z.differentiate()
1
sage: z.derivative()
1
```


For consistency aliases `.diff()` and `.differentiate()` should be added to all polynomial rings.


---

Comment by PythonNut created at 2013-09-08 00:24:02

I will work on this as my first ticket.


---

Attachment

Alias .diff() and .differentiate() to .derivative() in polynomial rings


---

Comment by PythonNut created at 2013-09-11 04:14:52

Changing status from new to needs_review.


---

Comment by jdemeyer created at 2013-12-07 08:26:14

Looks good.


---

Comment by jdemeyer created at 2013-12-07 08:26:14

Resolution: fixed
