# Issue 16756: Broken fraction field of rational polynomial ring

Issue created by migration from https://trac.sagemath.org/ticket/16993

Original creator: SimonKing

Original creation time: 2014-09-16 12:49:38

CC:  tscrim yzh mkoeppe etn40ff slelievre


```
sage: P.<t> = QQ[]
sage: p = 4/(-4*t)
sage: p   # OK, fractions are not automatically reduced
4/(-4*t)
sage: p.reduce()
sage: p   # What the heck...
4/(-4*t)
sage: p == -1/t   # At least sage gets this right
True
```

So, not only is the fraction not automatically simplified by "obvious" common factors, but also it is not simplified upon request.

Note that the fraction field of an integral polynomial ring works better.

```
sage: P.<t> = ZZ[]
sage: p = 4/(-4*t)
sage: p
1/-t
```



---

Comment by emassop created at 2014-09-16 14:17:10

I think this is fixed in [u/robertwb/ticket/16268](http://git.sagemath.org/sage.git/log/?h=u/robertwb/ticket/16268) which is part of #16268. On #16268, I felt that some of the functions introduced there could not live up to their documentation for nastier rings and should be moved around. Also the description of #16268 then goes on to hashes, which IMHO should be fixed without too much extra normalisation as this normalisation is probably not possible for nasty rings. Sadly I don't have time to work on this.

Now back to this ticket: I am not sure I would call reduce _broken_ per se: If _reduce_ is interpreted as _divide out gcd_, then the behaviour makes sense to me, since 1 is a generator of the ideal `4*QQ[t] + (-4*t)*QQ[t]` and therefore a gcd.

Normalisation in Q(ZZ[t]) isn't optimal either:

```
sage: P.<t> = ZZ[]
sage: (2*t)/(2*t+1)
2*t/(2*t + 1)
sage: (-2*t)/(-2*t-1)
-2*t/(-2*t - 1)
```


I think Nemo solves this (for unnasty rings) by dividing the denominator by what it calls a canonical unit. My understanding of "canonical unit" is this: It is the result of a multiplicative map from the non-zero elements to the units, that is the identity on units. (In particular if this map is called `f`, we have `f(a/f(a)) = 1` for any non-zero element `a`.) In the case of `QQ[t]` the function "leading coefficient" works. In the case of `ZZ[t]` the function "sign after leading coefficient" works.


---

Comment by tscrim created at 2015-09-25 22:03:21

My suggestion would be that if we create a fraction field of some commutative algebra over a field `k` such that `k` is constructed as the fraction field of `R` (perhaps with some extra conditions on the ring), then we create the fraction field over the algebra over `R`. This change would definitely require a discussion on sage-devel, and might be something we do only for polynomial rings or some other nice class of commutative algebras.


---

Comment by rws created at 2015-10-11 06:14:55

Changing component from basic arithmetic to commutative algebra.


---

Comment by mkoeppe created at 2018-09-14 04:33:38

Changing status from new to needs_review.


---

Comment by mkoeppe created at 2018-09-14 04:33:38

With #16268, the example now works as expected:

```
sage: P.<t> = QQ[]
sage: p = 4/(-4*t)
sage: p
-1/t
sage: p.reduce()
sage: p
-1/t
```

I would suggest to close this ticket as a duplicate of #16268.


---

Comment by mmezzarobba created at 2018-09-22 14:36:12

Changing status from needs_review to positive_review.


---

Comment by embray created at 2019-02-26 13:58:00

Presuming these are all correctly reviewed as either duplicate, invalid, or wontfix.


---

Comment by embray created at 2019-02-26 13:58:00

Resolution: invalid
