# Issue 14066: Remove function call syntax for symbolic expressions

Issue created by migration from https://trac.sagemath.org/ticket/14270

Original creator: ppurka

Original creation time: 2013-03-14 16:04:31

Assignee: burcin

CC:  nthiery kini @davewittemorris nbruin egourgoulhon

The function call syntax for symbolic expressions has been deprecated for over four years. It is about time it raised some errors. This will prevent people from getting confused because of behavior [like this](http://ask.sagemath.org/question/2357/the-difference-between-fx3-and-f3-of-callable).


---

Comment by ppurka created at 2013-03-14 16:39:06

Changing status from new to needs_review.


---

Comment by ppurka created at 2013-03-15 03:00:21

Changing status from needs_review to needs_work.


---

Comment by ppurka created at 2013-03-19 08:46:02

I am able to fix all the doctests except for the following one in combinat/tutorial.py.

The example which fails seems to make no sense to me. A `substitute_function` method is being used to substitute a function with a symbolic expression.

```
sage: C, z = var('C,z');
sage: sys = [ C == z + C*C ]
sage: sol = solve(sys, C, solution_dict=True); sol
[{C: -1/2*sqrt(-4*z + 1) + 1/2}, {C: 1/2*sqrt(-4*z + 1) + 1/2}]
sage: s0 = sol[0][C]; s1 = sol[1][C]

...

sage: C = s0; C
-1/2*sqrt(-4*z + 1) + 1/2

...

sage: equadiff
(4*z - 1)*D[0](C)(z) - 2*C(z) + 1 == 0
sage: Cf = sage.symbolic.function_factory.function('C')
sage: equadiff.substitute_function(Cf, s0)  # Original answer is the deprecation + answer
...
TypeError: %d format: a number is required, not NoneType
```

Let us try to "fix" this (`z` is a symbolic variable). Somehow the following works (beats me why it does):

```
sage: equadiff.substitute_function(Cf(z), s0)
(4*z - 1)*D[0](C)(z) - 2*C(z) + 1 == 0     # OK, so this seems to work
```

But now the next command in the tutorial gives `False` instead of `True`

```
sage: bool(equadiff.substitute_function(Cf(z), s0))  
False
```


Why is all this happening? Looking at the documentation of `substitute_function` shows that it should be used for substituting _functions_, not anything else

```
    def substitute_function(self, original, new):
        """
        Returns this symbolic expressions all occurrences of the
        function *original* replaced with the function *new*.
```


And what exactly are we substituting above?

```
sage: type(Cf)
sage.symbolic.function_factory.NewSymbolicFunction
sage: type(s0)
sage.symbolic.expression.Expression
```

We are substituting a symbolic function with a symbolic expression! How was this even working earlier?

What should I do with this portion of the tutorial? Delete this?


---

Comment by ppurka created at 2013-03-19 08:46:38

Apply to devel/sage


---

Attachment

Replying to [comment:3 ppurka]:
> I am able to fix all the doctests except for the following one in combinat/tutorial.py.
<snip>
> What should I do with this portion of the tutorial? Delete this?
I'm cc:ing Nicolas, who should know what is going on here.


---

Comment by kcrisman created at 2013-03-20 03:23:08

I'd also say that I think the prep tutorial one should still talk about this at some length, to explain (in the event this is done) _why_ this doesn't work, because a lot of people will now and forevermore expect that it will work.  Similarly, most of these examples presumably should be moved to the new syntax, perhaps even with an explanatory remark as to exactly why that is the syntax.  For instance, how _would_ one do the matrix example `h(x)` now?    We should be careful not to remove anything, just to change how it works to the appropriate way post-this-ticket.

Rant I don't actually want to rehash any more, but put here for completeness:

    <rant>
    Because distinguishing between a function and a symbolic expression is an unnatural, CS-y thing to do; any symbolic expression is obviously a function of all variables in it, mathematically; for any function with more than one `var` I agree we don't want this (as indeed the example in the prep document points out) but for one-variable expressions (pace Jason, who will immediately ask whether `x+y-y` is one variable) it seems worth the potential for confusion...
    </rant>


---

Comment by ppurka created at 2013-03-20 05:00:45

Replying to [comment:5 kcrisman]:
> I'd also say that I think the prep tutorial one should still talk about this at some length, to explain (in the event this is done) _why_ this doesn't work, because a lot of people will now and forevermore expect that it will work.

IMHO, the people who expect this to _still_ work need to change their code. It has been in deprecated mode for over four years. That's more than enough time to change their habit and old code. I think someone hasn't complained before either because they are complacent or because they don't use this at all.

While teaching a course with Sage, I remember that we ourselves ran into this problem with the students. It was annoying and confusing because we were unaware of the code and how to fix it. We would just ask the students to ignore those warnings. What would a beginner do after defining `f(x) = x^2`? The most natural thing would be to do `f(2)` or something similar to "see" that it can actually evaluate. Now imagine the same with `f = x^2` and what you get is the deprecation message and then the correct answer. Second time it is evaluated, there is no deprecation message, so a beginner will wonder what just happened in the first invocation. It is not a favorable impression. It gives the impression of a half-done software.

I agree with you that it should be explained in the tutorial that there is a difference between symbolic functions and symbolic expressions and python functions.


---

Comment by rws created at 2015-02-01 09:32:20

This is actually the same as #8214, but that has no code, so I'm copying the two links from there to here before declaring it a dupe.


---

Comment by ppurka created at 2015-02-01 15:01:05

This ticket is unlikely to get fixed unless someone who knows the code really well addresses  comment:3


---

Comment by nbruin created at 2015-02-01 17:28:26

Replying to [comment:3 ppurka]:
> I am able to fix all the doctests except for the following one in combinat/tutorial.py.

OK, from what you've written down here, I can come up with one way of rewriting the example.

> {{{
> sage: C, z = var('C,z');
> sage: sys = [ C == z + C*C ]
> sage: sol = solve(sys, C, solution_dict=True); sol
> [{C: -1/2*sqrt(-4*z + 1) + 1/2}, {C: 1/2*sqrt(-4*z + 1) + 1/2}]
> sage: s0 = sol[0][C]; s1 = sol[1][C]
> }}}

> {{{
> sage: C = s0; C
> -1/2*sqrt(-4*z + 1) + 1/2
> }}}
I think this should be deleted. Use s0 if you want that and just leave C bound to the variable. It's already bad enough that we need "C as a function" further down.

> {{{
> sage: equadiff
> (4*z - 1)*D[0](C)(z) - 2*C(z) + 1 == 0
> sage: Cf = sage.symbolic.function_factory.function('C')
> }}}
Didn't we need Cf before to arrive at `equadiff`? How did `C(z)` get into that expression in the first place?

> {{{
> sage: equadiff.substitute_function(Cf, s0)  # Original answer is the deprecation + answer
> ...
> TypeError: %d format: a number is required, not NoneType
> }}}
I think the following should work (it does in vanilla, without a deprecation warning):

```
sage: equadiff.substitute_function(Cf, s0.function(z))
```

> Let us try to "fix" this (`z` is a symbolic variable). Somehow the following works (beats me why it does):
> {{{
> sage: equadiff.substitute_function(Cf(z), s0)
> (4*z - 1)*D[0](C)(z) - 2*C(z) + 1 == 0     # OK, so this seems to work
> }}}
I'm not so sure it "works". It doesn't give an error (which is surprising in its own right; perhaps that should change), but I don't think it gives the same answer. In vanilla:

```
sage: equadiff.substitute_function(Cf(z), s0)
(4*z - 1)*D[0](C)(z) - 2*C(z) + 1 == 0
sage: equadiff.substitute_function(Cf, s0.function(z))
(4*z - 1)/sqrt(-4*z + 1) + sqrt(-4*z + 1) == 0
```


> But now the next command in the tutorial gives `False` instead of `True`
Rightly so, judging from the results above.

> Why is all this happening? Looking at the documentation of `substitute_function` shows that it should be used for substituting _functions_, not anything else
> {{{
>     def substitute_function(self, original, new):
>         """
>         Returns this symbolic expressions all occurrences of the
>         function *original* replaced with the function *new*.
> }}}
> 
> And what exactly are we substituting above?
> {{{
> sage: type(Cf)
> sage.symbolic.function_factory.NewSymbolicFunction
> sage: type(s0)
> sage.symbolic.expression.Expression
> }}}
> We are substituting a symbolic function with a symbolic expression! How was this even working earlier?

I guess because symbolic expressions were deprecated "functions": you could call then with symbolic arguments and get a symbolic expression, at the cost of a deprecation warning.

> What should I do with this portion of the tutorial? Delete this?

No, just do

```
sage: equadiff.substitute_function(Cf, s0.function(z))
```

That's probably a useful example to have anyway. It shows how to turn a symbolic expression into a function in a non-ambiguous way, because you need to specify argument order.


---

Comment by rws created at 2017-08-23 07:48:43

Replying to [comment:5 kcrisman]:
>     <rant>
>     Because distinguishing between a function and a symbolic expression is an unnatural, CS-y thing to do; any symbolic expression is obviously a function of all variables in it, mathematically; for any function with more than one `var` I agree we don't want this (as indeed the example in the prep document points out) but for one-variable expressions (pace Jason, who will immediately ask whether `x+y-y` is one variable) it seems worth the potential for confusion...
>     </rant>

I actually agree and I don't see why a function call with non-relational argument should not be allowed IF there is only one variable in the expression. The confusion comes from the fact that things like `sqrt(2)(x+y)` almost always are typos where the `*` is missing. These should be marked as error. Now Sage cannot distinguish between `f=x^2; f(2)` and `sqrt(2)(x+y)` because `f` is replaced immediately with `x^2` and so in both cases an expression has its `__call__` member executed. BUT, first with `sqrt(2)(x+y)` the expression has no variables and so it can be doubtlessy marked as error; secondly, before `f` is silently expanded to `x^2` it is seen by the parser---maybe the parser can distinguish between calls that are done to `f` (like calls to functions) and other calls, and only allow the former?


---

Comment by rws created at 2017-08-23 07:50:29

Changing status from needs_work to needs_info.


---

Comment by jdemeyer created at 2017-08-23 07:58:18

Replying to [comment:16 rws]:
> maybe the parser can distinguish between calls that are done to `f` (like calls to functions) and other calls, and only allow the former?

That would be adding even more special cases just for Sage.

In Python, you expect the following two to do the same thing

```
f = x^2
print(f(2))
```

and

```
print((x^2)(2))
```

It would be very surprising if somehow these would become different.


---

Comment by kcrisman created at 2017-08-23 12:03:42

But of course Jason's `x+y-y` still has to be dealt with, if only to ignore it ...


---

Comment by rws created at 2017-08-23 13:08:11

This is equality (or zero) proving in the symbolic ring, so it can be arbitrarily complex. Ignore it, yes.


---

Comment by rws created at 2017-08-23 13:43:06

> ... The confusion comes from the fact that things like `sqrt(2)(x+y)` almost always are typos where the `*` is missing. These should be marked as error.

This is now #23684


---

Comment by mkoeppe created at 2021-07-05 19:43:10

Changing status from needs_info to needs_work.


---

Comment by mkoeppe created at 2021-07-05 23:43:56

New commits:


---

Comment by mkoeppe created at 2021-07-05 23:47:32

Changing status from needs_work to needs_review.


---

Comment by git created at 2021-07-07 00:21:12

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by mkoeppe created at 2021-07-17 21:52:37

Changing status from needs_review to needs_work.


---

Comment by mkoeppe created at 2021-07-17 21:52:37

patchbot found some doctest failures


---

Comment by git created at 2021-07-17 22:21:42

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by git created at 2021-07-17 22:45:56

Branch pushed to git repo; I updated commit sha1. This was a forced push. New commits:


---

Comment by mkoeppe created at 2021-07-17 22:46:44

Changing status from needs_work to needs_review.


---

Comment by mkoeppe created at 2021-07-18 20:05:06

Changing status from needs_review to needs_work.


---

Comment by git created at 2021-07-18 20:13:47

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by mkoeppe created at 2021-07-18 20:16:55

`fast_callable` still needs updating


---

Comment by git created at 2021-07-18 23:33:03

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by mkoeppe created at 2021-07-18 23:33:59

As `fast_callable` is used in plotting, this should be checked carefully for any regressions


---

Comment by mkoeppe created at 2021-07-18 23:33:59

Changing status from needs_work to needs_review.


---

Comment by mkoeppe created at 2021-07-24 22:17:44

Changing status from needs_review to needs_work.


---

Comment by mkoeppe created at 2021-07-24 22:17:44


```
sage -t --long --random-seed=0 src/sage/calculus/desolvers.py
**********************************************************************
File "src/sage/calculus/desolvers.py", line 1609, in sage.calculus.desolvers.?
Failed example:
    sol=desolve_odeint(f,[0.5,2],srange(0,10,0.1),[x,y])
Exception raised:
    Traceback (most recent call last):
      File "/home/sage-patchbot/sage/local/lib/python3.8/site-packages/sage/doctest/forker.py", line 718, in _run
        self.compile_and_execute(example, compiler, test.globs)
      File "/home/sage-patchbot/sage/local/lib/python3.8/site-packages/sage/doctest/forker.py", line 1137, in compile_and_execute
        exec(compiled, globs)
      File "<doctest sage.calculus.desolvers.?[3]>", line 1, in <module>
        sol=desolve_odeint(f,[RealNumber('0.5'),Integer(2)],srange(Integer(0),Integer(10),RealNumber('0.1')),[x,y])
      File "/home/sage-patchbot/sage/local/lib/python3.8/site-packages/sage/calculus/desolvers.py", line 1726, in desolve_odeint
        return desolve_odeint_inner(ivar)
      File "/home/sage-patchbot/sage/local/lib/python3.8/site-packages/sage/calculus/desolvers.py", line 1679, in desolve_odeint_inner
        desc.append(fast_float(de,*variabs))
      File "sage/ext/fast_eval.pyx", line 1391, in sage.ext.fast_eval.fast_float (build/cythonized/sage/ext/fast_eval.c:11249)
        return fast_callable(f, vars=vars, domain=float,
      File "sage/ext/fast_callable.pyx", line 457, in sage.ext.fast_callable.fast_callable (build/cythonized/sage/ext/fast_callable.c:4734)
        vars = [to_var(var) for var in vars]
      File "sage/ext/fast_callable.pyx", line 456, in sage.ext.fast_callable.fast_callable.to_var (build/cythonized/sage/ext/fast_callable.c:4147)
        return SR.var(var)
      File "sage/symbolic/ring.pyx", line 999, in sage.symbolic.ring.SymbolicRing.var (build/cythonized/sage/symbolic/ring.cpp:11232)
        raise ValueError(f'The name "{s}" is not a valid Python identifier.')
    ValueError: The name "(symbol1790" is not a valid Python identifier.
```



---

Comment by git created at 2021-07-25 01:39:55

Branch pushed to git repo; I updated commit sha1. Last 10 new commits:


---

Comment by mkoeppe created at 2021-07-25 04:51:37

Changing status from needs_work to needs_review.


---

Comment by mjo created at 2021-07-28 12:25:23

I think this needs a rebase onto rc0? Trac merge failed even though it rebases cleanly.


---

Comment by mjo created at 2021-07-28 12:25:23

Changing status from needs_review to needs_work.


---

Comment by git created at 2021-08-01 21:20:44

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by mkoeppe created at 2021-08-01 21:21:26

Changing status from needs_work to needs_review.


---

Comment by tscrim created at 2021-08-05 22:35:06

We have given people plenty of time to stop using this. Time to bring down the hammer. I am setting this to a positive review, but setting it to 9.5 just to make sure it does not go into the soon-to-be-released 9.4 to get more testing.


---

Comment by tscrim created at 2021-08-05 22:35:06

Changing status from needs_review to positive_review.


---

Comment by mkoeppe created at 2021-08-09 20:01:55

Thank you!


---

Comment by vbraun created at 2021-08-29 09:38:02

Resolution: fixed
