# Issue 14387: cosh integral incorrect because of abs_integrate

Issue created by migration from https://trac.sagemath.org/ticket/14591

Original creator: kcrisman

Original creation time: 2013-05-15 14:12:26

Assignee: burcin

CC:  tmonteil gagern

See [this ask.sagemath question](http://ask.sagemath.org/question/2577/integrate-with-elliptic-integral-special-function?answer=3545#3545).


```
sage: a = integrate(sqrt(1-1/4*cosh(x)^2),x)
sage: a.full_simplify()
cosh(x)
```

Not that I'm an expert here, but at any rate, viewed as real functions this makes no sense, though perhaps on some branch it does.  This happens because 

```

Maxima 5.29.1 http://maxima.sourceforge.net
using Lisp ECL 12.12.1
Distributed under the GNU Public License. See the file COPYING.
Dedicated to the memory of William Schelter.
The function bug_report() provides bug reporting information.
(%i1) domain:complex;
(%o1)                               complex
(%i2) display2d:false;

(%o2) false
(%i3) B:integrate(sqrt(1-cosh(x)^2/4),x);

(%o3) 'integrate(sqrt(1-cosh(x)^2/4),x)
(%i4) trigsimp(B);

(%o4) 'integrate(sqrt(-(cosh(x)^2-4)/4),x)
(%i5) fullratsimp(B);

(%o5) 'integrate(sqrt(-(cosh(x)^2-4)/4),x)
(%i6) load(abs_integrate);

(%o6) "/Users/.../sage-5.9.rc1/local/share/maxima/5.29.1/share/contrib/integration/abs_integrate.mac"
(%i7) trigsimp(B);

(%o7) cosh(x)
(%i8) fullratsimp(B);

(%o8) cosh(x)
```

I'm not sure we want to unload `abs_integrate` but we need to figure something out here.


---

Comment by jdemeyer created at 2013-06-13 09:26:03

Fixed by #13973.


---

Comment by pbruin created at 2014-05-28 02:03:30

The answer cosh(_x_) is completely wrong, even in a neighbourhood of _x_ = 0:

```
cosh(x) = integrate(sqrt(1 - 1/4*cosh(x)^2),x)
=> sinh(x) = sqrt(1 - 1/4*cosh(x)^2)
=> sinh(x)^2 = 1 - 1/4*cosh(x)^2
=> 0 = 3/4  (substitute x = 0)
```

According to the ask.sagemath.org link in the ticket description, the correct answer can be expressed in terms of an elliptic integral function, which I trust much more.


---

Comment by kcrisman created at 2014-05-28 15:25:37

As Thierry pointed out on the ask.sagemath question.  So, does #13973 fix this or not?


---

Comment by pbruin created at 2014-05-28 15:52:58

Replying to [comment:8 kcrisman]:
> As Thierry pointed out on the ask.sagemath question.
Yes, I just wanted to give a clear reason here why the answer couldn't possibly be right.
> So, does #13973 fix this or not?
No, it doesn't.  I have been doing some debugging of the Maxima command

```
trigsimp(integrate(sqrt(4 - cosh(x)^2),x));
```

which returns `cosh(x)` when executed after loading `abs_integrate`.  It seems that the problem arises in `ratsubst`, when substituting `1 + sinh(x)^2` for `cosh(x)^2`.  What makes it more tricky is that calling `ratsubst` directly with the same arguments gives a correct answer.  Possibly some flag is set at some intermediate point that triggers the bug.


---

Comment by pbruin created at 2014-05-28 17:43:56

Reported upstream: https://sourceforge.net/p/maxima/bugs/2737/


---

Comment by kcrisman created at 2014-12-08 15:00:50

See also #12731.


---

Comment by chapoton created at 2019-05-17 17:55:06

Changing keywords from "" to "abs_integrate".


---

Comment by chapoton created at 2019-08-24 14:25:41

Works (no wrong answer) in sage 8.9.b7 with py3:

```
sage: sage: a = integrate(sqrt(1-1/4*cosh(x)^2),x)
1/2*integrate(sqrt(-cosh(x)^2 + 4), x)
```



---

Comment by pbruin created at 2019-08-24 15:05:48

Also in 8.8:

```
┌────────────────────────────────────────────────────────────────────┐
│ SageMath version 8.8, Release Date: 2019-06-26                     │
│ Using Python 2.7.15. Type "help()" for help.                       │
└────────────────────────────────────────────────────────────────────┘
sage: a = integrate(sqrt(1-1/4*cosh(x)^2),x)
sage: a.full_simplify()
integrate(sqrt(-1/4*cosh(x)^2 + 1), x)
```

This is most likely due to #12731.  I'm not sure we should view this bug as being fixed; ideally, the answer should be given as an elliptic integral (see the ask.sagemath question).
