# Issue 16929: Add coercion complex -> CC

Issue created by migration from Trac.

Original creator: jdemeyer

Original creation time: 2014-10-16 17:42:12

CC:  robertwb

This works fine:

```
sage: CC(complex('13.8+6.2j'))
13.8000000000000 + 6.20000000000000*I
sage: CDF(complex('13.8+6.2j'))
13.8 + 6.2*I
```


However, it is a _conversion_ while it should be a _coercion_.

```
sage: CC.has_coerce_map_from(complex)
False
```

This is inconsistent with

```
sage: CC.has_coerce_map_from(float)
True
```



---

Comment by jdemeyer created at 2014-10-16 18:16:37

Changing status from new to needs_review.


---

Comment by jdemeyer created at 2014-10-16 18:16:37

New commits:


---

Comment by kcrisman created at 2014-10-16 19:07:12

What did the old doctest

```
a=matrix([[1, 1e-4r, 1+1e-100jr], [1e-8+3j, 0, 1e-58r]])
```

do with the changes in question if you didn't change the ring?  (I'm just wondering about breaking existing third-party code.)


---

Comment by jdemeyer created at 2014-10-16 19:10:32

Replying to [comment:3 kcrisman]:
> What did the old doctest
> {{{
> a=matrix([[1, 1e-4r, 1+1e-100jr], [1e-8+3j, 0, 1e-58r]])
> }}}
> do with the changes in question if you didn't change the ring?
Return a matrix over `CC` instead of `CDF`.


---

Comment by jdemeyer created at 2014-10-16 19:44:18

But your question makes sense: why should it have changed?


---

Comment by jdemeyer created at 2014-10-16 19:47:59

Replying to [comment:5 jdemeyer]:
> But your question makes sense: why should it have changed?
The change makes sense because the parent of the entry `1e-8+3j` is `CC`. Therefore, it is logical that the matrix is defined over `CC`.


---

Comment by vbraun created at 2014-10-18 16:07:42

IMHO the coercion should be complex -> CDF -> CC and not complex -> CC -> CDF. Pretty much the only difference is that the matrix would default to CDF, but since matrices over CDF are much more useful than matrices over CC this is probably what the user prefers.


---

Comment by jdemeyer created at 2014-10-19 17:04:59

Replying to [comment:7 vbraun]:
> IMHO the coercion should be complex -> CDF -> CC and not complex -> CC -> CDF.
Coercion goes both ways in this case (CDF -> CC and CC -> CDF), so the result is the same really. Interestingly, this has the following consequence:

```
sage: Sequence([CDF(1), CC(1)]).parent()
Category of sequences in Complex Double Field
sage: Sequence([CC(1), CDF(1)]).parent()
Category of sequences in Complex Field with 53 bits of precision
```


Let me know what you think, if you think the coercion should be added to `ComplexDoubleField._coerce_map_from()`, I could do that.


---

Comment by vbraun created at 2014-10-19 17:13:03

I also noticed that we have coercions both way CDF <-> CC. This sounds a bit wonky, IMHO it shoud be `ComplexField(>=53)` -> `CDF` -> `ComplexField(<53)`. Though this has been around for a long time, perhaps there is a deeper reason for that? Maybe Robert knows? Possibly stuff for another ticket, though.

What I originally meant was just that Python `complex` should coerce to CDF and not CC.


---

Comment by jdemeyer created at 2014-10-19 17:32:40

Replying to [comment:9 vbraun]:
> What I originally meant was just that Python `complex` should coerce to CDF and not CC. 
Having a coercion `complex -> CDF` and `CDF -> CC` but not `complex -> CC` sounds strange to me (isn't coercion supposed to be transitive?). Moreover, that would be inconsistent with

```
sage: RR.has_coerce_map_from(float)
True
sage: RDF.has_coerce_map_from(float)
True
```


Whatever the outcome of this ticket is, the behaviour of `complex / CDF / CC` should be the same as `float / RDF / RR`.


---

Comment by jdemeyer created at 2014-10-19 17:34:11

Replying to [comment:9 vbraun]:
> IMHO it shoud be `ComplexField(>=53)` -> `CDF` -> `ComplexField(<53)`.
I would prefer `CDF -> ComplexField(53)` simply because there are numbers in `CC` which cannot be represented in `CDF`:

```
sage: CC(1e1000)
1.00000000000000e1000
sage: CDF(1e1000)
+infinity
```



---

Comment by robertwb created at 2014-10-21 17:23:20

Yes, it should be `ComplexField(>53)` -> `CDF` -> `ComplexField(<=53)`. We should also have `complex` -> `CDF`. This does induce a coercion `complex` -> `ComplexField(<=53)`.


---

Comment by jdemeyer created at 2014-10-29 11:31:07

Can this ticket please be reviewed as just making `complex`/`CC` consistent with `float`/`RR`? Further discussions about changing coercion between `CC` and `CDF` can still go to another ticket.


---

Comment by tscrim created at 2014-11-04 00:08:07

I'm okay with pushing the issues with the other coercions to another ticket, and the current branch LGTM. So I'm setting a positive review.


---

Comment by tscrim created at 2014-11-04 00:08:14

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2014-11-15 16:22:27

Resolution: fixed
