# Issue 28329: improve conversions between Macaulay2 and Sage

Issue created by migration from https://trac.sagemath.org/ticket/28566

Original creator: @mwageringel

Original creation time: 2019-10-06 17:38:34

CC:  saliola dimpase @antonleykin

Keywords: macaulay2

This ticket implements and improves conversions between Macaulay2 and Sage:

• vectors/free module elements

• matrices: The function `InterfaceElement._matrix_()` is implemented to allow for this syntax:
  {{{
  sage: A = macaulay2('matrix {{1,2},{3,4}}')
  sage: matrix(QQ, A)
  [1 2]
  [3 4]
  }}}
  This ticket also fixes an issue where the elements are not promoted to the correct ring:
  {{{
  sage: R.<x,y> = QQ[]
  sage: m = macaulay2(matrix(R, [[1, 2], [3, 4]]))
  sage: m.ring()  # should be R
  ZZ
  }}}

• finite fields: An issue is fixed where the generator names are not preserved:
  {{{
  sage: K = GF(49, 'b')
  sage: K.gens(), macaulay2(K).gens()  # should be the same
  ((b,), {a})
  }}}



---

Comment by @mwageringel created at 2019-10-06 17:52:58

New commits:


---

Comment by @mwageringel created at 2019-10-06 20:48:46

Changing keywords from "macaulay2" to "macaulay2, IMA Coding Sprint".


---

Comment by git created at 2019-10-06 23:35:39

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by saliola created at 2019-10-06 23:46:47

I reviewed all the changes up to this point (​[602f6eb](https://git.sagemath.org/sage.git/commit?id=602f6eb2663bb4a3cce1da4d9f69ac5eceda8e05)) and have only a couple of minor suggestions for the presentation of doctests (see [ce24186](https://git.sagemath.org/sage.git/commit/?id=ce24186223fc5340a15d06b0a708a2f8ddb6e0f8)).

After discussions, it seems that instead of using `promote` in M2, one should use the `matrix(R,v)` constructor in M2; see [matrix(R,v) documentation for M2](https://faculty.math.illinois.edu/Macaulay2/doc/Macaulay2-1.12/share/doc/Macaulay2/Macaulay2Doc/html/_matrix_lp__Ring_cm__List_rp.html).

This also applies to constructing vectors: first construct a matrix in M2 over the correct base ring and then apply the vector command `vector(Matrix)`.


---

Comment by git created at 2019-10-07 17:24:26

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by @mwageringel created at 2019-10-07 17:25:52

Replying to [comment:4 saliola]:
> After discussions, it seems that instead of using `promote` in M2, one should use the `matrix(R,v)` constructor in M2; see [matrix(R,v) documentation for M2](https://faculty.math.illinois.edu/Macaulay2/doc/Macaulay2-1.12/share/doc/Macaulay2/Macaulay2Doc/html/_matrix_lp__Ring_cm__List_rp.html).
> 
> This also applies to constructing vectors: first construct a matrix in M2 over the correct base ring and then apply the vector command `vector(Matrix)`.

Thanks, I have changed it.


---

Comment by saliola created at 2019-10-10 19:14:17

Changing status from new to needs_review.


---

Comment by saliola created at 2019-10-10 19:14:29

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2019-10-12 22:12:30

Resolution: fixed
