# Issue 18082: coefficient in SR weirdness.

archive/issues_018082.json:
```json
{
    "body": "CC:  tscrim\n\nKeywords: coefficient\n\nIn Sage 6.5:\n\n\n```\nsage: var(\"a\")\na\nsage: (a+1).coefficient?\nObject `coefficient` not found.\nsage: (a+1).coefficient(a)\n0\nsage: (a+1)\na + 1\nsage: (a+1).coefficient(a)\n1\n```\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/18319\n\n",
    "created_at": "2015-04-28T09:53:40Z",
    "labels": [
        "symbolics",
        "major",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-duplicate/invalid/wontfix",
    "title": "coefficient in SR weirdness.",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/18082",
    "user": "mantepse"
}
```
CC:  tscrim

Keywords: coefficient

In Sage 6.5:


```
sage: var("a")
a
sage: (a+1).coefficient?
Object `coefficient` not found.
sage: (a+1).coefficient(a)
0
sage: (a+1)
a + 1
sage: (a+1).coefficient(a)
1
```


Issue created by migration from https://trac.sagemath.org/ticket/18319





---

archive/issue_comments_243630.json:
```json
{
    "body": "No similar weirdness with the current beta (6.7.\u03b23):\n\n\n```\nsage: var(\"a\")\na\nsage: (a+1).coefficient?\nObject `coefficient` not found.\nsage: (a+1).coefficient(a)\n1\nsage: (a+1)\na + 1\nsage: (a+1).coefficient(a)\n1\n```\n",
    "created_at": "2015-04-28T14:09:49Z",
    "issue": "https://github.com/sagemath/sagetest/issues/18082",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/18082#issuecomment-243630",
    "user": "mmezzarobba"
}
```

No similar weirdness with the current beta (6.7.Î²3):


```
sage: var("a")
a
sage: (a+1).coefficient?
Object `coefficient` not found.
sage: (a+1).coefficient(a)
1
sage: (a+1)
a + 1
sage: (a+1).coefficient(a)
1
```




---

archive/issue_comments_243631.json:
```json
{
    "body": "Great, thanks, and sorry for the noise!\n\nMartin",
    "created_at": "2015-04-28T16:14:11Z",
    "issue": "https://github.com/sagemath/sagetest/issues/18082",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/18082#issuecomment-243631",
    "user": "mantepse"
}
```

Great, thanks, and sorry for the noise!

Martin



---

archive/issue_comments_243632.json:
```json
{
    "body": "Actually there is still the issue why you don't get the help with `?`:\n\n```\nsage: x.coefficient?\nsage: (x+1).coefficient?\nObject `coefficient` not found.\nsage: (x+1).n?\n...this works...\n```\n",
    "created_at": "2015-05-03T06:31:25Z",
    "issue": "https://github.com/sagemath/sagetest/issues/18082",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/18082#issuecomment-243632",
    "user": "rws"
}
```

Actually there is still the issue why you don't get the help with `?`:

```
sage: x.coefficient?
sage: (x+1).coefficient?
Object `coefficient` not found.
sage: (x+1).n?
...this works...
```




---

archive/issue_comments_243633.json:
```json
{
    "body": "Changing component from symbolics to documentation.",
    "created_at": "2015-05-03T06:31:25Z",
    "issue": "https://github.com/sagemath/sagetest/issues/18082",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/18082#issuecomment-243633",
    "user": "rws"
}
```

Changing component from symbolics to documentation.



---

archive/issue_comments_243634.json:
```json
{
    "body": "If anything I'm surprised that `(x+1).n?` works: typically `obj.foo?` only works reliably if `obj` is a variable, and either raises an error or returns nonsense otherwise. For instance:\n\n```\nsage: (x.variables()).n?\nSignature:      n(x, prec=None, digits=None, algorithm=None)\nDocstring:\n   Returns a numerical approximation of an object \"x\" with at least\n   \"prec\" bits (or decimal \"digits\") of precision.\n...\nsage: (x.variables()).n()\n...\nAttributeError: 'tuple' object has no attribute 'n'\n```\n",
    "created_at": "2015-05-03T07:11:55Z",
    "issue": "https://github.com/sagemath/sagetest/issues/18082",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/18082#issuecomment-243634",
    "user": "mmezzarobba"
}
```

If anything I'm surprised that `(x+1).n?` works: typically `obj.foo?` only works reliably if `obj` is a variable, and either raises an error or returns nonsense otherwise. For instance:

```
sage: (x.variables()).n?
Signature:      n(x, prec=None, digits=None, algorithm=None)
Docstring:
   Returns a numerical approximation of an object "x" with at least
   "prec" bits (or decimal "digits") of precision.
...
sage: (x.variables()).n()
...
AttributeError: 'tuple' object has no attribute 'n'
```




---

archive/issue_comments_243635.json:
```json
{
    "body": "I propose to close this as invalid. Objections ?",
    "created_at": "2017-07-07T08:33:10Z",
    "issue": "https://github.com/sagemath/sagetest/issues/18082",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/18082#issuecomment-243635",
    "user": "chapoton"
}
```

I propose to close this as invalid. Objections ?



---

archive/issue_comments_243636.json:
```json
{
    "body": "Changing status from new to needs_review.",
    "created_at": "2017-07-07T08:33:10Z",
    "issue": "https://github.com/sagemath/sagetest/issues/18082",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/18082#issuecomment-243636",
    "user": "chapoton"
}
```

Changing status from new to needs_review.



---

archive/issue_comments_243637.json:
```json
{
    "body": "The `?` parsing is done by IPython, Sage is not involved in this. So this isn't a Sage bug, which is sufficient reason to close this.",
    "created_at": "2017-07-07T10:37:25Z",
    "issue": "https://github.com/sagemath/sagetest/issues/18082",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/18082#issuecomment-243637",
    "user": "jdemeyer"
}
```

The `?` parsing is done by IPython, Sage is not involved in this. So this isn't a Sage bug, which is sufficient reason to close this.



---

archive/issue_comments_243638.json:
```json
{
    "body": "Resolution: invalid",
    "created_at": "2017-07-07T10:41:46Z",
    "issue": "https://github.com/sagemath/sagetest/issues/18082",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/18082#issuecomment-243638",
    "user": "jdemeyer"
}
```

Resolution: invalid



---

archive/issue_comments_243639.json:
```json
{
    "body": "See https://github.com/ipython/ipython/issues/10694",
    "created_at": "2017-07-07T10:41:46Z",
    "issue": "https://github.com/sagemath/sagetest/issues/18082",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/18082#issuecomment-243639",
    "user": "jdemeyer"
}
```

See https://github.com/ipython/ipython/issues/10694
