# Issue 30961: Add dict method for boolean polynomials

Issue created by migration from https://trac.sagemath.org/ticket/31198

Original creator: slelievre

Original creation time: 2021-01-07 17:01:22

CC:  slelievre

Boolean polynomials lack a `dict` method
available for other polynomials.

This prevents expressing a multivariate polynomial
as a polynomial in one if its variables.

Initial report:

- [Ask Sage question 55168](https://ask.sagemath.org/question/55168)


---

Comment by slelievre created at 2021-01-08 09:11:44

Boolean polynomials also lack floor division and mod.

Define

```
sage: P = BooleanPolynomialRing(8, 'x')
sage: x = P.gens()
sage: p = x[1] * x[2] + x[1] * x[3] * x[5] + x[3] + x[7] * x[2]
sage: p
x1*x2 + x1*x3*x5 + x2*x7 + x3
```


Then:

```
sage: p // x[1]
Traceback (most recent call last)
...
TypeError: unsupported operand parent(s) for //:
'Boolean PolynomialRing in x0, x1, x2, x3, x4, x5, x6, x7' and
'Boolean PolynomialRing in x0, x1, x2, x3, x4, x5, x6, x7'

sage: p % x[1]
Traceback (most recent call last)
...
NotImplementedError:
```


But in fact `/` performs floor division:

```
sage: p / x[1]
x2 + x3*x5
```



---

Comment by mkoeppe created at 2021-02-13 20:51:01

Setting new milestone based on a cursory review of ticket status, priority, and last modification date.
