# Issue 25936: Conversion of non-commutative rings from Singular to Sage

Issue created by migration from Trac.

Original creator: SimonKing

Original creation time: 2018-09-01 17:44:27

I noticed that a non-commutative ring defined in the Singular pexpect interface is not correctly converted to a non-commutative polynomial ring in Sage:

```
sage: singular.LIB("nctools.lib")
sage: R = singular.ring(0,'(a,b,c,d)','dp')
sage: singular('basering')
polynomial ring, over a field, global ordering
// coefficients: QQ
// number of vars : 4
//        block   1 : ordering dp
//                  : names    a b c d
//        block   2 : ordering C
sage: NC = singular.superCommutative(2)
sage: NC.set_ring()
sage: singular('basering')
polynomial ring, over a field, global ordering
// coefficients: QQ
// number of vars : 4
//        block   1 : ordering dp
//                  : names    a b c d
//        block   2 : ordering C
// noncommutative relations:
//    cb=-b*c
//    db=-b*d
//    dc=-c*d
// quotient ring from ideal
_[1]=d^2
_[2]=c^2
_[3]=b^2
sage: NC.sage()
Quotient of Multivariate Polynomial Ring in a, b, c, d over Rational Field by the ideal (d^2, c^2, b^2)
sage: _.is_commutative()
True
```

That ought to be fixed!
