# Issue 16532: Conversion RR -> QQ wrong for exact integers

archive/issues_016532.json:
```json
{
    "body": "This real number can be exactly represented by the integer (and also rational) `2^54`, so this is off by one:\n\n```\nsage: QQ(RR(2^54))\n18014398509481983\n```\n\n\nThe underlying function called by `QQ()` is `simplest_rational`:\n\n```\nsage: RR(2^54).simplest_rational()\n18014398509481983\n```\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/16769\n\n",
    "created_at": "2014-08-06T08:12:24Z",
    "labels": [
        "basic arithmetic",
        "major",
        "bug"
    ],
    "title": "Conversion RR -> QQ wrong for exact integers",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/16532",
    "user": "jdemeyer"
}
```
This real number can be exactly represented by the integer (and also rational) `2^54`, so this is off by one:

```
sage: QQ(RR(2^54))
18014398509481983
```


The underlying function called by `QQ()` is `simplest_rational`:

```
sage: RR(2^54).simplest_rational()
18014398509481983
```


Issue created by migration from https://trac.sagemath.org/ticket/16769





---

archive/issue_comments_217530.json:
```json
{
    "body": "` RR(2^54) ` is an exact integer although not an instance of `Integer` here. Conversion of `RealNumber` to `Rational` should yield its integral value. What if we check whether `RR(2^54)` or any `RealNumber` in general is an exact integer before returning it as `Rational` ?",
    "created_at": "2016-02-06T17:48:44Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16532",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16532#issuecomment-217530",
    "user": "ajagekar.akshay"
}
```

` RR(2^54) ` is an exact integer although not an instance of `Integer` here. Conversion of `RealNumber` to `Rational` should yield its integral value. What if we check whether `RR(2^54)` or any `RealNumber` in general is an exact integer before returning it as `Rational` ?



---

archive/issue_comments_217531.json:
```json
{
    "body": "Replying to [comment:3 ajagekar.akshay]:\n> ` RR(2^54) ` is an exact integer although not an instance of `Integer` here. Conversion of `RealNumber` to `Rational` should yield its integral value. What if we check whether `RR(2^54)` or any `RealNumber` in general is an exact integer before returning it as `Rational` ?\n\nThat would solve this particular case but I'm doubting if that is general enough.",
    "created_at": "2016-02-06T20:24:11Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16532",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16532#issuecomment-217531",
    "user": "jdemeyer"
}
```

Replying to [comment:3 ajagekar.akshay]:
> ` RR(2^54) ` is an exact integer although not an instance of `Integer` here. Conversion of `RealNumber` to `Rational` should yield its integral value. What if we check whether `RR(2^54)` or any `RealNumber` in general is an exact integer before returning it as `Rational` ?

That would solve this particular case but I'm doubting if that is general enough.



---

archive/issue_comments_217532.json:
```json
{
    "body": "Replying to [comment:4 jdemeyer]:\n> Replying to [comment:3 ajagekar.akshay]:\n> > ` RR(2^54) ` is an exact integer although not an instance of `Integer` here. Conversion of `RealNumber` to `Rational` should yield its integral value. What if we check whether `RR(2^54)` or any `RealNumber` in general is an exact integer before returning it as `Rational` ?\n> \n> That would solve this particular case but I'm doubting if that is general enough.\nCan you give some examples where this will not work ?",
    "created_at": "2016-02-07T07:11:13Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16532",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16532#issuecomment-217532",
    "user": "ajagekar.akshay"
}
```

Replying to [comment:4 jdemeyer]:
> Replying to [comment:3 ajagekar.akshay]:
> > ` RR(2^54) ` is an exact integer although not an instance of `Integer` here. Conversion of `RealNumber` to `Rational` should yield its integral value. What if we check whether `RR(2^54)` or any `RealNumber` in general is an exact integer before returning it as `Rational` ?
> 
> That would solve this particular case but I'm doubting if that is general enough.
Can you give some examples where this will not work ?



---

archive/issue_comments_217533.json:
```json
{
    "body": "Any element of RR of absolute value at least 2<sup>52</sup> can be expressed \"exactly\" as an integer:\n\n```\nsage: a=RR(2^52)\nsage: s,m,e=a.sign_mantissa_exponent()\nsage: s,m,e\n(1, 4503599627370496, 0)\nsage: s*m*2^e == a\nTrue\n```\n\nsimply because `e` will be non-negative for such numbers.\nIndeed, any float can be expressed exactly as a rational number: it's the number `s*m*2^e` that is used internally. The reason why we're not using that is basically this:\n\n```\nsage: a=RR(1/3)\nsage: s,m,e=a.sign_mantissa_exponent()\nsage: s*m*2^e\n6004799503160661/18014398509481984\n```\n\nIt's much nicer to get `1/3` back.\n\nIndeed, the definition of \"simplest rational\" doesn't seem so useful anymore by the time you enter the range where the denominator is guaranteed to be 1. However, depending on getting an exact number back after going through RR is almost certainly a bug somewhere. So I don't think we should go out of our way to guarantee it. If you absolutely want access to the internal representation, there's `sign_mantissa_exponent` anyway.\n\nThe key is, the map `ZZ->RR` is not injective. So any section in the other direction is not going to compose to the identity on `ZZ`. It's basically an implementation detail that `ZZ(2^54)` maps to an element in `RR` that internally is represented by something that amounts to exactly that integer.",
    "created_at": "2016-02-07T22:11:46Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16532",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16532#issuecomment-217533",
    "user": "nbruin"
}
```

Any element of RR of absolute value at least 2<sup>52</sup> can be expressed "exactly" as an integer:

```
sage: a=RR(2^52)
sage: s,m,e=a.sign_mantissa_exponent()
sage: s,m,e
(1, 4503599627370496, 0)
sage: s*m*2^e == a
True
```

simply because `e` will be non-negative for such numbers.
Indeed, any float can be expressed exactly as a rational number: it's the number `s*m*2^e` that is used internally. The reason why we're not using that is basically this:

```
sage: a=RR(1/3)
sage: s,m,e=a.sign_mantissa_exponent()
sage: s*m*2^e
6004799503160661/18014398509481984
```

It's much nicer to get `1/3` back.

Indeed, the definition of "simplest rational" doesn't seem so useful anymore by the time you enter the range where the denominator is guaranteed to be 1. However, depending on getting an exact number back after going through RR is almost certainly a bug somewhere. So I don't think we should go out of our way to guarantee it. If you absolutely want access to the internal representation, there's `sign_mantissa_exponent` anyway.

The key is, the map `ZZ->RR` is not injective. So any section in the other direction is not going to compose to the identity on `ZZ`. It's basically an implementation detail that `ZZ(2^54)` maps to an element in `RR` that internally is represented by something that amounts to exactly that integer.
