# Issue 24643: gcd is not commutative (on rationals)

Issue created by migration from https://trac.sagemath.org/ticket/24880

Original creator: vdelecroix

Original creation time: 2018-03-01 19:02:38

CC:  rws

Keywords: days83


```
sage: gcd([1/1,1/2])
1
sage: gcd([1/2,1/1])
1/2
```

Though the gcd is perfectly well defined on rationals

```
sage: (1/1).gcd(1/2)
1/2
sage: (1/2).gcd(1/1)
1/2
```



---

Comment by rws created at 2018-03-02 07:22:59

It's because the loop through the sequence is interrupted as soon as the partial GCD is one, which is only valid for integer GCD:

```
    for vi in v:
        g = vi.gcd(g, **kwargs)
        if g == one:
            return g
```



---

Comment by vklein created at 2018-04-03 13:29:38

Changing status from new to needs_review.


---

Comment by vklein created at 2018-04-03 13:29:38


```
if g == one:
            return g
```

has been removed. 
----
New commits:


---

Comment by slabbe created at 2018-04-05 08:04:58

Changing status from needs_review to needs_work.


---

Comment by slabbe created at 2018-04-05 08:04:58

Documentation won't build correctly as you need double `::` before a doctest block of code (after `TESTS`).


---

Comment by slabbe created at 2018-04-05 08:05:55

Changing keywords from "days83" to "days83, thursdaysbdx".


---

Comment by git created at 2018-04-05 08:44:05

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by vklein created at 2018-04-05 08:45:01

Changing status from needs_work to needs_review.


---

Comment by vklein created at 2018-04-05 08:45:01

Replying to [comment:5 slabbe]:
> Documentation won't build correctly as you need double `::` after a doctest block of code (after `TESTS`).

Fixed


---

Comment by jdemeyer created at 2018-04-05 08:56:56

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2018-05-08 17:27:50

Resolution: fixed
