# Issue 15552: Translation from Maxima seems to fail on some big big numbers

archive/issues_015552.json:
```json
{
    "body": "At [this ask.sagemath question](http://ask.sagemath.org/question/3499/looong-computation-by-desolve_rk4), the following issue came up.\n\n```\n    sage: desolve_rk4(f(t,y), y, ivar=t, ics=[0,-4], end_points=[0,.4])\n    [[0, -4],\n     [0.1, -6.44026308551],\n     [0.2, -18.4360863753],\n     [0.3, -9638.98851821],\n     [0.4, -2.29907718472e+44]]\n```\n\nworks, but \n\n```\n    sage: desolve_rk4(f(t,y), y, ivar=t, ics=[0,-4], end_points=[0,.5])\n    TypeError: unable to make sense of Maxima expression '[[0,-4],[0.1,-6.440263085506939],[0.2,-18.436086375306434],[.30000000000000004,-9638.988518207414],[0.4,-229907718471530700000000000000000000000000000.],[0.5,-.000000000000000.000000000000000]]' in Sage\n```\n\nand indeed `-.000000000000000.000000000000000` makes no sense inside of Sage.  I'm not sure what it's supposed to mean in Maxima, either!\n\nHere is the problem, in Maxima.\n\n```\n    (%i1) rk(6+y-y^2,y,-4,[t,0,.5,.1]);\n    (%o1) [[0, - 4], [0.1, - 6.440263085506939], [0.2, - 18.436086375306434], \n    [.30000000000000004, - 9638.988518207414], [0.4, - 2.2990771847153071e+44], \n    [0.5, - .000000000000000e+4932]]\n```\n\n\nI'm not sure exactly what is going on in Sage here, because\n\n```\nsage: a = maxima('- 2.2990771847153071e+44')\nsage: a._sage_()\n-2.29907718472e+44\nsage: b = maxima(' - .000000000000000e+4932')\nsage: b._sage_()\n0.0\n```\n\nso it must be something about how these are translated.\n\nIssue created by migration from https://trac.sagemath.org/ticket/15789\n\n",
    "created_at": "2014-02-05T20:16:39Z",
    "labels": [
        "interfaces",
        "major",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-6.4",
    "title": "Translation from Maxima seems to fail on some big big numbers",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/15552",
    "user": "@kcrisman"
}
```
At [this ask.sagemath question](http://ask.sagemath.org/question/3499/looong-computation-by-desolve_rk4), the following issue came up.

```
    sage: desolve_rk4(f(t,y), y, ivar=t, ics=[0,-4], end_points=[0,.4])
    [[0, -4],
     [0.1, -6.44026308551],
     [0.2, -18.4360863753],
     [0.3, -9638.98851821],
     [0.4, -2.29907718472e+44]]
```

works, but 

```
    sage: desolve_rk4(f(t,y), y, ivar=t, ics=[0,-4], end_points=[0,.5])
    TypeError: unable to make sense of Maxima expression '[[0,-4],[0.1,-6.440263085506939],[0.2,-18.436086375306434],[.30000000000000004,-9638.988518207414],[0.4,-229907718471530700000000000000000000000000000.],[0.5,-.000000000000000.000000000000000]]' in Sage
```

and indeed `-.000000000000000.000000000000000` makes no sense inside of Sage.  I'm not sure what it's supposed to mean in Maxima, either!

Here is the problem, in Maxima.

```
    (%i1) rk(6+y-y^2,y,-4,[t,0,.5,.1]);
    (%o1) [[0, - 4], [0.1, - 6.440263085506939], [0.2, - 18.436086375306434], 
    [.30000000000000004, - 9638.988518207414], [0.4, - 2.2990771847153071e+44], 
    [0.5, - .000000000000000e+4932]]
```


I'm not sure exactly what is going on in Sage here, because

```
sage: a = maxima('- 2.2990771847153071e+44')
sage: a._sage_()
-2.29907718472e+44
sage: b = maxima(' - .000000000000000e+4932')
sage: b._sage_()
0.0
```

so it must be something about how these are translated.

Issue created by migration from https://trac.sagemath.org/ticket/15789





---

archive/issue_comments_200960.json:
```json
{
    "body": "Does this help?\n\n```\nsage: E=maxima_calculus('rk(6+y-y^2,y,-4,[t,0,.5,.1])')\nsage: E.ecl()\n<ECL: ((MLIST SIMP) ((MLIST SIMP) 0 -4) ((MLIST SIMP) 0.1 -6.440263085506939)\n ((MLIST SIMP) 0.2 -18.436086375306434)\n ((MLIST SIMP) 0.30000000000000004 -9638.988518207414)\n ((MLIST SIMP) 0.4 -2.299077184715307e44)\n ((MLIST SIMP) 0.5 #.ext::double-float-negative-infinity))>\n```\n\nit seems to be ECL's own IEEE negative infinity, which seems to get handled a little strange by maxima.",
    "created_at": "2014-02-06T06:17:35Z",
    "issue": "https://github.com/sagemath/sagetest/issues/15552",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/15552#issuecomment-200960",
    "user": "@nbruin"
}
```

Does this help?

```
sage: E=maxima_calculus('rk(6+y-y^2,y,-4,[t,0,.5,.1])')
sage: E.ecl()
<ECL: ((MLIST SIMP) ((MLIST SIMP) 0 -4) ((MLIST SIMP) 0.1 -6.440263085506939)
 ((MLIST SIMP) 0.2 -18.436086375306434)
 ((MLIST SIMP) 0.30000000000000004 -9638.988518207414)
 ((MLIST SIMP) 0.4 -2.299077184715307e44)
 ((MLIST SIMP) 0.5 #.ext::double-float-negative-infinity))>
```

it seems to be ECL's own IEEE negative infinity, which seems to get handled a little strange by maxima.
