# Issue 1907: matrix nullity returns wrong value

Issue created by migration from https://trac.sagemath.org/ticket/1907

Original creator: AlexGhitza

Original creation time: 2008-01-24 03:43:52

Assignee: was

The nullity() function for matrices is supposed to return the dimension of the kernel, but:


```
sage: M=Matrix(QQ,[[1,0,0,1],[0,1,1,0],[1,1,1,0]])
sage: M.nullity()
1
sage: M.kernel().dimension()
0
```


The correct value is indeed 0.



---

Comment by AlexGhitza created at 2008-01-24 04:10:04

Sorry, I should sleep more before filing bugs.  The nullity is indeed 1.  It is the kernel() function that seems to be broken.  For the matrix in question, it should be one-dimensional generated by [0,1,-1,0].


```
sage: M=Matrix(QQ,[[1,0,0,1],[0,1,1,0],[1,1,1,0]])
sage: M

[1 0 0 1]
[0 1 1 0]
[1 1 1 0]
sage: M.kernel()

Vector space of degree 3 and dimension 0 over Rational Field
Basis matrix:
[]
```



---

Comment by AlexGhitza created at 2008-01-24 04:25:38

OK, so it's again a left-versus-right thing, see #1607.  But the documentation for nullity() clearly states that it is the dimension of the kernel(), which definitely is not happening at the moment, so we need to do something about it.


---

Comment by was created at 2008-01-24 05:02:05

Changing status from new to assigned.


---

Attachment

Looks good, applies cleanly against sage-2.10.3.rc3, and passes tests.


---

Comment by mabshoff created at 2008-03-12 22:04:20

Merged in Sage 2.10.4.alpha0


---

Comment by mabshoff created at 2008-03-12 22:04:20

Resolution: fixed
