# Issue 10993: Crashes when constructing algebraic numbers using Matrix.eigenvectors

Issue created by migration from Trac.

Original creator: jsrn

Original creation time: 2011-04-06 10:44:56

Assignee: AlexGhitza

CC:  tjolivet

Keywords: matrix, eigenvectors

With certain constructions of algebraic numbers, the numbers exhibit very weird behaviour and crashes in almost any interaction.


```

sage: M = matrix(3, [0,0,1,1,0,1,0,1,0]) 
sage: y = M.eigenvectors_left()[1][1][0]
sage: a = abs(y[1])
sage: a
0.868836961832710?
sage: type(a)
<class 'sage.rings.qqbar.AlgebraicReal'>
sage: a.minpoly()
...
TypeError: Unable to convert number to real interval.
sage: a*a == a*a
...
TypeError: Unable to convert number to real interval.

```


When constructing the above number by more direct methods, it seems to be alright:


```
sage: R.<x> = QQbar[x]
sage: exp = x^3-x-1
sage: y1 = exp.roots()[1][0]
sage: a = abs(y1)
sage: a
0.868836961832710?
sage: a.minpoly()
x^6 + x^4 - 1
sage: a*a == a*a
True

```


I don't know if the error is pertaining to eigenvectors, AlgebraicNumber, AlgebraicReal, abs, or a combination of these.


---

Comment by mmezzarobba created at 2013-08-06 09:59:50

Works now (sage-5.11.rc0). Probably a duplicate of #12727.


---

Comment by mmezzarobba created at 2013-08-06 09:59:50

Changing status from new to needs_review.


---

Comment by chapoton created at 2013-09-22 18:30:13

Indeed, this has been solved.


---

Comment by chapoton created at 2013-09-22 18:30:13

Changing status from needs_review to positive_review.


---

Comment by jdemeyer created at 2013-10-05 09:44:21

Resolution: worksforme
