# Issue 10007: List / Iter on the element of a MatrixGroup over number field.

Issue created by migration from Trac.

Original creator: nborie

Original creation time: 2010-09-24 20:40:19

Assignee: joyner

All is in this log


```
sage: K = CyclotomicField(3)
sage: t = K.gen()
sage: M = Matrix([[1,0,0],[0,t,0],[0,0,t^2]])
sage: G = MatrixGroup([M])
sage: G.list()
---------------------------------------------------------------------------
AttributeError                            Traceback (most recent call last)

/home/nicolas/<ipython console> in <module>()

/opt/sage/local/lib/python2.6/site-packages/sage/groups/matrix_gps/matrix_group.pyc in list(self)
    573         n = F.degree()
    574         p = F.characteristic()
--> 575         a = F.prime_subfield().multiplicative_generator()
    576         b = F.multiplicative_generator()
    577 

/opt/sage/local/lib/python2.6/site-packages/sage/structure/parent.so in sage.structure.parent.Parent.__getattr__ (sage/structure/parent.c:5501)()

/opt/sage/local/lib/python2.6/site-packages/sage/structure/parent.so in sage.structure.parent.getattr_from_other_class (sage/structure/parent.c:2765)()

/opt/sage/local/lib/python2.6/site-packages/sage/structure/parent.so in sage.structure.parent.raise_attribute_error (sage/structure/parent.c:2637)()

AttributeError: 'RationalField_with_category' object has no attribute 'multiplicative_generator'
sage: G.cardinality()
3
sage: [Matrix(K,m) for m in gap(G).List()]
[
[         1          0          0]  [         1          0          0]
[         0 -zeta3 - 1          0]  [         0      zeta3          0]
[         0          0      zeta3], [         0          0 -zeta3 - 1],

[1 0 0]
[0 1 0]
[0 0 1]
]
```



---

Comment by davidloeffler created at 2011-03-13 19:22:12

Changing status from new to needs_review.


---

Comment by davidloeffler created at 2011-03-13 19:22:12

The above example works for me in sage 4.6.2 (probably because of #9437):

```
sage: K = CyclotomicField(3)
sage: t = K.gen()
sage: M = Matrix([[1,0,0],[0,t,0],[0,0,t^2]])
sage: G = MatrixGroup([M])
sage: G.list()
[[1 0 0]
[0 1 0]
[0 0 1], [         1          0          0]
[         0 -zeta3 - 1          0]
[         0          0      zeta3], [         1          0          0]
[         0      zeta3          0]
[         0          0 -zeta3 - 1]]
```


Release manager: please close as fixed.


---

Comment by davidloeffler created at 2011-03-13 19:22:27

Changing status from needs_review to positive_review.


---

Comment by nborie created at 2011-03-13 19:40:53

Thanks for the update.

I confirm that the old piece of code which make me fall on this bug is now running fairly without the hack asking Gap directly for this computation.


---

Comment by jdemeyer created at 2011-04-05 16:03:56

Resolution: worksforme
