# Issue 18990: Graphs: DFS and broken distance-parameter

Issue created by migration from Trac.

Original creator: jmantysalo

Original creation time: 2015-09-17 04:20:48

CC:  ncohen vbraun

This bug is visible at least on normal 64-bit Linux machine running self-compiled Sage. Might be architechture-dependent.


```
G = DiGraph({1:[2,10],2:[3],3:[4],4:[5],5:[6],10:[4]})
list(G.depth_first_search(1, distance=3))
```


This should output also `5` as it is three jumps from 1: `1->10->4->5`. It is not outputted because `4` is already marked as seen vertex for `1->2->3->4`.

I found this when doing #19197 and there is already some discussion about it. I suspect that this might be used  in other places too, and that must be checked first.

Also note that #19223 might have collision as the fix may touch almost same lines.


---

Comment by jmantysalo created at 2015-09-17 10:49:01

Accidentally I tested what happens if I remove `distance` from `breadth_first_search`. Nothing: all doctests, except the function's own, were successfull. Hence `breadth()` in `lattices.py` is first one to use the parameter.

It also seems that `distance` at `depth_first_search()` is unused. I am running doctests, but plain grep shows no matches. Hence I guess we can just deprecate this.


---

Comment by jmantysalo created at 2015-09-17 11:29:34

I had to delete and modify some examples. Otherwise this just gives deprecation warning.
----
New commits:


---

Comment by jmantysalo created at 2015-09-17 11:29:34

Changing status from new to needs_review.


---

Comment by ncohen created at 2015-09-18 07:05:54

Err.. Given that it is is broken, that the output is architecture-dependent, and that people may have a misleading idea about what it does, why don't we just remove it? Volker repeats often enough that "we don't need to deprecate bugs". I only hope that in this case we agree that it is a bug (which isn't always the case when Volker uses that argument).

Nathann


---

Comment by jmantysalo created at 2015-09-18 07:17:58

Replying to [comment:4 ncohen]:
> Err.. Given that it is is broken, that the output is architecture-dependent, and that people may have a misleading idea about what it does, why don't we just remove it? Volker repeats often enough that "we don't need to deprecate bugs". I only hope that in this case we agree that it is a bug (which isn't always the case when Volker uses that argument).

Vbraun added to CC.

I am not exactly sure what counts as a bug and what not. See #18944.

I think that somebody might have code that uses this, maybe even working code (i.e. using DFS with `distance` only for trees). Can we give deprecation warning AND raise and exception? Then the user would at least know what has happened and why the code does not work any more.

Volker, #19197 contains some discussion about this; that is where Nathann saw this bug.


---

Comment by dcoudert created at 2015-09-20 10:13:39

Hello,

the behavior of the `G.depth_first_search(1, distance=3)` is not machine dependent but it depends on the labels of the vertices which define an ordering between vertices. So if you relabel `10->1` and `1->10` in your example, you will get different result.

I don't see a bug here, I see a definition problem: what are we expecting?
If we are not able to provide a clear definition of the expected behavior of the `distance` parameter, we should not have it in DFS.

David.


---

Comment by jmantysalo created at 2015-09-20 10:50:49

Replying to [comment:6 dcoudert]:

> the behavior of the `G.depth_first_search(1, distance=3)` is not machine dependent but it depends on the labels of the vertices which define an ordering between vertices.

So if you have labels `42` and `'hello!'`, it is machine-dependent.


---

Comment by ncohen created at 2015-09-20 11:36:48

> I don't see a bug here, I see a definition problem: what are we expecting?
> If we are not able to provide a clear definition of the expected behavior of the `distance` parameter, we should not have it in DFS.

I agree with that, the fact that it is architecture-dependent is merely a way to show that we will never find a clear explanation of what can be expected.

The other reason is that this being named 'distance' is very misleading.

Nathann


---

Comment by dcoudert created at 2015-09-20 11:41:23

Now I agree that not only we don't have a proper definition, but also that the result is machine-dependent.

on my mac:

```
sage: 42>'hello!'
True
```

on a linux desktop I have 

```
sage: 42>'hello!'
False
```



Could you:
- add your name as author
- change in the ticket description, `This should output` -> `This could output`.
- To show that the DFS can go backward, you could provide a simpler (and machine-independent) example, instead of this of `sorted([d_in.next(), d_in.next(), d_in.next()])`:

```
sage: D = digraphs.Path(10)
sage: list(D.depth_first_search(5, neighbors=D.neighbors_in))
[5, 4, 3, 2, 1, 0]
sage: list(D.depth_first_search(5, neighbors=D.neighbors_out))
[5, 6, 7, 8, 9]
```


Thanks.
David.


---

Comment by jmantysalo created at 2015-09-20 11:57:35

Changing status from needs_review to needs_work.


---

Comment by jmantysalo created at 2015-09-20 11:57:35

I can make a better example later, when I am on faster computer.

But is plain path a good example? It won't show any difference between `depth_first_search()` and `breadth_first_search()`.

Of course you can also do this; we can cross-review our codes.


---

Comment by dcoudert created at 2015-09-20 14:47:12

Could this be ok?

```
sage: D = digraphs.Path(10)
sage: D.add_path([22,23,24,5])
sage: D.add_path([5,33,34,35])
sage: list(D.depth_first_search(5, neighbors=D.neighbors_in))
[5, 4, 3, 2, 1, 0, 24, 23, 22]
sage: list(D.breadth_first_search(5, neighbors=D.neighbors_in))
[5, 24, 4, 23, 3, 22, 2, 1, 0]
sage: list(D.depth_first_search(5, neighbors=D.neighbors_out))
[5, 6, 7, 8, 9, 33, 34, 35]
sage: list(D.breadth_first_search(5, neighbors=D.neighbors_out))
[5, 33, 6, 34, 7, 35, 8, 9]
```



---

Comment by jmantysalo created at 2015-09-20 15:03:21

Replying to [comment:11 dcoudert]:
> Could this be ok?

Seems good example to me. Nathann is a specialist in graphs, so maybe I'll also wait to see if he sees something wrong with that.


---

Comment by ncohen created at 2015-09-20 15:52:29

> Seems good example to me. Nathann is a specialist in graphs, so maybe I'll also wait to see if he sees something wrong with that.

Err. Well. David is the head of the team in which I work these days. I have not followed your recent exchanges on the possible outputs of the faulty command, but if you need the reassurance of a graph specialist you needn't look further.

Nathann


---

Comment by jmantysalo created at 2015-09-20 15:59:58

Replying to [comment:13 ncohen]:

> Err. Well. David is the head of the team in which I work these days. I have not followed your recent exchanges on the possible outputs of the faulty command, but if you need the reassurance of a graph specialist you needn't look further.

OK. Let's say "specialist in graph theory with SageMath" `:=)`. Anyways, I will add that example. (Assuming I got this compiled... had to say `make distclean`, something has gone wrong when `make` was interrupted.)


---

Comment by git created at 2015-09-20 18:02:03

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by dcoudert created at 2015-09-20 21:11:44

Don't forget to set the ticket to `needs review` when ready.
David.


---

Comment by jmantysalo created at 2015-09-21 03:49:39

Changing status from needs_work to needs_review.


---

Comment by jmantysalo created at 2015-09-21 03:49:39

Replying to [comment:16 dcoudert]:
> Don't forget to set the ticket to `needs review` when ready.

Now it is, compiles and tests passed and html manual builds. (Got `ImportError` from `Config`?? Recompiled everything.)


---

Comment by dcoudert created at 2015-09-21 16:46:30

Changing status from needs_review to positive_review.


---

Comment by dcoudert created at 2015-09-21 16:46:30

For me the patch is good to go.
Thanks,
David.


---

Comment by vbraun created at 2015-09-22 14:49:09

Resolution: fixed
