# Issue 19778: Matrix: check keyword arguments

Issue created by migration from Trac.

Original creator: jdemeyer

Original creation time: 2016-02-05 17:21:51

CC:  ncohen


```
sage: Matrix(whatever=53)
[]
```



---

Comment by jdemeyer created at 2016-02-06 12:38:52

Changing status from new to needs_review.


---

Comment by jdemeyer created at 2016-02-06 12:38:52

New commits:


---

Comment by nbruin created at 2016-02-16 07:55:22

In this line:

```
 arg = [[arg(i,j) for j in range(ncols)] for i in range(nrows)]
```

can we use srange? This came up on [sage-support](https://groups.google.com/d/msg/sage-support/x82MR4yBAek/R3ZBNOsCAQAJ)


---

Comment by jdemeyer created at 2016-02-16 15:53:01

Changing status from needs_review to needs_work.


---

Comment by jdemeyer created at 2016-02-16 15:56:22

Replying to [comment:11 nbruin]:
> This came up on [sage-support](https://groups.google.com/d/msg/sage-support/x82MR4yBAek/R3ZBNOsCAQAJ)

Not really, that was a different issue with `range` vs. `srange`, unrelated to the matrix constructor. But of course you are right that we should use Sage integers.


---

Comment by git created at 2016-03-11 12:35:40

Branch pushed to git repo; I updated commit sha1. This was a forced push. New commits:


---

Comment by git created at 2016-03-11 14:47:21

Branch pushed to git repo; I updated commit sha1. This was a forced push. New commits:


---

Comment by jdemeyer created at 2016-03-11 14:48:45

Changing status from needs_work to needs_review.


---

Comment by jdemeyer created at 2016-03-11 17:27:59

Replying to [comment:11 nbruin]:
> In this line:
> {{{
>  arg = [[arg(i,j) for j in range(ncols)] for i in range(nrows)]
> }}}
> can we use srange?

Done.


---

Comment by vdelecroix created at 2016-03-12 14:43:40

For some input we get strange error messages

```
sage: matrix(ZZ,2,3,1)
...
TypeError: self must be a space of square matrices
```

And some strange input might actually gives a matrix

```
sage: matrix(RR, 1.5, 2.3)
[0.000000000000000 0.000000000000000]
```

With cythonization, we could use `sage.misc.long.pyobject_to_long`.


---

Comment by git created at 2016-03-14 05:22:45

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by jdemeyer created at 2016-03-14 05:23:20

Vincent, this fixes the two issues you mentioned. I have not yet ran all doctests.


---

Comment by vdelecroix created at 2016-03-14 12:58:31

Changing status from needs_review to needs_work.


---

Comment by vdelecroix created at 2016-03-14 12:58:31

One trivial doctest fails in `misc/sageinspect.py`.


---

Comment by git created at 2016-03-14 13:09:14

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by jdemeyer created at 2016-03-14 13:10:47

Changing status from needs_work to needs_review.


---

Comment by vdelecroix created at 2016-03-14 13:31:58

The error message does not correspond to what is happening with other entries

```
sage: matrix(QQ,2,2,0)
[0 0]
[0 0]
sage: matrix(QQ,2,2,0.0)
[0 0]
[0 0]
sage: matrix(QQ,2,2,'0')
[0 0]
[0 0]
sage: matrix(QQ,2,2,'0.0')
...
TypeError: entries must be coercible to a list or integer
```

If the data must be coercible then the last 3 should fail. Though, if the ring is provided I would be less strict and also allow conversion (and make all the above work).

The following should either work or not work for all rings

```
sage: matrix(QQ,2,2,'3')
[3 0]
[0 3]
sage: matrix(RBF,2,2,'3')
[3.000000000000000                 0]
[                0 3.000000000000000]
sage: matrix(ZZ,2,2,'3')
...
TypeError: entries has the wrong length
sage: matrix(QQbar,2,2,'3')
...
TypeError: entries has the wrong length
```

(there is something weird above since `QQbar('3')` does not work but `ZZ('3')` does)

Similarly, some rings are less strict about input conversion/coercion

```
sage: matrix(QQbar,2,2,3.0)
...
TypeError: entries must be coercible to a list or the base ring
sage: matrix(ZZ,2,2,3.0)
[3 0]
[0 3]
```



---

Comment by jdemeyer created at 2016-03-15 09:13:37

Replying to [comment:25 vdelecroix]:
> Similarly, some rings are less strict about input conversion/coercion
> {{{
> sage: matrix(QQbar,2,2,3.0)
> ...
> TypeError: entries must be coercible to a list or the base ring
> sage: matrix(ZZ,2,2,3.0)
> [3 0]
> [0 3]
> }}}
That is certainly outside the scope of this ticket. The matrix constructor should obviously just call `QQbar(3.0)` or `ZZ(3.0)` and let the parent ring deal with it.


---

Comment by jdemeyer created at 2016-03-15 09:57:25

Replying to [comment:25 vdelecroix]:
> {{{
> sage: matrix(QQbar,2,2,'3')
> ...
> TypeError: entries has the wrong length
> }}}

This is actually due to Python treating strings as some kind of list. Really, there is very little difference between `"abcd"` and `["a", "b", "c", "d"]`. So we unless we explicitly blacklist strings (which I don't want to do), I think this error is unavoidable.


---

Comment by jdemeyer created at 2016-03-15 10:14:50

Vincent, the problems you mention in [comment:25] are really in the `__init__` method of the various matrix classes, not the matrix constructor. So I would like to consider that for a follow-up ticket #20211.


---

Comment by vdelecroix created at 2016-03-15 11:38:13

Fine for me. Could you at least replace "coerce" by "convert" in the error message?

The following should be coherent between various ring as well

```
sage: matrix(ZZ,2,2,'1234')
[1 2]
[3 4]
sage: matrix(QQ,2,2,'1234')
[1234    0]
[   0 1234]
```



---

Comment by jdemeyer created at 2016-03-15 12:53:40

Replying to [comment:29 vdelecroix]:
> Fine for me. Could you at least replace "coerce" by "convert" in the error message?
> 
> The following should be coherent between various ring as well
> {{{
> sage: matrix(ZZ,2,2,'1234')
> [1 2]
> [3 4]
> sage: matrix(QQ,2,2,'1234')
> [1234    0]
> [   0 1234]
> }}}

Can we please leave both of these for #20211? This ticket deals with the higher-level matrix constructor, not with how matrices are initialized from the given entries.


---

Comment by vdelecroix created at 2016-03-15 13:48:07

All right. Then please take care of this in #20211.


---

Comment by vdelecroix created at 2016-03-15 13:48:07

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2016-03-20 23:41:38

Resolution: fixed
