# Issue 13992: "subgroups" fails for C1 x C2

archive/issues_013992.json:
```json
{
    "body": "Assignee: malb\n\nCC:  bisson\n\nKeywords: abelian group subgroups invfac one\n\nIn Sage 5.7:\n\n```\nsage: A = AbelianGroup([2,1])\nsage: A\nMultiplicative Abelian group isomorphic to C2 x C1\nsage: A.subgroups()\n[Multiplicative Abelian subgroup isomorphic to C2 generated by {f0},\n Trivial Abelian subgroup]\n\nsage: B = AbelianGroup([1,2])\nsage: B\nMultiplicative Abelian group isomorphic to C1 x C2\nsage: B.subgroups()\nVectors not LI:  [[0, 0], [0, 1]]\n...\nValueError: The given basis vectors must be linearly independent.\n```\n\n\nThis last command should work just as well as A.subgroups().\n\nIssue created by migration from https://trac.sagemath.org/ticket/14196\n\n",
    "created_at": "2013-02-27T19:48:59Z",
    "labels": [
        "commutative algebra",
        "major",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-6.4",
    "title": "\"subgroups\" fails for C1 x C2",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/13992",
    "user": "mstreng"
}
```
Assignee: malb

CC:  bisson

Keywords: abelian group subgroups invfac one

In Sage 5.7:

```
sage: A = AbelianGroup([2,1])
sage: A
Multiplicative Abelian group isomorphic to C2 x C1
sage: A.subgroups()
[Multiplicative Abelian subgroup isomorphic to C2 generated by {f0},
 Trivial Abelian subgroup]

sage: B = AbelianGroup([1,2])
sage: B
Multiplicative Abelian group isomorphic to C1 x C2
sage: B.subgroups()
Vectors not LI:  [[0, 0], [0, 1]]
...
ValueError: The given basis vectors must be linearly independent.
```


This last command should work just as well as A.subgroups().

Issue created by migration from https://trac.sagemath.org/ticket/14196





---

archive/issue_comments_174682.json:
```json
{
    "body": "In Sage 5.6, it was still:\n\n```\nsage: A = AbelianGroup([2,1])\nsage: A\nMultiplicative Abelian Group isomorphic to C2\nsage: A.subgroups()\n[Multiplicative Abelian Group isomorphic to C2, which is the subgroup of\nMultiplicative Abelian Group isomorphic to C2\ngenerated by [f], Trivial Abelian Group, which is the subgroup of\nMultiplicative Abelian Group isomorphic to C2\ngenerated by []]\nsage: B = AbelianGroup([1,2])\nsage: B\nMultiplicative Abelian Group isomorphic to C2\nsage: B.subgroups()\n[Multiplicative Abelian Group isomorphic to C2, which is the subgroup of\nMultiplicative Abelian Group isomorphic to C2\ngenerated by [f], Trivial Abelian Group, which is the subgroup of\nMultiplicative Abelian Group isomorphic to C2\ngenerated by []]\n```\n\nI think the situation in Sage 5.7 is an improvement, except of course for the failure to compute `B.subgroups()`.",
    "created_at": "2013-02-27T19:49:51Z",
    "issue": "https://github.com/sagemath/sagetest/issues/13992",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/13992#issuecomment-174682",
    "user": "mstreng"
}
```

In Sage 5.6, it was still:

```
sage: A = AbelianGroup([2,1])
sage: A
Multiplicative Abelian Group isomorphic to C2
sage: A.subgroups()
[Multiplicative Abelian Group isomorphic to C2, which is the subgroup of
Multiplicative Abelian Group isomorphic to C2
generated by [f], Trivial Abelian Group, which is the subgroup of
Multiplicative Abelian Group isomorphic to C2
generated by []]
sage: B = AbelianGroup([1,2])
sage: B
Multiplicative Abelian Group isomorphic to C2
sage: B.subgroups()
[Multiplicative Abelian Group isomorphic to C2, which is the subgroup of
Multiplicative Abelian Group isomorphic to C2
generated by [f], Trivial Abelian Group, which is the subgroup of
Multiplicative Abelian Group isomorphic to C2
generated by []]
```

I think the situation in Sage 5.7 is an improvement, except of course for the failure to compute `B.subgroups()`.



---

archive/issue_comments_174683.json:
```json
{
    "body": "Changing status from new to needs_review.",
    "created_at": "2014-11-28T19:28:09Z",
    "issue": "https://github.com/sagemath/sagetest/issues/13992",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/13992#issuecomment-174683",
    "user": "tscrim"
}
```

Changing status from new to needs_review.



---

archive/issue_comments_174684.json:
```json
{
    "body": "Changing component from commutative algebra to group theory.",
    "created_at": "2014-11-28T19:28:09Z",
    "issue": "https://github.com/sagemath/sagetest/issues/13992",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/13992#issuecomment-174684",
    "user": "tscrim"
}
```

Changing component from commutative algebra to group theory.



---

archive/issue_comments_174685.json:
```json
{
    "body": "New commits:",
    "created_at": "2014-11-28T19:28:09Z",
    "issue": "https://github.com/sagemath/sagetest/issues/13992",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/13992#issuecomment-174685",
    "user": "tscrim"
}
```

New commits:



---

archive/issue_comments_174686.json:
```json
{
    "body": "Is it me or is this commit in Sage already ?\n\nNathann",
    "created_at": "2015-01-16T11:02:20Z",
    "issue": "https://github.com/sagemath/sagetest/issues/13992",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/13992#issuecomment-174686",
    "user": "ncohen"
}
```

Is it me or is this commit in Sage already ?

Nathann



---

archive/issue_comments_174687.json:
```json
{
    "body": "It seems to be me. And the trac server which seems to say that the diff between this branch and Sage is empty `O_o`",
    "created_at": "2015-01-16T11:04:48Z",
    "issue": "https://github.com/sagemath/sagetest/issues/13992",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/13992#issuecomment-174687",
    "user": "ncohen"
}
```

It seems to be me. And the trac server which seems to say that the diff between this branch and Sage is empty `O_o`



---

archive/issue_comments_174688.json:
```json
{
    "body": "I think it's a trac bug that pops up sporadically.",
    "created_at": "2015-01-16T15:15:15Z",
    "issue": "https://github.com/sagemath/sagetest/issues/13992",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/13992#issuecomment-174688",
    "user": "tscrim"
}
```

I think it's a trac bug that pops up sporadically.



---

archive/issue_comments_174689.json:
```json
{
    "body": "ok, lgtm",
    "created_at": "2015-03-27T19:34:08Z",
    "issue": "https://github.com/sagemath/sagetest/issues/13992",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/13992#issuecomment-174689",
    "user": "chapoton"
}
```

ok, lgtm



---

archive/issue_comments_174690.json:
```json
{
    "body": "Changing status from needs_review to positive_review.",
    "created_at": "2015-03-27T19:34:08Z",
    "issue": "https://github.com/sagemath/sagetest/issues/13992",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/13992#issuecomment-174690",
    "user": "chapoton"
}
```

Changing status from needs_review to positive_review.



---

archive/issue_comments_174691.json:
```json
{
    "body": "Thanks Frederic.",
    "created_at": "2015-03-27T20:50:19Z",
    "issue": "https://github.com/sagemath/sagetest/issues/13992",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/13992#issuecomment-174691",
    "user": "tscrim"
}
```

Thanks Frederic.



---

archive/issue_comments_174692.json:
```json
{
    "body": "Resolution: fixed",
    "created_at": "2015-03-31T23:58:11Z",
    "issue": "https://github.com/sagemath/sagetest/issues/13992",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/13992#issuecomment-174692",
    "user": "vbraun"
}
```

Resolution: fixed
