# Issue 13403: bug lorsque l'on veut injecter un élément d'ordre q-1, appartenant à extension de F_q, dans F_q.

Issue created by migration from https://trac.sagemath.org/ticket/13607

Original creator: frovetta

Original creation time: 2012-10-16 13:16:43

Assignee: robertwb

CC:  kcrisman

Keywords: finite fields, coercion


```
sage : def element_primitif(K):
          q = K.cardinality()
          j = 0
              while j == 0:
          x = K.random_element()
          if x <> 0 and multiplicative_order(x) == q-1:
              j=1
          return x

sage :def element_d_ordre_a(K,a):
          q = K.cardinality()
          x = element_primitif(K)
          return x^((q-1)/a) 

sage : q = 25
sage : K.<d> = GF(q)
sage : F.<a> = GF(q^6)
sage : z = element_d_ordre_a(F,q-1);
# en fait z est un élément (primitif) de K puisque d'ordre q-1

sage : c = z
sage : print "c= ", c
sage : b = K(-c^2)
sage : print "b = ", b
sage : print "b = b:", b == -K(c)^2 # normalement sage doit renvoyer True

c=  4*a^11 + 4*a^10 + 2*a^9 + 3*a^7 + 4*a^6 + 4*a^5 + 3*a^4 + 3*a^3 +
4*a^2 + 4*a + 3
b =  3*d + 4
b = b: False
```



---

Comment by frovetta created at 2012-10-16 13:21:12

Changing type from PLEASE CHANGE to defect.


---

Comment by fwclarke created at 2012-10-17 09:08:09

The problem can be illustrated more simply:

```
sage: q = 25
sage: K.<d> = GF(q)
sage: F.<a> = GF(q^6)
sage: K(a)
d
```

This is, of course, nonsense.
      
The offending code is at lines 482--494 of `sage-5.3/devel/sage-main/sage/rings/finite_rings/element_givaro.pyx`.

As it says at lines 291--292 of `sage-5.3/devel/sage-main/sage/rings/finite_rings/finite_field_givaro.py`:

```
  PARI elements are interpreted as finite field elements; this PARI flexibility 
  is (absurdly!) liberal
```


----

There is a more mathematical difficulty with what you wish to do, and how one could expect Sage to do it.  There are, of course, two embeddings of GF(25) into GF(5<sup>12</sup>), with the same image.  Thus  there is no canonical way of identifying an element of GF(5<sup>12</sup>) belonging to the subfield of order 25 with an element of another field of order 25.

But it is possible, in a very simple-minded way, to find the two candidates:

```
sage: z = a^10172526
sage: z.multiplicative_order()
24
sage: [[y for y in K if f(y) == z][0] for f in Hom(K, F)]
[d, 4*d + 1]
```

Or, much more efficiently,

```
sage: z.minimal_polynomial().roots(ring=K, multiplicities=False)
[4*d + 1, d]
```


----

Another point: there's no need to define `element_primitif`; it's built in:

```
sage: K.primitive_element()
d
```



---

Comment by kcrisman created at 2012-10-23 00:43:46

Just FYI, the "author" is for the author of a solution.  Also, although we are by no means monolingual at Sage, it might be helpful to get more developers to look at this to put at least the summary in English... just a suggestion, not required, of course!


---

Comment by jpflori created at 2013-06-25 17:12:33

Changing status from new to needs_review.


---

Comment by jpflori created at 2013-06-25 17:12:33

I think this should be closed as invalid, or duplicate of #11938 and #8751 let's say although that particular ticket only targets finite fields implemented through givaro.

Or it should be changed to "Going down in compatibly embedded lattices of finite fields" and made a follow-up ticket to #8335 for psuedo-Conway lattices or #8751 for general lattices.


---

Comment by jpflori created at 2013-06-25 17:12:51

Changing status from needs_review to positive_review.


---

Comment by jdemeyer created at 2013-08-13 08:33:12

Resolution: duplicate
