# Issue 23564: subfields of large finite fields raises a TypeError

Issue created by migration from Trac.

Original creator: mderickx

Original creation time: 2017-09-08 05:03:58


```
sage: GF(2^93).subfields()
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)
...
TypeError: images do not define a valid homomorphism
sage: GF(37^16).subfields()
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)
...
TypeError: images do not define a valid homomorphism
```



---

Comment by mderickx created at 2017-09-08 06:04:16

I found a workaround but it is significantly slower.


```
sage: def subfields(F):
...       return [F.frobenius_endomorphism().fixed_field()
...                                  for n in F.degree().divisors()]
sage: #warmup chache
sage: for p in prime_range(2,100):
...       for i in srange(2,16):
...           F = GF(p^i)
sage: t=cputime()
sage: for p in prime_range(2,100):
...       for i in srange(2,16):
...           F = GF(p^i)
...           l=subfields(F)
...
sage: print cputime(t)
17.067403
sage: t=cputime()
sage: for p in prime_range(2,100):
...       for i in srange(2,16):
...           try:
...               F = GF(p^i)
...               tmp = F.subfields()
...           except TypeError:
...
sage: print cputime(t)
1.838485
```



---

Comment by roed created at 2017-09-08 06:39:08

The problem is in

```
elif hasattr(self, '_prefix'):
    K = GF(p**degree, name=name, prefix=self._prefix)
    return [(K, self.coerce_map_from(K))]
```

Prefix is only used when name is `None`.  So it creates a new finite field instead of just using the trivial embedding of the field into itself.  In the examples you gave, the problem only occurs in the degree 93/16 embedding respectively (though for larger fields, I would expect the problem to arise in other degrees as well).

We can probably replace the definition of `K` with `K = self.algebraic_closure()._subfield(degree)`, but that needs to be checked.


---

Comment by mderickx created at 2017-09-08 08:25:48

By reading the code I realised that the part

```
gen = self.gen()**((self.order() - 1)//(p**degree - 1))
K = GF(p**degree, modulus=gen.minimal_polynomial(), name=name)
return [(K, K.hom((gen,)))]
```

Is also problematic, because that assumes that gen is a primitive `p**degree-1`-th root of unity, but this is obviously not always the case. This allows for constructing failing examples like:

```
sage: F = GF(2^6,name='a',modulus=x^6 + x^3 + 1)
sage: F.subfields()
---------------------------------------------------------------------------
ValueError                                Traceback (most recent call last)
...
ValueError: the degree of the modulus does not equal the degree of the field
```



---

Comment by roed created at 2017-09-08 08:33:07

Note that this relationship between generators should hold for fields inside an algebraic closure (ie, when defined by pseudo-Conway polynomials).  Though I can believe that it causes problems if you specify the modulus explicitly.


---

Comment by mderickx created at 2017-09-08 08:46:26

Yes indeed, so that code would belong somewhere were one can assume that relation and not in `sage.rings.finite_rings.finite_field_base.FiniteField` which is the base class of all finite fields. Unless you want to convince me that a finite field should always be generated by a primitive `p**degree-1`-th root of unity ;).


---

Comment by mderickx created at 2017-09-08 08:50:21

p.s. Do you think that someone should be allowed to do this?


```
K = GF(37^16)
K2 = GF(37^16, name = 'b', prefix='c')
K.has_coerce_map_from(K2)
```



---

Comment by mderickx created at 2017-09-08 08:55:54

After this is fixed we should also let `K.frobenius_endomorphism(n).fixed_field()` point to `K.subfields(degree=n)` since this will reduce code duplication and probably speed up the first method.


---

Comment by roed created at 2017-09-11 19:24:09

Replying to [comment:7 mderickx]:
> p.s. Do you think that someone should be allowed to do this?
> 
> {{{
> K = GF(37^16)
> K2 = GF(37^16, name = 'b', prefix='c')
> K.has_coerce_map_from(K2)
> }}}

I think that creating a field with a name different from its prefix is weird, but we may want to support it as a way for the user to name the generator for a particular field but have it fit into a particular algebraic closure.

I think that there should be no coercion from K2 to K.


---

Comment by roed created at 2021-02-15 07:34:26

Possibly related:


```
sage: k.<a> = GF(3^240)                                                                                                                                                                                                                     
sage: S = k.subfields()                                                                                                                                                                                                                     
---------------------------------------------------------------------------
ValueError                                Traceback (most recent call last)
<ipython-input-1-a42d5157f9bd> in <module>
      1 k = GF(Integer(3)**Integer(240), names=('a',)); (a,) = k._first_ngens(1)
----> 2 S = k.subfields()

~/sage/sage-9.3.beta7/local/lib/python3.9/site-packages/sage/rings/finite_rings/finite_field_base.pyx in sage.rings.finite_rings.finite_field_base.FiniteField.subfields (build/cythonized/sage/rings/finite_rings/finite_field_base.c:19106)()
   1603         pairs = []
   1604         for m in divisors:
-> 1605             K = self.subfield(m, name=name[m])
   1606             pairs.append((K, self.coerce_map_from(K)))
   1607         return pairs

~/sage/sage-9.3.beta7/local/lib/python3.9/site-packages/sage/rings/finite_rings/finite_field_base.pyx in sage.rings.finite_rings.finite_field_base.FiniteField.subfield (build/cythonized/sage/rings/finite_rings/finite_field_base.c:18386)()
   1519         else:
   1520             gen = self.gen()**((self.order() - 1)//(p**degree - 1))
-> 1521             K = GF(p**degree, modulus=gen.minimal_polynomial(), name=name)
   1522             try: # to register a coercion map, embedding of K to self
   1523                 self.register_coercion(K.hom([gen], codomain=self, check=False))

~/sage/sage-9.3.beta7/local/lib/python3.9/site-packages/sage/structure/factory.pyx in sage.structure.factory.UniqueFactory.__call__ (build/cythonized/sage/structure/factory.c:2390)()
    365             False
    366         """
--> 367         key, kwds = self.create_key_and_extra_args(*args, **kwds)
    368         version = self.get_version(sage_version)
    369         return self.get_object(version, key, kwds)

~/sage/sage-9.3.beta7/local/lib/python3.9/site-packages/sage/rings/finite_rings/finite_field_constructor.py in create_key_and_extra_args(self, order, name, modulus, names, impl, proof, check_irreducible, prefix, repr, elem_cache, **kwds)
    584 
    585                     if modulus.degree() != n:
--> 586                         raise ValueError("the degree of the modulus does not equal the degree of the field")
    587                     if check_irreducible and not modulus.is_irreducible():
    588                         raise ValueError("finite field modulus must be irreducible but it is not")

ValueError: the degree of the modulus does not equal the degree of the field
```



---

Comment by roed created at 2021-02-24 20:22:27

New commits:


---

Comment by roed created at 2021-02-24 20:22:27

Changing status from new to needs_review.


---

Comment by git created at 2021-03-01 20:13:50

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by git created at 2021-03-10 08:13:59

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by saraedum created at 2021-03-11 20:23:45

I don't understand what "compatible" is in one of the comments. Otherwise feel free to set this to positive review.


---

Comment by git created at 2021-03-11 20:30:08

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by roed created at 2021-03-19 16:43:28

Marking as positive review based on Julian's comment.


---

Comment by roed created at 2021-03-19 16:43:28

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2021-03-20 20:55:02

Resolution: fixed
