# Issue 16349: K.zeta_function() unstable

Issue created by migration from Trac.

Original creator: rws

Original creation time: 2014-06-29 15:57:33

CC:  jakobkroeker

Keywords: zeta, dokchitser, precision, lseries

This was reported by parzan in http://ask.sagemath.org/question/8418/zeta-function-gone-wild/

```
sage: K.<a> = NumberField(x^2-2)
sage: K.zeta_function()(7)
82.7603619399160
sage: K.zeta_function(prec=100)(7)
45333.379954778857657650185188
sage: K.zeta_function(prec=200)(7)
5.6555192254423051174292272646037247772094677139829119697339e8
```

See that excellent bug report for more aspects of the matter. Setting `Component:` to scripts because it seems to be a Dokchitser issue. See also #4940. 


---

Comment by jdemeyer created at 2014-08-18 15:36:11

Changing component from scripts to number fields.


---

Comment by chapoton created at 2019-02-19 10:55:25

This strange behaviour happens at odd integers >=7 only:

```
sage: Z = K.zeta_function(prec=100)
sage: Z(6.999999)
1.0078766853919870115865646404
sage: Z(7.000001)
1.0078766743798187778098456037
sage: Z(7.00000)
45333.379954778857657650185188
```

and the value depends strongly on the cutoff parameter

```
sage: Z = K.zeta_function(prec=100)
sage: gg = Z.gp()
sage: gg.eval('Lseries_5(7,1,0)')
'45333.379954778857657650185187902307852 + O(S)'
sage: gg.eval('Lseries_5(7,2,0)')
'38708792.158193667152030560998244936055 + O(S)'
```

This suggests something fishy in the dokchitser scripts..


---

Comment by chapoton created at 2019-09-10 14:48:51

This works now with the default algorithm. Still fails with Dokchitser's scripts:

```
sage: K.zeta_function(prec=100, algorithm="pari")(7)
1.0078766798859009530335817870
sage: K.zeta_function(prec=100, algorithm="gp")(7)
45333.379954778857657650185188
```

