# Issue 17733: implement Meijer G function

Issue created by migration from Trac.

Original creator: rws

Original creation time: 2015-03-17 08:50:34

CC:  slelievre

This function would allow to express the result from differentiation of several special functions with respect to the order parameter, which at the moment gives an error:

```
sage: diff(exp_integral_e(n,x),n)
NotImplementedError: The derivative of this function is only implemented for sage: gamma_inc(n,x).diff(n)
D[0](gamma)(n, x)

sage: sympy.expint(n, x).diff(n)
-x**(n - 1)*meijerg(((), (1, 1)), ((0, 0, -n + 1), ()), x)
sage: sympy.uppergamma(n, x).diff(n)
meijerg(((), (1, 1)), ((0, 0, n), ()), x) + log(x)*uppergamma(n, x)
sage: sympy.lowergamma(n, x).diff(n)
-meijerg(((), (1, 1)), ((0, 0, n), ()), x) - log(x)*uppergamma(n, x) + gamma(n)*polygamma(0, n)
sage: meijerg?
Object `meijerg` not found.
```


Mpmath has numerics too.

https://en.wikipedia.org/wiki/Meijer_G-function


---

Comment by vdelecroix created at 2018-08-03 19:20:18

update milestone 8.3 -> 8.4


---

Comment by slelievre created at 2021-12-06 14:48:30

The Meijer G function is mentioned in questions,
answers, comments or discussions at:

- [Ask Sage question 60006: Meijer G function in Sage](https://ask.sagemath.org/question/60006)
- [Ask Sage question 48908: Avoid scientific notation in the Mathematica interface](https://ask.sagemath.org/question/48908)
- [Ask Sage question 43392: Force 'sympy' backend for simplifying symbolic integrals](https://ask.sagemath.org/question/43392)
- [Ask Sage question 42637: Error using algorithm="sympy" on an integral](https://ask.sagemath.org/question/42637)
- [Ask Sage question 10724: Symbolic integration](https://ask.sagemath.org/question/10724)
- [Ask Sage question 8634: Implement and plot meijerg](https://ask.sagemath.org/question/8634)


- [sage-support, 2018-04, simple?--from_meijer in jupyter](https://groups.google.com/g/sage-support/c/1I8ZThs_WGA)
- [sage-support, 2014-10, Formal methods are not human one](https://groups.google.com/g/sage-support/c/wmUdQHuxuZY)

- [sage-devel, 2017-01, GSoC 2017 kickoff](https://groups.google.com/g/sage-devel/c/t-fYDsiFvxw)
- [sage-devel, 2013-05, 3 GSoC projects for Sage](https://groups.google.com/g/sage-devel/c/bo8B4Ir30uI)
- [sage-devel, 2009-08, ANN: mpmath 0.13 released](https://groups.google.com/g/sage-devel/c/lgsC8KLtXfo)
- [sage-devel, 2010-08, test suites for Sage](https://groups.google.com/g/sage-devel/c/IrF6HRUFefg)
- [sage-devel, 2010-05, sage vs others by NIST](https://groups.google.com/g/sage-devel/c/4HMxOxqnSRU)
- [sage-devel, 2008-08, GiNaC as the symbolic manipulation engine in Sage](https://groups.google.com/g/sage-devel/c/8LGrV_DZjhg)


---

Comment by slelievre created at 2021-12-06 14:48:30

Changing keywords from "" to "meijerg".


---

Comment by @sheerluck created at 2022-01-01 16:00:04


```
sage: integrate(x * bessel_Y(1, x), (x, 0 ,1), algorithm="sympy")
---------------------------------------------------------------------------
AttributeError                            Traceback (most recent call last)
/usr/lib/python3.10/site-packages/sage/interfaces/sympy.py in _sympysage_function_by_name(fname)
    303         else:
    304             # the function defined in sympy is not known in sage
--> 305             raise AttributeError(fname)
    306     return func
    307 

AttributeError: meijerg
```

