# Issue 19128: Bug in lattice_polytope.positive_integer_relations

Issue created by migration from Trac.

Original creator: tmonteil

Original creation time: 2015-10-07 16:16:55

CC:  vdelecroix chapoton mkoeppe rws

Reported on [this ask question](http://ask.sagemath.org/question/29797/non-negative-integer-relations-on-vertices/):


```
sage: vertices = [(1,1,-1,-1,-1),(-1,-1,1,1,-1),(1,-1,-1,-1,1),(-1,1,1,1,1),(1,-1,1,-1,-1)]
sage: p = LatticePolytope(vertices)
sage: lattice_polytope.positive_integer_relations(p.vertices().column_matrix()
TypeError: unable to make sense of Maxima expression '"Problemnotfeasible!"' in Sage
```


Note that there is a non-negative nontrivial integer relation:


```
sage: p.vertices().column_matrix().right_kernel()
Free module of degree 5 and rank 1 over Integer Ring
Echelon basis matrix:
[1 1 1 1 0]
```



---

Comment by kcrisman created at 2015-10-07 19:56:12

See also #19367, which however I think is, if not orthogonal, at least not spanned by this question.


---

Comment by vdelecroix created at 2015-10-08 01:10:55

... changed a missing `)` in the description...


---

Comment by vdelecroix created at 2015-10-08 02:00:50

Simple solution.
----
New commits:


---

Comment by vdelecroix created at 2015-10-08 02:00:50

Changing status from new to needs_review.


---

Comment by kcrisman created at 2015-10-08 06:01:03


```
-        if x.str() == r'?Problem\not\feasible\!':
-            raise ValueError("cannot find required relations")
```

Why wasn't this triggered in the old code?

I suggest you run some timing on this code too, and see what it reports when there isn't a relation, etc.  I wonder why this non-generic code was used?


---

Comment by vdelecroix created at 2015-10-08 12:13:54

Replying to [comment:4 kcrisman]:
> {{{
> -        if x.str() == r'?Problem\not\feasible\!':
> -            raise ValueError("cannot find required relations")
> }}}
> Why wasn't this triggered in the old code?
> 
> I suggest you run some timing on this code too, and see what it reports when there isn't a relation, etc.  I wonder why this non-generic code was used?

Timing against what? The old code crashes on most examples...


---

Comment by novoselt created at 2015-10-08 17:50:11

The new version obviously has a different return type.

There is also some helper Maxima method that can be removed if it is not used anymore.

Timings against the old code are indeed irrelevant - that was just something that I managed to get into a working code back when I was young ;-)


---

Comment by novoselt created at 2015-10-08 17:50:11

Changing status from needs_review to needs_work.


---

Comment by git created at 2015-10-08 23:01:03

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by vdelecroix created at 2015-10-08 23:02:48

Changing status from needs_work to needs_review.


---

Comment by vdelecroix created at 2015-10-08 23:02:48

Replying to [comment:6 novoselt]:
> The new version obviously has a different return type.

Right. Fixed.

> There is also some helper Maxima method that can be removed if it is not used anymore.

Right. Deprecated.


---

Comment by novoselt created at 2015-10-08 23:35:05

Changing status from needs_review to positive_review.


---

Comment by tmonteil created at 2015-10-09 16:52:21

Changing status from positive_review to needs_work.


---

Comment by tmonteil created at 2015-10-09 16:52:21

The example provided in the doc is:


```
      sage: points = [(1,1,-1,-1,-1), (-1,-1,1,1,-1), (1,-1,-1,-1,1),
      ....:           (-1,1,1,1,1), (1,-1,1,-1,-1)]
      sage: positive_integer_relations(points)
      [(1, 0, 0, 1, 0)]
```


Could you explain how `(1,1,-1,-1,-1) + (-1,1,1,1,1) == 0` ?

The result should be `[(1, 1, 1, 1, 0)]`, see the ask question for the expected answer.

Given a list of tuples, is it more natural to interpret it as a list of vectors, or as a list of rows of a matrix whose columns are vectors ? We might argue that the doc says that the points "are given as columns of a matrix". But when the doc writes `points = [(1,1,-1,-1,-1), (-1,-1,1,1,-1), (1,-1,-1,-1,1), (-1,1,1,1,1), (1,-1,1,-1,-1)]`, should the user consider this as a natural way to define the vectors `[(1, -1, 1, -1, 1), (1, -1, -1, 1, -1), (-1, 1, -1, 1, 1), (-1, 1, -1, 1, -1), (-1, -1, 1, 1, -1)]` ?

It could be even worse if the user explicitely writes `points = [vector([1,1,-1,-1,-1]), vector([-1,-1,1,1,-1]), vector([1,-1,-1,-1,1]), vector([-1,1,1,1,1]), vector([1,-1,1,-1,-1])]` so that no ambiguity appears on her side, but the first line of the code `M = matrix(points)`, silently forgot all this information.


---

Comment by novoselt created at 2015-10-10 18:57:41

Good point. The old code would break right away on anything but the matrix and it looked at first as a good idea to have matrix constructor built in, but apparently it is not. I agree that both input and output formats of this function are not the best possible ones, but that's what it has been for ages (like since 2006/7), so let's keep it. Those who want to use this function have to do the conversion or write a new one and deprecate this one.

Interestingly, it is not used anywhere in Sage (I thought that somewhere in toric code it may be handy) but I am pretty sure I used it at some point in my worksheets.


---

Comment by mkoeppe created at 2016-06-14 22:07:44

This method was changed in #20766. Dup?


---

Comment by mkoeppe created at 2016-06-26 22:59:39

After #20766, the example in the description gives:


```
sage: vertices = [(1,1,-1,-1,-1),(-1,-1,1,1,-1),(1,-1,-1,-1,1),(-1,1,1,1,1),(1,-1,1,-1,-1)]
sage: p = LatticePolytope(vertices)
sage: lattice_polytope.positive_integer_relations(p.vertices().column_matrix())
MIPSolverException: PPL : There is no feasible solution
```



---

Comment by mkoeppe created at 2016-06-26 22:59:39

Changing status from needs_work to needs_info.
