# Issue 16247: Transformations for 2D plots

Issue created by migration from https://trac.sagemath.org/ticket/16484

Original creator: nthiery

Original creation time: 2014-06-16 11:47:28

CC:  slelievre

Implement transform, rotate, translate, ... for 2D plots analoguously to their 3D counterparts.


---

Comment by kcrisman created at 2014-06-18 01:46:47

Do you have some links for examples of syntax or functionality from other programs?  That could be helpful to anyone trying to do this - right now it's somewhat vague.  I like the idea.


---

Comment by nthiery created at 2014-06-18 06:41:46

Replying to [comment:1 kcrisman]:
> Do you have some links for examples of syntax or functionality from other programs?  That could be helpful to anyone trying to do this - right now it's somewhat vague.  I like the idea.

I had in mind the same syntax as for plot3d (up to the obvious adaptations), so that one could write dimension-agnostic code whenever possible. Here are some things you can do with them:

```
sage: p =  plot3d(lambda x, y: x^2 + y^2, (-2,2), (-2,2))
sage: p.translate(<vector>)
sage: p.rotateX(<angle>)
sage: p.scale(3)
sage: p.transform(rotate=..., scale=..., translate=...)
sage: p.transform(<matrix>)
sage: p.transform(<transformation>) # haven't checked that but would be natural
```


By the way: the documentation of Plot3d.transform does not make it clear that one can pass in a matrix; and it needs to be passed as m=<matrix>... which is not great.

But I haven't checked on matplotlib, and being consistent with it would be nice too.

http://matplotlib.org/users/transforms_tutorial.html

Cheers,
                                  Nicolas


---

Comment by slelievre created at 2016-11-11 05:32:51

Adding examples of user requests to ticket description.
