# Issue 22723: RealLazyField() and ComplexLazyField() are inexact rings

Issue created by migration from https://trac.sagemath.org/ticket/22960

Original creator: tmonteil

Original creation time: 2017-05-08 18:42:48

`RealLazyField()` and `ComplexLazyField()` claim to be exact, but they are not:


```
sage: RLF.is_exact()
True
sage: a = RLF(0.1) ; a
0.10000000000000001?
sage: a._value
0.100000000000000
sage: a._value.parent()
Real Field with 53 bits of precision
```




---

Comment by tmonteil created at 2017-05-08 18:45:41

Note that the doc of `RLF` itself claims to be exact.


```
    This class represents the set of real numbers to unspecified precision.
    For the most part it simply wraps exact elements and defers evaluation
    until a specified precision is requested.
```

