# Issue 10685: Extend p-adic L-series to handle nontrivial Teichmuller components

Issue created by migration from Trac.

Original creator: davidloeffler

Original creation time: 2011-02-06 00:31:31

Assignee: cremona

CC:  wuthrich

Keywords: p-adic L-function

The p-adic L-function of an elliptic curve is rightfully a distribution on `Zp*`. The current code only sees its Delta-invariant part, where Delta is the group of `(p-1)`st roots of unity.

I have coded up a quick fix for this, with the help of Chris Wuthrich and drawing on some code written by Chan-Ho Kim at Sage Days 22 (see [http://wiki.sagemath.org/days22/wuthrich](http://wiki.sagemath.org/days22/wuthrich).


---

Comment by davidloeffler created at 2011-02-06 00:33:43

Changing status from new to needs_review.


---

Attachment


---

Comment by wuthrich created at 2011-02-06 11:24:53

Great. Thanks a lot David. I will have a look at this during the coming week.

Aside: The long term plan would be to implement it for all twists, but then the coefficients of the power series are no longer ZZ_p but finite extensions of it. So it will take more work.


---

Comment by wuthrich created at 2011-02-07 14:01:24

Changing status from needs_review to positive_review.


---

Comment by wuthrich created at 2011-02-07 14:01:24

All tests passed. 

Here is a further example to illustrate the code. Maybe, we should add it in the docstring somewhere ?


```
sage: E=EllipticCurve('11a1')
sage: lp=E.padic_lseries(7)
sage: lp.series(4,eta=1)
6 + 2*7^3 + 5*7^4 + O(7^6) + (4*7 + 2*7^2 + O(7^3))*T + (2 + 3*7^2 + O(7^3))*T^2 + (1 + 2*7 + 2*7^2 + O(7^3))*T^3 + (1 + 3*7^2 + O(7^3))*T^4 + O(T^5)
sage: lp.series(4,eta=2)
5 + 6*7 + 4*7^2 + 2*7^3 + 3*7^4 + 2*7^5 + O(7^6) + (6 + 4*7 + 7^2 + O(7^3))*T + (3 + 2*7^2 + O(7^3))*T^2 + (1 + 4*7 + 7^2 + O(7^3))*T^3 + (6 + 6*7 + 6*7^2 + O(7^3))*T^4 + O(T^5)
sage: lp.series(4,eta=3)
O(7^6) + (3 + 2*7 + 5*7^2 + O(7^3))*T + (5 + 4*7 + 5*7^2 + O(7^3))*T^2 + (3*7 + 7^2 + O(7^3))*T^3 + (2*7 + 7^2 + O(7^3))*T^4 + O(T^5)
```


The last vanishes at T=0, which is good, because it corresponds to the positive rank over sqrt(-7):

```
sage: E.quadratic_twist(-7).rank()
1
```


This proves that E has rank 1 over Q(zeta_7).


---

Attachment

add an example


---

Comment by davidloeffler created at 2011-02-10 17:21:07

I've done a patch which adds your example to the class docstring. For form's sake, could you give it a quick glance and if you're happy set it back to positive review?


---

Comment by davidloeffler created at 2011-02-10 17:21:07

Changing status from positive_review to needs_work.


---

Comment by davidloeffler created at 2011-02-10 17:21:19

Changing status from needs_work to needs_review.


---

Comment by wuthrich created at 2011-02-11 10:41:35

Changing status from needs_review to positive_review.


---

Comment by wuthrich created at 2011-02-11 10:41:35

Yes, that is fine, too.
Both patches one after the other must be applied.


---

Comment by jdemeyer created at 2011-03-08 21:47:00

Resolution: fixed
