# Issue 17848: Symbolic integration and SymPy

Issue created by migration from https://trac.sagemath.org/ticket/18085

Original creator: kalvotom

Original creation time: 2015-03-30 09:40:29

CC:  vdelecroix sstarosta kcrisman

Keywords: sd66

The following integral cannot be evalueated by maxima:



```
sage: integrate(1/sqrt(1+x^3),x)
integrate(1/sqrt(x^3 + 1), x)
```



With 'sympy' algorithm the computation fails:



```
sage: integrate(1/sqrt(1+x^3),x,algorithm='sympy')
...
AttributeError: 'gamma' object has no attribute '_sage_'
```



However, SymPy can compute the integral and gives the result in terms of gamma and hypergeometric functions:



```
>>> from sympy import *
>>> x = Symbol('x')
>>> integrate(1/sqrt(1+x**3), x)
x*gamma(1/3)*hyper((1/3, 1/2), (4/3,), x**3*exp_polar(I*pi))/(3*gamma(4/3))
```



---

Comment by vdelecroix created at 2015-03-30 11:14:45

The problem actually does occur in Sympy code...

```
sage: import sympy
sage: s = sympy.gamma(1/3)
sage: s._sage_()
Traceback (most recent call last):
...
AttributeError: 'gamma' object has no attribute '_sage_'
```


Would you like to make a bug report in Sympy? Either on
 - the [mailing list](https://groups.google.com/forum/#!forum/sympy)
 - the [issue tracker](https://github.com/sympy/sympy/issues?utf8=%E2%9C%93&q=is%3Aopen)

Vincent


---

Comment by kalvotom created at 2015-03-30 20:32:38

After some more digging it turned out the this is almost OK in the most recent git version of Sympy (not 0.7.6 which is shipped with Sage). Class Function [has a _sage_ method](https://github.com/sympy/sympy/blob/master/sympy/core/function.py#L679) and hypergeometric function `hyper` is also [correctly dealt with](https://github.com/sympy/sympy/blob/master/sympy/functions/special/hyper.py#L306).

However, the example mentioned above still fails because Sage does not know `exp_polar` function. I have created [this pull request](https://github.com/sympy/sympy/pull/9224) which adds `_sage_` method to `exp_polar` and returns the usual exponential.

Tomáš


---

Comment by rws created at 2015-03-31 07:57:30

I have commented on the pull request, https://github.com/sympy/sympy/pull/9224


---

Comment by rws created at 2015-04-02 07:11:12

If you want to do try your hands at it, see http://trac.sagemath.org/wiki/symbolics/functions for symbolic function tickets, and https://github.com/sagemath/sage/compare/develop...rwst:special for a collection of most recent code examples.


---

Comment by kalvotom created at 2015-04-04 07:24:36

New commits:


---

Comment by kalvotom created at 2015-04-04 07:46:54

I have doctested the function with git version of Sympy and all tests passed (especially the one with integration). I guess we have to wait for a new version of Sympy to arrive in Sage (probably Sympy 0.7.7).

Anyway, this is my first attempt to contribute to Sage, so feel free to knitpick.

I have one question. How complicated it would be to force Sage to perform simplifications like 

```
sage: exp_polar(2 + 5*I)*exp_polar(5 - I)
exp_polar(7 + 4*I)
```

My current understanding is that such simplifications are taken care of by an external library ( Pynac ) and there is no way how to do this in Sage alone, am I right?


---

Comment by rws created at 2015-04-04 08:34:39

Replying to [comment:9 kalvotom]:
> I have doctested the function with git version of Sympy and all tests passed (especially the one with integration). I guess we have to wait for a new version of Sympy to arrive in Sage (probably Sympy 0.7.7).
Yes, other tickets are waiting for that too.
> Anyway, this is my first attempt to contribute to Sage, so feel free to knitpick.
Will get to it.
> I have one question. How complicated it would be to force Sage to perform simplifications like 
> {{{
> sage: exp_polar(2 + 5*I)*exp_polar(5 - I)
> exp_polar(7 + 4*I)
> }}}
> My current understanding is that such simplifications are taken care of by an external library ( Pynac ) and there is no way how to do this in Sage alone, am I right?
I think so, but I'm not much into Pynac. Anyway, it could be part of Python Sage by including a function that does it in one of the `Expression.simplify*` methods.


---

Comment by rws created at 2015-04-04 13:26:31

Thanks for your contribution. There were some minor problems requiring changes which I have added: removed the warning (because this ticket is pending Sympy-0.7.7 anyway), and adapted a bit to PEP 8. Documentation is fine, tests pass, so there is no reason to hold this back. If you agree with my changes you can set positive review.
----
New commits:


---

Comment by rws created at 2015-04-04 13:26:31

Changing status from new to needs_review.


---

Comment by kalvotom created at 2015-04-04 19:50:48

Changing status from needs_review to positive_review.


---

Comment by kalvotom created at 2015-04-04 19:55:45

Replying to [comment:12 rws]: Those changes are perfectly fine. Thanks.


---

Comment by vbraun created at 2016-01-02 19:16:02

Why is this still sage-pending?


---

Comment by vdelecroix created at 2016-01-02 19:32:28

"this ticket is pending Sympy-0.7.7" (see In [comment:12 comment:12]) but

```
sage: import sympy
sage: sympy.__version__
'0.7.6.1'
```



---

Comment by vbraun created at 2016-03-23 23:55:04

Resolution: fixed
