# Issue 21703: Positive raised by a positive power is not known to be real

Issue created by migration from https://trac.sagemath.org/ticket/21940

Original creator: pelegm

Original creation time: 2016-11-23 07:50:28

CC:  rws

Keywords: is_real,days79

But it is known to be positive...

See the following code:

```python
sage: assume(x>0)
sage: x.is_real()
True
sage: x.is_positive()
True
sage: (x**x).is_positive()
True
sage: (x**x).is_real()
False
```


For comparison, this is how SymPy handles this:

```python
In [2]: x = Symbol('x', positive=True)

In [3]: x.is_positive
Out[3]: True

In [4]: x.is_real
Out[4]: True

In [5]: (x**x).is_positive
Out[5]: True

In [6]: (x**x).is_real
Out[6]: True
```



---

Comment by rws created at 2016-11-23 14:07:45

What Sage version is this? With Sage-7.5beta3 I get:

```
sage: assume(x>0)
sage: x.is_real()
True
sage: (x*x).is_real()
True
```



---

Comment by pelegm created at 2016-11-25 09:15:57

Replying to [comment:3 rws]:
> What Sage version is this? With Sage-7.5beta3 I get:
> {{{
> sage: assume(x>0)
> sage: x.is_real()
> True
> sage: (x*x).is_real()
> True
> }}}

Hi,

This was tested on 7.5beta3.  You've checked `x*x`, and I have checked `x**x`.


---

Comment by rws created at 2016-11-25 14:27:05

Fixed in pynac git master, see https://github.com/pynac/pynac/commit/e5c6cd261e2652b7c4e7b4ca5f1bac9565ab0ef8

Please add a doctest to `Expression.is_real()` in `symbolic/expression.pyx`


---

Comment by pelegm created at 2016-11-25 21:29:02

New commits:


---

Comment by pelegm created at 2016-11-25 21:29:02

Changing status from new to needs_review.


---

Comment by rws created at 2016-12-06 08:52:48

Maybe interesting in this regard that fixing this allows Sage to simplify some apparently complex expressions, e.g.

```
Before:
sqrt(abs(1/25*(3*(2*sqrt(3)*sqrt(2) - 3)*(sqrt(6) - 2) + 16*sqrt(3)*sqrt(2) +
5*sqrt(6) - 54)^2 + 1/25*(3*(sqrt(6) - 2)*(sqrt(6) - 4) + 14*sqrt(3)*sqrt(2) +
4*sqrt(6) - 42)^2 + 144/25*(sqrt(3)*sqrt(2) - sqrt(6))^2))

After:
sqrt(1/25*(3*(2*sqrt(3)*sqrt(2) - 3)*(sqrt(6) - 2) + 16*sqrt(3)*sqrt(2) +
5*sqrt(6) - 54)^2 + 1/25*(3*(sqrt(6) - 2)*(sqrt(6) - 4) + 14*sqrt(3)*sqrt(2) +
4*sqrt(6) - 42)^2 + 144/25*(sqrt(3)*sqrt(2) - sqrt(6))^2)
```

(from a doctest in `matrix_symbolic_dense.pyx`)


---

Comment by pelegm created at 2016-12-06 12:53:56

Is this solving the case

```python
sage: assume(x, 'real')
sage: (2**x).is_positive()
True
sage: (2**x).is_real()
False
```

as well?


---

Comment by rws created at 2016-12-06 15:44:46

Right, now that works too.


---

Comment by rws created at 2016-12-20 15:43:51

Replying to [comment:9 pelegm]:
> Is this solving the case
> {{{#!python
> sage: assume(x, 'real')
> sage: (2**x).is_positive()
> True
> sage: (2**x).is_real()
> False
> }}}
> as well?

I added this as doctest. Could you review it please?
----
New commits:


---

Comment by pelegm created at 2017-03-12 18:42:04

Looks great.


---

Comment by pelegm created at 2017-03-12 18:42:04

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2017-03-27 20:42:47

Resolution: fixed
