# Issue 26579: Specify subgroups of Galois groups using generators

Issue created by migration from Trac.

Original creator: pbruin

Original creation time: 2018-12-04 15:56:38

Keywords: Galois group

It should be possible to construct a subgroup of the Galois group of a number field from a set of generators, just as for permutation groups.  This is already supported to some extent, but the list of elements of such a subgroup is wrong.

```
sage: R.<x> = QQ[]
sage: f = x^6 - 6*x^4 + 9*x^2 + 23
sage: K.<a> = NumberField(f)
sage: G = K.galois_group()
sage: list(G)
[(),
 (1,2,3)(4,5,6),
 (1,3,2)(4,6,5),
 (1,4)(2,6)(3,5),
 (1,5)(2,4)(3,6),
 (1,6)(2,5)(3,4)]
sage: g = G[1]
sage: h = G[3]
```

Before:

```
sage: list(G.subgroup([]))
[]
sage: list(G.subgroup([g]))
[(1,2,3)(4,5,6)]
sage: list(G.subgroup([h]))
[(1,4)(2,6)(3,5)]
sage: list(G.subgroup([g,h]))
[(1,2,3)(4,5,6), (1,4)(2,6)(3,5)]
```

After:

```
sage: list(G.subgroup([]))
[()]
sage: list(G.subgroup([g]))
[(), (1,2,3)(4,5,6), (1,3,2)(4,6,5)]
sage: list(G.subgroup([h]))
[(), (1,4)(2,6)(3,5)]
sage: list(G.subgroup([g,h]))
[(),
 (1,2,3)(4,5,6),
 (1,3,2)(4,6,5),
 (1,4)(2,6)(3,5),
 (1,5)(2,4)(3,6),
 (1,6)(2,5)(3,4)]
```



---

Comment by pbruin created at 2018-12-04 16:13:38

Changing status from new to needs_review.


---

Comment by git created at 2019-06-01 16:41:32

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by roed created at 2019-11-20 22:12:43

Looks good to me.  Recent patchbot failures due to transition to Python 3.


---

Comment by roed created at 2019-11-20 22:12:43

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2019-11-30 13:36:02

Resolution: fixed
