# Issue 27806: map_coefficients for power series

Issue created by migration from https://trac.sagemath.org/ticket/28043

Original creator: hivert

Original creation time: 2019-06-21 16:11:54

CC:  slelievre

Keywords: power series, coefficients

Currently `map_coefficients` works for polynomials by not power series:

```
sage: P.<z> = PolynomialRing(QQ)
sage: p = 1+2*z+5*z^2
sage: p.map_coefficients(lambda x : x^2)
25*z^2 + 4*z + 1

sage: P.<z> = PowerSeriesRing(QQ)
sage: p = 1+2*z+5*z^2 + O(z^3)
sage: p.map_coefficients(lambda x : x^2)
...
AttributeError: 'sage.rings.power_series_poly.PowerSeries_poly' object has no attribute 'map_coefficients'
```

I'm giving a basic implementation calling the corresponding method on the underlying polynomial


---

Comment by hivert created at 2019-06-21 16:48:48

New commits:


---

Comment by hivert created at 2019-06-21 16:48:48

Changing status from new to needs_review.


---

Comment by slelievre created at 2019-06-21 17:00:18

Changing keywords from "power series, coefficients" to "power series, coefficients, days101".


---

Comment by slelievre created at 2019-06-23 11:27:19

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2019-07-10 01:31:13

Resolution: fixed
