# Issue 27074: bug in simple limit

Issue created by migration from https://trac.sagemath.org/ticket/27311

Original creator: @GMS103

Original creation time: 2019-02-17 16:09:28

I have found the following bug in limit:


```
sage: version()
'SageMath version 8.6, Release Date: 2019-01-15'
sage: f=exp(-2*x^2)-cos(2*x);f
-cos(2*x) + e^(-2*x^2)
sage: g=x*(sin(x))^3;g
x*sin(x)^3
sage: lim(f/g,x=0) # this is wrong
und
sage: lim(f/g,x=0,dir='-'),lim(f/g,x=0,dir='+') # the second result is wrong
(4/3, +Infinity)
sage: taylor(f/g,x,0,3) # this is right
-26/45*x^2 + 4/3
sage: lim(f/x^4,x=0) # this is right too
4/3
```


(I am on OS X El Capitan (10.11.6).)

This seems to be a very old bug:  The results are the same for


```
sage: version()
'SageMath Version 6.10, Release Date: 2015-12-18'
```




---

Comment by embray created at 2019-03-25 10:56:15

Ticket retargeted after milestone closed (if you don't believe this ticket is appropriate for the Sage 8.8 release please retarget manually)


---

Comment by embray created at 2019-06-14 14:54:19

As the Sage-8.8 release milestone is pending, we should delete the sage-8.8 milestone for tickets that are not actively being worked on or that still require significant work to move forward.  If you feel that this ticket should be included in the next Sage release at the soonest please set its milestone to the next release milestone (sage-8.9).


---

Comment by embray created at 2019-12-30 14:48:17

Ticket retargeted after milestone closed


---

Comment by mkoeppe created at 2020-05-01 04:28:42

Moving tickets to milestone sage-9.2 based on a review of last modification date, branch status, and severity.


---

Comment by mkoeppe created at 2020-08-29 18:52:00

still the same in 9.2.beta10


---

Comment by @GMS103 created at 2020-08-29 19:53:59

Yes, you are right.

Anything I could do?  I am only a not very experienced user of [SageMath](SageMath).


---

Comment by @ninja18 created at 2020-10-11 13:38:03

This problem occurs only with maxima. With fricas it works as expected. But these are some of the other cases where the result is ambiguous.


```
sage: f = (1+1/x)^x
sage: lim(f,x=0.5)
und
sage: lim(f,x=1/2)
sqrt(3)
sage: lim(f,dir='+',x=0.5)
1.7320508075688774
sage: lim(f,dir='-',x=0.5)
1.7320508075688772
sage: lim(f,dir='-',x=3/2)
5/9*sqrt(5)*sqrt(3)
sage: lim(f,x=3/2)
und
sage: lim(f,x=1.5)
```



---

Comment by chapoton created at 2020-10-13 11:09:56

Changing keywords from "" to "limit".


---

Comment by mkoeppe created at 2021-04-07 19:29:15

Sage development has entered the release candidate phase for 9.3. Setting a new milestone for this ticket based on a cursory review.
