# Issue 11901: MatrixGroup() or order() incorrect for G_2(F_3)

archive/issues_011901.json:
```json
{
    "body": "Assignee: joyner\n\nKeywords: MatrixGroup, GAP, order\n\nIf I use the generators for the exceptional group G_2(F_3) in its natural 7-dimensional representation over F_3 in the MatrixGroup constructor, the order of the group returned is 8491392 (twice what it should be). However, if I use the same generators through the gap console within sage, I get the correct size.\n\n\n```\nK=GF(3)\nsage: gens=[matrix(K,7,[\n....: [0,2,0,0,0,0,0],\n....: [2,0,0,0,0,0,0],\n....: [0,0,0,2,0,0,0],\n....: [0,0,2,0,0,0,0],\n....: [0,0,0,0,0,2,0],\n....: [0,0,0,0,2,0,0],\n....: [2,2,2,2,1,1,1]]),\n....: matrix(K,7,[\n....: [2,0,0,0,0,0,0],\n....: [0,0,2,0,0,0,0],\n....: [1,1,1,0,0,0,0],\n....: [0,0,0,0,2,0,0],\n....: [1,0,0,1,1,0,0],\n....: [0,0,0,0,0,0,2],\n....: [1,0,0,0,0,1,1]])]\nsage: MatrixGroup(gens).order()\n8491392\n```\n\n\n\n\n```\ngap> m1:= [\n> [0,2,0,0,0,0,0],\n> [2,0,0,0,0,0,0],\n> [0,0,0,2,0,0,0],\n> [0,0,2,0,0,0,0],\n> [0,0,0,0,0,2,0],\n> [0,0,0,0,2,0,0],\n> [2,2,2,2,1,1,1]\n> ]*Z(3);\ngap> m2:= [\n> [2,0,0,0,0,0,0],\n> [0,0,2,0,0,0,0],\n> [1,1,1,0,0,0,0],\n> [0,0,0,0,2,0,0],\n> [1,0,0,1,1,0,0],\n> [0,0,0,0,0,0,2],\n> [1,0,0,0,0,1,1]\n> ]*Z(3);\ngap> Order(Group( m1, m2 ));\n4245696\n```\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/12073\n\n",
    "created_at": "2011-11-23T07:18:45Z",
    "labels": [
        "component: group theory",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-duplicate/invalid/wontfix",
    "title": "MatrixGroup() or order() incorrect for G_2(F_3)",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/11901",
    "user": "https://github.com/rharron"
}
```
Assignee: joyner

Keywords: MatrixGroup, GAP, order

If I use the generators for the exceptional group G_2(F_3) in its natural 7-dimensional representation over F_3 in the MatrixGroup constructor, the order of the group returned is 8491392 (twice what it should be). However, if I use the same generators through the gap console within sage, I get the correct size.


```
K=GF(3)
sage: gens=[matrix(K,7,[
....: [0,2,0,0,0,0,0],
....: [2,0,0,0,0,0,0],
....: [0,0,0,2,0,0,0],
....: [0,0,2,0,0,0,0],
....: [0,0,0,0,0,2,0],
....: [0,0,0,0,2,0,0],
....: [2,2,2,2,1,1,1]]),
....: matrix(K,7,[
....: [2,0,0,0,0,0,0],
....: [0,0,2,0,0,0,0],
....: [1,1,1,0,0,0,0],
....: [0,0,0,0,2,0,0],
....: [1,0,0,1,1,0,0],
....: [0,0,0,0,0,0,2],
....: [1,0,0,0,0,1,1]])]
sage: MatrixGroup(gens).order()
8491392
```




```
gap> m1:= [
> [0,2,0,0,0,0,0],
> [2,0,0,0,0,0,0],
> [0,0,0,2,0,0,0],
> [0,0,2,0,0,0,0],
> [0,0,0,0,0,2,0],
> [0,0,0,0,2,0,0],
> [2,2,2,2,1,1,1]
> ]*Z(3);
gap> m2:= [
> [2,0,0,0,0,0,0],
> [0,0,2,0,0,0,0],
> [1,1,1,0,0,0,0],
> [0,0,0,0,2,0,0],
> [1,0,0,1,1,0,0],
> [0,0,0,0,0,0,2],
> [1,0,0,0,0,1,1]
> ]*Z(3);
gap> Order(Group( m1, m2 ));
4245696
```


Issue created by migration from https://trac.sagemath.org/ticket/12073





---

archive/issue_events_032067.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2013-08-13T15:35:53Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/11901",
    "milestone": "sage-5.12",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/11901#event-32067"
}
```



---

archive/issue_events_032068.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-01-30T21:20:52Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/11901",
    "milestone": "sage-5.12",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/11901#event-32068"
}
```



---

archive/issue_events_032069.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-01-30T21:20:52Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/11901",
    "milestone": "sage-6.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/11901#event-32069"
}
```



---

archive/issue_events_032070.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-05-06T15:20:58Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/11901",
    "milestone": "sage-6.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/11901#event-32070"
}
```



---

archive/issue_events_032071.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-05-06T15:20:58Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/11901",
    "milestone": "sage-6.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/11901#event-32071"
}
```



---

archive/issue_events_032072.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-08-10T16:51:03Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/11901",
    "milestone": "sage-6.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/11901#event-32072"
}
```



---

archive/issue_events_032073.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-08-10T16:51:03Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/11901",
    "milestone": "sage-6.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/11901#event-32073"
}
```



---

archive/issue_comments_136148.json:
```json
{
    "body": "Compare\n\n```\nsage: L = [gap(GF(3)(i)) for i in range(3)]; L\n[0*Z(3), Z(3)^0, Z(3)]\n```\n\nand\n\n```\ngap> [0, 1, 2]*Z(3);\n[ 0*Z(3), Z(3), Z(3)^0 ]\n```\n",
    "created_at": "2017-06-02T12:39:55Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11901",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11901#issuecomment-136148",
    "user": "https://github.com/fchapoton"
}
```

Compare

```
sage: L = [gap(GF(3)(i)) for i in range(3)]; L
[0*Z(3), Z(3)^0, Z(3)]
```

and

```
gap> [0, 1, 2]*Z(3);
[ 0*Z(3), Z(3), Z(3)^0 ]
```




---

archive/issue_comments_136149.json:
```json
{
    "body": "same problems for other finite fields of prime order\n\n```\nsage: p=5; L = [gap(GF(p)(i)) for i in range(p)]; L\n[0*Z(5), Z(5)^0, Z(5), Z(5)^3, Z(5)^2]\n```\n\nversus\n\n```\ngap> p:=5; [0..p-1]*Z(p);\n5\n[ 0*Z(5), Z(5), Z(5)^2, Z(5)^0, Z(5)^3 ]\n```\n\n**EDIT**\nNote also that \n\n```\ngap> One(ZmodnZ(5));\nZ(5)^0\ngap> One(Z(5));\nZ(5)^0\ngap> One(GF(5));\nZ(5)^0\n```\n\nSo our conversion seems to be consistent with gap..",
    "created_at": "2017-06-02T12:43:38Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11901",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11901#issuecomment-136149",
    "user": "https://github.com/fchapoton"
}
```

same problems for other finite fields of prime order

```
sage: p=5; L = [gap(GF(p)(i)) for i in range(p)]; L
[0*Z(5), Z(5)^0, Z(5), Z(5)^3, Z(5)^2]
```

versus

```
gap> p:=5; [0..p-1]*Z(p);
5
[ 0*Z(5), Z(5), Z(5)^2, Z(5)^0, Z(5)^3 ]
```

**EDIT**
Note also that 

```
gap> One(ZmodnZ(5));
Z(5)^0
gap> One(Z(5));
Z(5)^0
gap> One(GF(5));
Z(5)^0
```

So our conversion seems to be consistent with gap..



---

archive/issue_comments_136150.json:
```json
{
    "body": "This boils down to\n\n```\ngap> 1*Z(5);\nZ(5)\ngap> One(Z(5));\nZ(5)^0\n```\n\nwhich is indeed not very-good looking.",
    "created_at": "2017-06-02T13:07:11Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11901",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11901#issuecomment-136150",
    "user": "https://github.com/fchapoton"
}
```

This boils down to

```
gap> 1*Z(5);
Z(5)
gap> One(Z(5));
Z(5)^0
```

which is indeed not very-good looking.



---

archive/issue_comments_136151.json:
```json
{
    "body": "Changing status from new to needs_review.",
    "created_at": "2017-06-02T13:39:14Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11901",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11901#issuecomment-136151",
    "user": "https://github.com/fchapoton"
}
```

Changing status from new to needs_review.



---

archive/issue_comments_136152.json:
```json
{
    "body": "ok, so this must come from a confusion: in Gap, Z(5) is not the one of the finite field, but a generator of the group of invertible elements. This means that your matrices are not the correct ones, I think.\n\nI propose to close this as invalid.",
    "created_at": "2017-06-02T13:39:14Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11901",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11901#issuecomment-136152",
    "user": "https://github.com/fchapoton"
}
```

ok, so this must come from a confusion: in Gap, Z(5) is not the one of the finite field, but a generator of the group of invertible elements. This means that your matrices are not the correct ones, I think.

I propose to close this as invalid.



---

archive/issue_events_032074.json:
```json
{
    "actor": "https://github.com/fchapoton",
    "created_at": "2017-06-02T13:39:14Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/11901",
    "milestone": "sage-6.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/11901#event-32074"
}
```



---

archive/issue_events_032075.json:
```json
{
    "actor": "https://github.com/fchapoton",
    "created_at": "2017-06-02T13:39:14Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/11901",
    "milestone": "sage-duplicate/invalid/wontfix",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/11901#event-32075"
}
```



---

archive/issue_comments_136153.json:
```json
{
    "body": "Confirmed:\n\n```\ngap> One(GF(5));\nZ(5)^0\n```\n\nand replacing by the above yields:\n\n```\ngap> Order(Group( m1, m2 ));\n8491392\n```\n\n\n\nFrom the [GAP manual](https://www.gap-system.org/Manuals/doc/ref/chap59.html):\n\n> The root returned by `Z` is a generator of the multiplicative group of the finite field with p<sup>d</sup> elements, which is cyclic.",
    "created_at": "2017-06-05T08:49:00Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11901",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11901#issuecomment-136153",
    "user": "https://github.com/tscrim"
}
```

Confirmed:

```
gap> One(GF(5));
Z(5)^0
```

and replacing by the above yields:

```
gap> Order(Group( m1, m2 ));
8491392
```



From the [GAP manual](https://www.gap-system.org/Manuals/doc/ref/chap59.html):

> The root returned by `Z` is a generator of the multiplicative group of the finite field with p<sup>d</sup> elements, which is cyclic.



---

archive/issue_comments_136154.json:
```json
{
    "body": "Changing status from needs_review to positive_review.",
    "created_at": "2017-06-05T08:49:00Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11901",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11901#issuecomment-136154",
    "user": "https://github.com/tscrim"
}
```

Changing status from needs_review to positive_review.



---

archive/issue_events_032076.json:
```json
{
    "actor": "https://github.com/embray",
    "created_at": "2017-07-13T07:54:31Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/11901",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/11901#event-32076"
}
```



---

archive/issue_comments_136155.json:
```json
{
    "body": "Resolution: wontfix",
    "created_at": "2017-07-13T07:54:31Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11901",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11901#issuecomment-136155",
    "user": "https://github.com/embray"
}
```

Resolution: wontfix



---

archive/issue_comments_136156.json:
```json
{
    "body": "Closing tickets in the sage-duplicate/invalid/wontfix module with positive_review (i.e. someone has confirmed they should be closed).",
    "created_at": "2017-07-13T07:54:31Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11901",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11901#issuecomment-136156",
    "user": "https://github.com/embray"
}
```

Closing tickets in the sage-duplicate/invalid/wontfix module with positive_review (i.e. someone has confirmed they should be closed).
