# Issue 30980: make subsemigroup work for MatrixSpace

archive/issues_030980.json:
```json
{
    "body": "CC:  @fchapoton @zabrocki schilling\n\nKeywords: semigroups, matrices\n\n`subsemigroup` does not work for matrices; and even when the command does not fail, the answer could be wrong.\n\nLet's try the subsemigroup generated by `A`, where\n\n```\nsage: M = MatrixSpace(ZZ, 2)\nsage: A = matrix([[0, 1], [0, 0]])\nsage: A * A\n[0 0]\n[0 0]\n```\n\nNote that `A * A == 0` so the subsemigroup consists of `A` and `0`.\n\n(1) First obvious attempt fails (this is how I expected it to work):\n\n```\nsage: M.subsemigroup([A])\n...\nTypeError: <class 'sage.sets.family.TrivialFamily_with_category'> is not hashable and does not implement _cache_key()\n```\n\nThis error message is not helpful: after digging around a while, I figured out that the input gets converted to a `Family`, so after trying to specify a `Family` instead, I realized that the real problem is that `A` is not immutable.\n\n(2) Second attempt fails:\n\n```\nsage: M.subsemigroup([M(A)])\n...\nTypeError: <class 'sage.sets.family.TrivialFamily_with_category'> is not hashable and does not implement _cache_key()\n```\n\nI thought this work work because I explicitly converted `A` to an element of `M`. It turns out that `M(A)` is not immutable, which seems like another issue that should be corrected.\n\n```\nsage: M(A).is_immutable()\nFalse\n```\n\n\n(3) Third attempt: first create `A` as an immutable matrix.\n\n```\nsage: M = MatrixSpace(ZZ, 2)\nsage: A = matrix([[0, 1], [0, 0]], immutable=True)\nsage: S = M.subsemigroup([A]); S\nA subsemigroup of (Full MatrixSpace of 2 by 2 dense matrices over Integer Ring) with 1 generators\n```\n\nHere, the command does not fail, but the result is wrong:\n\n```\nsage: S.list()     # fails first time, but not the second time...\n...\nTypeError: mutable matrices are unhashable\nsage: S.list()\n[[0 1]\n [0 0]]\nsage: [A, A*A]     # this is what the answer should be\n[\n[0 1]  [0 0]\n[0 0], [0 0]\n]\n```\n\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/31217\n\n",
    "created_at": "2021-01-09T20:56:57Z",
    "labels": [
        "algebra",
        "major",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-9.8",
    "title": "make subsemigroup work for MatrixSpace",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/30980",
    "user": "@saliola"
}
```
CC:  @fchapoton @zabrocki schilling

Keywords: semigroups, matrices

`subsemigroup` does not work for matrices; and even when the command does not fail, the answer could be wrong.

Let's try the subsemigroup generated by `A`, where

```
sage: M = MatrixSpace(ZZ, 2)
sage: A = matrix([[0, 1], [0, 0]])
sage: A * A
[0 0]
[0 0]
```

Note that `A * A == 0` so the subsemigroup consists of `A` and `0`.

(1) First obvious attempt fails (this is how I expected it to work):

```
sage: M.subsemigroup([A])
...
TypeError: <class 'sage.sets.family.TrivialFamily_with_category'> is not hashable and does not implement _cache_key()
```

This error message is not helpful: after digging around a while, I figured out that the input gets converted to a `Family`, so after trying to specify a `Family` instead, I realized that the real problem is that `A` is not immutable.

(2) Second attempt fails:

```
sage: M.subsemigroup([M(A)])
...
TypeError: <class 'sage.sets.family.TrivialFamily_with_category'> is not hashable and does not implement _cache_key()
```

I thought this work work because I explicitly converted `A` to an element of `M`. It turns out that `M(A)` is not immutable, which seems like another issue that should be corrected.

```
sage: M(A).is_immutable()
False
```


(3) Third attempt: first create `A` as an immutable matrix.

```
sage: M = MatrixSpace(ZZ, 2)
sage: A = matrix([[0, 1], [0, 0]], immutable=True)
sage: S = M.subsemigroup([A]); S
A subsemigroup of (Full MatrixSpace of 2 by 2 dense matrices over Integer Ring) with 1 generators
```

Here, the command does not fail, but the result is wrong:

```
sage: S.list()     # fails first time, but not the second time...
...
TypeError: mutable matrices are unhashable
sage: S.list()
[[0 1]
 [0 0]]
sage: [A, A*A]     # this is what the answer should be
[
[0 1]  [0 0]
[0 0], [0 0]
]
```



Issue created by migration from https://trac.sagemath.org/ticket/31217





---

archive/issue_comments_442417.json:
```json
{
    "body": "Setting new milestone based on a cursory review of ticket status, priority, and last modification date.",
    "created_at": "2021-02-13T20:51:01Z",
    "issue": "https://github.com/sagemath/sagetest/issues/30980",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/30980#issuecomment-442417",
    "user": "@mkoeppe"
}
```

Setting new milestone based on a cursory review of ticket status, priority, and last modification date.
