# Issue 18135: residue() produces wrong output

Issue created by migration from Trac.

Original creator: behackl

Original creation time: 2015-05-06 09:32:27

Keywords: residue

For functions where the pole is not recognized immediately when substituting the argument, residue yields output `0`.

For example:


```
sage: f(x) = 1/(1 - x - x^2)
sage: solve(1 - x - x^2 == 0, x)
[x == -1/2*sqrt(5) - 1/2, x == 1/2*sqrt(5) - 1/2]
sage: f(1/2*sqrt(5) - 1/2)
-4/((sqrt(5) - 1)^2 + 2*sqrt(5) - 6)  # pole is not recognized!
sage: f(1/2*sqrt(5) - 1/2).expand()
Traceback (most recent call last):  # here it is recognized.
...
ValueError: power::eval(): division by zero
sage: f(x).residue(x==1/2*sqrt(5) - 1/2)
0
```


This is wrong, as we would expect

```
sage: f(x).residue(x==1/2*sqrt(5) - 1/2)
-1/5*sqrt(5)
```



---

Comment by behackl created at 2015-05-06 09:45:16

In principle, this **could** be fixed by changing


```diff
diff --git a/src/sage/symbolic/expression.pyx b/src/sage/symbolic/expression.pyx
index aede6a0..462c311 100644
--- a/src/sage/symbolic/expression.pyx
+++ b/src/sage/symbolic/expression.pyx
`@``@` -3678,7 +3678,8 `@``@` cdef class Expression(CommutativeRingElement):
             a = 0
         if a == infinity:
             return (-self.subs({x: 1/x}) / x**2).residue(x == 0)
-        return self.subs({x: x+a}).series(x == 0, 0).coefficient(x, -1)
+        return self.subs({x: x+a}).expand()\
+            .series(x == 0, 0).coefficient(x, -1)
 
     def taylor(self, *args):
         r"""
```


in the `residue`-method -- however, I feel that is somehow dirty.

Maybe someone with more experience in Sage's symbolic engine has a opinion with respect to this issue?


---

Comment by behackl created at 2015-05-09 14:24:22

This is another possible fix (which seems a bit less dirty to me):


```diff
diff --git a/src/sage/symbolic/expression.pyx b/src/sage/symbolic/expression.pyx
index aede6a0..bbbd21b 100644
--- a/src/sage/symbolic/expression.pyx
+++ b/src/sage/symbolic/expression.pyx
`@``@` -3622,7 +3622,7 `@``@` cdef class Expression(CommutativeRingElement):
             prec = order
         sig_on()
         try:
-            x = self._gobj.series(symbol0._gobj, prec, 0)
+            x = self._gobj.expand(0).series(symbol0._gobj, prec, 0)
         finally:
             sig_off()
         return new_Expression_from_GEx(self._parent, x)
```



---

Comment by rws created at 2015-05-10 06:36:05

Yes, I think the last one is better. Not because it's less intrusive but the contrary. Expansion before series computation should make the series faster in general, if I'm not mistaken.


---

Comment by behackl created at 2015-05-10 14:31:01

I did some testing, and it seems that expanding before computing the series expansion actually is indeed marginally faster, for example:


```
sage: timeit("(1/(x^2 - x - 1)).series(x==1/2*sqrt(5)+1/2, 30)", number=300, repeat=5)
300 loops, best of 5: 18.4 ms per loop  # without patch

sage: timeit("(1/(x^2 - x - 1)).series(x==1/2*sqrt(5)+1/2, 30)", number=300, repeat=5)
300 loops, best of 5: 16.5 ms per loop  # with the patch
```


From this point of view, I think the fix would be OK -- after all, a class of `residue`-problems is fixed nevertheless. I'll push a branch to the ticket and run some doctests.


---

Comment by behackl created at 2015-05-10 17:41:22

Changing status from new to needs_review.


---

Comment by rws created at 2015-05-11 13:11:24

Looks fine and passes all tests. Please add your name in the authors field.


---

Comment by rws created at 2015-05-11 13:11:24

Changing status from needs_review to positive_review.


---

Comment by behackl created at 2015-05-11 14:12:45

Thanks for the review!


---

Comment by vbraun created at 2015-05-12 22:14:59

Resolution: fixed
