# Issue 23912: roots of zero polynomial over finite ring

Issue created by migration from https://trac.sagemath.org/ticket/24149

Original creator: zimmerma

Original creation time: 2017-11-03 09:59:21

currently we get with Sage 8.0:

```
sage: R.<x> = IntegerModRing(4)[]
sage: R(0).roots(multiplicities=False)
[0, 1, 2, 3]
```

but:

```
sage: R.<x> = ZZ[]
sage: R(0).roots(ring=IntegerModRing(4),multiplicities=False)
...
ValueError: roots of 0 are not defined
```

The second answer is inconsistent with the first one, and in this case the roots are well defined: all elements of the finite ring are roots.


---

Comment by zimmerma created at 2017-11-03 10:04:36

moreover the first way does not work properly for 2:

```
sage: S.<x> = IntegerModRing(2)[]
sage: S(0).roots(multiplicities=False)
...
ArithmeticError: factorization of 0 is not defined
```

and the answer is wrong for other prime cardinalities:

```
sage: S.<x> = IntegerModRing(3)[]
sage: S(0).roots(multiplicities=False)
[]
```



---

Comment by roed created at 2017-11-04 00:43:14

There is certainly a bug here.  The `ArithmeticError` is for consistency with non-finite rings, where we can't return a list of all elements.  Certainly

```
sage: S.<x> = IntegerModRing(3)[]
sage: S(0).roots(multiplicities=False)
[]
```

should be fixed, but I would say that we should raise an `ArithmeticError` in every case.


---

Comment by vdelecroix created at 2017-11-06 13:34:08

In the case of an infinite base ring, one can still return the base ring (thought as an infinite set). I would also prefer an `ArithmeticError` in every case.


---

Comment by roed created at 2017-11-06 21:24:03

Replying to [comment:3 vdelecroix]:
> In the case of an infinite base ring, one can still return the base ring (thought as an infinite set). 

True, but the expectation is for a list.

> I would also prefer an `ArithmeticError` in every case.

Let's do that then. :-)


---

Comment by vdelecroix created at 2018-08-03 19:20:18

update milestone 8.3 -> 8.4


---

Comment by roed created at 2019-09-07 12:28:55

Changing keywords from "" to "padicBordeaux".


---

Comment by zimmerma created at 2020-02-11 13:49:02

here is another example with Sage 8.8:

```
sage: R.<X> = IntegerModRing(1048576)[]
sage: p = 16*X^2 + 320*X + 576
sage: p.roots(multiplicities=False)
...
ArithmeticError: factorization of 0 is not defined
```

The roots of that polynomial modulo 1048576 are well defined, we should get their list instead.
