# Issue 23394: conversion of multivariate polynomial (over a number field) back to its base ring fails

archive/issues_023394.json:
```json
{
    "body": "CC:  @tscrim\n\n\n```\nsage: K.<s, t> = QQ.extension([x^2-2, x^2-3])\nsage: R.<y, z> = K[]\nsage: D.<d, e> = R[]\nsage: R(D(y))\n```\n\nfails with `TypeError: not a constant polynomial`\n\n\n```\nsage: K.<s, t> = QQ.extension([x^2-2, x^2-3])\nsage: R = PolynomialRing(K, 'xG_0, xG_1, xH_0')\nsage: D.<d, e> = R[]\nsage: R(D(R.0))\n```\n\nfails with `TypeError: unable to convert 'xG_0' to a rational`\n\nIssue created by migration from https://trac.sagemath.org/ticket/23631\n\n",
    "created_at": "2017-08-17T13:14:45Z",
    "labels": [
        "algebra",
        "major",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-8.1",
    "title": "conversion of multivariate polynomial (over a number field) back to its base ring fails",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/23394",
    "user": "@dkrenn"
}
```
CC:  @tscrim


```
sage: K.<s, t> = QQ.extension([x^2-2, x^2-3])
sage: R.<y, z> = K[]
sage: D.<d, e> = R[]
sage: R(D(y))
```

fails with `TypeError: not a constant polynomial`


```
sage: K.<s, t> = QQ.extension([x^2-2, x^2-3])
sage: R = PolynomialRing(K, 'xG_0, xG_1, xH_0')
sage: D.<d, e> = R[]
sage: R(D(R.0))
```

fails with `TypeError: unable to convert 'xG_0' to a rational`

Issue created by migration from https://trac.sagemath.org/ticket/23631





---

archive/issue_comments_327420.json:
```json
{
    "body": "Maybe the same / a similar issue as #23629, but from the outside behavior it looks different; thus a new ticket.",
    "created_at": "2017-08-17T13:15:46Z",
    "issue": "https://github.com/sagemath/sagetest/issues/23394",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/23394#issuecomment-327420",
    "user": "@dkrenn"
}
```

Maybe the same / a similar issue as #23629, but from the outside behavior it looks different; thus a new ticket.
