# Issue 25059: RingConverter should handle named variables by default

Issue created by migration from https://trac.sagemath.org/ticket/25296

Original creator: @BrentBaccala

Original creation time: 2018-05-06 02:51:35

CC:  rws

In the current version of Sage, when a RingConverter is used to convert from the symbolic ring to an algebraic ring, all converted variables must be specified in the RingConverter's dictionary.  For example,


```
sage: from sage.symbolic.expression_conversions import RingConverter
sage: R = QQ['x']
sage: RC = RingConverter(R, {x: R.0})
sage: RC(x)
x
```


Attempting to convert without a dictionary produces an error:


```
sage: RC = RingConverter(R)
sage: RC(x)
...
TypeError:
```


This patch changes this behavior so that if a variable is not found in the RingConverter's dictionary, an attempt is make to convert it to the ring using the ring's element constructor.  This allows the last example to work as expected; the symbolic variable "x" is converted to the ring element of the same name.


```
sage: from sage.symbolic.expression_conversions import RingConverter
sage: R = QQ['x']
sage: RC = RingConverter(R)
sage: R(x)
x
sage: x.parent()
Symbolic Ring
sage: R(x).parent()
Univariate Polynomial Ring in x over Rational Field
```



---

Comment by @BrentBaccala created at 2018-05-06 02:57:33

New commits:


---

Comment by @BrentBaccala created at 2018-05-06 02:57:33

Changing status from new to needs_review.


---

Comment by mmezzarobba created at 2018-06-01 12:33:44

`RingConverter` is no longer used in Sage itself since 1b82d7, and it is really unlikely that anyone else was relying on it failing in that case...


---

Comment by mmezzarobba created at 2018-06-01 12:33:44

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2018-06-02 16:11:33

Resolution: fixed
