# Issue 22439: Different results from definite integral methods

Issue created by migration from Trac.

Original creator: rws

Original creation time: 2017-03-23 15:52:24


```
sage: ((x^-5+2*x^(1/3))^(1/5)).integral(x,.2,.3)
-3/64*(-1)^(1/5)*sqrt(2*sqrt(5) - 10)*log(sqrt(1.0....
...
sage: _.n()
0.405689098012116 + 0.0000627092036312171*I
sage: ((x^-5+2*x^(1/3))^(1/5)).nintegrate(x,.2,.3)
(0.4055729987450207, 4.50276481372992e-15, 21, 0)
```

Wolfram Alpha favors the latter result.


---

Comment by tscrim created at 2017-03-23 16:55:16

Note that we also have:

```
sage: F = ((x^-5+2*x^(1/3))^(1/5)).integral(x)
sage: (F(x=.3) - F(x=.2)).n()
0.405572998744828 + 2.49245069028348e-14*I
sage: numerical_integral(((x^-5+2*x^(1/3))^(1/5)), .2, .3)
(0.40557299874502073, 4.502764813729917e-15)
```

