# Issue 30448: Subgroups of Galois groups

Issue created by migration from https://trac.sagemath.org/ticket/30685

Original creator: kedlaya

Original creation time: 2020-09-30 23:39:35

CC:  slelievre

Keywords: number field, Galois group

I'm not sure what behavior we want here, but this isn't it.

```
sage: P.<x> = QQ[]                                                              
sage: L.<a> = (x^3+x+1).splitting_field()                                       
sage: G = L.galois_group()                                                      
sage: G.subgroups()                                                             
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)
<ipython-input-14-0b3754d7fa51> in <module>
----> 1 G.subgroups()

~/sage/local/lib/python3.8/site-packages/sage/groups/perm_gps/permgroup.py in subgroups(self)
   3494         for cc in ccs:
   3495             for h in cc.Elements():
-> 3496                 all_sg.append(self.subgroup(gap_group=h))
   3497         return all_sg
   3498 

TypeError: subgroup() got an unexpected keyword argument 'gap_group'
```



---

Comment by mkoeppe created at 2021-02-13 20:51:01

Setting new milestone based on a cursory review of ticket status, priority, and last modification date.


---

Comment by slelievre created at 2021-07-06 14:00:38

Changing status from new to needs_review.


---

Comment by slelievre created at 2021-07-06 14:00:38

Fixed by #31489.


```
sage: x = polygen(QQ)
sage: L.<a> = (x^3 + x + 1).splitting_field()
sage: G = L.galois_group()
sage: G.subgroups()
[Subgroup generated by [()] of (Galois group 6T2 ([3]2) with order 6 of x^6 + 3*x^5 + 29*x^4 + 55*x^3 + 223*x^2 + 151*x + 379),
 Subgroup generated by [(1,2)(3,4)(5,6)] of (Galois group 6T2 ([3]2) with order 6 of x^6 + 3*x^5 + 29*x^4 + 55*x^3 + 223*x^2 + 151*x + 379),
 Subgroup generated by [(1,3)(2,5)(4,6)] of (Galois group 6T2 ([3]2) with order 6 of x^6 + 3*x^5 + 29*x^4 + 55*x^3 + 223*x^2 + 151*x + 379),
 Subgroup generated by [(1,6)(2,4)(3,5)] of (Galois group 6T2 ([3]2) with order 6 of x^6 + 3*x^5 + 29*x^4 + 55*x^3 + 223*x^2 + 151*x + 379),
 Subgroup generated by [(1,4,5)(2,6,3)] of (Galois group 6T2 ([3]2) with order 6 of x^6 + 3*x^5 + 29*x^4 + 55*x^3 + 223*x^2 + 151*x + 379),
 Subgroup generated by [(1,2)(3,4)(5,6), (1,4,5)(2,6,3)] of (Galois group 6T2 ([3]2) with order 6 of x^6 + 3*x^5 + 29*x^4 + 55*x^3 + 223*x^2 + 151*x + 379)]
```


Set to positive review if you agree.


---

Comment by slelievre created at 2021-07-06 14:03:16

Or use this ticket to add this example as a doctest.


---

Comment by kedlaya created at 2021-07-06 19:19:12

Agreed, we can go ahead and close this.


---

Comment by kedlaya created at 2021-07-06 19:19:12

Changing status from needs_review to positive_review.


---

Comment by slelievre created at 2021-07-06 19:36:06

Resolution: duplicate
