# Issue 29391: Wedge product of multivector field with scalar field

Issue created by migration from https://trac.sagemath.org/ticket/29628

Original creator: rburing

Original creation time: 2020-05-01 13:01:42

CC:  egourgoulhon

Keywords: manifolds, multivector_field, scalar_field

If `P` is a multivector field and `f` is a scalar field then `f.wedge(P)` is already defined


```
sage: M = Manifold(3, 'M')
sage: X.<x,y,z> = M.chart()
sage: ddX = X.frame()
sage: ddx,ddy,ddz = ddX[:]
sage: P = x*ddy.wedge(ddz) + y*ddz.wedge(ddx) + z*ddx.wedge(ddy)
sage: f = M.scalar_field(x)
sage: f.wedge(P)
x*z d/dx/\d/dy - x*y d/dx/\d/dz + x^2 d/dy/\d/dz
```


but `P.wedge(f)` is not:


```
sage: P.wedge(f)
...
AttributeError: 'DiffScalarFieldAlgebra_with_category.element_class' object has no attribute '_ambient_domain'
```


This is the multivector field analogue of #28579.


---

Comment by egourgoulhon created at 2020-05-03 13:33:10

Changing status from new to needs_review.


---

Comment by egourgoulhon created at 2020-05-03 13:33:10

New commits:


---

Comment by egourgoulhon created at 2020-05-03 13:34:01

Thanks for reporting this; a fix is proposed in the above commit.


---

Comment by rburing created at 2020-05-04 10:55:08

Looks good to me! üëç


---

Comment by rburing created at 2020-05-04 10:55:08

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2020-05-26 21:43:45

Resolution: fixed
