# Issue 17459: bug in polynomial interface to Singular (in special rings)

archive/issues_017459.json:
```json
{
    "body": "CC:  simonking @malb swewers\n\nKeywords: Singular polynomial interface\n\nIt seems that the interface to Singular has a bug,\nsee example:\n\n```\nsage: K0=GF(11)\nsage: #K0=QQ\nsage: R0.<b>=K0[]\nsage: K.<b>=K0.extension(b^5+4)\nsage: R1.<zzz>=K[]\nsage: L=FractionField(R1)\nsage: R.<x>=L[]\nsage: f=x^4+1/(b*zzz)\nTrue\nsage: f._singular_()  #  where is the fraction 1/(b*zzz)  ?\nx^4\nsage: g = R(x^4)\nsage: f==g\nFalse\n\n```\n\nNote that already\n\n```\nsage: (1/(b*zzz))._singular_()\n0 \n```\n\nRemarkable is that `f = x^4+1/(b)*(1/zzz) ` is correctly translated to Singular:\n\n```\nsage: K0=GF(11)\nsage: #K0=QQ\nsage: R0.<b>=K0[]\nsage: K.<b>=K0.extension(b^5+4)\nsage: R1.<zzz>=K[]\nsage: L=FractionField(R1)\nsage: R.<x>=L[]\nsage: f=x^4+1/(b)*(1/zzz)\nsage: f._singular_() \n-1/(4*zzz)*b^4+x^4\nsage: g = -1/(4*zzz)*b^4+x^4\nsage: f == g \nTrue\n```\n\nPlease check  if there is a similar issue in other rings than in the example above.\n\n`@`Simon, `@`Martin:\nshould I Ccing someone else or remove you from Cc?\n\nIssue created by migration from https://trac.sagemath.org/ticket/17696\n\n",
    "created_at": "2015-01-30T14:30:01Z",
    "labels": [
        "component: interfaces",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-6.5",
    "title": "bug in polynomial interface to Singular (in special rings)",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/17459",
    "user": "https://trac.sagemath.org/admin/accounts/users/jakobkroeker"
}
```
CC:  simonking @malb swewers

Keywords: Singular polynomial interface

It seems that the interface to Singular has a bug,
see example:

```
sage: K0=GF(11)
sage: #K0=QQ
sage: R0.<b>=K0[]
sage: K.<b>=K0.extension(b^5+4)
sage: R1.<zzz>=K[]
sage: L=FractionField(R1)
sage: R.<x>=L[]
sage: f=x^4+1/(b*zzz)
True
sage: f._singular_()  #  where is the fraction 1/(b*zzz)  ?
x^4
sage: g = R(x^4)
sage: f==g
False

```

Note that already

```
sage: (1/(b*zzz))._singular_()
0 
```

Remarkable is that `f = x^4+1/(b)*(1/zzz) ` is correctly translated to Singular:

```
sage: K0=GF(11)
sage: #K0=QQ
sage: R0.<b>=K0[]
sage: K.<b>=K0.extension(b^5+4)
sage: R1.<zzz>=K[]
sage: L=FractionField(R1)
sage: R.<x>=L[]
sage: f=x^4+1/(b)*(1/zzz)
sage: f._singular_() 
-1/(4*zzz)*b^4+x^4
sage: g = -1/(4*zzz)*b^4+x^4
sage: f == g 
True
```

Please check  if there is a similar issue in other rings than in the example above.

`@`Simon, `@`Martin:
should I Ccing someone else or remove you from Cc?

Issue created by migration from https://trac.sagemath.org/ticket/17696


