# Issue 13553: The conversion from E to E.abelian_group() does not perserve group order for elliptic curves over finite fields.

Issue created by migration from Trac.

Original creator: mderickx

Original creation time: 2012-11-25 23:45:43

Assignee: tbd

One would expect that the following code is deterministic and prints 10 times the same:

```
sub_gens=[(542, 488, 1)]
p=709
for i in xrange(10):
    E2=EllipticCurve(GF(p),[606,486])
    ab=E2.abelian_group()
    sub_gens=[E2(i) for i in sub_gens]
    index=ab.order()/ab.submodule([ab(i) for i in sub_gens]).order()
    sub=ab.submodule([ab(i) for i in sub_gens])
    print index,[(ab(i),i.order(),ab(i).order()) for i in sub_gens]
```


However the output is:

```
6 [((542 : 488 : 1), 57, 114)]
228 [((542 : 488 : 1), 57, 3)]
6 [((542 : 488 : 1), 57, 114)]
3 [((542 : 488 : 1), 57, 228)]
3 [((542 : 488 : 1), 57, 228)]
6 [((542 : 488 : 1), 57, 114)]
6 [((542 : 488 : 1), 57, 114)]
3 [((542 : 488 : 1), 57, 228)]
228 [((542 : 488 : 1), 57, 3)]
6 [((542 : 488 : 1), 57, 114)]
```



---

Comment by mderickx created at 2012-11-26 00:20:21

This weird problem seems to be caused by the following


```
vec=(0,2)
ab_elt=ab(vec)
for i in xrange(10):
    print vec,ab_elt
    vec=ab_elt.vector()
    ab_elt=ab(vec)
```



---

Comment by mderickx created at 2012-11-26 00:21:04

This outputs:

```
(0, 2) (665 : 37 : 1)
(0, 2) (11 : 229 : 1)
(2, 0) (665 : 37 : 1)
(0, 2) (11 : 229 : 1)
(2, 0) (665 : 37 : 1)
(0, 2) (11 : 229 : 1)
(2, 0) (665 : 37 : 1)
(0, 2) (11 : 229 : 1)
(2, 0) (665 : 37 : 1)
(0, 2) (11 : 229 : 1)
```



---

Comment by mderickx created at 2012-11-26 00:41:15

Changing assignee from tbd to joyner.


---

Comment by mderickx created at 2012-11-26 00:41:15

Changing type from PLEASE CHANGE to defect.


---

Comment by mderickx created at 2012-11-26 00:41:15

Changing component from PLEASE CHANGE to group theory.


---

Comment by mderickx created at 2012-11-26 07:31:57

I've made this critical since this bug affect the initialisation of all things inheriting from FGP_Module and silently produces completely wrong answers.


---

Comment by mderickx created at 2012-11-26 07:31:57

Changing priority from major to critical.


---

Comment by chapoton created at 2013-07-22 11:13:44

trying to look at the problem, here is part of the problem maybe:

```
sage: p=709
sage: E2=EllipticCurve(GF(p),[606,486])
sage: ab=E2.abelian_group()
sage: ab((2,0))
(11 : 229 : 1)
sage: ab(vector((2,0)))
(409 : 94 : 1)
sage: ab((0,2))
(409 : 94 : 1)
sage: ab(vector((0,2)))
(11 : 229 : 1)
```

so there is a strange transposition of the arguments.

*But* there is also something random happening in the choice of the embedding:

```
sage: ab=EllipticCurve(GF(p),[606,486]).abelian_group()
sage: ab(vector((2,0)))
(534 : 340 : 1)
sage: ab=EllipticCurve(GF(p),[606,486]).abelian_group()
sage: ab(vector((2,0)))
(350 : 542 : 1)
```



---

Comment by chapoton created at 2014-09-08 18:51:41

Changing status from new to needs_review.


---

Comment by chapoton created at 2014-09-08 18:51:41

This seems to have been solve by #16261


---

Comment by jdemeyer created at 2014-09-09 07:49:29

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2014-09-09 14:51:47

Resolution: fixed
