# Issue 14471: FreeGroup.quotient does not convert relations

Issue created by migration from https://trac.sagemath.org/ticket/14675

Original creator: mmarco

Original creation time: 2013-06-01 21:56:35

Assignee: mmarco

CC:  vbraun sydahmad vdelecroix jhpalmieri tjolivet rbeezer dimpase dshurbert

Keywords: free groups, finitely presented groups

Somebody that was using finitely presented groups pointed me the following behaviour (which was very confusing for him):


```
sage: F1.<a,b,c>=FreeGroup()
sage: F2.<a,b>=FreeGroup()
sage: r=a*b/a
sage: r.parent()
Free Group on generators {a, b}
sage: r in F1
True
sage: F1/[r]
---------------------------------------------------------------------------
ValueError                                Traceback (most recent call last)
<ipython-input-6-2ebcb0072f61> in <module>()
----> 1 F1/[r]

/usr/lib64/python2.7/site-packages/sage/groups/free_group.pyc in quotient(self, relations)
    620         """
    621         from sage.groups.finitely_presented import FinitelyPresentedGroup
--> 622         return FinitelyPresentedGroup(self, tuple(relations))
    623 
    624     __div__ = quotient

/usr/lib64/python2.7/site-packages/sage/misc/classcall_metaclass.so in sage.misc.classcall_metaclass.ClasscallMetaclass.__call__ (sage/misc/classcall_metaclass.c:1105)()

/usr/lib64/python2.7/site-packages/sage/misc/cachefunc.so in sage.misc.cachefunc.WeakCachedFunction.__call__ (sage/misc/cachefunc.c:5363)()

/usr/lib64/python2.7/site-packages/sage/structure/unique_representation.pyc in __classcall__(cls, *args, **options)
    445 
    446         """
--> 447         instance = typecall(cls, *args, **options)
    448         assert isinstance( instance, cls )
    449         if instance.__class__.__reduce__ == CachedRepresentation.__reduce__:

/usr/lib64/python2.7/site-packages/sage/misc/classcall_metaclass.so in sage.misc.classcall_metaclass.typecall (sage/misc/classcall_metaclass.c:1467)()

/usr/lib64/python2.7/site-packages/sage/groups/finitely_presented.pyc in __init__(self, free_group, relations)
    447         self._relations = relations
    448         self._assign_names(free_group.variable_names())
--> 449         parent_gap = free_group.gap() / libgap([ rel.gap() for rel in relations])
    450         ParentLibGAP.__init__(self, parent_gap)
    451         Group.__init__(self)

/usr/lib64/python2.7/site-packages/sage/structure/element.so in sage.structure.element.RingElement.__div__ (sage/structure/element.c:15103)()

/usr/lib64/python2.7/site-packages/sage/libs/gap/element.so in sage.libs.gap.element.GapElement._div_ (sage/libs/gap/element.c:5820)()

ValueError: libGAP: Error, no method found! Error, no 1st choice method found for `/' on 2 arguments

```


This is because the relations are not converted to the free group.

This patch just converts the relations to the parent, solving this and, besides, allowing things like 

```
sage: F1/[[1,2,3,-1,-2,-3],[1,3]]
Finitely presented group < a, b, c | a*b*c*a^-1*b^-1*c^-1, a*c >
```



}}}


---

Attachment


---

Comment by vbraun created at 2013-06-02 13:11:09

Ready for review?


---

Comment by mmarco created at 2013-06-02 13:14:04

Changing status from new to needs_review.


---

Comment by mmarco created at 2013-06-02 13:14:35

Yes, sorry, forgot to set it to "needs review"


---

Comment by vbraun created at 2013-06-02 13:16:07

Looks good to me.


---

Comment by tscrim created at 2013-06-02 16:21:10

Is that a positive review?


---

Comment by vbraun created at 2013-06-02 16:56:04

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2013-06-02 16:56:04

yes ;-)


---

Comment by rbeezer created at 2013-06-03 23:56:33

This ticket prompts the following question:


```
sage: F1.<a> = FreeGroup()
sage: F2.<b> = FreeGroup()
sage: F1.quotient([b])
Finitely presented group < a | a >
```


Should this be the intended behavior, or should the user get a warning about `b` not being a generator of `F1`.

Perhaps this is the root cause:


```
sage: F1(b)
a
```



---

Comment by mmarco created at 2013-06-04 00:09:41

Yes, that is indeed a problem (maybe worth anothet ticket?). In fact, it is a potentially more confusing behaviour:


```
sage: F.<a,b>=FreeGroup()
sage: G.<b,a>=FreeGroup()
sage: F(a)
b
```


The reason is that FreeGroup._self_element_constructor_ just considers the Tietze list of the argument, and constructs the element of self with the same list. Maybe we should include a test to check if all the generators of the argument are generators of self, and in that case, make the appropriate translation.


---

Comment by rbeezer created at 2013-06-04 00:19:09

Replying to [comment:8 mmarco]:

Thanks for the explanation.  Yes, that example looks even worse!

> Yes, that is indeed a problem (maybe worth anothet ticket?

Definitely another ticket - the wording here just suggested the experiment so I tossed it on.  Let's not add anymore to this.  Let me know if you want me to initiate a ticket (though, I won't be writing the fix).

Rob


---

Comment by mmarco created at 2013-06-04 00:30:53

I will open a new ticket (hopefully with a patch) tomorrow. A quick fix seems feassible, but maybe it would be a good time to do some thinking about the appropriate way to make free and finitely generated groups work best with the coercion/conversion model.


---

Comment by mmarco created at 2013-06-04 01:17:35

Done, it is now #14684


---

Comment by jdemeyer created at 2013-06-06 12:34:38

Resolution: fixed
