# Issue 15540: Problems with polynomials over extensions of finite fields

Issue created by migration from Trac.

Original creator: tscrim

Original creation time: 2014-02-02 07:39:06

Assignee: tscrim

CC:  brucin roed jdemeyer pbruin

While looking at #13642, I noticed the following:

```
sage: k = GF(5)
sage: D.<x> = k[]
sage: l.<x> = k.extension(x^2 + 2)
sage: R.<t> = l[]
sage: f = t^4 + (2*x - 1)*t^3 + (2*x + 1)*t^2 + 3
sage: h = t^4 - x*t^3 + (3*x + 1)*t^2 + 2*t + 2*x - 1
sage: pow(f, 2, h)
---------------------------------------------------------------------------
RuntimeError                              Traceback (most recent call last)
...
RuntimeError: PowerMod: bad args

sage: pow(t, 2, x) # segfault
```

This occurs on a clean 6.1.


---

Comment by tscrim created at 2014-02-02 07:44:52

Also we should re-enable the tests in #13642.


---

Comment by jpflori created at 2014-02-26 20:28:56

Changing keywords from "" to "NTL".


---

Comment by jpflori created at 2014-02-26 20:28:56

It was a problem with the use of NTL modular exp which does not like the base of equal or higher degree than the modulus.
----
New commits:


---

Comment by jpflori created at 2014-02-26 20:28:56

Changing status from new to needs_review.


---

Comment by jpflori created at 2014-02-26 20:32:49

Oops, I forgot the segfault which was not in the disabled tests.


---

Comment by jpflori created at 2014-02-26 20:32:49

Changing status from needs_review to needs_work.


---

Comment by jpflori created at 2014-02-26 20:33:56

Ok NTL does not like building a pre conditionning modulus object when the modulus is of degree one...


---

Comment by jpflori created at 2014-02-26 21:03:41

Not sure what to do about this one:

```
sage: x = polygen(GF(5))
sage: x % 2
0
```

and similar stuff.
Whatsoever, I propose to postpone that case where the modulus is of degree < 1 to a later ticket.


---

Comment by jpflori created at 2014-02-26 21:18:30

This one in not so good as well:

```
sage: x = polygen(GF(5))
sage: pow(x,100000000000,x)
Exception (FLINT memory_manager). Unable to allocate memory.
```



---

Comment by jpflori created at 2014-02-26 21:24:58

This one is nice enough as well:

```
sage: x = polygen(ZZ)
sage: pow(x,100,x+1)
x^100
```



---

Comment by jpflori created at 2014-02-26 21:43:24

Replying to [comment:4 jpflori]:
> Ok NTL does not like building a pre conditionning modulus object when the modulus is of degree one...
Same problem for NTL GF2X polynomials.


---

Comment by git created at 2014-02-26 22:33:09

Branch pushed to git repo; I updated commit sha1. This was a forced push. New commits:


---

Comment by jpflori created at 2014-02-26 22:35:58

At least the two problems mentioned in the ticket description and involving NTL are fixed now.

The polynomial stuff needs major refactoring anyway, we should move the template files to different folders in the spirit of what was done in #12555 for p-adics, use templating for additional classes, etc.; so let's postpone the other issues I reported here to follow up tickets.


---

Comment by jpflori created at 2014-02-26 22:35:58

Changing status from needs_work to needs_review.


---

Comment by jpflori created at 2014-02-26 22:43:31

Follow-up tickets: #15866, #15867, #15868.


---

Comment by tscrim created at 2014-02-27 07:57:52

Changing status from needs_review to positive_review.


---

Comment by tscrim created at 2014-02-27 07:57:52

Well let's get on those, but first, positive review here. Thanks Jean-Pierre.


---

Comment by vbraun created at 2014-03-01 08:48:23

Resolution: fixed
