# Issue 20389: lazy_import'ed modules broken on introspection

Issue created by migration from https://trac.sagemath.org/ticket/20626

Original creator: nthiery

Original creation time: 2016-05-19 07:08:23

CC:  jdemeyer vdelecroix @kliem

*Steps to reproduce*: extract the attached archive containing a
trivial module bar lazy imported from a module foo in the current
directory, and run sage:


```
sage: import foo
sage: foo.bar?
---------------------------------------------------------------------------
RuntimeError                              Traceback (most recent call last)
<ipython-input-2-04fe32111b22> in <module>()
----> 1 get_ipython().magic(u'pinfo foo.bar')

/opt/sage-git/local/lib/python2.7/site-packages/IPython/core/interactiveshell.pyc in magic(self, arg_s)
   2161         magic_name, _, magic_arg_s = arg_s.partition(' ')
   2162         magic_name = magic_name.lstrip(prefilter.ESC_MAGIC)
-> 2163         return self.run_line_magic(magic_name, magic_arg_s)
   2164 
   2165     #-------------------------------------------------------------------------


... last 3 frames repeated, from the frame below ...

/opt/sage-git/local/lib/python2.7/site-packages/sage/misc/sageinspect.pyc in sage_getdoc_original(obj)
   1765         typ = type(obj)
   1766 
-> 1767     s,argspec = _extract_embedded_signature(_sage_getdoc_unformatted(obj), typ.__name__)
   1768     if s:
   1769         pos = _extract_embedded_position(s)

RuntimeError: maximum recursion depth exceeded in __instancecheck__
```


*Analysis*: sage.misc.sageinspect.sage_getdoc_original gets confused
when detecting that `foo.bar` is of type `LazyImport` (and not module)
and trying to recover its documentation from there.


*Use case*: some Sage modules contain only documentation:

- `sage.combinat.tutorial`
- `sage.combinat.primer`
- `sage.modules.tutorial_free_module`
- `sage.categories.primer`
- `sage.categories.tutorial`

and more will come. It would be nice to lazy import them to reduce the
memory and startup footprint.


---

Comment by vbraun created at 2016-05-22 08:47:37

Possibly related: documentation of lazy imports includes various `lazy_import` stuff

```
sage: %pinfo piecewise
Type:            LazyImport
String form:     piecewise
File:            ~/Sage/src/sage/misc/lazy_import.pyx
Docstring:
   Piecewise function    <---- this section is the only one that is correct

   EXAMPLES:

      sage: var('x, y')
      (x, y)
      sage: f = piecewise([((0,1), x^2*y), ([-1,0], -x*y^2)], var=x);  f
      piecewise(x|-->x^2*y on (0, 1), x|-->-x*y^2 on [-1, 0]; x)
      sage: f(1/2)
      1/4*y
      sage: f(-1/2)
      1/2*y^2

Class docstring:
   EXAMPLES:

      sage: from sage.misc.lazy_import import LazyImport
      sage: my_integer = LazyImport('sage.rings.all', 'Integer')
      sage: my_integer(4)
      4
      sage: my_integer('101', base=2)
      5
      sage: my_integer(3/2)
      Traceback (most recent call last):
      ...
      TypeError: no conversion of this rational to integer
Init docstring:
   EXAMPLES:

      sage: from sage.misc.lazy_import import LazyImport
      sage: my_isprime = LazyImport('sage.all', 'is_prime')
      sage: my_isprime(5)
      True
      sage: my_isprime(55)
      False
Call docstring:
   Calling self calls the wrapped object.

   EXAMPLES:

      sage: from sage.misc.lazy_import import LazyImport
      sage: my_isprime = LazyImport('sage.all', 'is_prime')
      sage: my_isprime(12)
      False
      sage: my_isprime(13)
      True
```



---

Comment by jdemeyer created at 2017-04-06 13:45:01

Changing status from new to needs_review.


---

Comment by jdemeyer created at 2017-04-06 13:45:01

Last 10 new commits:


---

Comment by jdemeyer created at 2017-04-06 20:16:13

Resolution: wontfix


---

Comment by jdemeyer created at 2017-04-06 20:26:21

Changing status from closed to new.


---

Comment by jdemeyer created at 2017-04-06 20:26:21

Resolution changed from wontfix to 


---

Comment by nthiery created at 2017-04-07 03:12:31

Hi Jeroen,
I am happy to see work happening on this front, but a bit confused by the recent activity. Could you clarify? Thanks!


---

Comment by jdemeyer created at 2017-04-07 07:31:14

Replying to [comment:12 nthiery]:
> Hi Jeroen,
> I am happy to see work happening on this front, but a bit confused by the recent activity. Could you clarify?

I got quite negative reactions (mostly from Nils Bruin but also from Erik Bray) on #22752, which is a dependency of this ticket and #15648.

So either

1. Nils and/or Erik need to reimplement lazy imports "their way".

2. Nils and/or Erik should realize that my code on #22752 wasn't so bad anyway.

3. We try to fix #15648 and #20626 with the current implementation of lazy imports, without #22752.


---

Comment by nthiery created at 2018-07-22 15:03:31

Hi there,
While searching for lazy import issues I stumbled back on this ticket. It seems things have evolved a bit since the last comment with #22752 being merged. Does it change the status of this ticket?

Cheers,


---

Comment by jdemeyer created at 2018-07-22 15:29:11

I am reverting to the ticket description before #22752. Do you still have that "attached archive containing a trivial module bar lazy imported"?


---

Comment by vdelecroix created at 2018-08-03 19:20:18

update milestone 8.3 -> 8.4


---

Comment by nthiery created at 2020-09-19 04:44:05

Prompted by Sam, I tried to recreate the archive with several variants of:


```
mkdir -p foo/bar
touch foo/bar/__init__.py
cat > foo/__init.py__ <<EOF
from sage.misc.lazy_import import LazyImport
bar = LazyImport('foo', 'bar')
EOF
```


However -- not quite surprisingly -- that fails:


```
sage                                                                                                                  
┌────────────────────────────────────────────────────────────────────┐
│ SageMath version 9.0, Release Date: 2020-01-01                     │
│ Using Python 3.7.3. Type "help()" for help.                        │
└────────────────────────────────────────────────────────────────────┘
sage: import foo
sage: foo.bar
------------------------------------------------------------------------
/opt/sage-git/local/lib/python3.7/site-packages/cysignals/signals.cpython-37m-x86_64-linux-gnu.so(+0x9a64)[0x7f49349d7a64]
/opt/sage-git/local/lib/python3.7/site-packages/cysignals/signals.cpython-37m-x86_64-linux-gnu.so(+0x9b19)[0x7f49349d7b19]
/opt/sage-git/local/lib/python3.7/site-packages/cysignals/signals.cpython-37m-x86_64-linux-gnu.so(+0xd57f)[0x7f49349db57f]
/lib/x86_64-linux-gnu/libc.so.6(+0x46470)[0x7f49373fe470]
/opt/sage-git/local/lib/libpython3.7m.so.1.0(+0xe2e44)[0x7f49376c8e44]
/opt/sage-git/local/lib/libpython3.7m.so.1.0(PyUnicode_New+0x8b)[0x7f49376e98fb]
/opt/sage-git/local/lib/libpython3.7m.so.1.0(_PyUnicodeWriter_PrepareInternal+0x1c1)[0x7f493770fad1]
```


I can't remember which idiom I had tried back then. Maybe that
idiom does not exist anymore.

It would be useful though to have some idiom that enables to lazy
import a submodule into a module, making sure that one can indeed
inspect its documentation.
