# Issue 33570: is_subring fails on finite field extensions with explicit gens

Issue created by migration from https://trac.sagemath.org/ticket/33807

Original creator: antoine-leudiere

Original creation time: 2022-05-05 12:12:57

CC:  zimmerma

Hi!

The following works:


```
sage: Fq = GF(3^2)
sage: L = Fq.extension(6)
sage: M = L.extension(2)
sage: assert Fq.is_subring(M)
True
```


The following does not:


```
sage: Fq.<z2> = GF(3^2)
sage: L = Fq.extension(6)
sage: M = L.extension(2)
sage: Fq.is_subring(M)
False
```


This is dispite

```
sage: Fq.is_subring(L)
True
sage: L.is_subring(M)
True
```


I am using version `SageMath version 9.6.rc2, Release Date: 2022-04-25`.
