# Issue 12320: Polyhedron().radius() is nonsensical

Issue created by migration from Trac.

Original creator: kini

Original creation time: 2012-02-10 15:01:34

Assignee: mhampton

See [this sage-support thread](https://groups.google.com/d/topic/sage-support/rj6ZjjPPDSk/discussion).


```
sage: sq=polytopes.n_cube(2)
sage: sq.vertices()
[[1, 1], [-1, 1], [1, -1], [-1, -1]]
sage: sq.radius()
2*sqrt(2)
sage: Polyhedron([[p0+1,p1] for p0,p1 in sq.vertices()]).radius()
2*sqrt(3)
sage: Polyhedron([[p0+10,p1] for p0,p1 in sq.vertices()]).radius()
2*sqrt(102)
```


The radius of the unit square is of course `sqrt(2)`. I have no idea what the current code is trying to do, so I'm rewriting it.


---

Comment by kini created at 2012-02-10 15:14:05

Running tests. The code block in the description now looks like this:


```
sage: sq=polytopes.n_cube(2)
sage: sq.vertices() 
[[1, 1], [-1, 1], [1, -1], [-1, -1]]
sage: sq.radius()
sqrt(2)
sage: Polyhedron([[p0+1,p1] for p0,p1 in sq.vertices()]).radius()
sqrt(2)
sage: Polyhedron([[p0+10,p1] for p0,p1 in sq.vertices()]).radius()
sqrt(2)
```


And just to show that it can produce numbers other than `sqrt(2)`:


```
sage: Polyhedron([[p0*3+10,p1*3] for p0,p1 in sq.vertices()]).radius()
3*sqrt(2)
```



---

Attachment

apply to $SAGE_ROOT/devel/sage


---

Comment by kini created at 2012-02-11 09:36:46

All tests pass. Please review!


---

Comment by kini created at 2012-02-11 09:36:46

Changing status from new to needs_review.


---

Comment by ppurka created at 2012-02-11 13:58:08

Changing status from needs_review to positive_review.


---

Comment by ppurka created at 2012-02-11 13:58:08

Earlier code was clearly wrong. This one works.


---

Comment by jdemeyer created at 2012-02-12 12:29:17

Sorry, mistake.


---

Comment by jdemeyer created at 2012-02-14 14:24:10

Resolution: fixed
