# Issue 13992: "subgroups" fails for C1 x C2

Issue created by migration from https://trac.sagemath.org/ticket/14196

Original creator: mstreng

Original creation time: 2013-02-27 19:48:59

Assignee: malb

CC:  bisson

Keywords: abelian group subgroups invfac one

In Sage 5.7:

```
sage: A = AbelianGroup([2,1])
sage: A
Multiplicative Abelian group isomorphic to C2 x C1
sage: A.subgroups()
[Multiplicative Abelian subgroup isomorphic to C2 generated by {f0},
 Trivial Abelian subgroup]

sage: B = AbelianGroup([1,2])
sage: B
Multiplicative Abelian group isomorphic to C1 x C2
sage: B.subgroups()
Vectors not LI:  [[0, 0], [0, 1]]
...
ValueError: The given basis vectors must be linearly independent.
```


This last command should work just as well as A.subgroups().


---

Comment by mstreng created at 2013-02-27 19:49:51

In Sage 5.6, it was still:

```
sage: A = AbelianGroup([2,1])
sage: A
Multiplicative Abelian Group isomorphic to C2
sage: A.subgroups()
[Multiplicative Abelian Group isomorphic to C2, which is the subgroup of
Multiplicative Abelian Group isomorphic to C2
generated by [f], Trivial Abelian Group, which is the subgroup of
Multiplicative Abelian Group isomorphic to C2
generated by []]
sage: B = AbelianGroup([1,2])
sage: B
Multiplicative Abelian Group isomorphic to C2
sage: B.subgroups()
[Multiplicative Abelian Group isomorphic to C2, which is the subgroup of
Multiplicative Abelian Group isomorphic to C2
generated by [f], Trivial Abelian Group, which is the subgroup of
Multiplicative Abelian Group isomorphic to C2
generated by []]
```

I think the situation in Sage 5.7 is an improvement, except of course for the failure to compute `B.subgroups()`.


---

Comment by tscrim created at 2014-11-28 19:28:09

Changing status from new to needs_review.


---

Comment by tscrim created at 2014-11-28 19:28:09

Changing component from commutative algebra to group theory.


---

Comment by tscrim created at 2014-11-28 19:28:09

New commits:


---

Comment by ncohen created at 2015-01-16 11:02:20

Is it me or is this commit in Sage already ?

Nathann


---

Comment by ncohen created at 2015-01-16 11:04:48

It seems to be me. And the trac server which seems to say that the diff between this branch and Sage is empty `O_o`


---

Comment by tscrim created at 2015-01-16 15:15:15

I think it's a trac bug that pops up sporadically.


---

Comment by chapoton created at 2015-03-27 19:34:08

ok, lgtm


---

Comment by chapoton created at 2015-03-27 19:34:08

Changing status from needs_review to positive_review.


---

Comment by tscrim created at 2015-03-27 20:50:19

Thanks Frederic.


---

Comment by vbraun created at 2015-03-31 23:58:11

Resolution: fixed
