# Issue 23053: Graph.merge_vertices() destroys loops

Issue created by migration from Trac.

Original creator: zgershkoff

Original creation time: 2017-06-21 01:57:33

CC:  dcoudert tscrim stefan




---

Comment by zgershkoff created at 2017-06-21 02:14:07

Changing component from PLEASE CHANGE to graph theory.


---

Comment by zgershkoff created at 2017-06-21 02:14:07

Changing type from PLEASE CHANGE to defect.


---

Comment by zgershkoff created at 2017-06-21 02:14:07


```
sage: edgelist = [(0,0,'a'), (0,1,'b'), (1,1,'c')]
sage: G = Graph(edgelist, loops=True, multiedges=True)
sage: G.merge_vertices([0,1]); G.edges()
[(0,0,'a')]
```


It looks like merge_vertices() works by computing the edge boundary between the specified set of vertices and the rest of the graph, then deleting all the vertices except the first one, then putting the edges back in.

So there are actually two issues here. (1) Loops not on the first vertex will be lost (because they're not in the edge boundary and their vertices get deleted), and (2) we'll lose other edges that are not in the edge boundary so they should become loops.

(1) is certainly a defect. I'm not so certain about (2) because I don't know if it's appropriate for this method to create loops. In fact, it's probably not.


---

Comment by zgershkoff created at 2017-06-21 02:14:07

Changing priority from major to minor.


---

Comment by dcoudert created at 2017-06-21 07:23:17

It is not an easy task to decide on the good behavior. See #10357 #9807 #7304 #7159.


---

Comment by zgershkoff created at 2017-06-21 21:23:06

In that case, I'll fix (1) and leave (2) for one of the other tickets.


---

Comment by zgershkoff created at 2017-06-21 22:43:15

Changing status from new to needs_review.


---

Comment by zgershkoff created at 2017-06-21 22:43:15

It now checks if any of the (di)graph's loops are on the vertices to be deleted before deleting them, and it only adds a few steps if loops are disabled.
----
New commits:


---

Comment by zgershkoff created at 2017-06-22 17:10:16

Before this gets closed: There's code at the beginning of `merge_vertices()` to check if the first vertex label is `None`, but I don't think this will ever happen because of #9362. Should I take those lines out?

Nevermind. A user may wish to input `None` as the first item in the list because this will give the merged vertex a new name.


---

Comment by Stefan created at 2017-06-23 04:07:42

Changing status from needs_review to positive_review.


---

Comment by Stefan created at 2017-06-23 04:07:42

Works as advertised!


---

Comment by dcoudert created at 2017-06-24 08:12:42

This could be more efficient

```
        u = vertices[0]
        for v in vertices[1:]:
            if self.has_edge(v, v):
                if self.allows_multiple_edges():
                    for l in self.edge_label(v, v):
                        self.add_edge(u, u, l)
                else:
                    self.add_edge(u, u, self.edge_label(v, v))
```



Could you add a test to do nothing when `len(vertices) < 2`.

```
sage: G = Graph()
sage: G.merge_vertices([None])
sage: G
Graph on 1 vertex
sage: G.merge_vertices([None])
sage: G
Graph on 2 vertices
```



Other issue: `TESTS::` -> `TESTS:`


---

Comment by dcoudert created at 2017-06-24 08:12:42

Changing status from positive_review to needs_work.


---

Comment by dcoudert created at 2017-06-24 08:18:52

Also, when multiedges are not allowed, the behavior must be documented.

```
sage: edgelist = [(0,0,'a'),(0,1,'b'),(1,1,'c')]
sage: G = Graph(edgelist, loops=True, multiedges=False)
sage: G.merge_vertices([0,1]); G.edges()
[(0, 0, 'c')]
sage: edgelist = [(0,0,'a'),(0,1,'b'),(1,1,'c'), (1, 2, 'd'), (2, 2, 'e')]
sage: G = Graph(edgelist, loops=True, multiedges=False)
sage: G.merge_vertices([0,1,2]); G.edges()
[(0, 0, 'e')]
sage: G = Graph(edgelist, loops=True, multiedges=False)
sage: G.merge_vertices([0,2,1]); G.edges()
[(0, 0, 'e')]
```



---

Comment by zgershkoff created at 2017-06-25 16:28:45

Replying to [comment:8 dcoudert]:
> This could be more efficient
> {{{
>         u = vertices[0]
>         for v in vertices[1:]:
>             if self.has_edge(v, v):
>                 if self.allows_multiple_edges():
>                     for l in self.edge_label(v, v):
>                         self.add_edge(u, u, l)
>                 else:
>                     self.add_edge(u, u, self.edge_label(v, v))
> }}}

Is this faster because it specifies the vertices, rather than iterating over a list of edges to get the loops?

> 
> Could you add a test to do nothing when `len(vertices) < 2`.
> {{{
> sage: G = Graph()
> sage: G.merge_vertices([None])
> sage: G
> Graph on 1 vertex
> sage: G.merge_vertices([None])
> sage: G
> Graph on 2 vertices
> }}}

It's an undocumented feature that `None` as the first entry will give the vertex a new name, and a bug that it will create a new vertex if there's nothing to merge. I'll addressed both.

> Other issue: `TESTS::` -> `TESTS:`

Is there a guide where I can see how to correctly mark up documentation? The developer's guide doesn't seem to cover it all, and many of the other methods I've looked at use `TESTS::` and not `TESTS:`. This doesn't seem to be a standard thing for Python docstrings so I'm not sure where to look.


---

Comment by dcoudert created at 2017-06-25 17:50:44

Replying to [comment:10 zgershkoff]:
> Replying to [comment:8 dcoudert]:
> > This could be more efficient
> > {{{
> >         u = vertices[0]
> >         for v in vertices[1:]:
> >             if self.has_edge(v, v):
> >                 if self.allows_multiple_edges():
> >                     for l in self.edge_label(v, v):
> >                         self.add_edge(u, u, l)
> >                 else:
> >                     self.add_edge(u, u, self.edge_label(v, v))
> > }}}
> 
> Is this faster because it specifies the vertices, rather than iterating over a list of edges to get the loops?
The `loop_edges` method calls the `loop_vertices` method which returns `[v for v in self if self.has_edge(v,v)]` if loops are allowed.

Since `vertices` is a subset of the vertices of the graph, and we can expect this set to be small most of the time (e.g., 2), what I propose should be faster than your first proposal.

 
 

> > Could you add a test to do nothing when `len(vertices) < 2`.
 
> > {{{
> > sage: G = Graph()
> > sage: G.merge_vertices([None])
> > sage: G
> > Graph on 1 vertex
> > sage: G.merge_vertices([None])
> > sage: G
> > Graph on 2 vertices
> > }}}
> 
> It's an undocumented feature that `None` as the first entry will give the vertex a new name, and a bug that it will create a new vertex if there's nothing to merge. I'll addressed both.

It's documented in the method, 3rd paragraph: `The new vertex is named after the first vertex in the list given in argument. If this first name is None, a new vertex is created.`
  
> > Other issue: `TESTS::` -> `TESTS:`
> 
> Is there a guide where I can see how to correctly mark up documentation? The developer's guide doesn't seem to cover it all, and many of the other methods I've looked at use `TESTS::` and not `TESTS:`. This doesn't seem to be a standard thing for Python docstrings so I'm not sure where to look.

To be honest, I don't know. I checked on recent ticket, and #23255 suggests that `TESTS::` is the good form. So keep it as is.


---

Comment by git created at 2017-06-25 18:03:37

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by zgershkoff created at 2017-06-25 18:09:43

Replying to [comment:11 dcoudert]:
> To be honest, I don't know. I checked on recent ticket, and #23255 suggests that `TESTS::` is the good form. So keep it as is.

Judging from that ticket, the convention is to use `::` when `sage:` follows and `:` when text follows. So in this instance, I should indeed use `TESTS:`. The usage isn't consistent throughout the file but I'm not going to try and fix it within this ticket.

I made the changes you suggested, but I had to change one of the tests:


```
sage: edgelist = [(0,0,'a'),(0,1,'b'),(1,1,'c'), (1, 2, 'd'), (2, 2, 'e')]
sage: G = Graph(edgelist, loops=True, multiedges=False)
sage: G.merge_vertices([0,1,2]); G.edges()
[(0, 0, 'e')]
sage: G = Graph(edgelist, loops=True, multiedges=False)
sage: G.merge_vertices([0,2,1]); G.edges()
[(0, 0, 'e')]
```


I think the last output should be `[(0, 0, 'c')]`, and that's what the code currently returns, since it evaluates vertex `1` last and finds the label `'c'` last.


---

Comment by zgershkoff created at 2017-06-25 18:09:51

Changing status from needs_work to needs_review.


---

Comment by dcoudert created at 2017-06-25 19:03:22

Changing status from needs_review to positive_review.


---

Comment by dcoudert created at 2017-06-25 19:03:22

That's much better now. Thanks.


---

Comment by vbraun created at 2017-06-26 21:24:41

Resolution: fixed
