# Issue 25331: regression between 8.0 and 8.2

archive/issues_025331.json:
```json
{
    "body": "CC:  rws\n\nthis used to work in 8.0:\n\n```\nsage: a=650824205667/2^52;b=4507997673885435/2^51\nsage: z=sqrt(a+i*b)\nsage: a=RR(a);b=RR(b);s=a^2+b^2;rho=sqrt(s);nu=rho+a;x=sqrt(nu/2);y=b/(2*x)\nsage: RR((y.exact_rational()-z.imag())/z.imag())*2^53\n3.99819260752485\n```\n\nWith Sage 8.2 we get for the last command:\n\n```\nsage: RR((y.exact_rational()-z.imag())/z.imag())*2^53\n---------------------------------------------------------------------------\nRuntimeError                              Traceback (most recent call last)\n<ipython-input-34-0d9f9c6adca1> in <module>()\n----> 1 RR((y.exact_rational()-z.imag())/z.imag())*Integer(2)**Integer(53)\n\n/usr/local/sage-8.2/local/lib/python2.7/site-packages/sage/structure/element.pyx in sage.structure.element.Element.__div__ (build/cythonized/sage/structure/element.c:12773)()\n   1660         cdef int cl = classify_elements(left, right)\n   1661         if HAVE_SAME_PARENT(cl):\n-> 1662             return (<Element>left)._div_(right)\n   1663         if BOTH_ARE_ELEMENT(cl):\n   1664             return coercion_model.bin_op(left, right, div)\n\n/usr/local/sage-8.2/local/lib/python2.7/site-packages/sage/symbolic/expression.pyx in sage.symbolic.expression.Expression._div_ (build/cythonized/sage/symbolic/expression.cpp:25729)()\n   3534                 raise ZeroDivisionError(\"Symbolic division by zero\")\n   3535             else:\n-> 3536                 raise\n   3537         finally:\n   3538             sig_off()\n\n/usr/local/sage-8.2/local/lib/python2.7/site-packages/sage/symbolic/expression.pyx in sage.symbolic.expression.Expression._div_ (build/cythonized/sage/symbolic/expression.cpp:25625)()\n   3526                                o)\n   3527             else:\n-> 3528                 x = left._gobj / _right._gobj\n   3529             return new_Expression_from_GEx(left._parent, x)\n   3530         except Exception as msg:\n\nRuntimeError: unsupported type in numeric::lcm\n```\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/25568\n\n",
    "created_at": "2018-06-13T07:55:28Z",
    "labels": [
        "basic arithmetic",
        "critical",
        "bug"
    ],
    "title": "regression between 8.0 and 8.2",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/25331",
    "user": "zimmerma"
}
```
CC:  rws

this used to work in 8.0:

```
sage: a=650824205667/2^52;b=4507997673885435/2^51
sage: z=sqrt(a+i*b)
sage: a=RR(a);b=RR(b);s=a^2+b^2;rho=sqrt(s);nu=rho+a;x=sqrt(nu/2);y=b/(2*x)
sage: RR((y.exact_rational()-z.imag())/z.imag())*2^53
3.99819260752485
```

With Sage 8.2 we get for the last command:

```
sage: RR((y.exact_rational()-z.imag())/z.imag())*2^53
---------------------------------------------------------------------------
RuntimeError                              Traceback (most recent call last)
<ipython-input-34-0d9f9c6adca1> in <module>()
----> 1 RR((y.exact_rational()-z.imag())/z.imag())*Integer(2)**Integer(53)

/usr/local/sage-8.2/local/lib/python2.7/site-packages/sage/structure/element.pyx in sage.structure.element.Element.__div__ (build/cythonized/sage/structure/element.c:12773)()
   1660         cdef int cl = classify_elements(left, right)
   1661         if HAVE_SAME_PARENT(cl):
-> 1662             return (<Element>left)._div_(right)
   1663         if BOTH_ARE_ELEMENT(cl):
   1664             return coercion_model.bin_op(left, right, div)

/usr/local/sage-8.2/local/lib/python2.7/site-packages/sage/symbolic/expression.pyx in sage.symbolic.expression.Expression._div_ (build/cythonized/sage/symbolic/expression.cpp:25729)()
   3534                 raise ZeroDivisionError("Symbolic division by zero")
   3535             else:
-> 3536                 raise
   3537         finally:
   3538             sig_off()

/usr/local/sage-8.2/local/lib/python2.7/site-packages/sage/symbolic/expression.pyx in sage.symbolic.expression.Expression._div_ (build/cythonized/sage/symbolic/expression.cpp:25625)()
   3526                                o)
   3527             else:
-> 3528                 x = left._gobj / _right._gobj
   3529             return new_Expression_from_GEx(left._parent, x)
   3530         except Exception as msg:

RuntimeError: unsupported type in numeric::lcm
```


Issue created by migration from https://trac.sagemath.org/ticket/25568





---

archive/issue_comments_357112.json:
```json
{
    "body": "Changing component from basic arithmetic to symbolics.",
    "created_at": "2018-06-13T09:29:17Z",
    "issue": "https://github.com/sagemath/sagetest/issues/25331",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/25331#issuecomment-357112",
    "user": "jdemeyer"
}
```

Changing component from basic arithmetic to symbolics.



---

archive/issue_comments_357113.json:
```json
{
    "body": "thank you Jeroen for analyzing the issue!",
    "created_at": "2018-06-13T09:49:44Z",
    "issue": "https://github.com/sagemath/sagetest/issues/25331",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/25331#issuecomment-357113",
    "user": "zimmerma"
}
```

thank you Jeroen for analyzing the issue!



---

archive/issue_comments_357114.json:
```json
{
    "body": "It looks like https://github.com/pynac/pynac/issues/179 is not properly resolved. In pynac-0.7.21 this no longer crashes and is generally improved but the problem of `Expression` Python objects as numeric persists:\n\n```\nsage: z\n1/2*sqrt(sqrt(2))*sqrt(-sqrt(2) + 2)\nsage: w\n1/2*2^(1/4)*sqrt(-sqrt(2) + 2)\nsage: (1/2-z)/z\n-(sqrt(sqrt(2))*sqrt(-sqrt(2) + 2) - 1)/(sqrt(sqrt(2))*sqrt(-sqrt(2) + 2))\nsage: (1/2-w)/w\n-1/2*2^(3/4)*(2^(1/4)*sqrt(-sqrt(2) + 2) - 1)/sqrt(-sqrt(2) + 2)\n```\n\nWhat happens is that eventually Pynac needs the absolute value of a `NumberFieldElement` like `1+I` and in `numeric::abs` calls `PyNumber_Absolute` which in Python is `number_field_element_quadratic.pyx:NumberFieldElement_quadratic::__abs__()`. This returns `(self.real()**2 + self.imag()**2).sqrt()` which itself is a symbolic expression Python object. Pynac's `numeric::abs` is not aware of the type of Python object and puts it, as it does with all other Python objects, in a `numeric` which becomes part of the result expression:\n\n```\nsage: abs(1+I)\nsqrt(2)\nsage: _._dbgprinttree()\nsqrt(2) (numeric) @0x40ee870, hash=0x678dde6e5fd29f08, flags=0x1, type PYOBJECT: \"<type 'sage.symbolic.expression.Expression'>\"\n```\n",
    "created_at": "2018-06-13T13:31:46Z",
    "issue": "https://github.com/sagemath/sagetest/issues/25331",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/25331#issuecomment-357114",
    "user": "rws"
}
```

It looks like https://github.com/pynac/pynac/issues/179 is not properly resolved. In pynac-0.7.21 this no longer crashes and is generally improved but the problem of `Expression` Python objects as numeric persists:

```
sage: z
1/2*sqrt(sqrt(2))*sqrt(-sqrt(2) + 2)
sage: w
1/2*2^(1/4)*sqrt(-sqrt(2) + 2)
sage: (1/2-z)/z
-(sqrt(sqrt(2))*sqrt(-sqrt(2) + 2) - 1)/(sqrt(sqrt(2))*sqrt(-sqrt(2) + 2))
sage: (1/2-w)/w
-1/2*2^(3/4)*(2^(1/4)*sqrt(-sqrt(2) + 2) - 1)/sqrt(-sqrt(2) + 2)
```

What happens is that eventually Pynac needs the absolute value of a `NumberFieldElement` like `1+I` and in `numeric::abs` calls `PyNumber_Absolute` which in Python is `number_field_element_quadratic.pyx:NumberFieldElement_quadratic::__abs__()`. This returns `(self.real()**2 + self.imag()**2).sqrt()` which itself is a symbolic expression Python object. Pynac's `numeric::abs` is not aware of the type of Python object and puts it, as it does with all other Python objects, in a `numeric` which becomes part of the result expression:

```
sage: abs(1+I)
sqrt(2)
sage: _._dbgprinttree()
sqrt(2) (numeric) @0x40ee870, hash=0x678dde6e5fd29f08, flags=0x1, type PYOBJECT: "<type 'sage.symbolic.expression.Expression'>"
```




---

archive/issue_comments_357115.json:
```json
{
    "body": "This means the specific issue is improved with #24838 but not completely resolved:\n\n```\nsage: sage: z = sqrt(1+I).imag()\n....: sage: w = z.simplify()\n....: \nsage: (1/2-z)/2\n-1/4*sqrt(sqrt(2))*sqrt(-sqrt(2) + 2) + 1/4\nsage: (1/2-w)/2\n-1/4*2^(1/4)*sqrt(-sqrt(2) + 2) + 1/4\n```\n",
    "created_at": "2018-06-13T13:42:25Z",
    "issue": "https://github.com/sagemath/sagetest/issues/25331",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/25331#issuecomment-357115",
    "user": "rws"
}
```

This means the specific issue is improved with #24838 but not completely resolved:

```
sage: sage: z = sqrt(1+I).imag()
....: sage: w = z.simplify()
....: 
sage: (1/2-z)/2
-1/4*sqrt(sqrt(2))*sqrt(-sqrt(2) + 2) + 1/4
sage: (1/2-w)/2
-1/4*2^(1/4)*sqrt(-sqrt(2) + 2) + 1/4
```




---

archive/issue_comments_357116.json:
```json
{
    "body": "update milestone 8.3 -> 8.4",
    "created_at": "2018-08-03T19:20:18Z",
    "issue": "https://github.com/sagemath/sagetest/issues/25331",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/25331#issuecomment-357116",
    "user": "vdelecroix"
}
```

update milestone 8.3 -> 8.4
