# Issue 15045: Labelling of product posets seem to normalize the labels of the posets

Issue created by migration from https://trac.sagemath.org/ticket/15282

Original creator: darij

Original creation time: 2013-10-15 17:55:14

CC:  sage-combinat aschilling tscrim jmantysalo ncohen

Keywords: posets, finite_posets, sage-combinat

When taking the product of two posets, apparently both posets are getting relabelled:


```
sage: A = Posets.ChainPoset(3)
sage: B = A.product(A).product(A)
sage: 
sage: B[0]    # one would expect (0, 0, 0)
(0, 0)
sage: B[1]    # but no
(0, 1)
sage: B[2]    # instead, the first coordinate is what really should be
(0, 2)
sage: B[3]    # 3 * the first coordinate + the second coordinate
(1, 0)
sage: B[4]    # while the second coordinate is OK
(1, 1)
sage: B[5]
(1, 2)
sage: B[6]
(2, 0)
sage: B[7]
(2, 1)
sage: B[8]
(2, 2)
sage: B[9]
(3, 0)
sage: B[10]
(6, 0)
sage: B.show()
```


This doesn't exactly help coding.


---

Comment by tscrim created at 2013-10-15 18:14:11

I would actually expect things like `((0, 0), 0)` since there is no way to tell if you are taking a 3 fold product from the commands. However I do think there should be an option for keeping the old labels and possibly extend product by

```
A.product([A, A])
```

which would automatically relabel itself with `(0, 0, 0)` since it would "know" it's a 3x product.


---

Comment by darij created at 2013-10-15 18:14:53

Oops, yes, I meant it should be ((0, 0), 0).


---

Comment by jmantysalo created at 2014-10-02 08:59:05

I didn't notice this and did #17060 as a new ticket. I suggest this to be closed as a duplicate.

I too think that `product`, `disjoint_union` and `ordinal_sum` might have versions for getting `(a,b,c)` instead of `((a,b),c)`. However, it is easy relabeling with `lambda l: (l[0][0], l[0][1], l[1])`. Maybe add a note of this to doc of `product`? See #17053 and documentation of `disjoint_union`.


---

Comment by jmantysalo created at 2014-10-02 08:59:05

Changing status from new to needs_review.


---

Comment by ncohen created at 2014-10-02 12:02:55

Changing status from needs_review to positive_review.


---

Comment by ncohen created at 2014-10-02 12:02:55

Jori,

When you change the milestone to wontfix, please change the status to `positive_review` at the same time.

About the `(a,b,c)` instead of `((a,b),c)` thing: it is not that complicated to accept such input if you need it:


```
sage: def a(*args,**kwds):
....:         print args
....:         print kwds
....:     
sage: a(1,2,3,5,labels=True)
(1, 2, 3, 5)
{'labels': True}
```


In this case, "args" will be a list of posets that you need to transform into a big poset, and `kwds` will be the union of all "named" arguments.

Two things to pay attention to:

1) When building the final poset, it is best to do it all at once and not two by two (faster)

2) Always check that `kwds` does not contain something unexpected. Otherwise, this function would say nothing when you call `a(1,2,3,labelss="True")` and it is painful to find such typos when you have a bug in your code.

Nathann


---

Comment by jmantysalo created at 2014-10-02 12:25:03

Replying to [comment:10 ncohen]:

> When you change the milestone to wontfix, please change the status to `positive_review` at the same time.

But how to ask if some ticket should be closed or not? I wasn't sure about this one.


---

Comment by ncohen created at 2014-10-02 12:48:15

> But how to ask if some ticket should be closed or not? I wasn't sure about this one.

Oh. Well, didn't you fix the bug reported here in #17060 ? When you run the example given in this ticket's description with that patch applied, you get the 'expected' thing:


```
sage: A = Posets.ChainPoset(3)
sage: B = A.product(A).product(A)
sage: B[0]
((0, 0), 0)
```


There is only this `(0,0,0)` thing to make available if you feel like it.

Nathann


---

Comment by vbraun created at 2014-10-13 15:50:24

Resolution: duplicate
