# Issue 17091: incomplete gamma in integral is wrong

archive/issues_017091.json:
```json
{
    "body": "CC:  rws\n\nSee [this sage-support thread](https://groups.google.com/forum/#!topic/sage-support/lGGO_q_NVzg) for details.\n\n\n```\nsage: N(integral(1/log(x)^2,(x,2,3)))\n0.536566859259958  # quite wrong\nsage: integral(1/(ln(x))^2, x,2,3)\ngamma(-1, -log(3)) - gamma(-1, -log(2))\n```\n\nWe get the antiderivative and answer from Maxima, which evaluates this correctly numerically.\n\n```\n (%i1) display2d : false $ \n  (%i2) foo : 1/log(x)^2 $ \n  (%i3) integrate (foo, x, 2, 3); \n  (%o3) gamma_incomplete(-1,-log(3))-gamma_incomplete(-1,-log(2)) \n  (%i4) %, numer; \n  (%o4) 1.273097216447114 \n  (%i5) integrate (foo, x); \n  (%o5) gamma_incomplete(-1,-log(x)) \n  (%i6) ev (%, x=3) - ev (%, x=2); \n  (%o6) gamma_incomplete(-1,-log(3))-gamma_incomplete(-1,-log(2)) \n  (%i7) %, numer; \n  (%o7) 1.273097216447114 \n```\n\n\nSee in particular this ugly plot.\n\n```\nsage: plot(lambda t: numerical_integral(1/ln(x)^2,2,t)[0],2,3)+plot(lambda t: gamma(-1, -log(t)).real(),2,3,color='red')\n```\n\nAnd even that we have to call `real()` to remove the numerical noise is not good...\n\nSee possibly also [here](https://groups.google.com/forum/#!topic/sage-support/RrveCpPgoKU) and [here](https://groups.google.com/forum/#!topic/sage-support/RD3YH3jb3qo) and possibly even #16697.\n\nIssue created by migration from https://trac.sagemath.org/ticket/17328\n\n",
    "created_at": "2014-11-12T21:14:19Z",
    "labels": [
        "calculus",
        "critical",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-6.4",
    "title": "incomplete gamma in integral is wrong",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/17091",
    "user": "kcrisman"
}
```
CC:  rws

See [this sage-support thread](https://groups.google.com/forum/#!topic/sage-support/lGGO_q_NVzg) for details.


```
sage: N(integral(1/log(x)^2,(x,2,3)))
0.536566859259958  # quite wrong
sage: integral(1/(ln(x))^2, x,2,3)
gamma(-1, -log(3)) - gamma(-1, -log(2))
```

We get the antiderivative and answer from Maxima, which evaluates this correctly numerically.

```
 (%i1) display2d : false $ 
  (%i2) foo : 1/log(x)^2 $ 
  (%i3) integrate (foo, x, 2, 3); 
  (%o3) gamma_incomplete(-1,-log(3))-gamma_incomplete(-1,-log(2)) 
  (%i4) %, numer; 
  (%o4) 1.273097216447114 
  (%i5) integrate (foo, x); 
  (%o5) gamma_incomplete(-1,-log(x)) 
  (%i6) ev (%, x=3) - ev (%, x=2); 
  (%o6) gamma_incomplete(-1,-log(3))-gamma_incomplete(-1,-log(2)) 
  (%i7) %, numer; 
  (%o7) 1.273097216447114 
```


See in particular this ugly plot.

```
sage: plot(lambda t: numerical_integral(1/ln(x)^2,2,t)[0],2,3)+plot(lambda t: gamma(-1, -log(t)).real(),2,3,color='red')
```

And even that we have to call `real()` to remove the numerical noise is not good...

See possibly also [here](https://groups.google.com/forum/#!topic/sage-support/RrveCpPgoKU) and [here](https://groups.google.com/forum/#!topic/sage-support/RD3YH3jb3qo) and possibly even #16697.

Issue created by migration from https://trac.sagemath.org/ticket/17328





---

archive/issue_comments_227294.json:
```json
{
    "body": "Possibly - even likely - related is #11164.",
    "created_at": "2014-11-14T21:08:37Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17091",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17091#issuecomment-227294",
    "user": "kcrisman"
}
```

Possibly - even likely - related is #11164.



---

archive/issue_comments_227295.json:
```json
{
    "body": "I can't seem to reproduce this in Sage 6.4:\n\n```\nsage: numerical_integral(1/log(x)^2,2,3)\n(1.273097216447114, 1.4134218422857824e-14)\nsage: N(integral(1/log(x)^2,(x,2,3)))\n1.27309721644711\n```\n\nIn fact, the incomplete gamma function is evaluated using PARI, and the bug appears to have been fixed by the latest PARI upgrade (see #15767):\n\n```\ngp-2.5 > incgam(-1,-1)\n%1 = -1.5817775437849803404714887501837998073\ngp-2.5 > incgam(-1,-log(3)) - incgam(-1,-log(2))\n%2 = 0.54869101686030432559293241097969276965\n\ngp-2.7 > incgam(-1,-1)\n%1 = -0.82316401210310847989376653702102822882 + 3.1415926535897932384626433832795028842*I\ngp-2.7 > incgam(-1,-log(3)) - incgam(-1,-log(2))\n%2 = 1.2730972164471138219094623429485715030 + 0.E-37*I\n```\n",
    "created_at": "2014-11-14T22:08:36Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17091",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17091#issuecomment-227295",
    "user": "pbruin"
}
```

I can't seem to reproduce this in Sage 6.4:

```
sage: numerical_integral(1/log(x)^2,2,3)
(1.273097216447114, 1.4134218422857824e-14)
sage: N(integral(1/log(x)^2,(x,2,3)))
1.27309721644711
```

In fact, the incomplete gamma function is evaluated using PARI, and the bug appears to have been fixed by the latest PARI upgrade (see #15767):

```
gp-2.5 > incgam(-1,-1)
%1 = -1.5817775437849803404714887501837998073
gp-2.5 > incgam(-1,-log(3)) - incgam(-1,-log(2))
%2 = 0.54869101686030432559293241097969276965

gp-2.7 > incgam(-1,-1)
%1 = -0.82316401210310847989376653702102822882 + 3.1415926535897932384626433832795028842*I
gp-2.7 > incgam(-1,-log(3)) - incgam(-1,-log(2))
%2 = 1.2730972164471138219094623429485715030 + 0.E-37*I
```




---

archive/issue_comments_227296.json:
```json
{
    "body": "Interesting and confirmed.  Of course, possibly due to something completely different, we now have\n\n```\nsage: plot(lambda t: gamma(-1, -log(t)),2,3,color='red')\nAttributeError: type object 'float' has no attribute 'precision'\n```\n\nas opposed to a wacky plot, no plot.",
    "created_at": "2014-11-15T02:58:05Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17091",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17091#issuecomment-227296",
    "user": "kcrisman"
}
```

Interesting and confirmed.  Of course, possibly due to something completely different, we now have

```
sage: plot(lambda t: gamma(-1, -log(t)),2,3,color='red')
AttributeError: type object 'float' has no attribute 'precision'
```

as opposed to a wacky plot, no plot.



---

archive/issue_comments_227297.json:
```json
{
    "body": "Replying to [comment:4 kcrisman]:\n> Interesting and confirmed.  Of course, possibly due to something completely different, we now have\n> {{{\n> sage: plot(lambda t: gamma(-1, -log(t)),2,3,color='red')\n> AttributeError: type object 'float' has no attribute 'precision'\n> }}}\n> as opposed to a wacky plot, no plot.\nThat is because of a patch I made at #7099; it assumed that the parent had a `precision()` method (previously the precision was ignored when converting the arguments into a `ComplexField`).  I will fix this as soon as I have time.\n\nWe should also add a doctest for the original bug.",
    "created_at": "2014-11-15T11:24:23Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17091",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17091#issuecomment-227297",
    "user": "pbruin"
}
```

Replying to [comment:4 kcrisman]:
> Interesting and confirmed.  Of course, possibly due to something completely different, we now have
> {{{
> sage: plot(lambda t: gamma(-1, -log(t)),2,3,color='red')
> AttributeError: type object 'float' has no attribute 'precision'
> }}}
> as opposed to a wacky plot, no plot.
That is because of a patch I made at #7099; it assumed that the parent had a `precision()` method (previously the precision was ignored when converting the arguments into a `ComplexField`).  I will fix this as soon as I have time.

We should also add a doctest for the original bug.



---

archive/issue_comments_227298.json:
```json
{
    "body": "Changing priority from critical to major.",
    "created_at": "2014-11-17T12:00:58Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17091",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17091#issuecomment-227298",
    "user": "pbruin"
}
```

Changing priority from critical to major.



---

archive/issue_comments_227299.json:
```json
{
    "body": "Changing status from new to needs_review.",
    "created_at": "2014-11-17T12:00:58Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17091",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17091#issuecomment-227299",
    "user": "pbruin"
}
```

Changing status from new to needs_review.



---

archive/issue_comments_227300.json:
```json
{
    "body": "Replying to [comment:4 kcrisman]:\n> Interesting and confirmed.  Of course, possibly due to something completely different, we now have\n> {{{\n> sage: plot(lambda t: gamma(-1, -log(t)),2,3,color='red')\n> AttributeError: type object 'float' has no attribute 'precision'\n> }}}\n> as opposed to a wacky plot, no plot.\nIt would be good if you (or someone else) could try plotting this with the above patch and check if it looks good to you.",
    "created_at": "2014-11-17T12:03:45Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17091",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17091#issuecomment-227300",
    "user": "pbruin"
}
```

Replying to [comment:4 kcrisman]:
> Interesting and confirmed.  Of course, possibly due to something completely different, we now have
> {{{
> sage: plot(lambda t: gamma(-1, -log(t)),2,3,color='red')
> AttributeError: type object 'float' has no attribute 'precision'
> }}}
> as opposed to a wacky plot, no plot.
It would be good if you (or someone else) could try plotting this with the above patch and check if it looks good to you.



---

archive/issue_comments_227301.json:
```json
{
    "body": "Changing keywords from \"\" to \"incomplete gamma function\".",
    "created_at": "2014-11-17T12:03:45Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17091",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17091#issuecomment-227301",
    "user": "pbruin"
}
```

Changing keywords from "" to "incomplete gamma function".



---

archive/issue_comments_227302.json:
```json
{
    "body": "Seems to give correct answers in various precisions.\n\n```\nplot(lambda t: gamma(-1, -log(t)).real() - numerical_integral(1/ln(x)^2,2,t)[0],2,3,color='red')\n```\n\nis a very nice straight line *just* below zero now.   And the imaginary part seems to be consistently pi for t>1.  And the fix is a good one.\n> We should also add a doctest for the original bug.\nDid you want to add \n\n```\nN(integral(1/log(x)^2,(x,2,3)))\n```\n\nas well then, or is the example you have with the actual antideriv and floats sufficient?",
    "created_at": "2014-11-17T14:54:41Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17091",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17091#issuecomment-227302",
    "user": "kcrisman"
}
```

Seems to give correct answers in various precisions.

```
plot(lambda t: gamma(-1, -log(t)).real() - numerical_integral(1/ln(x)^2,2,t)[0],2,3,color='red')
```

is a very nice straight line *just* below zero now.   And the imaginary part seems to be consistently pi for t>1.  And the fix is a good one.
> We should also add a doctest for the original bug.
Did you want to add 

```
N(integral(1/log(x)^2,(x,2,3)))
```

as well then, or is the example you have with the actual antideriv and floats sufficient?



---

archive/issue_comments_227303.json:
```json
{
    "body": "Passes relevant tests, so other than that question we're good to go.",
    "created_at": "2014-11-17T16:07:06Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17091",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17091#issuecomment-227303",
    "user": "kcrisman"
}
```

Passes relevant tests, so other than that question we're good to go.



---

archive/issue_comments_227304.json:
```json
{
    "body": "Replying to [comment:8 kcrisman]:\n> Seems to give correct answers in various precisions.\n> {{{\n> plot(lambda t: gamma(-1, -log(t)).real() - numerical_integral(1/ln(x)^2,2,t)[0],2,3,color='red')\n> }}}\n> is a very nice straight line *just* below zero now.   And the imaginary part seems to be consistently pi for t>1.  And the fix is a good one.\nOK, thanks!\n> > We should also add a doctest for the original bug.\n> Did you want to add \n> {{{\n> N(integral(1/log(x)^2,(x,2,3)))\n> }}}\n> as well then, or is the example you have with the actual antideriv and floats sufficient?\nI don't think it is necessary to add another doctest for the integral; this would just test in addition that Maxima computes the correct antiderivative.  Of course the above command was how the bug was originally found, but I don't really see why we should doctest exactly that command.  What I meant to say is \"add a doctest to show that the PARI bug has been fixed\".",
    "created_at": "2014-11-17T19:27:44Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17091",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17091#issuecomment-227304",
    "user": "pbruin"
}
```

Replying to [comment:8 kcrisman]:
> Seems to give correct answers in various precisions.
> {{{
> plot(lambda t: gamma(-1, -log(t)).real() - numerical_integral(1/ln(x)^2,2,t)[0],2,3,color='red')
> }}}
> is a very nice straight line *just* below zero now.   And the imaginary part seems to be consistently pi for t>1.  And the fix is a good one.
OK, thanks!
> > We should also add a doctest for the original bug.
> Did you want to add 
> {{{
> N(integral(1/log(x)^2,(x,2,3)))
> }}}
> as well then, or is the example you have with the actual antideriv and floats sufficient?
I don't think it is necessary to add another doctest for the integral; this would just test in addition that Maxima computes the correct antiderivative.  Of course the above command was how the bug was originally found, but I don't really see why we should doctest exactly that command.  What I meant to say is "add a doctest to show that the PARI bug has been fixed".



---

archive/issue_comments_227305.json:
```json
{
    "body": "Changing status from needs_review to positive_review.",
    "created_at": "2014-11-17T21:54:40Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17091",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17091#issuecomment-227305",
    "user": "kcrisman"
}
```

Changing status from needs_review to positive_review.



---

archive/issue_comments_227306.json:
```json
{
    "body": "Resolution: fixed",
    "created_at": "2014-11-19T08:32:10Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17091",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17091#issuecomment-227306",
    "user": "vbraun"
}
```

Resolution: fixed



---

archive/issue_comments_227307.json:
```json
{
    "body": "Just to let you know: I already had a patch for this at #17130, so the code of this patch will be overwritten again in #17130. I noticed this ticket only now because of a merge conflict.",
    "created_at": "2014-11-26T08:18:51Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17091",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17091#issuecomment-227307",
    "user": "jdemeyer"
}
```

Just to let you know: I already had a patch for this at #17130, so the code of this patch will be overwritten again in #17130. I noticed this ticket only now because of a merge conflict.
