# Issue 11991: Missing digits in numerical_approx

Issue created by migration from https://trac.sagemath.org/ticket/12163

Original creator: slabbe

Original creation time: 2011-12-16 03:36:38

Assignee: jason, jkantor

From [this conversation](http://groups.google.com/group/sage-devel/browse_thread/thread/abe39e9167ab386c) on sage-devel :


```
Using n() sometimes returns the wrong number of digits

This is correct:

sage: a = n(golden_ratio, digits=5000)
sage: len(str(a))
5001

This is not:

sage: a = n(golden_ratio, digits=5000000)
sage: len(str(a))
4999989

Any clue?

Jerome Tremblay
LaCIM, UQAM 
```



---

Comment by slabbe created at 2011-12-16 03:47:02

This is related to (and maybe fixed by) #10164.


---

Comment by kcrisman created at 2011-12-16 03:58:24

Changing status from new to needs_review.


---

Comment by kcrisman created at 2011-12-16 03:58:24

I think that this is in fact a dup of (or at any rate should be solved by the patch at) #10164 :) caused by the BDFL not reading all the posts in a thread carefully enough :)  Presumably this fixes it.

By the way, the doctests at that ticket are themselves quite entertaining.


---

Comment by kcrisman created at 2011-12-16 04:00:26

Changing status from needs_review to positive_review.


---

Comment by kcrisman created at 2011-12-16 04:00:26

With #10164:

```
sage:  a = n(golden_ratio, digits=5000)
sage: len(str(a))
5001
sage: a = n(golden_ratio, digits=5000000)
lsage: len(str(a))
5000004
```

So let's close as a dup.


---

Comment by jdemeyer created at 2012-01-05 13:31:19

Resolution: duplicate
