# Issue 17390: Construction of FinitelyGeneratedGroup from GAP group

Issue created by migration from Trac.

Original creator: vdelecroix

Original creation time: 2015-01-12 20:36:52

CC:  was â€‹mmarco

It should be possible to initialize a `FinitelyPresentedGroup` (in `sage.groups.finitely_presented_group`) directly from a GAP group. At the same time we should provide a wrapper for `gap.AllGroups` feature to iterate through all groups of given order.


---

Comment by captaintrunky created at 2015-01-25 21:07:32

Hi!
I'm working on this ticket currently. I think that it is more or less ready, but I struggle with the following behavior:


```
f = FreeGroup("x,y")
g = f/ [x^2*y^-1, x^3*y^2, x*y*x^-1*y^-1]
NameError                                 Traceback (most recent call last)
<ipython-input-4-6f3ccf45fba8> in <module>()
----> 1 g = f/ [x**Integer(2)*y**-Integer(1), x**Integer(3)*y**Integer(2), x*y*x**-Integer(1)*y**-Integer(1)]

NameError: name 'y' is not defined
```

while


```
f.<x,y> = FreeGroup()
g = f/ [x^2*y^-1, x^3*y^2, x*y*x^-1*y^-1]
```

works without any issues. Probably I'm missing something obvious, but how can I 'register' variables globally without <,> notion? Is there some sort of function that is wrapped by <>? My goal is to write something like this:


```
names = repr(free_group.GeneratorsOfGroup()).strip('[   ]')                             
free_group = FreeGroup(names)
```



---

Comment by vdelecroix created at 2015-01-25 21:20:53

Sorry, I should have been clearer. The only issue is that

```
sage: F.<x,y> = FreeGroup(2)
sage: G = F/[x**2*y,x*y]
sage: G
Finitely presented group < x, y | x^2*y, x*y >
sage: G_gap = G._gap_()
sage: from sage.groups.finitely_presented import FinitelyPresentedGroup
sage: FinitelyPresentedGroup(G_gap)
** BOOM **
sage: FinitelyPresentedGroup(gap_group=G_gap)
** BOOM **
```

What are you trying to do?!

In the mean time, I realized that there is a function `wrap_FpGroup` so I think that there is almost nothing to do to make it work.

Vincent


---

Comment by captaintrunky created at 2015-01-25 21:35:30

I try to exactly what you are proposing. But I've struggle with the following:

```
fp_gap = libgap.FreeGroup("x", "y")
fp_sage = wrap_FreeGroup(fp_gap)

g = fp_sage / [x^2*y^-1, x^3*y^2, x*y*x^-1*y^-1]
*EXCEPTION*
NameError: name 'y' is not defined
```


Replying to [comment:3 vdelecroix]:
> Sorry, I should have been clearer. The only issue is that
> {{{
> sage: F.<x,y> = FreeGroup(2)
> sage: G = F/[x**2*y,x*y]
> sage: G
> Finitely presented group < x, y | x^2*y, x*y >
> sage: G_gap = G._gap_()
> sage: from sage.groups.finitely_presented import FinitelyPresentedGroup
> sage: FinitelyPresentedGroup(G_gap)
> ** BOOM **
> sage: FinitelyPresentedGroup(gap_group=G_gap)
> ** BOOM **
> }}}
> What are you trying to do?!
> 
> In the mean time, I realized that there is a function `wrap_FpGroup` so I think that there is almost nothing to do to make it work.
> 
> Vincent


---

Comment by vdelecroix created at 2015-01-25 21:47:52

Replying to [comment:4 captaintrunky]:
> I try to exactly what you are proposing. But I've struggle with the following:

Great ;-)

What I know

```
fp_gap = libgap.FreeGroup("x", "y")
sage: libgap.GeneratorsOfGroup(fp_gap)
[ x, y ]
sage: F = wrap_FreeGroup(fp_gap)
sage: F.gen(0)
x
sage: F.gen(1)
y
```



---

Comment by captaintrunky created at 2015-01-25 22:05:05

I knew this too, but it does not work due to this exception. As I understand, the code:

```
f.<x,y> = FreeGroup()
```

makes some magic and the code:


```
f = FreeGroup("x, y")
```

doesn't do this magic. This whole thing completely breaks relations addition. Probably, I should ask on sage-devel.

Replying to [comment:5 vdelecroix]:
> Replying to [comment:4 captaintrunky]:
> > I try to exactly what you are proposing. But I've struggle with the following:
> 
> Great ;-)
> 
> What I know
> {{{
> fp_gap = libgap.FreeGroup("x", "y")
> sage: libgap.GeneratorsOfGroup(fp_gap)
> [ x, y ]
> sage: F = wrap_FreeGroup(fp_gap)
> sage: F.gen(0)
> x
> sage: F.gen(1)
> y
> }}}


---

Comment by vdelecroix created at 2015-01-25 22:10:44

Replying to [comment:6 captaintrunky]:
> I knew this too, but it does not work due to this exception. As I understand, the code:
> {{{
> f.<x,y> = FreeGroup()
> }}}
> makes some magic and the code:
> 
> {{{
> f = FreeGroup("x, y")
> }}}
> doesn't do this magic. This whole thing completely breaks relations addition. Probably, I should ask on sage-devel.

Yes. The magic can be analyzed through

```
sage: preparse("f.<x,y> = FreeGroup()")
"f = FreeGroup(names=('x', 'y',)); (x, y,) = f._first_ngens(2)"
```



---

Comment by captaintrunky created at 2015-01-25 22:17:16

Replying to [comment:7 vdelecroix]:
> Replying to [comment:6 captaintrunky]:
> > I knew this too, but it does not work due to this exception. As I understand, the code:
> > {{{
> > f.<x,y> = FreeGroup()
> > }}}
> > makes some magic and the code:
> > 
> > {{{
> > f = FreeGroup("x, y")
> > }}}
> > doesn't do this magic. This whole thing completely breaks relations addition. Probably, I should ask on sage-devel.
> 
> Yes. The magic can be analyzed through
> {{{
> sage: preparse("f.<x,y> = FreeGroup()")
> "f = FreeGroup(names=('x', 'y',)); (x, y,) = f._first_ngens(2)"
> }}}
Thanks, I will experiment with it tomorrow.


---

Comment by jhpalmieri created at 2015-01-25 22:17:25

You can also do

```
sage: f = FreeGroup("x,y")
sage: f.inject_variables()
Defining x, y
sage: g = f/ [x^2*y^-1, x^3*y^2, x*y*x^-1*y^-1]
```

One of the points is that a command like `f = ...` should only define `f`, not anything else. So having `f = FreeGroup("x, y")` not define `x` or `y` is intentional.


---

Comment by captaintrunky created at 2015-01-26 19:48:34

New commits:


---

Comment by captaintrunky created at 2015-01-26 19:56:52

Changing status from new to needs_review.


---

Comment by vdelecroix created at 2015-11-28 13:20:31

What I had in mind and is now described in the ticket description was the case of one argument sent to `FinitelyPresentedGroup`. Your solution solves the case when the *free group* provided is a gap group. The latter case should be handled directly in `FreeGroup` and not in `FinitelyPresentedGroup`. And by the way, it is *always* a bad idea to inject variables in a function.


---

Comment by vdelecroix created at 2015-11-28 13:20:31

Changing status from needs_review to needs_work.
