# Issue 31783: Multivariate Generating Functions: critical cone cannot be described for non-rational critical point

Issue created by migration from https://trac.sagemath.org/ticket/32020

Original creator: behackl

Original creation time: 2021-06-21 11:36:27

CC:  @markcwilson @kliem

`FractionWithFactoredDenominator.critical_cone` returns `None` when the corresponding critical point has non-rational coordinates. Consider the following example:


```
sage: from sage.rings.asymptotic.asymptotics_multivariate_generating_functions import FractionWithFactoredDenominatorRing
sage: R.<x, y> = QQ[]
sage: FFPD = FractionWithFactoredDenominatorRing(R)
sage: G = 1; H = 1 - x - y - x*y
sage: Hfac = H.factor()
sage: G = G / Hfac.unit()
sage: F = FFPD(G, Hfac)
```


For a point with rational coordinates, everything works as expected:

```
sage: I = F.smooth_critical_ideal(alpha=(1, 1))
sage: points = solve([SR(z) for z in I.gens()], [SR(z) for z in R.gens()], solution_dict=true)
sage: F.critical_cone(points[1])
([(1, 1)], 1-d cone in 2-d lattice N)
```


For non-rational coordinates, the critical cone returns `None`:

```
sage: I = F.smooth_critical_ideal(alpha=(2, 1))
sage: points = solve([SR(z) for z in I.gens()], [SR(z) for z in R.gens()], solution_dict=true)
sage: F.critical_cone(points[1])
([(((sqrt(5) - 1)*(sqrt(5) - 2) + sqrt(5) - 1)/((sqrt(5) - 1)*(sqrt(5) - 2) + 2*sqrt(5) - 4),
   1)],
 None)
```



---

Comment by mkoeppe created at 2021-06-21 15:08:02

Using `Polyhedron` instead of `Cone` in this case would be an option.


---

Comment by mkoeppe created at 2021-06-21 15:55:56

See also #30172, where an ABC for convex cones (not necessarily rational polyhedral) is in the works


---

Comment by behackl created at 2021-06-21 17:32:20

Replying to [comment:1 mkoeppe]:
> Using `Polyhedron` instead of `Cone` in this case would be an option. 

In this particular example, simplifying the ray directions would actually suffice. The ray list passed to `Cone` is

```
[(((sqrt(5) - 1)*(sqrt(5) - 2) + sqrt(5) - 1)/((sqrt(5) - 1)*(sqrt(5) - 2) + 2*sqrt(5) - 4),
  1)]
```

which actually is just

```
[(2, 1)]
```


But that doesn't change the fact that if the rays actually have non-rational components, `Cone` isn't suitable.

When I try to use `Polyhedron` with non-rational ray directions, I also get an error, e.g.,

```
sage: Polyhedron(rays=[(sqrt(2), 1)])
Traceback (most recent call last):
...
ValueError: no default backend for computations with Symbolic Ring
```


Did you mean that `Polyhedron` could be used after moving the rays to some more appropriate base ring? Or am I missing something else?

Also, thanks for the reference to #30172!


---

Comment by mkoeppe created at 2021-06-21 17:35:48

You would need to pass `base_ring=AA`. Polyhedron refuses to compute with `SR`.


---

Comment by behackl created at 2021-06-21 17:38:42

Replying to [comment:5 mkoeppe]:
> You would need to pass `base_ring=AA`. Polyhedron refuses to compute with `SR`.

Makes sense, thanks.


---

Comment by mkoeppe created at 2021-06-21 17:40:22

If you need cones with transcendental data, #30234 would be an approach.
