# Issue 16303: Regression in Pari finite field interface

Issue created by migration from Trac.

Original creator: defeo

Original creation time: 2014-06-25 16:21:12

CC:  pbruin

Keywords: finite_field regression pari

In Sage 6.2


```
sage: GF(11^23, 'a').gen()^Zmod(11)(1)
1
```


In 5.9 this used to give


```
sage: GF(11^23, 'a').gen()^Zmod(11)(1)
a
```




---

Comment by jdemeyer created at 2014-06-26 13:15:54

Do you agree that the correct behaviour is a `ValueError`?


---

Comment by pbruin created at 2014-06-26 13:58:52

PARI's `FF_pow` requires the exponent to be a `t_INT`, but does not check the type, and `FiniteFieldElement_pari_ffelt.__pow__()` does not enforce this either.  (Actually it also assumes the exponent to be an integer, since it checks if it is negative.)  We could simply convert the exponent into an `Integer`; the only drawback is that we would have to do a separate check for `IntegerMod` with an incorrect modulus if we want to raise a `ValueError` in that case.


---

Comment by defeo created at 2014-06-27 00:13:56

Replying to [comment:1 jdemeyer]:
> Do you agree that the correct behaviour is a `ValueError`?

I agree that mathematically the operation does not make sense, unless the modulus is equal to the order of the element (but computing it would be overkill in my opinion) or a multiple (the only reasonable one being cardinality - 1).

Now, if we want to raise a `ValueError`, this is not a Pari issue anymore: it is a huge issue in basically any component of Sage!


```
sage: 3^Zmod(3)(2)
9
sage: GF(101)(2)^Zmod(3)(2)
4
sage: QQ['x'].gen()^Zmod(3)(2)
x^2
sage: i^Zmod(3)(2)
-1
sage: AbelianGroup([10])[1]^Zmod(3)(2)
f^2
```


etc...


---

Comment by pbruin created at 2014-08-13 22:25:38

Changing status from new to needs_review.


---

Comment by pbruin created at 2014-08-13 22:25:38

Here is a branch to make `FiniteFieldElement_pari_ffelt.__pow__()` always convert the exponent to an integer.  This fixes the following mathematically wrong answer to return `a`:

```
sage: q = 11^23
sage: F.<a> = FiniteField(q)
sage: a^Mod(1, q - 1)
1
```

The new code actually seems to be marginally faster than the old one (about 10% on this example).  It also adds a warning to the documentation that we do not check for well-definedness before converting the exponent to an integer.


---

Comment by jdemeyer created at 2014-08-18 14:51:18

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2014-08-18 14:58:38

Changing status from positive_review to needs_work.


---

Comment by vbraun created at 2014-08-18 14:58:38

Reviewer name


---

Comment by jdemeyer created at 2014-08-18 15:07:46

Changing status from needs_work to positive_review.


---

Comment by vbraun created at 2014-08-19 10:39:00

Resolution: fixed
