# Issue 16199: is_real method should exist for elements of AA, ZZ, QQ

archive/issues_016199.json:
```json
{
    "body": "The function ``is_real`` is useful but it is not practical because it it not implemented for every types of numbers in Sage. And I do not want to do type checking before being able to use it in my code.\n\n\n```\nsage: CC(3).is_real()\nTrue\nsage: RR(3).is_real()\nTrue\nsage: SR(3).is_real()\nTrue\nsage: ZZ(3).is_real()\nTraceback (most recent call last):\n...\nAttributeError: 'sage.rings.integer.Integer' object has no attribute 'is_real'\nsage: QQ(3).is_real()\nTraceback (most recent call last):\n...\nAttributeError: 'sage.rings.rational.Rational' object has no attribute 'is_real'\nsage: AA(3).is_real()\nTraceback (most recent call last)\n...\nAttributeError: 'AlgebraicReal' object has no attribute 'is_real'\n```\n\n\nI am sure I forget some other rings...\n\nWe need more of this kind of consistency in Sage. ``is_imaginary`` is another example.\n\nIssue created by migration from https://trac.sagemath.org/ticket/16436\n\n",
    "created_at": "2014-06-03T21:38:30Z",
    "labels": [
        "algebra",
        "major",
        "enhancement"
    ],
    "title": "is_real method should exist for elements of AA, ZZ, QQ",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/16199",
    "user": "slabbe"
}
```
The function ``is_real`` is useful but it is not practical because it it not implemented for every types of numbers in Sage. And I do not want to do type checking before being able to use it in my code.


```
sage: CC(3).is_real()
True
sage: RR(3).is_real()
True
sage: SR(3).is_real()
True
sage: ZZ(3).is_real()
Traceback (most recent call last):
...
AttributeError: 'sage.rings.integer.Integer' object has no attribute 'is_real'
sage: QQ(3).is_real()
Traceback (most recent call last):
...
AttributeError: 'sage.rings.rational.Rational' object has no attribute 'is_real'
sage: AA(3).is_real()
Traceback (most recent call last)
...
AttributeError: 'AlgebraicReal' object has no attribute 'is_real'
```


I am sure I forget some other rings...

We need more of this kind of consistency in Sage. ``is_imaginary`` is another example.

Issue created by migration from https://trac.sagemath.org/ticket/16436





---

archive/issue_comments_211516.json:
```json
{
    "body": "Hi Sebastien. Note that you can also use coercion with the poorest real representation:\n\n\n```\nsage: AA(3) in RealField(2)\nTrue\nsage: CC(3) in RealField(2)\nTrue\nsage: RR(3) in RealField(2)\nTrue\nsage: SR(3) in RealField(2)\nTrue\nsage: ZZ(3) in RealField(2)\nTrue\nsage: QQ(3) in RealField(2)\nTrue\nsage: AA(3) in RealField(2)\nTrue\nsage: QQbar(3) in RealField(2)\nTrue\n```\n\n\nthough you need to be careful with `NaN` and `+/-Infinity` that also belong to `RealField(2)`. By the way: \n\n```\nsage: SR(Infinity).is_real()\nTrue\n```\n",
    "created_at": "2014-06-04T08:55:21Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16199",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16199#issuecomment-211516",
    "user": "tmonteil"
}
```

Hi Sebastien. Note that you can also use coercion with the poorest real representation:


```
sage: AA(3) in RealField(2)
True
sage: CC(3) in RealField(2)
True
sage: RR(3) in RealField(2)
True
sage: SR(3) in RealField(2)
True
sage: ZZ(3) in RealField(2)
True
sage: QQ(3) in RealField(2)
True
sage: AA(3) in RealField(2)
True
sage: QQbar(3) in RealField(2)
True
```


though you need to be careful with `NaN` and `+/-Infinity` that also belong to `RealField(2)`. By the way: 

```
sage: SR(Infinity).is_real()
True
```




---

archive/issue_comments_211517.json:
```json
{
    "body": "Replying to [comment:1 tmonteil]:\n> Hi Sebastien. Note that you can also use coercion with the poorest real representation:\n\nI have been using monkey tricks like that for too long now like `.n().imag() == 0`. I want a clean solution. It should be normal to ask if some eigenvalue of some matrix is a real number.\n\n\n```\nsage: M = identity_matrix(RR,4)\nsage: [a.is_real() for a in M.eigenvalues()]\n[True, True, True, True]\n```\n\n\n\n```\nsage: M = identity_matrix(ZZ,4)\nsage: [a.is_real() for a in M.eigenvalues()]\nTraceback (most recent call last):\n...\nAttributeError: 'sage.rings.rational.Rational' object has no attribute 'is_real'\n```\n\n\n\n```\nsage: M = random_matrix(ZZ,4)\nsage: [a.is_real() for a in M.eigenvalues()]\nTraceback (most recent call last):\n...\nAttributeError: 'AlgebraicNumber' object has no attribute 'is_real'\n```\n",
    "created_at": "2014-06-04T12:59:16Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16199",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16199#issuecomment-211517",
    "user": "slabbe"
}
```

Replying to [comment:1 tmonteil]:
> Hi Sebastien. Note that you can also use coercion with the poorest real representation:

I have been using monkey tricks like that for too long now like `.n().imag() == 0`. I want a clean solution. It should be normal to ask if some eigenvalue of some matrix is a real number.


```
sage: M = identity_matrix(RR,4)
sage: [a.is_real() for a in M.eigenvalues()]
[True, True, True, True]
```



```
sage: M = identity_matrix(ZZ,4)
sage: [a.is_real() for a in M.eigenvalues()]
Traceback (most recent call last):
...
AttributeError: 'sage.rings.rational.Rational' object has no attribute 'is_real'
```



```
sage: M = random_matrix(ZZ,4)
sage: [a.is_real() for a in M.eigenvalues()]
Traceback (most recent call last):
...
AttributeError: 'AlgebraicNumber' object has no attribute 'is_real'
```




---

archive/issue_comments_211518.json:
```json
{
    "body": "If, as i proposed on sage-devel we could have an overlay (say, `RR`) for real fields, the syntax `CC(3) in RR` would be very readable. The only problem with `CC(3) in RealField(2)` is about `NaN` and `+/-Infinity`, but you should notice that the same problem exists with the current `.is_real()` methods, so the solution is not clean either.",
    "created_at": "2014-06-04T20:25:22Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16199",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16199#issuecomment-211518",
    "user": "tmonteil"
}
```

If, as i proposed on sage-devel we could have an overlay (say, `RR`) for real fields, the syntax `CC(3) in RR` would be very readable. The only problem with `CC(3) in RealField(2)` is about `NaN` and `+/-Infinity`, but you should notice that the same problem exists with the current `.is_real()` methods, so the solution is not clean either.



---

archive/issue_comments_211519.json:
```json
{
    "body": "Replying to [comment:1 tmonteil]:\n> Hi Sebastien. Note that you can also use coercion with the poorest real representation:\n> \n> {{{\n> sage: AA(3) in RealField(2)\n> True\n> }}}\nSee #12967 and #17984 for why `x in RR` will determine elementship in `RR` not in the mathematical **R**. For this `is_real` is meant.",
    "created_at": "2015-03-21T09:45:25Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16199",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16199#issuecomment-211519",
    "user": "rws"
}
```

Replying to [comment:1 tmonteil]:
> Hi Sebastien. Note that you can also use coercion with the poorest real representation:
> 
> {{{
> sage: AA(3) in RealField(2)
> True
> }}}
See #12967 and #17984 for why `x in RR` will determine elementship in `RR` not in the mathematical **R**. For this `is_real` is meant.



---

archive/issue_comments_211520.json:
```json
{
    "body": "One clean way to implement `is_real` might be to compare x with its conjugate, which is implemented quite often:\n\n```\nsage: def is_real(x):\n....:     return(x == x.conjugate())\n....:\nsage: is_real(ZZ(3))\nTrue\nsage: is_real(QQ(3))\nTrue\nsage: is_real(AA(3))\nTrue\nsage: is_real(RR(3))\nTrue\nsage: is_real(CC(3))\nTrue\n```\n\nOne could handle `is_imaginary` similarly.",
    "created_at": "2016-04-09T23:31:29Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16199",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16199#issuecomment-211520",
    "user": "kedlaya"
}
```

One clean way to implement `is_real` might be to compare x with its conjugate, which is implemented quite often:

```
sage: def is_real(x):
....:     return(x == x.conjugate())
....:
sage: is_real(ZZ(3))
True
sage: is_real(QQ(3))
True
sage: is_real(AA(3))
True
sage: is_real(RR(3))
True
sage: is_real(CC(3))
True
```

One could handle `is_imaginary` similarly.
