# Issue 19860: NaN in RealIntervalField is smaller than 1

Issue created by migration from https://trac.sagemath.org/ticket/20097

Original creator: dkrenn

Original creation time: 2016-02-22 14:01:09


```
sage: n = (1/RIF(0,1)).diameter()
sage: n
NaN
sage: n < 1
True
```

but `n < 1` should return `False`.


---

Comment by @ninja18 created at 2020-10-10 07:30:44

Does it make sense to compare Not a Number to number?


---

Comment by @DaveWitteMorris created at 2020-10-10 16:43:04

I get `False`, so the bug seems to be gone.  (Tested 9.1 on `CoCalc` and 9.2rc0 on MacOS 10.15.7.)  If `False` is the correct answer, then we should just add a doctest. But I don't know anything about numerics: should this be a `ValueError`?


---

Comment by @DaveWitteMorris created at 2020-10-10 20:10:07

I think I would prefer `ValueError`. However, according to [Wikipedia](https://en.wikipedia.org/wiki/NaN#Comparison_with_NaN), it seems that comparisons using `<, >, ==` should be `False`, including `n == n` and comparisons with infinity, but comparisons using `!=` should be `True`, including `n != n`.  Sage seems to get these right, including `n < 1./0.`, which I think is a comparison with `+infinity`. (On the other hand, sage says `n < +oo` is `True`.)

Does anything need to be changed?  Should we add doctests?


---

Comment by @ninja18 created at 2020-10-11 01:53:45

There is ambiguity because they are of different type.

```
sage: type(oo)
<class 'sage.rings.infinity.PlusInfinity'>
sage: type(1./0)
<class 'sage.rings.real_mpfr.RealNumber'>
```


I feel this is useful to be documented with the relevant cases.
