# Issue 16885: bessel_Y is off by 3 ulps

Issue created by migration from Trac.

Original creator: zimmerma

Original creation time: 2014-10-09 14:58:37

consider the following with Sage 6.0:

```
sage: R=RealField(113)
sage: a=R("1.414213562373095048801688724209698177")
sage: b=bessel_Y(0,a)
sage: c=R(bessel_Y(0,RealField(200)(a)))
sage: (b-c)/c.ulp()
-3.00000000000000000000000000000000
sage: b
-7.44623881999333920107530266264974e-7
sage: c
-7.44623881999333920107530266264973e-7
```

Given that MPFR provides correct rounding for bessel_Y (mpfr_y0) this should not happen.


---

Comment by jdemeyer created at 2014-10-09 15:38:43

The example is wrong, I get

```
sage: R = RealField(113)
sage: a = R("1.414213562373095048801688724209698177")
sage: b = bessel_Y(0,a)
sage: c = R(bessel_Y(0,RealField(200)(a)))
sage: (b-c)/c.ulp()
0.000000000000000000000000000000000
sage: b
0.344636931299712753154578621698097
sage: c
0.344636931299712753154578621698097
```


Anyway, numerical evaluation of Bessel functions is done using mpmath, not mpfr. I guess the reason is that mpfr can only compute `Y(n,x)` for _integers_ n, while mpmath supports more general complex numbers for `n`.

Note that you can access the mpfr functions directly using

```
sage: R = RealField(113)
sage: a = R("1.414213562373095048801688724209698177")
sage: a.y0()
0.344636931299712753154578621698097
```



---

Comment by zimmerma created at 2014-10-09 15:50:35

sorry, the value of `a` was wrong, I changed it in the description.

Indeed MPFR can only handle integer n for Y(n,x), but it would better to call it in that case,
since it guarantees correct rounding (and thus numerical reproducibility).


---

Comment by jdemeyer created at 2014-10-09 20:15:15

mpfr is also much faster...


---

Comment by jdemeyer created at 2014-10-09 20:53:49

Is there an MPFR function which can check if an `mpfr_t` is an exact integer? Or which acts like `mpfr_get_si` but _without rounding_, just converting if the number already was an exact integer (and returning an error otherwise). Or alternatively, which acts like `mpfr_get_z` and returns a ternary value.


---

Comment by zimmerma created at 2014-10-09 21:02:35

there is `mpfr_integer_p`, but you also want `mpfr_fits_slong_p` if you want to convert the (integer) argument to a long before giving it to say `mpfr_yn`.


---

Comment by jdemeyer created at 2014-10-10 09:26:23

I bumped into #17130 which I think should be fixed first (not by me).


---

Comment by jdemeyer created at 2014-11-26 16:07:44

New commits:


---

Comment by jdemeyer created at 2014-11-26 16:07:44

Changing status from new to needs_review.


---

Comment by zimmerma created at 2014-11-26 19:52:58

I wish I could review that patch, but unfortunately since the change to git I don't know any more how
to do...

Paul


---

Comment by jdemeyer created at 2014-11-26 21:25:19

I think it's sufficient to look at [http://git.sagemath.org/sage.git/commit/?id=bce4fb0c1665025c98ec15d89c1345a0a67e925c](http://git.sagemath.org/sage.git/commit/?id=bce4fb0c1665025c98ec15d89c1345a0a67e925c) (the other commits come from #17130).


---

Comment by zimmerma created at 2014-12-05 17:23:49

Changing status from needs_review to positive_review.


---

Comment by zimmerma created at 2014-12-05 17:23:49

this commit looks correct to me. Positive review.

Paul


---

Comment by vbraun created at 2014-12-12 12:29:24

Resolution: fixed
