# Issue 17782: Slow performance when running mpfi in Sage (compairing to Perl)

Issue created by migration from https://trac.sagemath.org/ticket/18019

Original creator: akhi

Original creation time: 2015-03-20 23:43:58

CC:  nthiery saliola merbst ​zimmerma

I have wrote a simple program for addition and multiplication in Sage  using mpfi . same thing when I runs in Perl it took much lesser time
Example::{{{{
sage: %runfile test3.sage
3.14159265358979323846264338328? is the mpfi number 
10.4374148846 seconds time for  1000000 divisions
sage: %runfile test3a.sage
3.14159265358979323846264338328? is the mpfi number 
8.87430405617 seconds time for  1000000 additions
sage: 


akhi`@`akhi:~$ perl test3.pl
[3.1415926535897932384626433832793,3.1415926535897932384626433832825] is the mpfi number
total time =  2 seconds time for  1000000 divisions 
akhi`@`akhi:~$ perl test3a.pl
[3.1415926535897932384626433832793,3.1415926535897932384626433832825] is the mpfi number
total time =  2 seconds time for  1000000 additions 
akhi`@`akhi:~$ 




}}}


---

Attachment


---

Attachment


---

Attachment


---

Comment by akhi created at 2015-03-20 23:51:51

Changing keywords from "" to "mpfi, RIF, sagedays 64".


---

Comment by nthiery created at 2016-08-22 09:48:21

Hi Paul,

Akhilesh is sitting next to me here at Sage Days 75. Would you have any insight about the speed difference between Sage and Perl here?

Amitiés,
                                Nicolas


---

Comment by tmonteil created at 2016-08-22 21:13:57

When you write `b = n/res`, note that `n` is a Python int and res an element of `RIF`, so Sage has to resolve the coercion to find a common parent, which takes time. Instead, you can transform `n` to an element of `RIF` by writing instead : `b = RIF(n)/res`. The timings should decrease (Debian seems not to distribute MPFI for Perl, so i couldn't do the comparison).


---

Comment by akhi created at 2016-08-23 08:41:39

I have made the modifications that you suggested but still Perl works much faster\\
sage: load("test3.sage")
\\3.14159265358979323846264338328? is the mpfi number 
\\4.71341490746 seconds time for  1000000 divisions
\\akhi`@`akhi:~$ perl test3.pl
\\[3.1415926535897932384626433832793,3.1415926535897932384626433832825] is the mpfi number
\\total time =  2 seconds time for  1000000 divisions


---

Comment by akhi created at 2016-08-23 08:46:14

perl mpfi library is there at cpan http://search.cpan.org/~sisyphus/Math-MPFI-0.05/MPFI.pm
