# Issue 30607: better maple conversion for symbolic matrices

Issue created by migration from https://trac.sagemath.org/ticket/30844

Original creator: chapoton

Original creation time: 2020-11-01 14:04:04

CC:  mkoeppe

Keywords: maple

TODO : same fix as in #30815, once this ticket is merged


---

Comment by chapoton created at 2020-11-10 20:41:03

New commits:


---

Comment by chapoton created at 2020-11-10 20:41:03

Changing status from new to needs_review.


---

Comment by chapoton created at 2020-11-10 20:48:56

hmm, strange bug, this does not work !

```
sage: y = var('y')                                                              
sage: M = matrix(SR, 2, [y+sin(y), y - 4, 1/y, dilog(y)])                       
sage: M == maple(M).sage()                                                      
False
sage: M._maple_init_()                                                          
'Matrix(2,2,[(y)+(sin(y)),(y)+(-4)],[(y)^(-1),dilog(y)])'
sage: maple(M)                                                                  
Matrix(2, 2, [[1/y,dilog(y)],[0,0]])
```



---

Comment by git created at 2020-11-10 20:55:02

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by chapoton created at 2020-11-10 20:56:47

ok, works now, ready for review


---

Comment by mmezzarobba created at 2020-11-12 09:46:29

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2020-11-22 15:06:23

Resolution: fixed
