# Issue 21521: Hold symbolic powers unevaluated if evaluation fails

Issue created by migration from https://trac.sagemath.org/ticket/21758

Original creator: rws

Original creation time: 2016-10-24 14:39:41

CC:  vdelecroix

Automatic evaluation of symbolic expressions of "numerics" prevents construction of such expressions despite them being perfectly numerically approximatable (or otherwise useful) if exact evaluation in the algebraic sense fails. This is usually not a problem with function expressions (because of the easily added `hold=True`), and sums and products (?), but powers have to be constructed awkwardly:

```
            sage: SR(2) ^ SR(QQbar(sqrt(2)))
            Traceback (most recent call last):
            ...
            TypeError: no canonical coercion ...
            sage: SR(2).power(SR(QQbar(sqrt(2))), hold=True)
            2^1.414213562373095?
```


The ticket catches `TypeError`s in the first case and automatically uses the second form, to allow:

```
            sage: SR(2) ^ SR(QQbar(sqrt(2)))
            2^1.414213562373095?
```




---

Comment by rws created at 2016-10-24 14:43:05

New commits:


---

Comment by rws created at 2016-10-24 14:43:05

Changing status from new to needs_review.


---

Comment by vdelecroix created at 2016-10-30 16:28:22


```
sage: a = SR(2) ^ QQbar(3).sqrt()
sage: a
2^1.732050807568878?
sage: b = a + 1
sage: b
<repr(<sage.symbolic.expression.Expression at ...>) failed: TypeError: no canonical coercion from Algebraic Field to Rational Field>
```



---

Comment by vdelecroix created at 2016-10-30 16:28:22

Changing status from needs_review to needs_work.


---

Comment by vdelecroix created at 2016-10-30 16:31:57

Why algebraic numbers behave differently from `pi`?

```
sage: a = 2 ^ pi.sqrt() + 1
sage: a
2^sqrt(pi) + 1
sage: a.n()
4.41634542118404
```

And why is `pi` not numeric?

``` 
sage: pi.is_numeric()
False
```



---

Comment by rws created at 2016-10-31 06:01:14

Replying to [comment:4 vdelecroix]:
> Why algebraic numbers behave differently from `pi`?
> {{{
> sage: a = 2 ^ pi.sqrt() + 1
> sage: a
> 2^sqrt(pi) + 1
> sage: a.n()
> 4.41634542118404
> }}}

Because traditionally in Pynac all Python objects that can't be converted to Pynac objects are wrapped inside a `numeric` object. Constants can be converted and are handled correctly. That's why pi is non-numeric.


---

Comment by rws created at 2016-11-06 14:47:20

Replying to [comment:3 vdelecroix]:
> {{{
> sage: a = SR(2) ^ QQbar(3).sqrt()
> sage: a
> 2^1.732050807568878?
> sage: b = a + 1
> sage: b
> <repr(<sage.symbolic.expression.Expression at ...>) failed: TypeError: no canonical coercion from Algebraic Field to Rational Field>
> }}}
I have opened a Pynac issue although atm I have no idea where exactly to fix.
https://github.com/pynac/pynac/issues/208
