# Issue 15305: Rounding weirdness when increasing the precision of a real number

Issue created by migration from Trac.

Original creator: mmezzarobba

Original creation time: 2013-12-18 08:53:40

CC:  zimmerma

This is not correct:

```
sage: Reals(200)(RR(1.0e-20))
1.0000000000000000000000000000000000000000000000000000000000e-20
```

since `RR(1.0e-20)` is actually equal to 6646139978924579Â·2<sup>-119</sup>, and indeed:

```
sage: Reals(200)(RR(1.0e-20).exact_rational())
9.9999999999999994515327145420957165172950370278739244710772e-21
```


Also note that the following related examples work:

```
sage: Reals(200)(RDF(1.0e-20))
9.9999999999999994515327145420957165172950370278739244710772e-21
sage: ComplexField(200)(CC(1.0e-20))
9.9999999999999994515327145420957165172950370278739244710772e-21
```



---

Comment by jdemeyer created at 2014-01-06 16:37:34

Feature, not a bug.

This is done such that `RealField(200)(1.0e-20)` would work as expected.


---

Comment by jdemeyer created at 2014-01-06 16:37:34

Changing status from new to needs_review.


---

Comment by jdemeyer created at 2014-01-06 16:37:40

Changing status from needs_review to positive_review.


---

Comment by zimmerma created at 2014-01-06 16:55:47

I find this "feature" quite inconsistent with what is done for other fields:

```
sage: ComplexField(200)(CC(1.0e-20))
9.9999999999999994515327145420957165172950370278739244710772e-21
sage: RealIntervalField(100)(RIF("1.0e-20"))
[9.9999999999999994515327145420957e-21 .. 1.0000000000000000956165483594624e-20]
```


Moreover:

```
sage: Reals(200)(RR(1.0e-20))
1.0000000000000000000000000000000000000000000000000000000000e-20
sage: Reals(200)(RR("1.0e-20"))
9.9999999999999994515327145420957165172950370278739244710772e-21
```


Paul


---

Comment by jdemeyer created at 2014-01-06 17:00:34

Replying to [comment:3 zimmerma]:
> I find this "feature" quite inconsistent with what is done for other fields:
I agree, but that's not the topic of this ticket. You could consider creating 3 new tickets for the inconsistencies below (but I personally don't care enough to fix them).

> {{{
> sage: ComplexField(200)(CC(1.0e-20))
> 9.9999999999999994515327145420957165172950370278739244710772e-21
> sage: RealIntervalField(100)(RIF("1.0e-20"))
> [9.9999999999999994515327145420957e-21 .. 1.0000000000000000956165483594624e-20]
> sage: Reals(200)(RR("1.0e-20"))
> 9.9999999999999994515327145420957165172950370278739244710772e-21
> }}}


---

Comment by zimmerma created at 2014-01-06 17:07:55

ok, but then this is definitively a bug:

```
sage: a=RealField(53)(1.0e-20)
sage: Reals(200)(a)
1.0000000000000000000000000000000000000000000000000000000000e-20
sage: Reals(200)(a.exact_rational())
9.9999999999999994515327145420957165172950370278739244710772e-21
```

Since a 53-bit floating-point value is exactly representable with a precision of 200 bits, we should have `Reals(200)(a) == Reals(200)(a.exact_rational())`. Otherwise Sage is not IEEE-754 compliant (despite MPFR being compliant).

Paul


---

Comment by mmezzarobba created at 2014-01-06 19:34:02

Replying to [comment:5 zimmerma]:
> ok, but then this is definitively a bug:
> {{{
> sage: a=RealField(53)(1.0e-20)
> sage: Reals(200)(a)
> 1.0000000000000000000000000000000000000000000000000000000000e-20
> sage: Reals(200)(a.exact_rational())
> 9.9999999999999994515327145420957165172950370278739244710772e-21
> }}}
> Since a 53-bit floating-point value is exactly representable with a precision of 200 bits, we should have `Reals(200)(a) == Reals(200)(a.exact_rational())`. Otherwise Sage is not IEEE-754 compliant (despite MPFR being compliant).

I also can't see how this could be considered anything other than a bug. If `RealField(200)(1.0e-20)` really has to be equal to `RealField(200)(10**(-20))` (which is definitely _not_ what I would call "work as expected"), then `1.0e-20` should be preparsed to something else than an element of `RR`!


---

Comment by jdemeyer created at 2014-01-06 20:10:08

At least the behaviour is intentional, so it's by definition not a bug. Perhaps it's a bad design decision. But if you want to argue for that, please do it on `sage-devel`, not this ticket.


---

Comment by zimmerma created at 2014-01-06 20:24:27

> At least the behaviour is intentional, so it's by definition not a bug.

then it should be documented somewhere. Where?

Also:

```
sage: a=RealField(53)(1.0e-20)
sage: a.exact_rational?
...
   Returns the exact rational representation of this floating-point number.
```

thus either `a` is **exactly** `10^(-20)`, and then `exact_rational` should return that
value, or it is not, and `Reals(200)(a.exact_rational())` should return `6646139978924579/664613997892457936451903530140172288`

Paul


---

Comment by jdemeyer created at 2014-01-06 20:28:07

If you care about this, please discuss it on `sage-devel`.


---

Comment by mmezzarobba created at 2014-01-06 21:43:34

Replying to [comment:6 mmezzarobba]:
> `1.0e-20` should be preparsed to something else than an element of `RR`!

To clarify, I don't really care whether `Reals(200)(1.0e-20)` yields `1.0000000000000000000000000000000000000000000000000000000000e-20` or `9.9999999999999994515327145420957165172950370278739244710772e-21`. I find `RealLiteral`s confusing, but the way `Reals(200)(1.0e-20)` works is not a bug by itself.

The way `Reals(200)(RR(1.0e-20))` works is a more serious problem, however. In other words, unless we simply get rid of  `RealLiteral`s (as Paul just suggested on sage-devel), they should be elements of some ad hoc that coerces into real fields (or perhaps even of `QQ`), not of real fields themselves!


---

Comment by vbraun created at 2014-01-07 05:03:34

I'm closing this ticket, please direct any future discussion to sage-devel thread at
https://groups.google.com/d/msg/sage-devel/c2Ih4uglTgQ/iGSIpTwuoBsJ


---

Comment by vbraun created at 2014-01-07 05:03:42

Resolution: wontfix
