# Issue 15788: numerical inconsistency with exponential integral values Ei(x)

Issue created by migration from https://trac.sagemath.org/ticket/16025

Original creator: rws

Original creation time: 2014-03-27 17:45:44


```
sage: Ei(1.1,prec=300)
/home/ralf/sage/src/bin/sage-ipython:1: DeprecationWarning: The prec keyword argument is deprecated. Explicitly set the precision of the input, for example Ei(RealField(300)(1)), or use the prec argument to .n() for exact inputs, e.g., Ei(1).n(300), instead.
See http://trac.sagemath.org/7748 for details.
  #!/usr/bin/env python
2.16737827956340306615064476647912607220394065907142504328679588538509331805598360907980986

sage: Ei(1.1).n(300)
2.16737827956340289858871983597055077552795410156250000000000000000000000000000000000000000

sage: Ei(RealField(300)(1.1))
2.16737827956340282358378734233807621497112737591639704719499002090327541763352339357795426
```

Not sure what would be correct, though.


---

Comment by kcrisman created at 2014-03-28 01:10:21

Oh, dear.  This is because we auto-evaluate things with decimal points.

```
sage: Ei(1.1)
2.16737827956340
sage: Ei(1.1).n(300)
2.16737827956340289858871983597055077552795410156250000000000000000000000000000000000000000
```

Not sure where those other things come from - floating point remains, I guess?  Especially since the last few digits are a power of two...

The `prec` deprecation was intended for things like 

```
sage: Ei(1)
Ei(1)
sage: Ei(1).n(300)
1.89511781635593675546652093433163426901706058173270759164622843188251383453380415354890071
```

but apparently the warning happens no matter what.  And if you read the warning closely (!):

```
Explicitly set the precision of the input, for example 
Ei(RealField(300)(1)), or use the prec argument to .n() for exact inputs, 
e.g., Ei(1).n(300), instead.
```

So ... are you asking for more clarification of this (which I would understand) or are you saying it is wrong?   `1.1` is not "exact" so the warning is telling us to explicitly set the precision of the input.  Maybe the example should be one that isn't exact, and say more about that being appropriate then?


---

Comment by rws created at 2014-03-28 09:02:04

Replying to [comment:1 kcrisman]:
> So ... are you asking for more clarification of this
I was just naively comparing and, frankly, I see no reason why we should surprise the user with

```
sage: Ei(1.1).n(300)
2.16737827956340289858871983597055077552795410156250000000000000000000000000000000000000000
sage: Ei(11/10).n(300)
2.16737827956340282358378734233807621497112737591639704719499002090327541763352339357795426
```

Update:
Let's assume I accept the convention of 1.1 being auto-evaluated as 53-bit real, then I would expect a warning of some kind on the attempt of getting 300 bits of precision from it.


---

Comment by kcrisman created at 2014-03-28 18:27:17

I think this convention has been deciding on by others.  However, I do agree that perhaps it's confusing in the way you suggest.  I don't feel like I know enough about how people want to use reals in this way, so I wouldn't come down on either side here, but I think it's totally reasonable to [ask on sage-support](https://groups.google.com/forum/#!topic/sage-support/YI62-vWjvww) - or even on sage-devel - whether this is a silly situation.  Your example above cuts to the chase, although it happens just as well on things like

```
print sqrt(4.001).n(300)
print sqrt(4001/1000).n(300)
```

so no need to invoke special functions, and I'll put that in the thread.


---

Comment by rws created at 2014-03-30 07:03:17

The functionality already exists in `sage.symbolic.constants.LimitedPrecisionConstant`:

```
sage: brun.n(30)
1.9021606
sage: brun.n(50)
...
NotImplementedError: brun is only available up to 41 bits
```


So another naive question, aren't all constants that have been input by the user, limited precision? What would break or have to be implemented if they were?


---

Comment by jdemeyer created at 2014-10-16 20:54:52

New commits:


---

Comment by jdemeyer created at 2014-10-16 20:54:52

Changing status from new to needs_review.


---

Comment by kcrisman created at 2014-10-17 00:20:09

Somehow I feel like there should be more documentation where the examples have disappeared.  Also, is there/should there be a numerical approximation method for the CC like you added for the RR?  (This may be a dumb question.)


---

Comment by jdemeyer created at 2014-10-17 05:54:12

Replying to [comment:12 kcrisman]:
> Also, is there/should there be a numerical approximation method for the CC like you added for the RR?  (This may be a dumb question.)
This is for `RealLiteral`, not `RealNumber`. Given that there is no `ComplexLiteral`, no it doesn't have to be added. Remark also the difference (with or without this ticket):

```
sage: a = RR(CC(1.3))
sage: b = RR(1.3)
sage: a == b
True
sage: RealField(200)(a)
1.3000000000000000444089209850062616169452667236328125000000
sage: RealField(200)(b)
1.3000000000000000000000000000000000000000000000000000000000
```



---

Comment by jdemeyer created at 2014-10-17 06:00:38

Replying to [comment:12 kcrisman]:
> Somehow I feel like there should be more documentation where the examples have disappeared.
I assume you refer to the 2 examples in `src/sage/modules/free_module_element.pyx`? They were testing the `.n()` method for vectors, but there are already plenty of tests for that (also in `src/sage/misc/functional.py` for example).


---

Comment by mmarco created at 2014-10-19 21:17:46

The part of tides is being take care of in #17179


---

Comment by git created at 2014-10-29 11:32:01

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by git created at 2014-11-19 22:05:03

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by kcrisman created at 2015-01-05 16:42:12

> Let's assume I accept the convention of 1.1 being auto-evaluated as 53-bit real, then I would expect a warning of some kind on the attempt of getting 300 bits of precision from it.

Was there ever any consensus on this?  I feel like maybe there was a sage-devel thread but I don't see it linked here.


---

Comment by jdemeyer created at 2015-01-05 16:57:16

Replying to [comment:19 kcrisman]:
> I feel like maybe there was a sage-devel thread but I don't see it linked here.
I believe there was no such thread. Do you think there should be one?


---

Comment by kcrisman created at 2015-01-05 17:12:03

> > I feel like maybe there was a sage-devel thread but I don't see it linked here.
> I believe there was no such thread. Do you think there should be one?
Not necessarily, but I'm wondering whether rws is convinced by the current discussion.


---

Comment by rws created at 2015-01-05 17:30:22

I think I have seen discussions in the meantime which I guess have changed my opinion. Hey, that comment was 9 months ago, and I have learned a bit through my work on and with Sage. So consider me convinced please.


---

Comment by kcrisman created at 2015-01-05 17:38:36

Actually, perhaps Jeroen was convinced by you... I haven't looked at this in some time either.


---

Comment by jdemeyer created at 2015-01-05 18:56:37

There wasn't much "convincing" needed, I agreed that there was an issue indeed.


---

Comment by git created at 2015-01-05 19:00:22

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by rws created at 2015-01-16 16:59:35

I think this should go in. It passes `make ptestlong`.


---

Comment by rws created at 2015-01-16 16:59:35

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2015-01-23 23:40:49

Resolution: fixed
