# Issue 11625: Finite field elements are allowed in exponents

Issue created by migration from https://trac.sagemath.org/ticket/11797

Original creator: nbruin

Original creation time: 2011-09-13 20:52:02

Assignee: AlexGhitza


```
sage: p=7
sage: k=GF(p)
sage: k(2)^k(p)
1
sage: (GF(7)(2))^(GF(5)(2))
4
sage: k(2)^p
2
```

It looks like it's simply quietly lifting the exponent to the integers, which it shouldn't do because there is no coercion in that direction (only a conversion):

```
sage: k.<a>=GF(p^2)
sage: k(2)^k(p)
1
sage: k(2)^k(a)
TypeError: not in prime subfield
sage: ZZ(k(1))
1
sage: ZZ(k(a))
TypeError: not in prime subfield
```

There is one side-effect of this that does look elegant:

```
sage: R=Integers(p-1)
sage: (k(2))^(R(p))
2
```

but in general I'd say an error should result from exponentiations like this.


---

Comment by jdemeyer created at 2014-09-10 11:50:57

Resolution: duplicate
