# Issue 28675: sage.rings.integer.Integer is problematic

archive/issues_028675.json:
```json
{
    "body": "CC:  slelievre\n\nUsing [SageMath](SageMath) version 9.0.beta10 via docker image.\n\n\n {{{\n sage: x=4**10000                                                                                                                                                             \n sage: from math import log10                                                                                                                                                 \n sage: type(x)                                                                                                                                                                \n <class 'sage.rings.integer.Integer'>                                                                                                                                         \n sage: log10(x)                                                                                                                                                               \n inf                                                                                                                                                                          \n sage: log10(int(x))                                                                                                                                                          \n 6020.599913279624\n}}}\n\nIssue created by migration from https://trac.sagemath.org/ticket/28912\n\n",
    "created_at": "2019-12-26T15:21:08Z",
    "labels": [
        "packages: standard",
        "minor",
        "bug"
    ],
    "title": "sage.rings.integer.Integer is problematic",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/28675",
    "user": "@ismail"
}
```
CC:  slelievre

Using [SageMath](SageMath) version 9.0.beta10 via docker image.


 {{{
 sage: x=4**10000                                                                                                                                                             
 sage: from math import log10                                                                                                                                                 
 sage: type(x)                                                                                                                                                                
 <class 'sage.rings.integer.Integer'>                                                                                                                                         
 sage: log10(x)                                                                                                                                                               
 inf                                                                                                                                                                          
 sage: log10(int(x))                                                                                                                                                          
 6020.599913279624
}}}

Issue created by migration from https://trac.sagemath.org/ticket/28912





---

archive/issue_comments_405014.json:
```json
{
    "body": "Confirmed in Sage 9.0.beta10.\n\nSmallest Sage integers where this fails:\n\n```\nsage: a = (2^54-1)*2^(1024-54)\nsage: aa = int(a)\n```\n\n\nImport `log10` from the `math` module:\n\n```\nsage: from math import log10\nsage: [log10(x) for x in [0.01, 0.1, 1, 10, 100]]\n[-2.0, -1.0, 0.0, 1.0, 2.0]\n```\n\n\nComputing `log10(aa)` works, but not `log10(a)`:\n\n```\nsage: log10(aa)\n308.25471555991675\nsage: log10(a)\ninf\n```\n\n\nNo problem with `a - 1` as a Sage integer:\n\n```\nsage: type(a-1)\n<class 'sage.rings.integer.Integer'>\nsage: log10(a-1)\n308.25471555991675\n```\n\n\nWorkaround:\n\n```\nsage: RR(a).log()/(10.0).log()\n308.254715559917\n```\n\n\nNote that Sage has a built-in method for the \"number of digits\"\nof an integer (a common reason for taking the base ten logarithm):\n\n```\nsage: a.ndigits()\n309\nsage: a.ndigits(base=2)\n1024\n```\n",
    "created_at": "2019-12-27T05:31:14Z",
    "issue": "https://github.com/sagemath/sagetest/issues/28675",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/28675#issuecomment-405014",
    "user": "slelievre"
}
```

Confirmed in Sage 9.0.beta10.

Smallest Sage integers where this fails:

```
sage: a = (2^54-1)*2^(1024-54)
sage: aa = int(a)
```


Import `log10` from the `math` module:

```
sage: from math import log10
sage: [log10(x) for x in [0.01, 0.1, 1, 10, 100]]
[-2.0, -1.0, 0.0, 1.0, 2.0]
```


Computing `log10(aa)` works, but not `log10(a)`:

```
sage: log10(aa)
308.25471555991675
sage: log10(a)
inf
```


No problem with `a - 1` as a Sage integer:

```
sage: type(a-1)
<class 'sage.rings.integer.Integer'>
sage: log10(a-1)
308.25471555991675
```


Workaround:

```
sage: RR(a).log()/(10.0).log()
308.254715559917
```


Note that Sage has a built-in method for the "number of digits"
of an integer (a common reason for taking the base ten logarithm):

```
sage: a.ndigits()
309
sage: a.ndigits(base=2)
1024
```




---

archive/issue_comments_405015.json:
```json
{
    "body": "Changing component from packages: standard to numerical.",
    "created_at": "2019-12-27T05:31:14Z",
    "issue": "https://github.com/sagemath/sagetest/issues/28675",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/28675#issuecomment-405015",
    "user": "slelievre"
}
```

Changing component from packages: standard to numerical.



---

archive/issue_comments_405016.json:
```json
{
    "body": "More descriptive ticket title.",
    "created_at": "2019-12-27T05:36:09Z",
    "issue": "https://github.com/sagemath/sagetest/issues/28675",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/28675#issuecomment-405016",
    "user": "slelievre"
}
```

More descriptive ticket title.



---

archive/issue_comments_405017.json:
```json
{
    "body": "More of the same problem:\n\n\n```\nsage: math.log2(a)                                                                                                                                                           \ninf                                                                                                                                                                          \nsage: math.log(a)                                                                                                                                                            \ninf                                                                                                                                                                          \nsage: math.isinf(a)                                                                                                                                                          \nTrue \n```\n",
    "created_at": "2019-12-27T05:57:38Z",
    "issue": "https://github.com/sagemath/sagetest/issues/28675",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/28675#issuecomment-405017",
    "user": "@ismail"
}
```

More of the same problem:


```
sage: math.log2(a)                                                                                                                                                           
inf                                                                                                                                                                          
sage: math.log(a)                                                                                                                                                            
inf                                                                                                                                                                          
sage: math.isinf(a)                                                                                                                                                          
True 
```




---

archive/issue_comments_405018.json:
```json
{
    "body": "Ticket retargeted after milestone closed",
    "created_at": "2020-01-06T14:10:03Z",
    "issue": "https://github.com/sagemath/sagetest/issues/28675",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/28675#issuecomment-405018",
    "user": "embray"
}
```

Ticket retargeted after milestone closed



---

archive/issue_comments_405019.json:
```json
{
    "body": "Moving tickets to milestone sage-9.2 based on a review of last modification date, branch status, and severity.",
    "created_at": "2020-05-01T04:28:42Z",
    "issue": "https://github.com/sagemath/sagetest/issues/28675",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/28675#issuecomment-405019",
    "user": "mkoeppe"
}
```

Moving tickets to milestone sage-9.2 based on a review of last modification date, branch status, and severity.



---

archive/issue_comments_405020.json:
```json
{
    "body": "Moving to 9.4, as 9.3 has been released.",
    "created_at": "2021-05-10T17:42:09Z",
    "issue": "https://github.com/sagemath/sagetest/issues/28675",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/28675#issuecomment-405020",
    "user": "mkoeppe"
}
```

Moving to 9.4, as 9.3 has been released.
