# Issue 12241: Sage crashes to prompt while creating quitient of vector spaces

Issue created by migration from Trac.

Original creator: JStarx

Original creation time: 2012-02-01 20:53:17

Assignee: AlexGhitza

CC:  malb

Keywords: linbox

The following crashes Sage 4.8 on OS X 10.6.8 with a mysterious message:


```
sage: X = (GF(3)^1)/(GF(3)^0)
sage: Y = (GF(3)^1)/(GF(3)^1)
sage: X.hom([(1,)], Y)
lda must be >= MAX(N,1): lda=0 N=0Parameter 7 to routine cblas_sgemv was incorrect
Mac OS BLAS parameter error in cblas_sgemv, parameter #0, (unavailable), is 0
d-69-91-159-193:devel Starx$
```


I have not yet been able to find the error, the problem may be with a call to LinBox, as discussed here: http://groups.google.com/group/sage-support/browse_thread/thread/30bfc9922b26f3d7 but I am not yet sure.


---

Comment by vbraun created at 2012-02-01 22:37:02

I can reproduce it with sage-5.0.beta1 on Fedora 16. The problem is in vector-matrix multiplication:

```
sage: vector(GF(3),[1]) * matrix(GF(3),[[]]) 
lda must be >= MAX(N,1): lda=0 N=0Parameter 7 to routine cblas_sgemv was incorrect
```

Note that the matrix is of the wrong size, but the coercion model will try it out to see if any error is raised.


---

Comment by vbraun created at 2012-02-01 22:37:02

Changing assignee from AlexGhitza to jason, was.


---

Comment by vbraun created at 2012-02-01 22:37:02

Changing component from algebra to linear algebra.


---

Comment by vbraun created at 2012-02-01 22:37:02

Changing keywords from "linbox" to "".


---

Comment by malb created at 2012-02-01 23:28:25

Changing status from new to needs_review.


---

Comment by malb created at 2012-02-01 23:28:25

Prepared the patch while being very tired, so fingers crossed it does what it should :)


---

Comment by vbraun created at 2012-02-01 23:56:37

Changing status from needs_review to needs_work.


---

Comment by vbraun created at 2012-02-01 23:56:37

We should definitely raise an error when multiplying matrix/vector of incompatible size, and not just return a zero matrix. Maybe after you got some sleep? :-)


---

Comment by malb created at 2012-02-02 10:34:44

Hi, 

but `A = matrix(GF(3),[[]])` is a 1 x 0 matrix and `v = vector(GF(3),[1])` a vector of length 1. Hence, we do linear combination of the row of the matrix, which happens to have 0 columns. That seems correct to me?


---

Comment by vbraun created at 2012-02-02 17:54:52

Yes, you are right. Apparently I needed the sleep :-)

However, the following variation still crashes in `matrix_modn_dense_float`:

```
sage: vector(GF(3),[]) * matrix(GF(3),0,1,[]) 
```



---

Comment by malb created at 2012-02-02 18:06:43

Good catch. I updated the patch. It now returns:


```
sage: v = vector(GF(3),[]) * matrix(GF(3),0,1,[]); v
(0)
```


Is this what we want? I get confused with these zero row/column matrices.


---

Comment by vbraun created at 2012-02-20 05:11:29

I agree that the dimensions in the previous comment are correct.

Here is yet another crasher:

```
sage: matrix(GF(3),0,0,[]) * vector(GF(3),[])
lda must be >= MAX(N,1): lda=0 N=4194304Parameter 7 to routine cblas_sgemv was incorrect
```


I suggest we add the following to the doctests:

```
sage: v0 = vector(GF(3),[])
sage: v1 = vector(GF(3),[1])
sage: m00 = matrix(GF(3),0,0,[])
sage: m01 = matrix(GF(3),0,1,[])
sage: m10 = matrix(GF(3),1,0,[])
sage: m11 = matrix(GF(3),1,1,[1])
sage: good = [ (v0,m00), (v0,m01), (v1,m10), (v1,m11), (m00,v0), (m10,v0), (m01,v1), (m11,v1) ]
sage: for v,m in good:
...       print v, 'x', m, '=', v*m              
...
sage: bad  = [ (v1,m00), (v1,m01), (v0,m10), (v0,m11), (m00,v1), (m10,v1), (m01,v0), (m11,v0) ]
sage: for v,m in bad:
...       try:
...           v*m
...           print 'Uncaught dimension mismatch!'
...       except TypeError:
...           pass
...
```



---

Comment by malb created at 2012-02-20 11:26:52

Thanks for kicking my butt to do this properly. I've updated the patch accordingly.

However, I noticed that


```
sage: A = matrix(GF(3),1,0,[]) * matrix(GF(3),1,0,[])
sage: A.nrows()
1
sage: A.ncols()
0
```


which seems wrong. If you agree, I'll raise the issue on [sage-devel].


---

Comment by vbraun created at 2012-02-21 07:44:39

The shapes don't match in `matrix(GF(3),1,0,[]) * matrix(GF(3),1,0,[])`, so it is a bug that no error is raised.


---

Comment by malb created at 2012-02-21 11:52:17

Right, so I though this was handled on a lower level and hence a bug on a lower level but it turns out it's my responsibility here to throw an error. I'm throwing an `ArithmeticError` which matches what e.g. Integer matrices do. It doesn't match the error thrown for matrix times vector products though which is a `TypeError`.


---

Comment by malb created at 2012-02-21 11:52:17

Changing status from needs_work to needs_review.


---

Comment by vbraun created at 2012-02-22 05:30:26

Looks good!


---

Comment by vbraun created at 2012-02-22 05:30:26

Changing keywords from "" to "sd36".


---

Comment by vbraun created at 2012-02-22 05:30:26

Changing status from needs_review to positive_review.


---

Comment by jdemeyer created at 2012-02-22 12:19:10

The documentation is misformatted:

```
TESTS:

    We test corner cases for multiplication
```

should be

```
TESTS: 
	 
We test corner cases for multiplication::
```



---

Attachment

fixed.


---

Comment by jdemeyer created at 2012-03-04 21:19:02

Resolution: fixed
