# Issue 15435: Computing degree bound GBs with Magma is broken

Issue created by migration from Trac.

Original creator: malb

Original creation time: 2014-01-14 12:25:00

CC:  bouillaguet

Keywords: magma

This should work:


```
sage: R.<a,b,c,d,e,f,g,h,i,j> = PolynomialRing(GF(127),10)
sage: I = sage.rings.ideal.Cyclic(R,6)
sage: gb = I.groebner_basis('magma:GroebnerBasis', deg_bound=4)
```


The culprit is that PolynomialSequence casts to an ideal in Magma, but we need a sequence.


---

Comment by git created at 2014-01-14 12:42:00

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by malb created at 2014-01-14 14:37:38

Changing status from new to needs_review.


---

Comment by malb created at 2014-06-25 00:51:03

anyone up for reviewing it?


---

Comment by malb created at 2014-06-28 03:52:48

Changing keywords from "magma" to "magma, sd59".


---

Comment by malb created at 2014-08-04 17:24:00

ping? It's a quite simple patch


---

Comment by jakobkroeker created at 2014-08-07 09:40:02

I get a different ouput for `gb`,
so the doctest fails for me at `len(gb)`

```
 sage: R.<a,b,c,d,e,f,g,h,i,j> = PolynomialRing(GF(127),10)
 sage: I = sage.rings.ideal.Cyclic(R,6)
 sage: gb = I.groebner_basis('magma:GroebnerBasis', deg_bound=4)
 sage: len(gb) # optional - magma
 7 # doctest expects 5
```

Singular tells me 7, too (but we should not rely on that)

So why in your output len(gb) =5 ?  I have access to a dated magma version  `2.17-8`.

Here is the gb output I get:

```
[a*b*c*d*e*f - 1,
 a*b*c*d*e - 3*b*c*d*e*f - c^2*d*e*f - 2*c*d^2*e*f - 2*c*d*e^2*f - d^2*e^2*f + b*c*d*f^2 + 2*b*c*e*f^2 + 2*b*d*e*f^2 + 3*c*d*e*f^2 + 2*d^2*e*f^2 + b*e^2*f^2 + c*e^2*f^2 + 3*d*e^2*f^2 + e^3*f^2 - b*c*f^3 - c*d*f^3 - 3*b*e*f^3 - 3*c*e*f^3 - d*e*f^3 + b*f^4 + c*f^4 + d*f^4 - 3*e*f^4 + f^5, 
c^3*d - c^2*d^2 + b*c*d*e + 2*c^2*d*e - 2*c*d^2*e - c^3*f - b*c*d*f + 3*c^2*d*f + 2*c*d^2*f - c^2*e*f + b*e^2*f + c*e^2*f + d*e^2*f + e^3*f - b*c*f^2 - 4*c^2*f^2 - b*d*f^2 - d^2*f^2 + 4*b*e*f^2 + 2*c*e*f^2 + 2*d*e*f^2 + 5*e^2*f^2 - 3*b*f^3 - 6*c*f^3 - 4*d*f^3 + 3*e*f^3 - 3*f^4,
 b*c*d^2 - b*c*d*e + c*d^2*e - c*d^2*f + b*c*e*f + c*d*e*f + d*e^2*f - b*c*f^2 + b*d*f^2 + d^2*f^2 - 2*b*e*f^2 - 2*c*e*f^2 - 2*d*e*f^2 - e^2*f^2 + b*f^3 + c*f^3 + 2*d*f^3 - 2*e*f^3 + f^4, 
b*c^2 - b*c*d + c^2*d - c^2*f + b*e*f + c*e*f + d*e*f + e^2*f - b*f^2 - 2*c*f^2 - d*f^2 + e*f^2 - f^3,
 b^2 + b*d - c*d + b*e - d*e + 2*b*f + c*f + d*f + f^2,
 a + b + c + d + e + f]
```



---

Comment by jakobkroeker created at 2014-08-07 09:40:02

Changing status from needs_review to needs_info.


---

Comment by git created at 2014-08-07 12:22:59

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by malb created at 2014-08-07 12:23:32

Changing status from needs_info to needs_review.


---

Comment by malb created at 2014-08-07 12:23:32

I checked with my Magma install and indeed 5 was wrong. It also returns 7. I've fixed the doctest.


---

Comment by jakobkroeker created at 2014-08-08 12:31:51

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2014-08-10 16:37:23

Reviewer name (full name)


---

Comment by vbraun created at 2014-08-10 16:37:23

Changing status from positive_review to needs_work.


---

Comment by jakobkroeker created at 2014-08-11 07:43:00

Changing status from needs_work to needs_review.


---

Comment by jakobkroeker created at 2014-08-11 07:45:22

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2014-08-11 15:01:20

Resolution: fixed
