# Issue 11066: failing calculation of a symbolic integral

Issue created by migration from https://trac.sagemath.org/ticket/11238

Original creator: casamayou

Original creation time: 2011-04-22 14:04:54

Assignee: burcin

CC:  zimmerma kcrisman

Keywords: integrate

With a symbolic calculation, Sage returns 0 
for the integral integrate(exp(-x)*sinh(sqrt(x)), x, 0, oo) 
instead of 
exp(1/4) * sqrt(pi) / 2


```
sage: integrate(exp(-x)*sinh(sqrt(x)), x, 0, oo)
0
sage: integral_numerical(exp(-x)*sinh(sqrt(x)), 0, oo)
(1.1379378972322944, 3.1822014179283542e-07)
sage: (exp(1/4) * sqrt(pi) / 2).n()
1.13793789723437
sage: plot(exp(-t)*sinh(sqrt(t)), t, 0, 10)
```




---

Comment by kcrisman created at 2011-04-23 15:25:41

This is also present in the latest Maxima.  This is now reported at [this Maxima bug artifact](https://sourceforge.net/tracker/?func=detail&aid=3292033&group_id=4933&atid=104933).


```
Maxima 5.24.0 http://maxima.sourceforge.net
using Lisp SBCL 1.0.24
(%i3) integrate(exp(-x)*sinh(sqrt(x)),x,0,inf);
(%o3) 0
(%i4) quad_qagi(exp(-x)*sinh(sqrt(x)),x,0,inf);
(%o4) [1.137937897234377, 5.171862937913829e-11, 345, 0]
```



---

Comment by kcrisman created at 2012-01-28 02:54:01

This is NOT fixed in 5.24, so we can't yet do it, but it is now fixed in Maxima 5.26.

```

(%i2) display2d:false;

(%o2) false
(%i3) integrate(exp(-x)*sinh(sqrt(x)),x,0,inf);

(%o3) %e^(1/4)*sqrt(%pi)/2
```



---

Comment by mjo created at 2012-03-22 15:36:15

Add a doctest for the non-zero result.


---

Comment by mjo created at 2012-03-22 15:39:50

Changing status from new to needs_review.


---

Attachment

Here's another one I found fixed by the Maxima upgrade. The patch will apply cleanly on top of #11445. I put the test in the same place as that one, but I could of course copy/paste them out together.


---

Comment by kcrisman created at 2012-03-22 17:50:39

Looks good.  No worries about the cut/paste.  However, let's try to put others in the symbolic integration ones... Maybe we should even separate some of them out into one of our "tests" files in calculus/ or something.


---

Comment by kcrisman created at 2012-03-22 17:50:39

Changing status from needs_review to positive_review.


---

Comment by jdemeyer created at 2012-04-02 15:24:05

Resolution: fixed


---

Comment by mjo created at 2012-05-23 17:37:03

This seems to be back with maxima-5.27.0, but only with `domain: complex;`


```
Maxima 5.27.0 http://maxima.sourceforge.net
using Lisp ECL 12.2.1
Distributed under the GNU Public License. See the file COPYING.
Dedicated to the memory of William Schelter.
The function bug_report() provides bug reporting information.
(%i1) display2d:false;

(%o1) false
(%i2) integrate(exp(-x)*sinh(sqrt(x)),x,0,inf);

(%o2) %e^(1/4)*sqrt(%pi)/2
(%i3) domain:complex;

(%o3) complex
(%i4) integrate(exp(-x)*sinh(sqrt(x)),x,0,inf);

(%o4) 0
```


Reported upstream at https://sourceforge.net/tracker/?func=detail&aid=3529144&group_id=4933&atid=104933.


---

Comment by zimmerma created at 2012-05-24 07:14:34

thank you Michael, the new doctest will bump when/if we upgrade to Maxima 5.27.

Paul


---

Comment by mjo created at 2012-07-30 15:33:05

This is fixed upstream, again. It should make it into maxima-5.28.


---

Comment by kcrisman created at 2014-12-08 15:22:07

I won't reopen this one, but it is definitely still there - to the point that I don't see how we can be passing doctests!

```
(%i1) display2d:false;

(%o1) false
(%i2) integrate(exp(-x)*sinh(sqrt(x)),x,0,inf);

(%o2) -%e^(1/4)*(2*gamma_incomplete(1,1)-gamma_incomplete(1/2,1)-sqrt(%pi)-2)/4
 +%e^(1/4)*gamma_incomplete(1,1)/2-%e^(1/4)*gamma_incomplete(1/2,1)/4
 +%e^(1/4)*sqrt(%pi)/4-%e^(1/4)/2
(%i3) domain:complex;

(%o3) complex
(%i4) integrate(exp(-x)*sinh(sqrt(x)),x,0,inf);
<hangs>
```

See #17469.   Weirdly, the doctest does pass, but we had to change things at some point, which is a regression on Maxima's part:

```
    Another symbolic integral, from :trac:`11238`, that used to return
    zero incorrectly; with Maxima 5.26.0 one gets
    ``1/2*sqrt(pi)*e^(1/4)``, whereas with 5.29.1, and even more so
    with 5.33.0, the expression is less pleasant, but still has the
    same value.  Unfortunately, the computation takes a very long time
    with the default settings, so we temporarily use the Maxima
    setting ``domain: real``::

        sage: sage.calculus.calculus.maxima('domain: real')
        real
        sage: f = exp(-x) * sinh(sqrt(x))
        sage: t = integrate(f, x, 0, Infinity); t            # long time
        1/4*sqrt(pi)*(erf(1) - 1)*e^(1/4) - 1/4*(sqrt(pi)*(erf(1) - 1) - sqrt(pi) + 2*e^(-1) - 2)*e^(1/4) + 1/4*sqrt(pi)*e^(1/4) - 1/2*e^(1/4) + 1/2*e^(-3/4)
        sage: t.simplify_exp()  # long time
        1/2*sqrt(pi)*e^(1/4)
        sage: sage.calculus.calculus.maxima('domain: complex')
        complex
```



---

Comment by zimmerma created at 2014-12-08 15:37:29

with 6.0 both work but take a long time:

```
sage: sage.calculus.calculus.maxima('domain: real')
real
sage: integrate(exp(-x)*sinh(sqrt(x)), x, 0, oo)
1/4*sqrt(pi)*(erf(1) - 1)*e^(1/4) - 1/4*(sqrt(pi)*(erf(1) - 1) - sqrt(pi) + 2*e^(-1) - 2)*e^(1/4) + 1/4*sqrt(pi)*e^(1/4) - 1/2*e^(1/4) + 1/2*e^(-3/4)
sage: sage.calculus.calculus.maxima('domain: complex')
complex
sage: integrate(exp(-x)*sinh(sqrt(x)), x, 0, oo)
1/4*(sqrt(pi)*(erf(1) - 1) + sqrt(pi) + 2*e^(-1) - 2)*e^(1/4) - 1/4*(sqrt(pi)*(erf(1) - 1) - sqrt(pi) + 2*e^(-1) - 2)*e^(1/4)
```

Paul
