# Issue 32215: asymptotic rings involving monomial non-growth groups

Issue created by migration from https://trac.sagemath.org/ticket/32452

Original creator: mmezzarobba

Original creation time: 2021-09-02 16:21:22

CC:  cheuberg behackl dkrenn

Trying to create an asymptotic ring involving a monomial non-growth group fails with:

```
sage: AsymptoticRing('n^(RBF*I)', ZZ)
AttributeError: 'ImaginaryGroup_with_category' object has no attribute 'one'
```

The following change seems to be enough to make it work, but I am not sure at all if it is correct.

```
diff --git a/src/sage/rings/asymptotic/growth_group.py b/src/sage/rings/asymptotic/growth_group.py
index 4b8d43438e..7432faa022 100644
--- a/src/sage/rings/asymptotic/growth_group.py
+++ b/src/sage/rings/asymptotic/growth_group.py
@@ -5214,6 +5214,9 @@ def construction(self):
         """
         return MonomialNonGrowthGroupFunctor(self._var_), self.base()

+    def gens_monomial(self):
+        return tuple()
+

 MonomialGrowthGroup._non_growth_group_class_ = MonomialNonGrowthGroup
```



---

Comment by mmezzarobba created at 2021-09-03 09:47:00

Changing status from new to needs_review.


---

Comment by mmezzarobba created at 2021-09-03 09:47:00

New commits:


---

Comment by mmezzarobba created at 2021-09-03 09:47:00

Changing component from PLEASE CHANGE to asymptotic expansions.


---

Comment by mmezzarobba created at 2021-09-03 09:47:00

Changing type from PLEASE CHANGE to defect.


---

Comment by mmezzarobba created at 2021-09-10 16:10:51


```
sage: from sage.rings.asymptotic.growth_group import *
sage: Asy.<n> = AsymptoticRing('n^QQbar', ZZ)
sage: BGG = MonomialGrowthGroup.factory(RBF, 'n', extend_by_non_growth_group=True)
sage: BAsy = AsymptoticRing(BGG, ZZ)
sage: BAsy
Asymptotic Ring <n^RBF * n^(RBF*I)> over Integer Ring
sage: BAsy(n^(QQbar(-1)^(1/3)))
n^([0.500000000000000 +/- 1.95e-16])
```

(probably the same issue as #34064)


---

Comment by mmezzarobba created at 2021-09-10 16:10:51

Changing status from needs_review to needs_work.
