# Issue 28249: Morphisms from and evaluation of power series and Laurent series rings

Issue created by migration from https://trac.sagemath.org/ticket/28486

Original creator: roed

Original creation time: 2019-09-13 10:47:30

You can't create morphisms from power series rings to p-adic rings when you should be able to:

```
sage: R.<x> = ZZ[[]]
sage: A = Zp(5)
sage: R.hom([A(5)])
Traceback (most recent call last):
...
ValueError: relations do not all (canonically) map to 0 under map determined by images of generators
```

Moreover, you can evaluate power series on p-adic elements even when the result is not well defined:

```
sage: f = (x + x^4 + O(x^9))
sage: f(A(5)) # this is fine
5 + 5^4 + O(5^9)
sage: R.<x> = QQ[[]]
sage: f = (x + x^4 + O(x^9))
sage: f(A(5)) # this is not
5 + 5^4 + O(5^9)
```



---

Comment by embray created at 2019-12-30 14:48:17

Ticket retargeted after milestone closed


---

Comment by mkoeppe created at 2020-04-14 19:41:51

Batch modifying tickets that will likely not be ready for 9.1, based on a review of the ticket title, branch/review status, and last modification date.


---

Comment by mkoeppe created at 2021-02-13 20:51:01

Setting new milestone based on a cursory review of ticket status, priority, and last modification date.
