# Issue 20995: Fractional part function {x}

Issue created by migration from https://trac.sagemath.org/ticket/21232

Original creator: rws

Original creation time: 2016-08-12 12:47:57

This symbolic function will also be needed by the periodic piecewise function enhancement (#21215). It is in Sympy too.

https://en.wikipedia.org/wiki/Fractional_part


---

Comment by rws created at 2016-08-13 15:08:32

New commits:


---

Comment by rws created at 2016-08-13 15:08:32

Changing status from new to needs_review.


---

Comment by mkoeppe created at 2016-08-13 19:34:35


```
+            if isinstance(x, (int, long)):
+                return x - Integer(x)
```

Probably can just return Integer(0)


```
+    def _print_latex_(self, x):
+        r"""
+        EXAMPLES::
+
+            sage: latex(frac(x))
+            \left\{ x \right\}
+        """
+        return r"\left\{ %s \right\}"%latex(x)
```

I use this braces notation myself, but I can imagine that it's not universally used, and some people may prefer `\mathop{\mathrm{frac}}(x)`.  Perhaps a global option?


---

Comment by mkoeppe created at 2016-08-13 19:37:06


```
+            elif isinstance(x, (float, complex)):
+                return x - Integer(int(math.floor(x)))
```

Also, going through int seems dangerous here


---

Comment by mkoeppe created at 2016-08-13 19:41:33

Changing status from needs_review to needs_work.


---

Comment by mkoeppe created at 2016-08-13 19:56:54

Replying to [comment:5 mkoeppe]:
> {{{
> +            elif isinstance(x, (float, complex)):
> +                return x - Integer(int(math.floor(x)))
> }}}
> Also, going through int seems dangerous here
I retract this comment. I didn't realize `int()` makes Python bignums.


---

Comment by git created at 2016-08-17 06:27:09

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by rws created at 2016-08-17 06:27:48

Changing status from needs_work to needs_review.


---

Comment by mkoeppe created at 2016-08-17 18:54:55

Changing status from needs_review to positive_review.


---

Comment by mkoeppe created at 2016-08-17 18:54:55

Looks good to me.

For full symbolic functionality (which I never use), I guess one would need to tie this in with the simplification and assumptions machinery, so that things like this behave better:

```
sage: simplify(frac(frac(x)))
frac(frac(x))
sage: simplify(frac(floor(x)))
frac(floor(x))
sage: assume(x, 'integer')
sage: simplify(frac(x))
frac(x)
```

Perhaps on a follow-up ticket?


---

Comment by vbraun created at 2016-08-19 22:44:57

Resolution: fixed
