# Issue 14420: Failure in Singular upon division with remainder for a multivariate polynomial ring over a univariate fraction field

Issue created by migration from https://trac.sagemath.org/ticket/14624

Original creator: nthiery

Original creation time: 2013-05-21 18:31:31

Assignee: malb

CC:  simonking


```
sage: M = PolynomialRing(QQ['a'].fraction_field(), ['x','y'])
sage: x,y = M.gens()
sage: a = M(M.base_ring().gen())
sage: a.quo_rem(x)
Traceback (most recent call last):
...
/opt/sage-5.10.beta2/local/lib/python2.7/site-packages/sage/interfaces/singular.pyc in eval(self, x, allow_semicolon, strip, **kwds)
    588 
    589         if s.find("error") != -1 or s.find("Segment fault") != -1:
--> 590             raise SingularError('Singular error:\n%s'%s)
    591 
    592         if get_verbose() > 0:

TypeError: Singular error:
   ? division(`number`,`poly`) failed
   ? error occurred in or before STDIN line 101850: `def sage38517=division(sage38515,sage38516);`
```



---

Comment by SimonKing created at 2013-05-21 20:28:50

First question: Why is this operation using the singular pexpect interface, and not libsingular?

Second question: Why is `a._singular_init_()` returning `"a"` and not `"poly(a)"` or so? As a result, we have

```
sage: M = PolynomialRing(QQ['a'].fraction_field(), ['x','y'])
sage: x,y = M.gens()
sage: a = M(M.base_ring().gen())
sage: singular(a).typeof()
number
sage: singular("a").typeof()
number
sage: singular("poly(a)").typeof()
poly
```



---

Comment by SimonKing created at 2013-05-21 20:35:20

I guess we have to look at `sage.rings.polynomial.polynomial_singular_interface._singular_init_func`, where the use of the string representation without adding `"poly(...)"` is hardcoded.
