# Issue 13772: Problem in the return type of BooleanIdeal.variety()

Issue created by migration from https://trac.sagemath.org/ticket/13976

Original creator: Bouillaguet

Original creation time: 2013-01-20 15:35:26

Assignee: malb

CC:  malb alexanderdreyer

One can do:

```
sage= R.<x,y,z> = GF(2)[]
sage: I = ideal( [ x*y*z + x*z + y + 1, x+y+z+1] )
sage: sols = (I+sage.rings.ideal.FieldIdeal(R)).variety()
sage: sols
[{y: 1, z: 0, x: 0}, {y: 1, z: 1, x: 1}]

sage: sols[0][y]
1
```


Now the same thing fails in ``BooleanRing``'s:

```
sage: R.<x,y,z> = BooleanPolynomialRing()
sage: I = ideal( [ x*y*z + x*z + y + 1, x+y+z+1] )
sage: sols = I.variety()
sage: sols
[{y: 1, z: 0, x: 0}, {y: 1, z: 1, x: 1}]

sage: sols[0][y]
Traceback (most recent call last):
...
KeyError: y
```


This is caused by an ugly hack (I authored...) in #13103 to make the ``variety()`` function work on ``BooleanIdeal``'s.


---

Attachment


---

Comment by Bouillaguet created at 2013-01-20 16:00:51

Changing status from new to needs_review.


---

Comment by malb created at 2013-01-20 16:16:12

Looks okay.


---

Comment by malb created at 2013-01-20 16:16:12

Changing status from needs_review to positive_review.


---

Comment by AlexanderDreyer created at 2013-01-21 08:59:06

Nice patch, and Thank you for your great supporting work, Charles!


---

Comment by jdemeyer created at 2013-01-25 13:08:30

Resolution: fixed
