# Issue 20215: spurious limit computation

archive/issues_020215.json:
```json
{
    "body": "From [this sage-support thread](https://groups.google.com/forum/#!topic/sage-support/REsP6kXgMwM):\n\n```\n     sage: assume(x, 'real')\n       sage: limit((x^(1/x)-1)*sqrt(x), x=infinity)\n       +Infinity\n       sage: limit(((1/x)^x-1)/sqrt(x), x=0, dir='+')\n       +Infinity\n\n\nThanks.  In pure Maxima we get:\n\n(%i3) limit((x^(1/x)-1)*sqrt(x),x,inf);\n(%o3)                                 inf\n(%i4) limit((x^(1/x)-1)*sqrt(x),x,0);\n(%o4)                                 und\n(%i5) limit((x^(1/x)-1)*sqrt(x),x,0,plus);\n(%o5)                                  0\n(%i6) limit((x^(1/x)-1)*sqrt(x),x,0,minus);\n(%o6)                                 inf\n\nFrom what I understand, the first of these is wrong, maybe also the last (should it be infinity (complex infinity) instead?).\n\n\nInterestingly,\n\n(%i7) domain:complex;\n(%o7)                               complex\n(%i10) limit((x^(1/x)-1)*sqrt(x),x,0,minus);\n\n;;;\n;;; Detected access to protected memory, also kwown as 'bus or segmentation fault'.\n;;; Jumping to the outermost toplevel prompt\n\n<lots of times>\n\nSegmentation fault: 11\n```\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/20452\n\n",
    "created_at": "2016-04-17T02:18:50Z",
    "labels": [
        "calculus",
        "major",
        "bug"
    ],
    "title": "spurious limit computation",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/20215",
    "user": "kcrisman"
}
```
From [this sage-support thread](https://groups.google.com/forum/#!topic/sage-support/REsP6kXgMwM):

```
     sage: assume(x, 'real')
       sage: limit((x^(1/x)-1)*sqrt(x), x=infinity)
       +Infinity
       sage: limit(((1/x)^x-1)/sqrt(x), x=0, dir='+')
       +Infinity


Thanks.  In pure Maxima we get:

(%i3) limit((x^(1/x)-1)*sqrt(x),x,inf);
(%o3)                                 inf
(%i4) limit((x^(1/x)-1)*sqrt(x),x,0);
(%o4)                                 und
(%i5) limit((x^(1/x)-1)*sqrt(x),x,0,plus);
(%o5)                                  0
(%i6) limit((x^(1/x)-1)*sqrt(x),x,0,minus);
(%o6)                                 inf

From what I understand, the first of these is wrong, maybe also the last (should it be infinity (complex infinity) instead?).


Interestingly,

(%i7) domain:complex;
(%o7)                               complex
(%i10) limit((x^(1/x)-1)*sqrt(x),x,0,minus);

;;;
;;; Detected access to protected memory, also kwown as 'bus or segmentation fault'.
;;; Jumping to the outermost toplevel prompt

<lots of times>

Segmentation fault: 11
```


Issue created by migration from https://trac.sagemath.org/ticket/20452





---

archive/issue_comments_278592.json:
```json
{
    "body": "Changing keywords from \"\" to \"limit\".",
    "created_at": "2020-10-13T11:51:09Z",
    "issue": "https://github.com/sagemath/sagetest/issues/20215",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/20215#issuecomment-278592",
    "user": "chapoton"
}
```

Changing keywords from "" to "limit".
