# Issue 22434: Bug with definite integral

archive/issues_022434.json:
```json
{
    "body": "CC:  slelievre\n\n\n```\nThis works:\nsage: ((1+x)^(1/3)/(1-x)).integrate(x,2.,3.,hold=True)\nintegrate(-(x + 1)^(1/3)/(x - 1), x, 2.00000000000000, 3.00000000000000)\nsage: _.n()\n-1.045820326411141\nsage: ((1+x)^(1/3)/(1-x)).integrate(x,2.,3.)\nsqrt(3)*2^(1/3)*arctan(sqrt(3)*(0.5291336839893998*2^(2/3) + 0.3333333333333333)) - sqrt(3)*2^(1/3)*arctan(sqrt(3)*(0.48074985676913606*2^(2/3) + 0.3333333333333333)) + 1/2*2^(1/3)*log(1.0*2^(2/3) + 1.5874010519681994*2^(1/3) + 2.519842099789746) - 1/2*2^(1/3)*log(1.0*2^(2/3) + 1.4422495703074083*2^(1/3) + 2.080083823051904) - 2^(1/3)*log(-1.0*2^(1/3) + 1.5874010519681994) + 2^(1/3)*log(-1.0*2^(1/3) + 1.4422495703074083) - 0.4354544449823736\nsage: _.n()\n-1.04582032641114\n\nBut not this:\nsage: ((1+x)^(1/5)/(1-x)).integrate(x,2.,3.,hold=True)\nintegrate(-(x + 1)^(1/5)/(x - 1), x, 2.00000000000000, 3.00000000000000)\nsage: _.n()\n-0.8870832386197556\nsage: ((1+x)^(1/5)/(1-x)).nintegral(x,2.,3.)\n(-0.8870832386197555, 9.84860236274705e-15, 21, 0)\nsage: ex=((1+x)^(1/5)/(1-x)).integrate(x,2.,3.)\nsage: ex.n()\n-0.933985822519866 - 0.0743323693052679*I\n```\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/22671\n\n",
    "created_at": "2017-03-22T07:35:44Z",
    "labels": [
        "calculus",
        "major",
        "bug"
    ],
    "title": "Bug with definite integral",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/22434",
    "user": "rws"
}
```
CC:  slelievre


```
This works:
sage: ((1+x)^(1/3)/(1-x)).integrate(x,2.,3.,hold=True)
integrate(-(x + 1)^(1/3)/(x - 1), x, 2.00000000000000, 3.00000000000000)
sage: _.n()
-1.045820326411141
sage: ((1+x)^(1/3)/(1-x)).integrate(x,2.,3.)
sqrt(3)*2^(1/3)*arctan(sqrt(3)*(0.5291336839893998*2^(2/3) + 0.3333333333333333)) - sqrt(3)*2^(1/3)*arctan(sqrt(3)*(0.48074985676913606*2^(2/3) + 0.3333333333333333)) + 1/2*2^(1/3)*log(1.0*2^(2/3) + 1.5874010519681994*2^(1/3) + 2.519842099789746) - 1/2*2^(1/3)*log(1.0*2^(2/3) + 1.4422495703074083*2^(1/3) + 2.080083823051904) - 2^(1/3)*log(-1.0*2^(1/3) + 1.5874010519681994) + 2^(1/3)*log(-1.0*2^(1/3) + 1.4422495703074083) - 0.4354544449823736
sage: _.n()
-1.04582032641114

But not this:
sage: ((1+x)^(1/5)/(1-x)).integrate(x,2.,3.,hold=True)
integrate(-(x + 1)^(1/5)/(x - 1), x, 2.00000000000000, 3.00000000000000)
sage: _.n()
-0.8870832386197556
sage: ((1+x)^(1/5)/(1-x)).nintegral(x,2.,3.)
(-0.8870832386197555, 9.84860236274705e-15, 21, 0)
sage: ex=((1+x)^(1/5)/(1-x)).integrate(x,2.,3.)
sage: ex.n()
-0.933985822519866 - 0.0743323693052679*I
```


Issue created by migration from https://trac.sagemath.org/ticket/22671





---

archive/issue_comments_312530.json:
```json
{
    "body": "Changing keywords from \"\" to \"integral\".",
    "created_at": "2021-12-21T10:50:22Z",
    "issue": "https://github.com/sagemath/sagetest/issues/22434",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/22434#issuecomment-312530",
    "user": "chapoton"
}
```

Changing keywords from "" to "integral".



---

archive/issue_comments_312531.json:
```json
{
    "body": "This may be an issue with the maxima result\n\n```\nsage: B = G.integrate(x, 2., 3., algorithm=\"mathematica_free\")\nsage: B.n()\n-0.887083000000000\nsage: B = G.integrate(x, 2., 3., algorithm=\"giac\")\nsage: B.n()\n-0.887083238620000\n```\n",
    "created_at": "2022-02-24T15:52:02Z",
    "issue": "https://github.com/sagemath/sagetest/issues/22434",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/22434#issuecomment-312531",
    "user": "chapoton"
}
```

This may be an issue with the maxima result

```
sage: B = G.integrate(x, 2., 3., algorithm="mathematica_free")
sage: B.n()
-0.887083000000000
sage: B = G.integrate(x, 2., 3., algorithm="giac")
sage: B.n()
-0.887083238620000
```




---

archive/issue_comments_312532.json:
```json
{
    "body": "Perhaps the integration engine\n\n- uses a dedicated \"real cube root\" function in one case\n- lacks a \"real fifth root\" function for the other case",
    "created_at": "2022-02-25T09:00:14Z",
    "issue": "https://github.com/sagemath/sagetest/issues/22434",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/22434#issuecomment-312532",
    "user": "slelievre"
}
```

Perhaps the integration engine

- uses a dedicated "real cube root" function in one case
- lacks a "real fifth root" function for the other case
