# Issue 10642: error in padic power series construction

Issue created by migration from Trac.

Original creator: wuthrich

Original creation time: 2011-01-26 18:08:43

Assignee: roed

Keywords: padic power series

Here is an example of a bug in constructing a power series with coefficient in an extension of Qp.


```
sage: A = Qp(3,5)
sage: Po.<X> = A[]
sage: f = Po([3,0,-1])
sage: K = f.root_field('a')
sage: a = K.gen()
sage: R.<T> = K[[]]
sage: b = A(0).add_bigoh(-1)
sage: b
O(3^-1)
sage: v = [a,b,b*a,b*(1+a)]
sage: v
[(1 + O(3^5))*a, O(3^-1), (O(3^-1))*a, (O(3^-1))*a + (O(3^-1))]
sage: R(v,4)
(1 + O(3^5))*a + O(T^4)
```


Note that the coefficients with low precision were just set to 0


```
sage: g = R(v,4)
sage: g[1][0].precision_absolute()
+Infinity
```




---

Comment by wuthrich created at 2011-01-26 18:10:27

This may be linked to #4656. It was discovered while working on #10280 and it appears in the docstring of `pAdicLseriesOrdinary.series`.


---

Comment by roed created at 2016-02-16 21:02:47

So, one problem is that `f.root_field` should give the same result as `A.ext(f)`, rather than creating a polynomial quotient ring.  But this change isn't enough to fix the underlying precision issue.


---

Comment by caruso created at 2018-05-23 15:55:12

Currently (probably after #20310) `g[1][0].precision_absolute()` raises an error because `g[1][0]` is an integer. Should we consider that the problem is fixed? :-)


---

Comment by wuthrich created at 2018-05-23 19:45:58

With  8.3.beta2, including #20310, I still get exactly the same error:


```
sage: v
[a + O(a^11), O(3^-1), O(a^-1), O(a^-2)]
sage: R(v,4)
a + O(a^11) + O(T^4)
sage: s = _
sage: s[0]
a + O(a^11)
sage: s[1]
0
```


The coefficients for T and `T^2` are set to zero in the powerseries despite that we give `O(3^-1)`


---

Comment by roed created at 2018-05-24 20:02:46

Yeah, I agree that this ticket is not resolved.
