# Issue 10522: coercing multivariate poly's with repeated variable name shouldn't be allowed in some cases

Issue created by migration from https://trac.sagemath.org/ticket/10575

Original creator: was

Original creation time: 2011-01-09 19:00:19

Assignee: malb

Magma and Sage let us do this:

```
> R<x,x> := PolynomialRing(RationalField(),2);
> R.1*R.2;
x*x
```



```
sage: R.<x,x> = QQ[]

sage: f = R.0*R.1
sage: f
x*x
sage: magma(f)
x*x
sage: gp(f)
x^2
sage: pari(f)
x^2
sage: singular(f)
x^2
```



---

Comment by was created at 2011-01-09 19:00:47

I think that gp(f) should raise an error, since gp can't represent a poly in two variables with the same name.  Magma can fine.


---

Comment by lorenz created at 2021-08-13 04:32:01

Changing status from new to needs_review.


---

Comment by lorenz created at 2021-08-13 04:32:01

Looks like `R.<x,x> = QQ[]` started throwing an error in `normalize_names` at some point during the past 10 years. I think this can be closed.


---

Comment by slelievre created at 2021-08-19 23:05:42

Ok.


---

Comment by slelievre created at 2021-08-19 23:05:42

Changing status from needs_review to positive_review.


---

Comment by mkoeppe created at 2021-08-26 02:08:43

Resolution: invalid
