# Issue 14929: representation of large RIF elements

Issue created by migration from Trac.

Original creator: dkrenn

Original creation time: 2013-09-06 08:48:03

Keywords: representation, RIF


```
sage: RIF(1.84e13).exp()
6.817557048799520?e-1915670837
```

is wrong (`sage: exp(1.84e13)` gives `6.81755704879952e7991018467019`).

It seems that only the representation of the number is wrong, since

```
sage: (RIF(1.84e13).exp()).log()
1.840000000000000?e13
```

and

```
sage: 7e7991018467019 > RIF(1.84e13).exp() > 6e7991018467019
True
```

give the correct result.



---

Comment by jdemeyer created at 2014-02-04 14:40:36

Changing status from new to needs_review.


---

Comment by jdemeyer created at 2014-02-04 14:41:11

New commits:


---

Comment by mmezzarobba created at 2014-02-05 12:55:13

Looks good. I added a few tests.
----
New commits:


---

Comment by jdemeyer created at 2014-02-05 12:57:17

Some of these tests are certainly going to fail on 32-bit systems.


---

Comment by jdemeyer created at 2014-02-05 12:57:17

Changing status from needs_review to needs_work.


---

Comment by mmezzarobba created at 2014-02-05 13:03:01

Yes, I juste realized that too. Sorry for the noise.


---

Comment by mmezzarobba created at 2014-02-05 13:20:15

Another try. But the values in the 32-bit case may be incorrect (I computed them by manually, and I don't have a 32-bit machine at hand to check what really happens).
----
New commits:


---

Comment by git created at 2014-02-05 13:35:44

Branch pushed to git repo; I updated commit sha1. This was a forced push. New commits:


---

Comment by jdemeyer created at 2014-02-05 14:03:07

Surely this cannot be correct?

```diff
`@``@` -1134,6 +1134,7 `@``@` cdef class RealIntervalFieldElement(sage.structure.element.RingElement):
sage: a = RealIntervalField(428)(factorial(100)/exp(2)); a
1.26303298005073195998439505058085204028142920134742241494671502106333548593576383141666758300089860337889002385197008191910406895?e157
sage: a.diameter()
+ 2.38256490488795e-323228497 # 32-bit
4.7046373946079775711568954992429894854882556641460240333441655212438503516287848720594584761250430179569094634219773739322602945e-129
Type: ``RealIntervalField?`` for many more examples.
```



---

Comment by git created at 2014-02-05 15:01:17

Branch pushed to git repo; I updated commit sha1. This was a forced push. New commits:


---

Comment by mmezzarobba created at 2014-02-05 15:04:11

Replying to [comment:10 jdemeyer]:
> Surely this cannot be correct?

Indeed. Probably a line pasted there by mistake. I really should stop doing this kind of things in a hurry `:-(` I hope I didn't make yet another mistake this time.


---

Comment by jdemeyer created at 2014-02-05 15:21:27

So, did you actually doctest this on a 32-bit system?


---

Comment by mmezzarobba created at 2014-02-05 15:40:46

Replying to [comment:13 jdemeyer]:
> So, did you actually doctest this on a 32-bit system?

No: I don't think I have an account on a 32-bit system with sage. (That's why I left the ticket as `needs_work`.)


---

Comment by jdemeyer created at 2014-02-06 16:48:28

Changing status from needs_work to needs_review.


---

Comment by git created at 2014-02-11 07:52:52

Branch pushed to git repo; I updated commit sha1. This was a forced push. New commits:


---

Comment by mmezzarobba created at 2014-02-11 07:53:49

Replying to [comment:13 jdemeyer]:
> So, did you actually doctest this on a 32-bit system?

Now I have.


---

Comment by jdemeyer created at 2014-02-11 09:29:23

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2014-02-14 19:44:49

Resolution: fixed
