# Issue 15594: implement SR.next_variable()

Issue created by migration from Trac.

Original creator: rws

Original creation time: 2014-02-18 10:59:43

CC:  eviatarbach

Keywords: variable

Idea by ppurka in #14403. Something like this, not necessarily digit suffixes:

```
sage: SR.next_variable('x') # suppose x, x0, x1 are already defined
x2
sage: SR.next_variable('x2')
x3
sage: SR.next_variable('x0y') # suppose that x0y is not yet defined.
x0y
```


This would be better than

```
sage: SR.symbol()
symbol161
sage: SR.symbol()
symbol164
```

