# Issue 25389: intergrate with giac returns undef

Issue created by migration from https://trac.sagemath.org/ticket/25626

Original creator: @nasser1

Original creation time: 2018-06-21 11:05:14

CC:  frederichan parisse rws slelievre

Keywords: giac

Is this a known issue?  Using sage 8.3 beta 6.



```
    sage: var('t')
    sage: integrate(exp(t)/(t + 1)^2,t,algorithm="giac")
    undef

```


But using `giac` directly, it can integrate it with no problem



```
    >giac
    // Using locale /usr/share/locale/
    // en_US.utf8
    // /usr/share/locale/
    // giac
    // UTF-8
    // Maximum number of parallel threads 8
    Help file /usr/share/giac/doc/en/aide_cas not found
    Added 26 synonyms
    Welcome to giac readline interface
    (c) 2001,2017 B. Parisse & others
    Homepage http://www-fourier.ujf-grenoble.fr/~parisse/giac.html
    Released under the GPL license 3.0 or above
    See http://www.gnu.org for license details
    May contain BSD licensed software parts (lapack, atlas, tinymt)
    -------------------------------------------------
     0>> integrate(exp(t)/(t + 1)^2,t)
     (t*Ei(t+1)+Ei(t+1)-exp(1)*exp(t))/(t*exp(1)+exp(1))
    // Time 0.01
    1>> 

```


So why did `sage` return `udef` for this result?

First time reporting bug to sage. I do not know what all the options to select from the menu below. Feel free to change as needed.

Thank you,

--Nasser


---

Comment by slelievre created at 2018-09-19 16:18:06

Regarding the bug: maybe the `Ei` in the result could not be converted to Sage?

Regarding the Trac ticket: not sure if this belongs to "interfaces" or "symbolics".

Was this fixed in another ticket? This is what I get with Sage 8.3.rc3:

```
sage: version()
'SageMath version 8.3.rc3, Release Date: 2018-07-28'
sage: t = SR.var('t')
sage: integrate(exp(t)/(t + 1)^2, t, algorithm="giac")
integrate(e^t/(t + 1)^2, t)
```



---

Comment by slelievre created at 2018-09-19 16:21:33

Oh, I see, instead of `undef` I got the unevaluated integral back.

Slightly better than `undef`, but if Giac can compute it we would like to get the evaluated result.


---

Comment by chapoton created at 2020-08-17 07:16:48

Giac does the following

```
giac: integrate(exp(t)*(t+1)^-2,t)                                              
integrate(exp(1/(t+1)^-1-1)*(t+1)^-2,t)
giac: integrate(exp(t)/(t+1)^2,t)                                               
(t*Ei(t+1)+Ei(t+1)-exp(1)*exp(t))/(t*exp(1)+exp(1))
```



---

Comment by frederichan created at 2020-08-17 10:48:36

NB: it seems that it is not giac himself that is changing the quotient to a product but the conversion filter called before using giac:

```
sage: t=var('t')                                                                                              
sage: F=exp(t)/(1+t)^2                                                                                        
sage: giac(F)                                                                                                 
(t+1)^-2*exp(t)
sage: giac(str(F))                                                                                            
exp(t)/(t+1)^2
sage: giac(str(F)).integrate(t)                                                                               
(t*Ei(t+1)+Ei(t+1)-exp(1)*exp(t))/(t*exp(1)+exp(1))
```



---

Comment by chapoton created at 2020-12-13 09:22:47

Well, the expression itself is not considered as a quotient in sage:

```
sage: t = SR.var('t')                                                           
sage: F = exp(t)/(t + 1)^2                                                      
sage: F.operands()                                                              
[(t + 1)^(-2), e^t]
sage: F.operator()                                                              
<function mul_vararg at 0x7f4b14362310>
```



---

Comment by slelievre created at 2020-12-13 14:44:12

I don't think Sage's symbolic expressions are ever
recorded as differences or quotients, only as sums
(summing the opposite for a difference) and products
(multiplying by the inverse for a quotient).


---

Comment by slelievre created at 2021-03-27 15:21:21

In Sage 9.3.rc0:

```
sage: t = SR.var('t')
sage: integrate(exp(t)/(t + 1)^2, t, algorithm="giac")
(t*Ei(t + 1) + Ei(t + 1) - e^(t + 1))/(t*e + e)
```


Probably one of the `giac` or `giacpy_sage` upgrades solved that.

Should we add a doctest?


---

Comment by slelievre created at 2021-03-27 15:25:45

Changing keywords from "giac" to "giac, beginner".


---

Comment by mkoeppe created at 2021-04-07 19:29:15

Sage development has entered the release candidate phase for 9.3. Setting a new milestone for this ticket based on a cursory review.


---

Comment by chapoton created at 2021-12-21 10:51:03

Changing keywords from "giac, beginner" to "giac, beginner, integral".


---

Comment by @Rajat-Sirohi created at 2022-04-19 02:44:23

New commits:


---

Comment by @Rajat-Sirohi created at 2022-04-19 02:44:23

Changing status from new to needs_review.


---

Comment by klee created at 2022-04-19 05:19:37

Changing status from needs_review to positive_review.


---

Comment by klee created at 2022-04-19 05:19:37

Perfect.


---

Comment by fbissey created at 2022-05-24 09:42:52

Well, with giac 1.9 which has just been allowed from the system I get

```
sage -t --long --random-seed=138683552333987748337622634611718883378 /usr/lib/python3.10/site-packages/sage/calculus/calculus.py
**********************************************************************
File "/usr/lib/python3.10/site-packages/sage/calculus/calculus.py", line 387, in sage.calculus.calculus
Failed example:
    integrate(exp(t)/(t + 1)^2, t, algorithm="giac")
Expected:
    (t*Ei(t + 1) + Ei(t + 1) - e^(t + 1))/(t*e + e)
Got:
    ((t + 1)*(1/(t + 1) - 1)*Ei(-(t + 1)*(1/(t + 1) - 1) + 1) - Ei(-(t + 1)*(1/(t + 1) - 1) + 1) + e^(-(t + 1)*(1/(t + 1) - 1) + 1))/((t + 1)*(1/(t + 1) - 1)*e - e)
```

I haven't really checked whether it can be simplified to the previous form or not.


---

Comment by @Rajat-Sirohi created at 2022-05-24 10:18:45

Replying to [comment:19 fbissey]:
> Well, with giac 1.9 which has just been allowed from the system I get
> {{{
> sage -t --long --random-seed=138683552333987748337622634611718883378 /usr/lib/python3.10/site-packages/sage/calculus/calculus.py
> **********************************************************************
> File "/usr/lib/python3.10/site-packages/sage/calculus/calculus.py", line 387, in sage.calculus.calculus
> Failed example:
>     integrate(exp(t)/(t + 1)^2, t, algorithm="giac")
> Expected:
>     (t*Ei(t + 1) + Ei(t + 1) - e^(t + 1))/(t*e + e)
> Got:
>     ((t + 1)*(1/(t + 1) - 1)*Ei(-(t + 1)*(1/(t + 1) - 1) + 1) - Ei(-(t + 1)*(1/(t + 1) - 1) + 1) + e^(-(t + 1)*(1/(t + 1) - 1) + 1))/((t + 1)*(1/(t + 1) - 1)*e - e)
> }}}
> I haven't really checked whether it can be simplified to the previous form or not.
In fact, when you simplify the second expression, it is indeed equivalent to the first.


---

Comment by vbraun created at 2022-05-24 22:44:49

Resolution: fixed


---

Comment by fbissey created at 2022-06-21 01:30:31

Follow up at #34037
