# Issue 14011: solve with sqrt seems less than powerful

Issue created by migration from https://trac.sagemath.org/ticket/14215

Original creator: kcrisman

Original creation time: 2013-03-03 01:26:41

Assignee: burcin


```
sage:  eq = x == sqrt(x)
sage: solve(eq,x)
[x == sqrt(x)]
sage: solve(eq,x,to_poly_solve=True)
[x == 0, x == 1]
sage:  eq = x^2 == sqrt(x)
sage: solve(eq,x,to_poly_solve=True)
[x == x^(1/4), x == 0]
sage:  eq = x^2 == -sqrt(x)
sage: solve(eq,x,to_poly_solve=True)
[x == sqrt(-sqrt(x)), x == 1/2*I*sqrt(3) - 1/2, x == 0, x == -1/2*I*sqrt(3) - 1/2]
sage:  eq = a*x**2 == -sqrt(x)
sage: solve(eq,x,to_poly_solve=True)
[x == -sqrt(-sqrt(x)/a), x == sqrt(-sqrt(x)/a)]
```

This is a simplification of an example a user posted on the Sage Facebook page.


---

Comment by kcrisman created at 2013-03-03 01:26:50

This seems to be a general weakness in Maxima's solve; if someone wants to change this to a bug and not an enhancement, be my guest.


---

Comment by kcrisman created at 2013-03-03 01:29:03

The suggestion was made there that Sympy might be better at this.  Is it?  At least here it is giving answers - I don't think any are erroneous or missing, but I didn't check very hard, either.

```
sage: from sympy import solve as ssolve
sage: ssolve(x-sqrt(x),x)
[1, 0]
sage: ssolve(x^2-sqrt(x),x)
[1, 0]
sage: ssolve(x^2+sqrt(x),x)
[-1/2 + 3**(1/2)*I/2, -1/2 - 3**(1/2)*I/2, 0]
sage: ssolve(a*x^2+sqrt(x),x)
[(-1/a)**(2/3),
 0,
 (-1/a)**(2/3)*(-1 - 3**(1/2)*I)/2,
 (-1/a)**(2/3)*(-1 + 3**(1/2)*I)/2]
```

Does anyone know whether sympy's solve capabilities is a strict superset of Maxima's?  I assume not.
