# Issue 16885: bessel_Y is off by 3 ulps

archive/issues_016885.json:
```json
{
    "body": "consider the following with Sage 6.0:\n\n```\nsage: R=RealField(113)\nsage: a=R(\"1.414213562373095048801688724209698177\")\nsage: b=bessel_Y(0,a)\nsage: c=R(bessel_Y(0,RealField(200)(a)))\nsage: (b-c)/c.ulp()\n-3.00000000000000000000000000000000\nsage: b\n-7.44623881999333920107530266264974e-7\nsage: c\n-7.44623881999333920107530266264973e-7\n```\n\nGiven that MPFR provides correct rounding for bessel_Y (mpfr_y0) this should not happen.\n\nIssue created by migration from https://trac.sagemath.org/ticket/17122\n\n",
    "created_at": "2014-10-09T14:58:37Z",
    "labels": [
        "component: basic arithmetic",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-6.4",
    "title": "bessel_Y is off by 3 ulps",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/16885",
    "user": "https://github.com/zimmermann6"
}
```
consider the following with Sage 6.0:

```
sage: R=RealField(113)
sage: a=R("1.414213562373095048801688724209698177")
sage: b=bessel_Y(0,a)
sage: c=R(bessel_Y(0,RealField(200)(a)))
sage: (b-c)/c.ulp()
-3.00000000000000000000000000000000
sage: b
-7.44623881999333920107530266264974e-7
sage: c
-7.44623881999333920107530266264973e-7
```

Given that MPFR provides correct rounding for bessel_Y (mpfr_y0) this should not happen.

Issue created by migration from https://trac.sagemath.org/ticket/17122





---

archive/issue_comments_223251.json:
```json
{
    "body": "The example is wrong, I get\n\n```\nsage: R = RealField(113)\nsage: a = R(\"1.414213562373095048801688724209698177\")\nsage: b = bessel_Y(0,a)\nsage: c = R(bessel_Y(0,RealField(200)(a)))\nsage: (b-c)/c.ulp()\n0.000000000000000000000000000000000\nsage: b\n0.344636931299712753154578621698097\nsage: c\n0.344636931299712753154578621698097\n```\n\n\nAnyway, numerical evaluation of Bessel functions is done using mpmath, not mpfr. I guess the reason is that mpfr can only compute `Y(n,x)` for *integers* n, while mpmath supports more general complex numbers for `n`.\n\nNote that you can access the mpfr functions directly using\n\n```\nsage: R = RealField(113)\nsage: a = R(\"1.414213562373095048801688724209698177\")\nsage: a.y0()\n0.344636931299712753154578621698097\n```\n",
    "created_at": "2014-10-09T15:38:43Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16885",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16885#issuecomment-223251",
    "user": "https://github.com/jdemeyer"
}
```

The example is wrong, I get

```
sage: R = RealField(113)
sage: a = R("1.414213562373095048801688724209698177")
sage: b = bessel_Y(0,a)
sage: c = R(bessel_Y(0,RealField(200)(a)))
sage: (b-c)/c.ulp()
0.000000000000000000000000000000000
sage: b
0.344636931299712753154578621698097
sage: c
0.344636931299712753154578621698097
```


Anyway, numerical evaluation of Bessel functions is done using mpmath, not mpfr. I guess the reason is that mpfr can only compute `Y(n,x)` for *integers* n, while mpmath supports more general complex numbers for `n`.

Note that you can access the mpfr functions directly using

```
sage: R = RealField(113)
sage: a = R("1.414213562373095048801688724209698177")
sage: a.y0()
0.344636931299712753154578621698097
```




---

archive/issue_comments_223252.json:
```json
{
    "body": "sorry, the value of `a` was wrong, I changed it in the description.\n\nIndeed MPFR can only handle integer n for Y(n,x), but it would better to call it in that case,\nsince it guarantees correct rounding (and thus numerical reproducibility).",
    "created_at": "2014-10-09T15:50:35Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16885",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16885#issuecomment-223252",
    "user": "https://github.com/zimmermann6"
}
```

sorry, the value of `a` was wrong, I changed it in the description.

Indeed MPFR can only handle integer n for Y(n,x), but it would better to call it in that case,
since it guarantees correct rounding (and thus numerical reproducibility).



---

archive/issue_comments_223253.json:
```json
{
    "body": "mpfr is also much faster...",
    "created_at": "2014-10-09T20:15:15Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16885",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16885#issuecomment-223253",
    "user": "https://github.com/jdemeyer"
}
```

mpfr is also much faster...



---

archive/issue_comments_223254.json:
```json
{
    "body": "Is there an MPFR function which can check if an `mpfr_t` is an exact integer? Or which acts like `mpfr_get_si` but *without rounding*, just converting if the number already was an exact integer (and returning an error otherwise). Or alternatively, which acts like `mpfr_get_z` and returns a ternary value.",
    "created_at": "2014-10-09T20:53:49Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16885",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16885#issuecomment-223254",
    "user": "https://github.com/jdemeyer"
}
```

Is there an MPFR function which can check if an `mpfr_t` is an exact integer? Or which acts like `mpfr_get_si` but *without rounding*, just converting if the number already was an exact integer (and returning an error otherwise). Or alternatively, which acts like `mpfr_get_z` and returns a ternary value.



---

archive/issue_comments_223255.json:
```json
{
    "body": "there is `mpfr_integer_p`, but you also want `mpfr_fits_slong_p` if you want to convert the (integer) argument to a long before giving it to say `mpfr_yn`.",
    "created_at": "2014-10-09T21:02:35Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16885",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16885#issuecomment-223255",
    "user": "https://github.com/zimmermann6"
}
```

there is `mpfr_integer_p`, but you also want `mpfr_fits_slong_p` if you want to convert the (integer) argument to a long before giving it to say `mpfr_yn`.



---

archive/issue_comments_223256.json:
```json
{
    "body": "I bumped into #17130 which I think should be fixed first (not by me).",
    "created_at": "2014-10-10T09:26:23Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16885",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16885#issuecomment-223256",
    "user": "https://github.com/jdemeyer"
}
```

I bumped into #17130 which I think should be fixed first (not by me).



---

archive/issue_comments_223257.json:
```json
{
    "body": "New commits:",
    "created_at": "2014-11-26T16:07:44Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16885",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16885#issuecomment-223257",
    "user": "https://github.com/jdemeyer"
}
```

New commits:



---

archive/issue_comments_223258.json:
```json
{
    "body": "Changing status from new to needs_review.",
    "created_at": "2014-11-26T16:07:44Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16885",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16885#issuecomment-223258",
    "user": "https://github.com/jdemeyer"
}
```

Changing status from new to needs_review.



---

archive/issue_comments_223259.json:
```json
{
    "body": "I wish I could review that patch, but unfortunately since the change to git I don't know any more how\nto do...\n\nPaul",
    "created_at": "2014-11-26T19:52:58Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16885",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16885#issuecomment-223259",
    "user": "https://github.com/zimmermann6"
}
```

I wish I could review that patch, but unfortunately since the change to git I don't know any more how
to do...

Paul



---

archive/issue_comments_223260.json:
```json
{
    "body": "I think it's sufficient to look at [http://git.sagemath.org/sage.git/commit/?id=bce4fb0c1665025c98ec15d89c1345a0a67e925c](http://git.sagemath.org/sage.git/commit/?id=bce4fb0c1665025c98ec15d89c1345a0a67e925c) (the other commits come from #17130).",
    "created_at": "2014-11-26T21:25:19Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16885",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16885#issuecomment-223260",
    "user": "https://github.com/jdemeyer"
}
```

I think it's sufficient to look at [http://git.sagemath.org/sage.git/commit/?id=bce4fb0c1665025c98ec15d89c1345a0a67e925c](http://git.sagemath.org/sage.git/commit/?id=bce4fb0c1665025c98ec15d89c1345a0a67e925c) (the other commits come from #17130).



---

archive/issue_comments_223261.json:
```json
{
    "body": "Changing status from needs_review to positive_review.",
    "created_at": "2014-12-05T17:23:49Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16885",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16885#issuecomment-223261",
    "user": "https://github.com/zimmermann6"
}
```

Changing status from needs_review to positive_review.



---

archive/issue_comments_223262.json:
```json
{
    "body": "this commit looks correct to me. Positive review.\n\nPaul",
    "created_at": "2014-12-05T17:23:49Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16885",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16885#issuecomment-223262",
    "user": "https://github.com/zimmermann6"
}
```

this commit looks correct to me. Positive review.

Paul



---

archive/issue_comments_223263.json:
```json
{
    "body": "Resolution: fixed",
    "created_at": "2014-12-12T12:29:24Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16885",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16885#issuecomment-223263",
    "user": "https://github.com/vbraun"
}
```

Resolution: fixed



---

archive/issue_events_016339.json:
```json
{
    "actor": "@vbraun",
    "created_at": "2014-12-12T12:29:24Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/16885",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/16885#event-16339"
}
```
