# Issue 12054: rational a finite word

Issue created by migration from https://trac.sagemath.org/ticket/12226

Original creator: sstarosta

Original creation time: 2011-12-23 10:57:52

Assignee: sage-combinat

CC:  vdelecroix slabbe

Upgrade exponent of a FiniteWord_class to calculate rational exponents.

Now:

```
sage: Word('1231').exponent()
1
```


Expected:

```
sage: Word('1231').exponent()
4/3
```


The goal

```
sage: Word('1231').exponent()
4/3
sage: Word('1231').exponent(integer=True)
1
```



Also, upgrade (deprecate, review, and/or change name) the method primitive() to be in accordance with the terminology used in literature (the word is usually called the period instead of the primitive)

```
sage: Word('1231').exponent()
4/3
sage: Word('1231').period()
word: 123
```


Upgrade influenced methods (primitive_length(), ...).


---

Comment by sstarosta created at 2011-12-23 10:58:41

Changing assignee from sage-combinat to sstarosta.


---

Comment by slabbe created at 2012-01-09 16:41:19

Should not period be an integer?

... I already had the idea of making `period` an alias of `minimal_period`:


```
sage: Word('1231').minimal_period()
3
```


What do you think?


---

Comment by sstarosta created at 2012-01-09 20:58:29

Replying to [comment:2 slabbe]:
> Should not period be an integer?

You are right, I found both versions in the literature (integer in Lothaire, word for instance in http://www.springerlink.com/content/t59071u33573168v/ )

When hearing period without context, I think an integer is expected. Although a word is definitely more useful in papers and you have the integer by taking just the length of the word.

Is something like that stupid?

```
sage: Word('1231').period(word=True)
word: 123
sage: Word('1231').period()
3
```




> What do you think?

I think an alias is not necessary. There is no other period, and anyone looking for that notion will use "period" anyway.


---

Comment by slabbe created at 2012-01-10 19:42:02

> I think an alias is not necessary. There is no other period, and anyone looking for that notion will use "period" anyway.

If 3 is a period, than 6, 9, 12 are period as well. But I agree that 3 is *the* period. 

I would rather suggest the following :


```
sage: Word('1231').period_word()
word: 123
sage: Word('1231').period()
3
```



---

Comment by slabbe created at 2012-01-10 19:46:35

> The goal
> {{{
> sage: Word('1231').exponent()
> 4/3
> sage: Word('1231').exponent(integer=True)
> 1
> }}}

I would prefer the argument to speak about the use or not of the fraction :


```
sage: Word('1231').exponent() # default
1
sage: Word('1231').exponent(allow_fraction=True)
4/3
```


or 


```
sage: Word('1231').exponent(allow_fraction=False)
1
sage: Word('1231').exponent() # default
4/3
```

