# Issue 19281: Allow GroupAlgebra to be used as base ring of a PolynomialRing

Issue created by migration from Trac.

Original creator: etn40ff

Original creation time: 2015-11-04 12:10:13




---

Comment by etn40ff created at 2015-11-04 12:25:58

Changing keywords from "" to "GroupAlgebra PolynomialRing".


---

Comment by etn40ff created at 2015-11-04 12:25:58

Changing component from PLEASE CHANGE to group theory.


---

Comment by etn40ff created at 2015-11-04 12:25:58

Changing status from new to needs_review.


---

Comment by etn40ff created at 2015-11-04 12:25:58

Changing type from PLEASE CHANGE to enhancement.


---

Comment by git created at 2015-11-06 18:31:11

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by git created at 2015-11-07 14:45:31

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by tscrim created at 2015-11-13 18:10:53

This has uncovered a couple of different bugs:

1. We have an issue with translating to/from GAP:

```
sage: SU(2, 3).random_element()
[      1 2*a + 2]
[      0       1]
sage: SU(2, 4).random_element()
<repr(<sage.groups.matrix_gps.group_element.UnitaryMatrixGroup_gap_with_category.element_class at 0x7f826b84eaa0>) failed: ValueError: the given finite field has incompatible size>
```

2. Abelian groups `.algebra` aren't returning group algebras.
3. `Commutative()` does not commute with the `Algebras` functor construction.

```
sage: Groups().Commutative().Algebras(QQ)
Join of Category of group algebras over Rational Field and Category of commutative algebras over Rational Field and Category of commutative magma algebras over Rational Field
sage: Groups().Algebras(QQ).Commutative()
Category of commutative group algebras over Rational Field
```

The main problem for this ticket I think is the last one.


---

Comment by cheuberg created at 2017-01-05 11:44:53

doctests fail (cf. patchbot)


---

Comment by cheuberg created at 2017-01-05 11:44:53

Changing status from needs_review to needs_work.
