# Issue 30733: Graphic function point() broken

Issue created by migration from https://trac.sagemath.org/ticket/30970

Original creator: egourgoulhon

Original creation time: 2020-11-27 12:51:51

CC:  chapoton

Keywords: plot, point

In Sage 9.2.beta3, the following code

```
sage: f(x) = x + 1                                                                                  
sage: point((0, f(0)), size=60)                                                                     
```

results in a plot with two points located at (0,0) and (1,0), instead of a single point at (0,1).
Both

```
sage: point([(0, f(0))], size=60)
```

and 

```
sage: point([(0, RR(f(0)))], size=60)
```

give the correct result.

Sage 9.2 is free from this bug; it might have been introduced in #16804, which has been merged in Sage 9.3.beta2. 


---

Comment by klee created at 2020-11-28 01:52:03

This is failue of the code

```
    elif l == 2:  # special case for a single 2D point
        if all(isinstance(z, numbers.Real) for z in points):
            points = [points]  
```

Specifically, for `l = (0, f(0))` and `z = f(0)`, `isinstance(z, numbers.Real)` gives `False`. Is the condition `z in RR` better alternative?


---

Comment by klee created at 2020-12-04 09:33:03

`complex(z).imag == 0` seems a simple check for expressions.


---

Comment by egourgoulhon created at 2020-12-04 10:47:57

Replying to [comment:3 klee]:
> `complex(z).imag == 0` seems a simple check for expressions.  
`z in RR` would seem more natural. On the other hand, we have

```
sage: f(x) = x + 1                                                                                  
sage: z = f(0)                                                                                      
sage: %timeit z in RR                                                                               
5.96 µs ± 31.1 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)
sage: %timeit complex(z).imag == 0                                                                  
837 ns ± 3.02 ns per loop (mean ± std. dev. of 7 runs, 1000000 loops each)
```



---

Comment by klee created at 2020-12-04 13:25:06

Replying to [comment:4 egourgoulhon]:
> Replying to [comment:3 klee]:
> > `complex(z).imag == 0` seems a simple check for expressions.  
> `z in RR` would seem more natural. 

This is only superficial. The code behind `z in RR` (see `RR.__contains__??`) does not do much for expressions. 

> On the other hand, we have
> {{{
> sage: f(x) = x + 1                                                                                  
> sage: z = f(0)                                                                                      
> sage: %timeit z in RR                                                                               
> 5.96 µs ± 31.1 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)
> sage: %timeit complex(z).imag == 0                                                                  
> 837 ns ± 3.02 ns per loop (mean ± std. dev. of 7 runs, 1000000 loops each)
> }}}

Right. Even `not bool(complex(z).imag)` is slightly faster.


---

Comment by git created at 2020-12-08 08:41:57

Branch pushed to git repo; I updated commit sha1. New commits:


---

Comment by klee created at 2020-12-08 08:45:23

The bug is fixed, and hopefully no new bug is sneaked in. 

Now this also works:

```
point(sqrt(2) + I, size=60) 
```



---

Comment by klee created at 2020-12-08 08:45:35

Changing status from new to needs_review.


---

Comment by egourgoulhon created at 2020-12-10 15:06:12

LGTM. Thanks for the fix!


---

Comment by egourgoulhon created at 2020-12-10 15:06:12

Changing status from needs_review to positive_review.


---

Comment by vbraun created at 2020-12-13 20:31:22

Resolution: fixed
