# Issue 22723: RealLazyField() and ComplexLazyField() are inexact rings

archive/issues_022723.json:
```json
{
    "body": "`RealLazyField()` and `ComplexLazyField()` claim to be exact, but they are not:\n\n\n```\nsage: RLF.is_exact()\nTrue\nsage: a = RLF(0.1) ; a\n0.10000000000000001?\nsage: a._value\n0.100000000000000\nsage: a._value.parent()\nReal Field with 53 bits of precision\n```\n\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/22960\n\n",
    "created_at": "2017-05-08T18:42:48Z",
    "labels": [
        "numerical",
        "major",
        "bug"
    ],
    "title": "RealLazyField() and ComplexLazyField() are inexact rings",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/22723",
    "user": "tmonteil"
}
```
`RealLazyField()` and `ComplexLazyField()` claim to be exact, but they are not:


```
sage: RLF.is_exact()
True
sage: a = RLF(0.1) ; a
0.10000000000000001?
sage: a._value
0.100000000000000
sage: a._value.parent()
Real Field with 53 bits of precision
```



Issue created by migration from https://trac.sagemath.org/ticket/22960





---

archive/issue_comments_317257.json:
```json
{
    "body": "Note that the doc of `RLF` itself claims to be exact.\n\n\n```\n    This class represents the set of real numbers to unspecified precision.\n    For the most part it simply wraps exact elements and defers evaluation\n    until a specified precision is requested.\n```\n",
    "created_at": "2017-05-08T18:45:41Z",
    "issue": "https://github.com/sagemath/sagetest/issues/22723",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/22723#issuecomment-317257",
    "user": "tmonteil"
}
```

Note that the doc of `RLF` itself claims to be exact.


```
    This class represents the set of real numbers to unspecified precision.
    For the most part it simply wraps exact elements and defers evaluation
    until a specified precision is requested.
```

