# Issue 24350: Wrong integral of sqrt(1-cos(x))

Issue created by migration from Trac.

Original creator: tmonteil

Original creation time: 2018-01-23 00:46:48

CC:  charpent mafra kcrisman

As reported on [this ask question](https://ask.sagemath.org/question/40733/integrate-sqrt1-cosx-integrinterval-from-0-to-2pi/):


```
sage: integral(sqrt(1-cos(x)), x, 0, 2*pi)
0
```



---

Comment by mantepse created at 2018-04-20 11:23:09

#25220 fixes the problem with FriCAS.


---

Comment by chapoton created at 2020-06-08 20:03:46

Changing keywords from "" to "integrate".


---

Comment by chapoton created at 2020-09-24 15:21:34

This should be upstreamed to maxima. Karl-Dieter, would you do so, please ?


---

Comment by kcrisman created at 2020-09-24 15:48:13

Interestingly, this may not necessarily be a problem with `domain:complex`.  Can you just confirm that the Fricas antiderivative makes more sense at [this graphic](https://sagecell.sagemath.org/?z=eJyNkMEKwyAMQO-D_YM3Y1XKPA563blfsOGsFMGq0x76-RNtt-5SdooJyXuJPepQsH4GLpr0ijMI0paYjIOF3EULyqf8QhRdcloCg4XxYJhogiHM6lG74WHlU9sOD36Sxl2Vn4LVCybnU4_o17GnVSHfVdpqPeLfolEyYaa89bHDY9Ta_VoA-HpJU9Fky7Mx80HO0on1QLa20GxqReYgug3XhsI4GvnjM6KW9rNx1EPZ9w02kHGI&lang=sage&interacts=eJyLjgUAARUAuQ==)?  It's been a while since I've had to deal with branch cuts and I feel like that is part of the question here - but the way in which the graphs are different between pi and 2pi is definitely a problem.  BUT Maxima gives the correct answer to the definite integral between pi and 2pi with either setting of `domain`.


---

Comment by kcrisman created at 2020-09-24 15:49:58

Okay, it is `domain:complex`, but more subtly.

```
(%i1) integrate(sqrt(1-cos(x)), x, %pi, 2*%pi);
                                      3/2
(%o1)                                2
(%i2) integrate(sqrt(1-cos(x)), x, 0, 2*%pi);  
                                      5/2
(%o2)                                2
(%i3) domain:complex;
(%o3)                               complex
(%i4) integrate(sqrt(1-cos(x)), x, %pi, 2*%pi);
                                      3/2
(%o4)                                2
(%i5) integrate(sqrt(1-cos(x)), x, 0, 2*%pi);
(%o5)                                  0
```

This I am more confident about reporting upstream.


---

Comment by chapoton created at 2022-01-05 19:24:51

No reaction upstream, it seems. Their primitive is plain wrong ; Fricas is right.


---

Comment by charpent created at 2022-01-05 21:53:50

I forgot this one...

Replying to [comment:10 chapoton]:
> No reaction upstream, it seems. Their primitive is plain wrong ; Fricas is right.

More or less :

* None of maxima, giac, fricas, mathematica has a term proportional to the length if the interval of integration ; all of them are periodic, which is wrong for the integral of a non-negative function positive almost everywhere on its period.

* sympy doesn't integrate this.

* fricas' result can be differentiated and simplified back to sqrt(1-cos(x)) ; others' can't.

* giac, fricas and mathematica give results numerically close to the numerical integration up to a constant plus a discontinuity at 2*k*pi ;maxima is just plain wrong.

To summarize, contemplate :


```
sage: Num=lambda t:numerical_integral(lambda u:sqrt(1-cos(u)),0,t)[0]
sage: Max=sqrt(1-cos(x)).integrate(x, algorithm="maxima").function(x)
sage: Max=sqrt(1-cos(x)).integrate(x, algorithm="maxima").function(x)
sage: Giac=sqrt(1-cos(x)).integrate(x, algorithm="giac").function(x)
sage: Fricas=sqrt(1-cos(x)).integrate(x, algorithm="fricas").function(x)
sage: Mathematica=sqrt(1-cos(x)).integrate(x, algorithm="mathematica_free").function(x)
sage: plot([Num, Max, Giac, Fricas, Mathematica], (0, 4*pi), legend_label=["Numerical", "Maxima", "Giac", "Fricas", "Mathematica"])
```


It //seems// that up to the "branch cut", fricas, giac and mathematica give numerically correctly answer, only fricas' being (easily) checkable by differentiation and simplification.

BTW : when the result of an integration is a periodic function, shouldn't a term adding (floor(number of periods in the integration interval)*(integral on one period) be added to the result ? If so, how to implement this ?
