# Issue 16294: Expression.solve() does not handle multiple variables to solve for.

Issue created by migration from https://trac.sagemath.org/ticket/16531

Original creator: mmarco

Original creation time: 2014-06-25 05:10:41

CC:  saraedum burcin

Keywords: sd59

Right now we get this answer


```
sage: var('b, c')
(b, c)
sage: solve((c-1)*(b-1), [b,c])
[b == 1]
```


Which is wrong. In fact maxima can do it correctly:


```
sage: f = (b-1)*(c-1)
sage: f._maxima_()
(b-1)*(c-1)
sage: f._maxima_().solve([b,c])
[[b=1,c=%r3],[b=%r4,c=1]]
```



This patch solves it.


I ignored this comment:


```
        # Take care of cases like solve([x^2-1], [x]) for consistency with
        # multiple variable input in sage.symbolic.relation.solve().
        # There *should* be only one variable in the list, since it is
        # passed from sage.symbolic.relation.solve() and multiple variables
        # there don't call this function.
```


In sage/symbollic/expression.py because there is no such consistency issue:


```
sage: sage.symbolic.relation.solve(f,[b,c])
[[b == 1, c == r5], [b == r6, c == 1]]
```


This should solve the issue:


---

Comment by saraedum created at 2014-06-25 05:51:45

Changing status from new to needs_review.


---

Comment by saraedum created at 2014-06-25 05:51:45

New commits:


---

Comment by saraedum created at 2014-06-25 05:51:45

Changing type from PLEASE CHANGE to defect.


---

Comment by saraedum created at 2014-06-25 06:09:43

Changing status from needs_review to positive_review.


---

Comment by saraedum created at 2014-06-25 06:13:57

New commits:


---

Comment by vbraun created at 2014-06-27 01:43:18

Resolution: fixed


---

Comment by jhpalmieri created at 2014-10-10 05:57:40

This seems to have caused a new bug: see #17128.
