# Issue 31450: factor() does not work in a simple case

Issue created by migration from https://trac.sagemath.org/ticket/31687

Original creator: @GMS103

Original creation time: 2021-04-18 21:06:37

CC:  slelievre

Tested with https://sagecell.sagemath.org and CoCalc:

```python
sage: version()
'SageMath version 9.2, Release Date: 2020-10-24'

sage: x,y=var('x,y')

sage: f=(x-5)*y/x-(x-6)*y/x ; f
(x - 5)*y/x - (x - 6)*y/x

sage: f.factor() # does not work
(x - 5)*y/x - (x - 6)*y/x

sage: (f*x).factor() # does not work either
x*((x - 5)*y/x - (x - 6)*y/x)

sage: (f*x).expand()/x # expected result
y/x
```

Of course, this is a very simple example showing the problem.

(I am sorry, I do not have any Sage 9.3.* to test.)


---

Comment by slelievre created at 2021-04-19 09:29:36

A workaround is to factor the numerator and denominator:

```python
sage: f.numerator().factor() / f.denominator().factor()
y/x
```

Or, in this case, to work in the fraction field of a polynomial ring.

```python
sage: R = PolynomialRing(QQ, ['x', 'y'])
sage: F = R.fraction_field()
sage: F(f)
y/x
sage: F(f).factor()
x^-1 * y
```



---

Comment by @GMS103 created at 2021-04-19 12:20:51

Well, actually in this case it suffices to expand:

```
sage: f.expand()                                                                                                        
y/x
```

But I was wondering about the cause of this behaviour (I do not think I would be able to find it myself).
