# Issue 31687: factor() does not work in a simple case

archive/issues_031450.json:
```json
{
    "body": "In Sage 9.2 on SageCell and CoCalc (same on Sage 9.3.rc2):\n\n```python\nsage: version()\n'SageMath version 9.2, Release Date: 2020-10-24'\n\nsage: x, y = var('x, y')\n\nsage: f = (x - 5)*y/x - (x - 6)*y/x ; f\n(x - 5)*y/x - (x - 6)*y/x\n\nsage: f.factor()  # does not work\n(x - 5)*y/x - (x - 6)*y/x\n\nsage: (f*x).factor()  # does not work either\nx*((x - 5)*y/x - (x - 6)*y/x)\n\nsage: (f*x).expand()/x  # expected result\ny/x\n```\nOf course, this is a very simple example showing the problem.\n\n\nCC:  @slel\n\nStatus: new\n\nIssue created by migration from https://trac.sagemath.org/ticket/31687\n\n",
    "created_at": "2021-04-18T21:06:37Z",
    "labels": [
        "component: factorization",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-9.8",
    "title": "factor() does not work in a simple case",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/31687",
    "user": "https://github.com/GMS103"
}
```
In Sage 9.2 on SageCell and CoCalc (same on Sage 9.3.rc2):

```python
sage: version()
'SageMath version 9.2, Release Date: 2020-10-24'

sage: x, y = var('x, y')

sage: f = (x - 5)*y/x - (x - 6)*y/x ; f
(x - 5)*y/x - (x - 6)*y/x

sage: f.factor()  # does not work
(x - 5)*y/x - (x - 6)*y/x

sage: (f*x).factor()  # does not work either
x*((x - 5)*y/x - (x - 6)*y/x)

sage: (f*x).expand()/x  # expected result
y/x
```
Of course, this is a very simple example showing the problem.


CC:  @slel

Status: new

Issue created by migration from https://trac.sagemath.org/ticket/31687





---

archive/issue_comments_622474.json:
```json
{
    "body": "<a id='comment:1'></a>\nA workaround is to factor the numerator and denominator:\n\n```python\nsage: f.numerator().factor() / f.denominator().factor()\ny/x\n```\nOr, in this case, to work in the fraction field of a polynomial ring.\n\n```python\nsage: R = PolynomialRing(QQ, ['x', 'y'])\nsage: F = R.fraction_field()\nsage: F(f)\ny/x\nsage: F(f).factor()\nx^-1 * y\n```",
    "created_at": "2021-04-19T09:29:36Z",
    "issue": "https://github.com/sagemath/sagetest/issues/31687",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/31687#issuecomment-622474",
    "user": "https://github.com/slel"
}
```

<a id='comment:1'></a>
A workaround is to factor the numerator and denominator:

```python
sage: f.numerator().factor() / f.denominator().factor()
y/x
```
Or, in this case, to work in the fraction field of a polynomial ring.

```python
sage: R = PolynomialRing(QQ, ['x', 'y'])
sage: F = R.fraction_field()
sage: F(f)
y/x
sage: F(f).factor()
x^-1 * y
```



---

archive/issue_comments_622475.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -1,23 +1,22 @@\n-Tested with https://sagecell.sagemath.org and CoCalc:\n+In Sage 9.2 on SageCell and CoCalc (same on Sage 9.3.rc2):\n \n ```python\n sage: version()\n 'SageMath version 9.2, Release Date: 2020-10-24'\n \n-sage: x,y=var('x,y')\n+sage: x, y = var('x, y')\n \n-sage: f=(x-5)*y/x-(x-6)*y/x ; f\n+sage: f = (x - 5)*y/x - (x - 6)*y/x ; f\n (x - 5)*y/x - (x - 6)*y/x\n \n-sage: f.factor() # does not work\n+sage: f.factor()  # does not work\n (x - 5)*y/x - (x - 6)*y/x\n \n-sage: (f*x).factor() # does not work either\n+sage: (f*x).factor()  # does not work either\n x*((x - 5)*y/x - (x - 6)*y/x)\n \n-sage: (f*x).expand()/x # expected result\n+sage: (f*x).expand()/x  # expected result\n y/x\n ```\n Of course, this is a very simple example showing the problem.\n \n-(I am sorry, I do not have any Sage 9.3.* to test.)\n``````\n",
    "created_at": "2021-04-19T09:29:36Z",
    "issue": "https://github.com/sagemath/sagetest/issues/31687",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/31687#issuecomment-622475",
    "user": "https://github.com/slel"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -1,23 +1,22 @@
-Tested with https://sagecell.sagemath.org and CoCalc:
+In Sage 9.2 on SageCell and CoCalc (same on Sage 9.3.rc2):
 
 ```python
 sage: version()
 'SageMath version 9.2, Release Date: 2020-10-24'
 
-sage: x,y=var('x,y')
+sage: x, y = var('x, y')
 
-sage: f=(x-5)*y/x-(x-6)*y/x ; f
+sage: f = (x - 5)*y/x - (x - 6)*y/x ; f
 (x - 5)*y/x - (x - 6)*y/x
 
-sage: f.factor() # does not work
+sage: f.factor()  # does not work
 (x - 5)*y/x - (x - 6)*y/x
 
-sage: (f*x).factor() # does not work either
+sage: (f*x).factor()  # does not work either
 x*((x - 5)*y/x - (x - 6)*y/x)
 
-sage: (f*x).expand()/x # expected result
+sage: (f*x).expand()/x  # expected result
 y/x
 ```
 Of course, this is a very simple example showing the problem.
 
-(I am sorry, I do not have any Sage 9.3.* to test.)
``````




---

archive/issue_comments_622476.json:
```json
{
    "body": "<a id='comment:2'></a>\nWell, actually in this case it suffices to expand:\n\n```\nsage: f.expand()                                                                                                        \ny/x\n```\nBut I was wondering about the cause of this behaviour (I do not think I would be able to find it myself).",
    "created_at": "2021-04-19T12:20:51Z",
    "issue": "https://github.com/sagemath/sagetest/issues/31687",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/31687#issuecomment-622476",
    "user": "https://github.com/GMS103"
}
```

<a id='comment:2'></a>
Well, actually in this case it suffices to expand:

```
sage: f.expand()                                                                                                        
y/x
```
But I was wondering about the cause of this behaviour (I do not think I would be able to find it myself).



---

archive/issue_events_101944.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2021-08-22T20:35:10Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/31687",
    "milestone": "sage-9.5",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/31687#event-101944"
}
```



---

archive/issue_events_101945.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2021-12-18T20:12:32Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/31687",
    "milestone": "sage-9.5",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/31687#event-101945"
}
```



---

archive/issue_events_101946.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2021-12-18T20:12:32Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/31687",
    "milestone": "sage-9.6",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/31687#event-101946"
}
```



---

archive/issue_events_101947.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-05-03T15:17:06Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/31687",
    "milestone": "sage-9.6",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/31687#event-101947"
}
```



---

archive/issue_events_101948.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-05-03T15:17:06Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/31687",
    "milestone": "sage-9.7",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/31687#event-101948"
}
```



---

archive/issue_events_101949.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-09-19T18:58:47Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/31687",
    "milestone": "sage-9.7",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/31687#event-101949"
}
```



---

archive/issue_events_101950.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-09-19T18:58:47Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/31687",
    "milestone": "sage-9.8",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/31687#event-101950"
}
```
