# Issue 31687: factor() does not work in a simple case

archive/issues_031450.json:
```json
{
    "assignees": [],
    "body": "<div id=\"comment:0\"></div>\n\nIn Sage 9.2 on SageCell and CoCalc (same on Sage 9.3.rc2):\n\n```python\nsage: version()\n'SageMath version 9.2, Release Date: 2020-10-24'\n\nsage: x, y = var('x, y')\n\nsage: f = (x - 5)*y/x - (x - 6)*y/x ; f\n(x - 5)*y/x - (x - 6)*y/x\n\nsage: f.factor()  # does not work\n(x - 5)*y/x - (x - 6)*y/x\n\nsage: (f*x).factor()  # does not work either\nx*((x - 5)*y/x - (x - 6)*y/x)\n\nsage: (f*x).expand()/x  # expected result\ny/x\n```\nOf course, this is a very simple example showing the problem.\n\n\nCC:  @slel\n\nComponent: **factorization**\n\n_Issue created by migration from https://trac.sagemath.org/ticket/31687_\n\n",
    "created_at": "2021-04-18T21:06:37Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/c%3A%20factorization",
        "https://github.com/sagemath/sage/labels/p%3A%20major%20/%203",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-9.8",
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "factor() does not work in a simple case",
    "type": "issue",
    "updated_at": "2022-09-19T18:58:47Z",
    "url": "https://github.com/sagemath/sage/issues/31687",
    "user": "https://github.com/GMS103"
}
```
<div id="comment:0"></div>

In Sage 9.2 on SageCell and CoCalc (same on Sage 9.3.rc2):

```python
sage: version()
'SageMath version 9.2, Release Date: 2020-10-24'

sage: x, y = var('x, y')

sage: f = (x - 5)*y/x - (x - 6)*y/x ; f
(x - 5)*y/x - (x - 6)*y/x

sage: f.factor()  # does not work
(x - 5)*y/x - (x - 6)*y/x

sage: (f*x).factor()  # does not work either
x*((x - 5)*y/x - (x - 6)*y/x)

sage: (f*x).expand()/x  # expected result
y/x
```
Of course, this is a very simple example showing the problem.


CC:  @slel

Component: **factorization**

_Issue created by migration from https://trac.sagemath.org/ticket/31687_





---

archive/issue_events_433917.json:
```json
{
    "actor": "https://github.com/GMS103",
    "created_at": "2021-04-18T21:06:37Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/31687",
    "milestone_number": null,
    "milestone_title": "sage-9.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/31687#event-433917"
}
```



---

archive/issue_events_433918.json:
```json
{
    "actor": "https://github.com/GMS103",
    "created_at": "2021-04-18T21:06:37Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/31687",
    "label": "https://github.com/sagemath/sage/labels/c%3A%20factorization",
    "label_color": "0000ff",
    "label_name": "c: factorization",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/31687#event-433918"
}
```



---

archive/issue_events_433919.json:
```json
{
    "actor": "https://github.com/GMS103",
    "created_at": "2021-04-18T21:06:37Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/31687",
    "label": "https://github.com/sagemath/sage/labels/p%3A%20major%20/%203",
    "label_color": "ffbb00",
    "label_name": "p: major / 3",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/31687#event-433919"
}
```



---

archive/issue_events_433920.json:
```json
{
    "actor": "https://github.com/GMS103",
    "created_at": "2021-04-18T21:06:37Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/31687",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "d73a4a",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/31687#event-433920"
}
```



---

archive/issue_comments_509571.json:
```json
{
    "body": "<div id=\"comment:1\" align=\"right\">comment:1</div>\n\nA workaround is to factor the numerator and denominator:\n\n```python\nsage: f.numerator().factor() / f.denominator().factor()\ny/x\n```\nOr, in this case, to work in the fraction field of a polynomial ring.\n\n```python\nsage: R = PolynomialRing(QQ, ['x', 'y'])\nsage: F = R.fraction_field()\nsage: F(f)\ny/x\nsage: F(f).factor()\nx^-1 * y\n```",
    "created_at": "2021-04-19T09:29:36Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/31687",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/31687#issuecomment-509571",
    "user": "https://github.com/slel"
}
```

<div id="comment:1" align="right">comment:1</div>

A workaround is to factor the numerator and denominator:

```python
sage: f.numerator().factor() / f.denominator().factor()
y/x
```
Or, in this case, to work in the fraction field of a polynomial ring.

```python
sage: R = PolynomialRing(QQ, ['x', 'y'])
sage: F = R.fraction_field()
sage: F(f)
y/x
sage: F(f).factor()
x^-1 * y
```



---

archive/issue_comments_509572.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -1,23 +1,22 @@\n-Tested with https://sagecell.sagemath.org and CoCalc:\n+In Sage 9.2 on SageCell and CoCalc (same on Sage 9.3.rc2):\n \n ```python\n sage: version()\n 'SageMath version 9.2, Release Date: 2020-10-24'\n \n-sage: x,y=var('x,y')\n+sage: x, y = var('x, y')\n \n-sage: f=(x-5)*y/x-(x-6)*y/x ; f\n+sage: f = (x - 5)*y/x - (x - 6)*y/x ; f\n (x - 5)*y/x - (x - 6)*y/x\n \n-sage: f.factor() # does not work\n+sage: f.factor()  # does not work\n (x - 5)*y/x - (x - 6)*y/x\n \n-sage: (f*x).factor() # does not work either\n+sage: (f*x).factor()  # does not work either\n x*((x - 5)*y/x - (x - 6)*y/x)\n \n-sage: (f*x).expand()/x # expected result\n+sage: (f*x).expand()/x  # expected result\n y/x\n ```\n Of course, this is a very simple example showing the problem.\n \n-(I am sorry, I do not have any Sage 9.3.* to test.)\n``````\n",
    "created_at": "2021-04-19T09:29:36Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/31687",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/31687#issuecomment-509572",
    "user": "https://github.com/slel"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -1,23 +1,22 @@
-Tested with https://sagecell.sagemath.org and CoCalc:
+In Sage 9.2 on SageCell and CoCalc (same on Sage 9.3.rc2):
 
 ```python
 sage: version()
 'SageMath version 9.2, Release Date: 2020-10-24'
 
-sage: x,y=var('x,y')
+sage: x, y = var('x, y')
 
-sage: f=(x-5)*y/x-(x-6)*y/x ; f
+sage: f = (x - 5)*y/x - (x - 6)*y/x ; f
 (x - 5)*y/x - (x - 6)*y/x
 
-sage: f.factor() # does not work
+sage: f.factor()  # does not work
 (x - 5)*y/x - (x - 6)*y/x
 
-sage: (f*x).factor() # does not work either
+sage: (f*x).factor()  # does not work either
 x*((x - 5)*y/x - (x - 6)*y/x)
 
-sage: (f*x).expand()/x # expected result
+sage: (f*x).expand()/x  # expected result
 y/x
 ```
 Of course, this is a very simple example showing the problem.
 
-(I am sorry, I do not have any Sage 9.3.* to test.)
``````




---

archive/issue_comments_509573.json:
```json
{
    "body": "<div id=\"comment:2\" align=\"right\">comment:2</div>\n\nWell, actually in this case it suffices to expand:\n\n```\nsage: f.expand()                                                                                                        \ny/x\n```\nBut I was wondering about the cause of this behaviour (I do not think I would be able to find it myself).",
    "created_at": "2021-04-19T12:20:51Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/31687",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/31687#issuecomment-509573",
    "user": "https://github.com/GMS103"
}
```

<div id="comment:2" align="right">comment:2</div>

Well, actually in this case it suffices to expand:

```
sage: f.expand()                                                                                                        
y/x
```
But I was wondering about the cause of this behaviour (I do not think I would be able to find it myself).



---

archive/issue_events_433921.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2021-08-22T20:35:10Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/31687",
    "milestone_number": null,
    "milestone_title": "sage-9.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/31687#event-433921"
}
```



---

archive/issue_events_433922.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2021-08-22T20:35:10Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/31687",
    "milestone_number": null,
    "milestone_title": "sage-9.5",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/31687#event-433922"
}
```



---

archive/issue_events_433923.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2021-12-18T20:12:32Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/31687",
    "milestone_number": null,
    "milestone_title": "sage-9.5",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/31687#event-433923"
}
```



---

archive/issue_events_433924.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2021-12-18T20:12:32Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/31687",
    "milestone_number": null,
    "milestone_title": "sage-9.6",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/31687#event-433924"
}
```



---

archive/issue_events_433925.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-05-03T15:17:06Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/31687",
    "milestone_number": null,
    "milestone_title": "sage-9.6",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/31687#event-433925"
}
```



---

archive/issue_events_433926.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-05-03T15:17:06Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/31687",
    "milestone_number": null,
    "milestone_title": "sage-9.7",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/31687#event-433926"
}
```



---

archive/issue_events_433927.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-09-19T18:58:47Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/31687",
    "milestone_number": null,
    "milestone_title": "sage-9.7",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/31687#event-433927"
}
```



---

archive/issue_events_433928.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-09-19T18:58:47Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/31687",
    "milestone_number": null,
    "milestone_title": "sage-9.8",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/31687#event-433928"
}
```
