# Issue 31755: NumberFieldEmbedding does not work with relative number fields

archive/issues_031518.json:
```json
{
    "body": "In Sage 9.1 or 9.3.rc4:\n\n```\nsage: from sage.rings.number_field.number_field_morphisms import (\n....:         NumberFieldEmbedding)\n\nsage: K.<sqrt2> = QuadraticField(2, embedding=1.414)\nsage: x = polygen(K)\nsage: p = x^3 + (sqrt2/2 + 1/3)*x^2 + (2*sqrt2/5+3/7)*x - 1\nsage: L.<s> = K.extension(p)\n\nsage: a = L.relative_polynomial().roots(QQbar)[0][0]\nsage: a\n0.5407496381556470?\n\nsage: my_embedding = NumberFieldEmbedding(L, QQbar, a)\nsage: my_embedding\nGeneric morphism:\n  From: Number Field in s with defining polynomial\n            x^3 + (1/2*sqrt2 + 1/3)*x^2 + (2/5*sqrt2 + 3/7)*x - 1\n            over its base field\n  To:   Algebraic Field\n  Defn: s -> 0.5407496381556470?\n\nsage: my_embedding.gen_image()\n0.5407496381556470?\nsage: my_embedding(L.gen())\n0.01354690080260168?\nsage: my_embedding(sqrt2)\n-0.9806353488506175?\n```\n\nExpected:\n\n- `my_embedding.gen_image()` should equal `my_embedding(L.gen())`\n- the image of `sqrt2` should be the (positive) square root of 2\n\nThe issue seems to stem from Sage somehow confusing\nthe relative generator of `L` (over `K`) with the absolute\ngenerator of `L` (over `QQ`).\n\nInitially discussed on sage-support: [https://groups.google.com/g/sage-support/c/tRRJ-yEPLu4](https://groups.google.com/g/sage-support/c/tRRJ-yEPLu4)\n\n\nCC:  @slel\n\nKeywords: NumberFieldEmbedding relative\n\nStatus: new\n\nIssue created by migration from https://trac.sagemath.org/ticket/31755\n\n",
    "created_at": "2021-04-29T12:19:56Z",
    "labels": [
        "component: number fields",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-9.8",
    "title": "NumberFieldEmbedding does not work with relative number fields",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/31755",
    "user": "https://github.com/Ilia-Smilga"
}
```
In Sage 9.1 or 9.3.rc4:

```
sage: from sage.rings.number_field.number_field_morphisms import (
....:         NumberFieldEmbedding)

sage: K.<sqrt2> = QuadraticField(2, embedding=1.414)
sage: x = polygen(K)
sage: p = x^3 + (sqrt2/2 + 1/3)*x^2 + (2*sqrt2/5+3/7)*x - 1
sage: L.<s> = K.extension(p)

sage: a = L.relative_polynomial().roots(QQbar)[0][0]
sage: a
0.5407496381556470?

sage: my_embedding = NumberFieldEmbedding(L, QQbar, a)
sage: my_embedding
Generic morphism:
  From: Number Field in s with defining polynomial
            x^3 + (1/2*sqrt2 + 1/3)*x^2 + (2/5*sqrt2 + 3/7)*x - 1
            over its base field
  To:   Algebraic Field
  Defn: s -> 0.5407496381556470?

sage: my_embedding.gen_image()
0.5407496381556470?
sage: my_embedding(L.gen())
0.01354690080260168?
sage: my_embedding(sqrt2)
-0.9806353488506175?
```

Expected:

- `my_embedding.gen_image()` should equal `my_embedding(L.gen())`
- the image of `sqrt2` should be the (positive) square root of 2

The issue seems to stem from Sage somehow confusing
the relative generator of `L` (over `K`) with the absolute
generator of `L` (over `QQ`).

Initially discussed on sage-support: [https://groups.google.com/g/sage-support/c/tRRJ-yEPLu4](https://groups.google.com/g/sage-support/c/tRRJ-yEPLu4)


CC:  @slel

Keywords: NumberFieldEmbedding relative

Status: new

Issue created by migration from https://trac.sagemath.org/ticket/31755





---

archive/issue_comments_623755.json:
```json
{
    "body": "<a id='comment:1'></a>\nPut your name in the \"Authors\" field if you contribute code to fix the issue.",
    "created_at": "2021-04-29T13:14:11Z",
    "issue": "https://github.com/sagemath/sagetest/issues/31755",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/31755#issuecomment-623755",
    "user": "https://github.com/slel"
}
```

<a id='comment:1'></a>
Put your name in the "Authors" field if you contribute code to fix the issue.



---

archive/issue_comments_623756.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -1,17 +1,27 @@\n-Example (in version 9.1, running on Ubuntu 18.04.3 LTS (64-bit)):\n-\n+In Sage 9.1 or 9.3.rc4:\n \n ```\n+sage: from sage.rings.number_field.number_field_morphisms import (\n+....:         NumberFieldEmbedding)\n+\n sage: K.<sqrt2> = QuadraticField(2, embedding=1.414)\n-sage: L.<s> = K.extension(x^3 + (sqrt2/2 + 1/3)*x^2 + (2*sqrt2/5+3/7)*x - 1)\n-sage: from sage.rings.number_field.number_field_morphisms import\n-NumberFieldEmbedding\n-sage: my_embedding = NumberFieldEmbedding(L, QQbar, L.relative_polynomial().roots(QQbar)[0][0])\n+sage: x = polygen(K)\n+sage: p = x^3 + (sqrt2/2 + 1/3)*x^2 + (2*sqrt2/5+3/7)*x - 1\n+sage: L.<s> = K.extension(p)\n+\n+sage: a = L.relative_polynomial().roots(QQbar)[0][0]\n+sage: a\n+0.5407496381556470?\n+\n+sage: my_embedding = NumberFieldEmbedding(L, QQbar, a)\n sage: my_embedding\n Generic morphism:\n-  From: Number Field in s with defining polynomial x^3 + (1/2*sqrt2 + 1/3)*x^2 + (2/5*sqrt2 + 3/7)*x - 1 over its base field\n+  From: Number Field in s with defining polynomial\n+            x^3 + (1/2*sqrt2 + 1/3)*x^2 + (2/5*sqrt2 + 3/7)*x - 1\n+            over its base field\n   To:   Algebraic Field\n   Defn: s -> 0.5407496381556470?\n+\n sage: my_embedding.gen_image()\n 0.5407496381556470?\n sage: my_embedding(L.gen())\n@@ -20,6 +30,14 @@\n -0.9806353488506175?\n ```\n \n-Of course, gen_image() should equal the image of L.gen(), and the image of sqrt2 should be the (positive) square root of 2. The issue seems to stem from Sage somehow confusing the relative generator of L (over K) with the absolute generator of L (over QQ).\n+Expected:\n \n-Relevant discussion on sage-support: [https://groups.google.com/g/sage-support/c/tRRJ-yEPLu4](https://groups.google.com/g/sage-support/c/tRRJ-yEPLu4)\n+- `my_embedding.gen_image()` should equal `my_embedding(L.gen())`\n+- the image of `sqrt2` should be the (positive) square root of 2\n+\n+The issue seems to stem from Sage somehow confusing\n+the relative generator of `L` (over `K`) with the absolute\n+generator of `L` (over `QQ`).\n+\n+Initially discussed on sage-support: [https://groups.google.com/g/sage-support/c/tRRJ-yEPLu4](https://groups.google.com/g/sage-support/c/tRRJ-yEPLu4)\n+\n``````\n",
    "created_at": "2021-04-29T13:14:11Z",
    "issue": "https://github.com/sagemath/sagetest/issues/31755",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/31755#issuecomment-623756",
    "user": "https://github.com/slel"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -1,17 +1,27 @@
-Example (in version 9.1, running on Ubuntu 18.04.3 LTS (64-bit)):
-
+In Sage 9.1 or 9.3.rc4:
 
 ```
+sage: from sage.rings.number_field.number_field_morphisms import (
+....:         NumberFieldEmbedding)
+
 sage: K.<sqrt2> = QuadraticField(2, embedding=1.414)
-sage: L.<s> = K.extension(x^3 + (sqrt2/2 + 1/3)*x^2 + (2*sqrt2/5+3/7)*x - 1)
-sage: from sage.rings.number_field.number_field_morphisms import
-NumberFieldEmbedding
-sage: my_embedding = NumberFieldEmbedding(L, QQbar, L.relative_polynomial().roots(QQbar)[0][0])
+sage: x = polygen(K)
+sage: p = x^3 + (sqrt2/2 + 1/3)*x^2 + (2*sqrt2/5+3/7)*x - 1
+sage: L.<s> = K.extension(p)
+
+sage: a = L.relative_polynomial().roots(QQbar)[0][0]
+sage: a
+0.5407496381556470?
+
+sage: my_embedding = NumberFieldEmbedding(L, QQbar, a)
 sage: my_embedding
 Generic morphism:
-  From: Number Field in s with defining polynomial x^3 + (1/2*sqrt2 + 1/3)*x^2 + (2/5*sqrt2 + 3/7)*x - 1 over its base field
+  From: Number Field in s with defining polynomial
+            x^3 + (1/2*sqrt2 + 1/3)*x^2 + (2/5*sqrt2 + 3/7)*x - 1
+            over its base field
   To:   Algebraic Field
   Defn: s -> 0.5407496381556470?
+
 sage: my_embedding.gen_image()
 0.5407496381556470?
 sage: my_embedding(L.gen())
@@ -20,6 +30,14 @@
 -0.9806353488506175?
 ```
 
-Of course, gen_image() should equal the image of L.gen(), and the image of sqrt2 should be the (positive) square root of 2. The issue seems to stem from Sage somehow confusing the relative generator of L (over K) with the absolute generator of L (over QQ).
+Expected:
 
-Relevant discussion on sage-support: [https://groups.google.com/g/sage-support/c/tRRJ-yEPLu4](https://groups.google.com/g/sage-support/c/tRRJ-yEPLu4)
+- `my_embedding.gen_image()` should equal `my_embedding(L.gen())`
+- the image of `sqrt2` should be the (positive) square root of 2
+
+The issue seems to stem from Sage somehow confusing
+the relative generator of `L` (over `K`) with the absolute
+generator of `L` (over `QQ`).
+
+Initially discussed on sage-support: [https://groups.google.com/g/sage-support/c/tRRJ-yEPLu4](https://groups.google.com/g/sage-support/c/tRRJ-yEPLu4)
+
``````




---

archive/issue_comments_623757.json:
```json
{
    "body": "Changing author from \"Ilia Smilga\" to \"\"",
    "created_at": "2021-04-29T13:14:11Z",
    "issue": "https://github.com/sagemath/sagetest/issues/31755",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/31755#issuecomment-623757",
    "user": "https://github.com/slel"
}
```

Changing author from "Ilia Smilga" to ""



---

archive/issue_events_102225.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2021-08-10T17:30:20Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/31755",
    "milestone": "sage-9.5",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/31755#event-102225"
}
```



---

archive/issue_events_102226.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2021-12-18T19:41:23Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/31755",
    "milestone": "sage-9.5",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/31755#event-102226"
}
```



---

archive/issue_events_102227.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2021-12-18T19:41:23Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/31755",
    "milestone": "sage-9.6",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/31755#event-102227"
}
```



---

archive/issue_events_102228.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-04-01T21:16:35Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/31755",
    "milestone": "sage-9.6",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/31755#event-102228"
}
```



---

archive/issue_events_102229.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-04-01T21:16:35Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/31755",
    "milestone": "sage-9.7",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/31755#event-102229"
}
```



---

archive/issue_events_102230.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-08-31T16:33:45Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/31755",
    "milestone": "sage-9.7",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/31755#event-102230"
}
```



---

archive/issue_events_102231.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-08-31T16:33:45Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/31755",
    "milestone": "sage-9.8",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/31755#event-102231"
}
```
