# Issue 15282: Labelling of product posets seem to normalize the labels of the posets

archive/issues_015045.json:
```json
{
    "assignees": [],
    "body": "When taking the product of two posets, apparently both posets are getting relabelled:\n\n```\nsage: A = Posets.ChainPoset(3)\nsage: B = A.product(A).product(A)\nsage: \nsage: B[0]    # one would expect (0, 0, 0)\n(0, 0)\nsage: B[1]    # but no\n(0, 1)\nsage: B[2]    # instead, the first coordinate is what really should be\n(0, 2)\nsage: B[3]    # 3 * the first coordinate + the second coordinate\n(1, 0)\nsage: B[4]    # while the second coordinate is OK\n(1, 1)\nsage: B[5]    # but only because the second factor was already\n(1, 2)\nsage: B[6]    # labelled with 0, 1, 2\n(2, 0)\nsage: B[7]\n(2, 1)\nsage: B[8]\n(2, 2)\nsage: B[9]\n(3, 0)\nsage: B[10]\n(6, 0)\nsage: B.show()\n```\n\nThis doesn't exactly help coding.\n\nCC:  sage-combinat @anneschilling @tscrim @jm58660 @nathanncohen\n\nKeywords: **posets, finite_posets, sage-combinat**\n\n_Issue created by migration from https://trac.sagemath.org/ticket/15282_\n\n",
    "closed_at": "2014-10-13T15:50:24Z",
    "created_at": "2013-10-15T17:55:14Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/bug",
        "https://github.com/sagemath/sage/labels/component%3A%20categories",
        "https://github.com/sagemath/sage/labels/duplicate"
    ],
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "Labelling of product posets seem to normalize the labels of the posets",
    "type": "issue",
    "updated_at": "2014-10-13T15:50:24Z",
    "url": "https://github.com/sagemath/sage/issues/15282",
    "user": "https://github.com/darijgr"
}
```
When taking the product of two posets, apparently both posets are getting relabelled:

```
sage: A = Posets.ChainPoset(3)
sage: B = A.product(A).product(A)
sage: 
sage: B[0]    # one would expect (0, 0, 0)
(0, 0)
sage: B[1]    # but no
(0, 1)
sage: B[2]    # instead, the first coordinate is what really should be
(0, 2)
sage: B[3]    # 3 * the first coordinate + the second coordinate
(1, 0)
sage: B[4]    # while the second coordinate is OK
(1, 1)
sage: B[5]    # but only because the second factor was already
(1, 2)
sage: B[6]    # labelled with 0, 1, 2
(2, 0)
sage: B[7]
(2, 1)
sage: B[8]
(2, 2)
sage: B[9]
(3, 0)
sage: B[10]
(6, 0)
sage: B.show()
```

This doesn't exactly help coding.

CC:  sage-combinat @anneschilling @tscrim @jm58660 @nathanncohen

Keywords: **posets, finite_posets, sage-combinat**

_Issue created by migration from https://trac.sagemath.org/ticket/15282_





---

archive/issue_events_192777.json:
```json
{
    "actor": "https://github.com/darijgr",
    "created_at": "2013-10-15T17:55:14Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/15282",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "d73a4a",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15282#event-192777"
}
```



---

archive/issue_events_192778.json:
```json
{
    "actor": "https://github.com/darijgr",
    "created_at": "2013-10-15T17:55:14Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/15282",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20categories",
    "label_color": "0000ff",
    "label_name": "component: categories",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15282#event-192778"
}
```



---

archive/issue_events_192779.json:
```json
{
    "actor": "https://github.com/darijgr",
    "created_at": "2013-10-15T17:55:14Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/15282",
    "label": "https://github.com/sagemath/sage/labels/invalid",
    "label_color": "a6a6a6",
    "label_name": "invalid",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15282#event-192779"
}
```



---

archive/issue_comments_191178.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -1,6 +1,7 @@\n When taking the product of two posets, apparently both posets are getting relabelled:\n \n-{{{sage: A = Posets.ChainPoset(3)\n+```\n+sage: A = Posets.ChainPoset(3)\n sage: B = A.product(A).product(A)\n sage: \n sage: B[0]    # one would expect (0, 0, 0)\n@@ -26,6 +27,6 @@\n sage: B[10]\n (6, 0)\n sage: B.show()\n-}}}\n+```\n \n This doesn't exactly help coding.\n``````\n",
    "created_at": "2013-10-15T17:56:12Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/15282",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/15282#issuecomment-191178",
    "user": "https://github.com/darijgr"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -1,6 +1,7 @@
 When taking the product of two posets, apparently both posets are getting relabelled:
 
-{{{sage: A = Posets.ChainPoset(3)
+```
+sage: A = Posets.ChainPoset(3)
 sage: B = A.product(A).product(A)
 sage: 
 sage: B[0]    # one would expect (0, 0, 0)
@@ -26,6 +27,6 @@
 sage: B[10]
 (6, 0)
 sage: B.show()
-}}}
+```
 
 This doesn't exactly help coding.
``````




---

archive/issue_comments_191179.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -14,9 +14,9 @@\n (1, 0)\n sage: B[4]    # while the second coordinate is OK\n (1, 1)\n-sage: B[5]\n+sage: B[5]    # but only because the second factor was already\n (1, 2)\n-sage: B[6]\n+sage: B[6]    # labelled with 0, 1, 2\n (2, 0)\n sage: B[7]\n (2, 1)\n``````\n",
    "created_at": "2013-10-15T17:56:47Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/15282",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/15282#issuecomment-191179",
    "user": "https://github.com/darijgr"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -14,9 +14,9 @@
 (1, 0)
 sage: B[4]    # while the second coordinate is OK
 (1, 1)
-sage: B[5]
+sage: B[5]    # but only because the second factor was already
 (1, 2)
-sage: B[6]
+sage: B[6]    # labelled with 0, 1, 2
 (2, 0)
 sage: B[7]
 (2, 1)
``````




---

archive/issue_comments_191180.json:
```json
{
    "body": "<a id='comment:3'>Comment 3:</a>\nI would actually expect things like `((0, 0), 0)` since there is no way to tell if you are taking a 3 fold product from the commands. However I do think there should be an option for keeping the old labels and possibly extend product by\n\n```\nA.product([A, A])\n```\nwhich would automatically relabel itself with `(0, 0, 0)` since it would \"know\" it's a 3x product.",
    "created_at": "2013-10-15T18:14:11Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/15282",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/15282#issuecomment-191180",
    "user": "https://github.com/tscrim"
}
```

<a id='comment:3'>Comment 3:</a>
I would actually expect things like `((0, 0), 0)` since there is no way to tell if you are taking a 3 fold product from the commands. However I do think there should be an option for keeping the old labels and possibly extend product by

```
A.product([A, A])
```
which would automatically relabel itself with `(0, 0, 0)` since it would "know" it's a 3x product.



---

archive/issue_comments_191181.json:
```json
{
    "body": "<a id='comment:4'>Comment 4:</a>\nOops, yes, I meant it should be ((0, 0), 0).",
    "created_at": "2013-10-15T18:14:53Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/15282",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/15282#issuecomment-191181",
    "user": "https://github.com/darijgr"
}
```

<a id='comment:4'>Comment 4:</a>
Oops, yes, I meant it should be ((0, 0), 0).



---

archive/issue_events_192780.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-01-30T21:20:52Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/15282",
    "milestone_number": null,
    "milestone_title": "sage-6.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15282#event-192780"
}
```



---

archive/issue_events_192781.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-01-30T21:20:52Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/15282",
    "milestone_number": null,
    "milestone_title": "sage-6.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15282#event-192781"
}
```



---

archive/issue_events_192782.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-05-06T15:20:58Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/15282",
    "milestone_number": null,
    "milestone_title": "sage-6.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15282#event-192782"
}
```



---

archive/issue_events_192783.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-05-06T15:20:58Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/15282",
    "milestone_number": null,
    "milestone_title": "sage-6.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15282#event-192783"
}
```



---

archive/issue_events_192784.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-08-10T16:51:03Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/15282",
    "milestone_number": null,
    "milestone_title": "sage-6.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15282#event-192784"
}
```



---

archive/issue_events_192785.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-08-10T16:51:03Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/15282",
    "milestone_number": null,
    "milestone_title": "sage-6.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15282#event-192785"
}
```



---

archive/issue_comments_191182.json:
```json
{
    "body": "<a id='comment:8'>Comment 8:</a>\nI didn't notice this and did #17060 as a new ticket. I suggest this to be closed as a duplicate.\n\nI too think that `product`, `disjoint_union` and `ordinal_sum` might have versions for getting `(a,b,c)` instead of `((a,b),c)`. However, it is easy relabeling with `lambda l: (l[0][0], l[0][1], l[1])`. Maybe add a note of this to doc of `product`? See #17053 and documentation of `disjoint_union`.",
    "created_at": "2014-10-02T08:59:05Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/15282",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/15282#issuecomment-191182",
    "user": "https://github.com/jm58660"
}
```

<a id='comment:8'>Comment 8:</a>
I didn't notice this and did #17060 as a new ticket. I suggest this to be closed as a duplicate.

I too think that `product`, `disjoint_union` and `ordinal_sum` might have versions for getting `(a,b,c)` instead of `((a,b),c)`. However, it is easy relabeling with `lambda l: (l[0][0], l[0][1], l[1])`. Maybe add a note of this to doc of `product`? See #17053 and documentation of `disjoint_union`.



---

archive/issue_events_192786.json:
```json
{
    "actor": "https://github.com/jm58660",
    "created_at": "2014-10-02T08:59:05Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/15282",
    "milestone_number": null,
    "milestone_title": "sage-6.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15282#event-192786"
}
```



---

archive/issue_events_192787.json:
```json
{
    "actor": "https://github.com/jm58660",
    "created_at": "2014-10-02T08:59:05Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/15282",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "7fff00",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15282#event-192787"
}
```



---

archive/issue_events_192788.json:
```json
{
    "actor": "https://github.com/nathanncohen",
    "created_at": "2014-10-02T12:02:55Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/15282",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "7fff00",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15282#event-192788"
}
```



---

archive/issue_events_192789.json:
```json
{
    "actor": "https://github.com/nathanncohen",
    "created_at": "2014-10-02T12:02:55Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/15282",
    "label": "https://github.com/sagemath/sage/labels/positive%20review",
    "label_color": "dfffc0",
    "label_name": "positive review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15282#event-192789"
}
```



---

archive/issue_comments_191183.json:
```json
{
    "body": "<a id='comment:10'>Comment 10:</a>\nJori,\n\nWhen you change the milestone to wontfix, please change the status to `positive_review` at the same time.\n\nAbout the `(a,b,c)` instead of `((a,b),c)` thing: it is not that complicated to accept such input if you need it:\n\n```\nsage: def a(*args,**kwds):\n....:         print args\n....:         print kwds\n....:     \nsage: a(1,2,3,5,labels=True)\n(1, 2, 3, 5)\n{'labels': True}\n```\n\nIn this case, \"args\" will be a list of posets that you need to transform into a big poset, and `kwds` will be the union of all \"named\" arguments.\n\nTwo things to pay attention to:\n\n1) When building the final poset, it is best to do it all at once and not two by two (faster)\n\n2) Always check that `kwds` does not contain something unexpected. Otherwise, this function would say nothing when you call `a(1,2,3,labelss=\"True\")` and it is painful to find such typos when you have a bug in your code.\n\nNathann",
    "created_at": "2014-10-02T12:02:55Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/15282",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/15282#issuecomment-191183",
    "user": "https://github.com/nathanncohen"
}
```

<a id='comment:10'>Comment 10:</a>
Jori,

When you change the milestone to wontfix, please change the status to `positive_review` at the same time.

About the `(a,b,c)` instead of `((a,b),c)` thing: it is not that complicated to accept such input if you need it:

```
sage: def a(*args,**kwds):
....:         print args
....:         print kwds
....:     
sage: a(1,2,3,5,labels=True)
(1, 2, 3, 5)
{'labels': True}
```

In this case, "args" will be a list of posets that you need to transform into a big poset, and `kwds` will be the union of all "named" arguments.

Two things to pay attention to:

1) When building the final poset, it is best to do it all at once and not two by two (faster)

2) Always check that `kwds` does not contain something unexpected. Otherwise, this function would say nothing when you call `a(1,2,3,labelss="True")` and it is painful to find such typos when you have a bug in your code.

Nathann



---

archive/issue_comments_191184.json:
```json
{
    "body": "<a id='comment:11'>Comment 11:</a>\nReplying to [@nathanncohen](#comment%3A10):\n\n> When you change the milestone to wontfix, please change the status to `positive_review` at the same time.\n\nBut how to ask if some ticket should be closed or not? I wasn't sure about this one.",
    "created_at": "2014-10-02T12:25:03Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/15282",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/15282#issuecomment-191184",
    "user": "https://github.com/jm58660"
}
```

<a id='comment:11'>Comment 11:</a>
Replying to [@nathanncohen](#comment%3A10):

> When you change the milestone to wontfix, please change the status to `positive_review` at the same time.

But how to ask if some ticket should be closed or not? I wasn't sure about this one.



---

archive/issue_comments_191185.json:
```json
{
    "body": "<a id='comment:12'>Comment 12:</a>\n> But how to ask if some ticket should be closed or not? I wasn't sure about this one.\n\nOh. Well, didn't you fix the bug reported here in #17060 ? When you run the example given in this ticket's description with that patch applied, you get the 'expected' thing:\n\n```\nsage: A = Posets.ChainPoset(3)\nsage: B = A.product(A).product(A)\nsage: B[0]\n((0, 0), 0)\n```\n\nThere is only this `(0,0,0)` thing to make available if you feel like it.\n\nNathann",
    "created_at": "2014-10-02T12:48:15Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/15282",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/15282#issuecomment-191185",
    "user": "https://github.com/nathanncohen"
}
```

<a id='comment:12'>Comment 12:</a>
> But how to ask if some ticket should be closed or not? I wasn't sure about this one.

Oh. Well, didn't you fix the bug reported here in #17060 ? When you run the example given in this ticket's description with that patch applied, you get the 'expected' thing:

```
sage: A = Posets.ChainPoset(3)
sage: B = A.product(A).product(A)
sage: B[0]
((0, 0), 0)
```

There is only this `(0,0,0)` thing to make available if you feel like it.

Nathann



---

archive/issue_events_192790.json:
```json
{
    "actor": "https://github.com/vbraun",
    "created_at": "2014-10-13T15:50:24Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/15282",
    "label": "https://github.com/sagemath/sage/labels/duplicate",
    "label_color": "a6a6a6",
    "label_name": "duplicate",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15282#event-192790"
}
```



---

archive/issue_events_192791.json:
```json
{
    "actor": "https://github.com/vbraun",
    "created_at": "2014-10-13T15:50:24Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/15282",
    "label": "https://github.com/sagemath/sage/labels/positive%20review",
    "label_color": "dfffc0",
    "label_name": "positive review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15282#event-192791"
}
```



---

archive/issue_events_192792.json:
```json
{
    "actor": "https://github.com/vbraun",
    "created_at": "2014-10-13T15:50:24Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/15282",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15282#event-192792"
}
```
