# Issue 15326: Polynomials exhibit strange behavior when seen in a different parent ring

archive/issues_015089.json:
```json
{
    "body": "When a polynomial is constructed from a certain polynomial ring and a different ring is constructed with the same indeterminates, Sage attempts to be smart and automatically convert elements of the old ring to the new ring (or something of the sort), but this smartness can cause very wrong behavior:\n\n```\nsage: R.<x,y> = PolynomialRing(QQ,['x','y'],order=\"deglex\")\nsage: pol = x^2 + y + 42\nsage: pol.degree(x)\n2\nsage: R.<x,y> = PolynomialRing(QQ,['x','y'],order=\"degrevlex\")\nsage: pol in R\nTrue\nsage: pol == x^2+y+42\nTrue\nsage: pol.degree(x)\n1\nsage: R(pol).degree(x)\n2\n```\n\nI'm not sure why pol.degree(x) returns 1, but this is certainly wrong.  An error message of the kind \"pol is not a polynomial in x\" would have been better than a wrong result.\n\n**CC:**  jakobkroeker\n\n**Keywords:** polynomials\n\nIssue created by migration from https://trac.sagemath.org/ticket/15326\n\n",
    "created_at": "2013-10-25T13:40:10Z",
    "labels": [
        "component: algebra",
        "minor",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-6.4",
    "title": "Polynomials exhibit strange behavior when seen in a different parent ring",
    "type": "issue",
    "url": "https://github.com/sagemath/sage/issues/15326",
    "user": "https://trac.sagemath.org/admin/accounts/users/davidamadore"
}
```
When a polynomial is constructed from a certain polynomial ring and a different ring is constructed with the same indeterminates, Sage attempts to be smart and automatically convert elements of the old ring to the new ring (or something of the sort), but this smartness can cause very wrong behavior:

```
sage: R.<x,y> = PolynomialRing(QQ,['x','y'],order="deglex")
sage: pol = x^2 + y + 42
sage: pol.degree(x)
2
sage: R.<x,y> = PolynomialRing(QQ,['x','y'],order="degrevlex")
sage: pol in R
True
sage: pol == x^2+y+42
True
sage: pol.degree(x)
1
sage: R(pol).degree(x)
2
```

I'm not sure why pol.degree(x) returns 1, but this is certainly wrong.  An error message of the kind "pol is not a polynomial in x" would have been better than a wrong result.

**CC:**  jakobkroeker

**Keywords:** polynomials

Issue created by migration from https://trac.sagemath.org/ticket/15326





---

archive/issue_events_134943.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-01-30T21:20:52Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/15326",
    "milestone": "sage-6.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15326#event-134943"
}
```



---

archive/issue_events_134944.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-01-30T21:20:52Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/15326",
    "milestone": "sage-6.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15326#event-134944"
}
```



---

archive/issue_events_134945.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-05-06T15:20:58Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/15326",
    "milestone": "sage-6.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15326#event-134945"
}
```



---

archive/issue_events_134946.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-05-06T15:20:58Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/15326",
    "milestone": "sage-6.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15326#event-134946"
}
```



---

archive/issue_events_134947.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-08-10T16:51:03Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/15326",
    "milestone": "sage-6.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15326#event-134947"
}
```



---

archive/issue_events_134948.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-08-10T16:51:03Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/15326",
    "milestone": "sage-6.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15326#event-134948"
}
```



---

archive/issue_comments_192311.json:
```json
{
    "body": "<a id='comment:4'></a>\nseems fixed meanwhile; needs a test?",
    "created_at": "2017-02-26T00:55:48Z",
    "issue": "https://github.com/sagemath/sage/issues/15326",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/15326#issuecomment-192311",
    "user": "https://trac.sagemath.org/admin/accounts/users/jakobkroeker"
}
```

<a id='comment:4'></a>
seems fixed meanwhile; needs a test?
