# Issue 15535: LinBox: you are running out of primes. 1000 coprime primes found

archive/issues_015298.json:
```json
{
    "assignees": [],
    "body": "Old issue, but still happens ocassionally. See also #12883 and https://groups.google.com/d/topic/linbox-use/SgsXVYM7u7s/discussion\n\n```\nsage -t --long src/sage/modular/modform/ambient.py\n    Timed out\n**********************************************************************\nTests run before process (pid=88588) timed out:\nsage: chi = DirichletGroup(25,QQ).0; chi ## line 13 ##\nDirichlet character modulo 25 of conductor 5 mapping 2 |--> -1\nsage: n = ModularForms(chi,2); n ## line 15 ##\nModular Forms space of dimension 6, character [-1] and weight 2 over Rational Field\nsage: type(n) ## line 17 ##\n<class 'sage.modular.modform.ambient_eps.ModularFormsAmbient_eps_with_category'>\nsage: n.basis() ## line 22 ##\n[\n1 + O(q^6),\nq + O(q^6),\nq^2 + O(q^6),\nq^3 + O(q^6),\nq^4 + O(q^6),\nq^5 + O(q^6)\n]\nsage: n.set_precision(20) ## line 34 ##\nsage: n.basis() ## line 35 ##\n[\n1 + 10*q^10 + 20*q^15 + O(q^20),\nq + 5*q^6 + q^9 + 12*q^11 - 3*q^14 + 17*q^16 + 8*q^19 + O(q^20),\nq^2 + 4*q^7 - q^8 + 8*q^12 + 2*q^13 + 10*q^17 - 5*q^18 + O(q^20),\nq^3 + q^7 + 3*q^8 - q^12 + 5*q^13 + 3*q^17 + 6*q^18 + O(q^20),\nq^4 - q^6 + 2*q^9 + 3*q^14 - 2*q^16 + 4*q^19 + O(q^20),\nq^5 + q^10 + 2*q^15 + O(q^20)\n]\nsage: m = ModularForms(Gamma1(20),2,GF(7)) ## line 47 ##\nsage: loads(dumps(m)) == m ## line 48 ##\nTrue\nsage: m = ModularForms(GammaH(11,[4]), 2); m ## line 53 ##\nModular Forms space of dimension 2 for Congruence Subgroup Gamma_H(11) with H generated by [4] of weight 2 over Rational Field\nsage: type(m) ## line 55 ##\n<class 'sage.modular.modform.ambient_g1.ModularFormsAmbient_gH_Q_with_category'>\nsage: m == loads(dumps(m)) ## line 57 ##\nTrue\nsage: sig_on_count() ## line 59 ##\n0\nsage: m = ModularForms(Gamma1(20),20); m ## line 102 ##\nModular Forms space of dimension 238 for Congruence Subgroup Gamma1(20) of weight 20 over Rational Field\nsage: m.is_ambient() ## line 104 ##\nTrue\nsage: sig_on_count() ## line 106 ##\n0\nsage: m = ModularForms(Gamma1(20),100); m._repr_() ## line 127 ##\n'Modular Forms space of dimension 1198 for Congruence Subgroup Gamma1(20) of weight 100 over Rational Field'\nsage: m.rename('A big modform space') ## line 132 ##\nsage: m ## line 133 ##\nA big modform space\nsage: m._repr_() ## line 135 ##\n'Modular Forms space of dimension 1198 for Congruence Subgroup Gamma1(20) of weight 100 over Rational Field'\nsage: sig_on_count() ## line 137 ##\n0\nsage: m = ModularForms(Gamma0(20),2) ## line 151 ##\nsage: m._submodule_class() ## line 152 ##\n<class 'sage.modular.modform.submodule.ModularFormsSubmodule'>\nsage: sig_on_count() ## line 154 ##\n0\nsage: M = ModularForms(Gamma0(37),2) ## line 169 ##\nsage: M.basis() ## line 170 ##\n[\nq + q^3 - 2*q^4 + O(q^6),\nq^2 + 2*q^3 - 2*q^4 + q^5 + O(q^6),\n1 + 2/3*q + 2*q^2 + 8/3*q^3 + 14/3*q^4 + 4*q^5 + O(q^6)\n]\nsage: M3 = M.change_ring(GF(3)) ## line 182 ##\nsage: M3.basis() ## line 183 ##\n[\n1 + q^3 + q^4 + 2*q^5 + O(q^6),\nq + q^3 + q^4 + O(q^6),\nq^2 + 2*q^3 + q^4 + q^5 + O(q^6)\n]\nsage: sig_on_count() ## line 189 ##\n0\nsage: m = ModularForms(Gamma1(20),20) ## line 202 ##\nsage: m.dimension() ## line 203 ##\n238\nsage: sig_on_count() ## line 205 ##\n0\nsage: ModularForms(25, 6).hecke_module_of_level(5) ## line 220 ##\nModular Forms space of dimension 3 for Congruence Subgroup Gamma0(5) of weight 6 over Rational Field\nsage: ModularForms(Gamma1(4), 3).hecke_module_of_level(8) ## line 222 ##\nModular Forms space of dimension 7 for Congruence Subgroup Gamma1(8) of weight 3 over Rational Field\nsage: ModularForms(Gamma1(4), 3).hecke_module_of_level(9) ## line 224 ##\nsage: sig_on_count() ## line 228 ##\n0\nsage: ModularForms(22, 2)._degeneracy_raising_matrix(ModularForms(44, 2), 1) ## line 242 ##\n[  1   0  -1  -2   0   0   0   0   0]\n[  0   1   0  -2   0   0   0   0   0]\n[  0   0   0   0   1   0   0   0  24]\n[  0   0   0   0   0   1   0  -2  21]\n[  0   0   0   0   0   0   1   3 -10]\nsage: ModularForms(22, 2)._degeneracy_raising_matrix(ModularForms(44, 2), 2) ## line 248 ##\n[0 1 0 0 0 0 0 0 0]\n[0 0 0 1 0 0 0 0 0]\n[0 0 0 0 1 0 0 0 0]\n[0 0 0 0 0 0 1 0 0]\n[0 0 0 0 0 0 0 1 0]\nsage: sig_on_count() ## line 254 ##\n0\nsage: m = ModularForms(Gamma0(20),4) ## line 272 ##\nsage: m.rank() ## line 273 ##\n12\nsage: m.dimension() ## line 275 ##\n12\nsage: sig_on_count() ## line 277 ##\n0\nsage: m = ModularForms(Gamma0(3),30) ## line 287 ##\nsage: m.ambient_space() is m ## line 288 ##\nTrue\nsage: sig_on_count() ## line 290 ##\n0\nsage: ModularForms(11).is_ambient() ## line 301 ##\nTrue\nsage: CuspForms(11).is_ambient() ## line 303 ##\nFalse\nsage: sig_on_count() ## line 305 ##\n0\nsage: S = ModularForms(11,2) ## line 315 ##\nsage: S.modular_symbols() ## line 316 ##\nModular Symbols space of dimension 3 for Gamma_0(11) of weight 2 with sign 0 over Rational Field\nsage: S.modular_symbols(sign=1) ## line 318 ##\nModular Symbols space of dimension 2 for Gamma_0(11) of weight 2 with sign 1 over Rational Field\nsage: S.modular_symbols(sign=-1) ## line 320 ##\nModular Symbols space of dimension 1 for Gamma_0(11) of weight 2 with sign -1 over Rational Field\nsage: ModularForms(1,12).modular_symbols() ## line 325 ##\nModular Symbols space of dimension 3 for Gamma_0(1) of weight 12 with sign 0 over Rational Field\nsage: sig_on_count() ## line 327 ##\n0\nsage: m = ModularForms(Gamma1(13),10) ## line 357 ##\nsage: m.free_module() ## line 358 ##\nVector space of dimension 69 over Rational Field\nsage: ModularForms(Gamma1(13),4, GF(49,'b')).free_module() ## line 360 ##\nVector space of dimension 27 over Finite Field in b of size 7^2\nsage: M = ModularForms(Gamma1(57), 1); M ## line 367 ##\nModular Forms space of dimension (unknown) for Congruence Subgroup Gamma1(57) of weight 1 over Rational Field\nsage: M.module() ## line 369 ##\nVector space of dimension 36 over Rational Field\nsage: M.basis() ## line 371 ##\nsage: sig_on_count() ## line 375 ##\n0\nsage: ModularForms(37).free_module() ## line 402 ##\nVector space of dimension 3 over Rational Field\nsage: sig_on_count() ## line 404 ##\n0\nsage: M = ModularForms(1,12, prec=3) ## line 421 ##\nsage: M.prec() ## line 422 ##\n3\nsage: M.basis() ## line 427 ##\n[\nq - 24*q^2 + O(q^3),\n1 + 65520/691*q + 134250480/691*q^2 + O(q^3)\n]\nsage: M.prec(5) ## line 435 ##\n5\nsage: M.basis() ## line 437 ##\n[\nq - 24*q^2 + 252*q^3 - 1472*q^4 + O(q^5),\n1 + 65520/691*q + 134250480/691*q^2 + 11606736960/691*q^3 + 274945048560/691*q^4 + O(q^5)\n]\nsage: sig_on_count() ## line 442 ##\n0\nsage: m = ModularForms(Gamma1(5),2) ## line 457 ##\nsage: m.set_precision(10) ## line 458 ##\nsage: m.basis() ## line 459 ##\n[\n1 + 60*q^3 - 120*q^4 + 240*q^5 - 300*q^6 + 300*q^7 - 180*q^9 + O(q^10),\nq + 6*q^3 - 9*q^4 + 27*q^5 - 28*q^6 + 30*q^7 - 11*q^9 + O(q^10),\nq^2 - 4*q^3 + 12*q^4 - 22*q^5 + 30*q^6 - 24*q^7 + 5*q^8 + 18*q^9 + O(q^10)\n]\nsage: m.set_precision(5) ## line 465 ##\nsage: m.basis() ## line 466 ##\n[\n1 + 60*q^3 - 120*q^4 + O(q^5),\nq + 6*q^3 - 9*q^4 + O(q^5),\nq^2 - 4*q^3 + 12*q^4 + O(q^5)\n]\nsage: sig_on_count() ## line 472 ##\n0\nsage: ModularForms(Gamma1(13)).cuspidal_submodule() ## line 486 ##\nCuspidal subspace of dimension 2 of Modular Forms space of dimension 13 for Congruence Subgroup Gamma1(13) of weight 2 over Rational Field\nsage: sig_on_count() ## line 489 ##\n0\nsage: m = ModularForms(Gamma1(13),2); m ## line 502 ##\nModular Forms space of dimension 13 for Congruence Subgroup Gamma1(13) of weight 2 over Rational Field\nsage: m.eisenstein_submodule() ## line 504 ##\nEisenstein subspace of dimension 11 of Modular Forms space of dimension 13 for Congruence Subgroup Gamma1(13) of weight 2 over Rational Field\nsage: sig_on_count() ## line 506 ##\n0\nsage: m = ModularForms(Gamma0(33),2); m ## line 527 ##\nModular Forms space of dimension 6 for Congruence Subgroup Gamma0(33) of weight 2 over Rational Field\nsage: m.new_submodule() ## line 529 ##\nModular Forms subspace of dimension 1 of Modular Forms space of dimension 6 for Congruence Subgroup Gamma0(33) of weight 2 over Rational Field\nsage: M = ModularForms(17,4) ## line 534 ##\nsage: N = M.new_subspace(); N ## line 535 ##\nModular Forms subspace of dimension 4 of Modular Forms space of dimension 6 for Congruence Subgroup Gamma0(17) of weight 4 over Rational Field\nsage: N.basis() ## line 537 ##\n[\nq + 2*q^5 + O(q^6),\nq^2 - 3/2*q^5 + O(q^6),\nq^3 + O(q^6),\nq^4 - 1/2*q^5 + O(q^6)\n]\nsage: ModularForms(12,4).new_submodule() ## line 547 ##\nModular Forms subspace of dimension 1 of Modular Forms space of dimension 9 for Congruence Subgroup Gamma0(12) of weight 4 over Rational Field\nsage: sig_on_count() ## line 561 ##\n0\nsage: m = ModularForms(Gamma0(23),2); m ## line 594 ##\nModular Forms space of dimension 3 for Congruence Subgroup Gamma0(23) of weight 2 over Rational Field\nsage: m.basis() ## line 596 ##\n[\nq - q^3 - q^4 + O(q^6),\nq^2 - 2*q^3 - q^4 + 2*q^5 + O(q^6),\n1 + 12/11*q + 36/11*q^2 + 48/11*q^3 + 84/11*q^4 + 72/11*q^5 + O(q^6)\n]\nsage: m._q_expansion([1,2,0], 5) ## line 602 ##\nq + 2*q^2 - 5*q^3 - 3*q^4 + O(q^5)\nsage: sig_on_count() ## line 604 ##\n0\nsage: m = ModularForms(GammaH(11,[4]), 2); m ## line 623 ##\nModular Forms space of dimension 2 for Congruence Subgroup Gamma_H(11) with H generated by [4] of weight 2 over Rational Field\nsage: m._dim_cuspidal() ## line 625 ##\n1\nsage: sig_on_count() ## line 627 ##\n0\nsage: m = ModularForms(GammaH(13,[4]), 2); m ## line 644 ##\nModular Forms space of dimension 3 for Congruence Subgroup Gamma_H(13) with H generated by [4] of weight 2 over Rational Field\nsage: m._dim_eisenstein() ## line 646 ##\n3\nsage: sig_on_count() ## line 648 ##\n0\nsage: m = ModularForms(GammaH(11,[2]), 2); m._dim_new_cuspidal() ## line 668 ##\n1\nsage: sig_on_count() ## line 670 ##\n0\nsage: m = ModularForms(Gamma0(11), 4) ## line 686 ##\nsage: m._dim_new_eisenstein() ## line 687 ##\n0\nsage: m = ModularForms(Gamma0(11), 2) ## line 689 ##\nsage: m._dim_new_eisenstein() ## line 690 ##\n1\nsage: sig_on_count() ## line 692 ##\n0\nsage: m = ModularForms(Gamma0(22), 2) ## line 720 ##\nsage: v = m.eisenstein_params(); v ## line 721 ##\n[(Dirichlet character modulo 22 of conductor 1 mapping 13 |--> 1, Dirichlet character modulo 22 of conductor 1 mapping 13 |--> 1, 2), (Dirichlet character modulo 22 of conductor 1 mapping 13 |--> 1, Dirichlet character modulo 22 of conductor 1 mapping 13 |--> 1, 11), (Dirichlet character modulo 22 of conductor 1 mapping 13 |--> 1, Dirichlet character modulo 22 of conductor 1 mapping 13 |--> 1, 22)]\nsage: type(v) ## line 723 ##\n<class 'sage.structure.sequence.Sequence_generic'>\nsage: sig_on_count() ## line 725 ##\n0\nsage: ModularForms(27,2).eisenstein_series() ## line 745 ##\n[\nq^3 + O(q^6),\nq - 3*q^2 + 7*q^4 - 6*q^5 + O(q^6),\n1/12 + q + 3*q^2 + q^3 + 7*q^4 + 6*q^5 + O(q^6),\n1/3 + q + 3*q^2 + 4*q^3 + 7*q^4 + 6*q^5 + O(q^6),\n13/12 + q + 3*q^2 + 4*q^3 + 7*q^4 + 6*q^5 + O(q^6)\n]\nsage: ModularForms(Gamma1(5),3).eisenstein_series() ## line 756 ##\n[\n-1/5*zeta4 - 2/5 + q + (4*zeta4 + 1)*q^2 + (-9*zeta4 + 1)*q^3 + (4*zeta4 - 15)*q^4 + q^5 + O(q^6),\nq + (zeta4 + 4)*q^2 + (-zeta4 + 9)*q^3 + (4*zeta4 + 15)*q^4 + 25*q^5 + O(q^6),\n1/5*zeta4 - 2/5 + q + (-4*zeta4 + 1)*q^2 + (9*zeta4 + 1)*q^3 + (-4*zeta4 - 15)*q^4 + q^5 + O(q^6),\nq + (-zeta4 + 4)*q^2 + (zeta4 + 9)*q^3 + (-4*zeta4 + 15)*q^4 + 25*q^5 + O(q^6)\n]\nsage: eps = DirichletGroup(13).0^2 ## line 766 ##\nsage: ModularForms(eps,2).eisenstein_series() ## line 767 ##\n[\n-7/13*zeta6 - 11/13 + q + (2*zeta6 + 1)*q^2 + (-3*zeta6 + 1)*q^3 + (6*zeta6 - 3)*q^4 - 4*q^5 + O(q^6),\nq + (zeta6 + 2)*q^2 + (-zeta6 + 3)*q^3 + (3*zeta6 + 3)*q^4 + 4*q^5 + O(q^6)\n]\nsage: sig_on_count() ## line 772 ##\n0\nsage: m = ModularForms(11,4) ## line 779 ##\nsage: m._compute_q_expansion_basis(5) ## line 780 ##\n[q + 3*q^3 - 6*q^4 + O(q^5), q^2 - 4*q^3 + 2*q^4 + O(q^5), 1 + O(q^5), q + 9*q^2 + 28*q^3 + 73*q^4 + O(q^5)]\nsage: sig_on_count() ## line 782 ##\n0\nsage: M = ModularForms(11, 2) ## line 800 ##\nsage: M._compute_hecke_matrix(6) ## line 801 ##\n[ 2  0]\n[ 0 12]\nsage: M = ModularForms(1, 512) ## line 812 ##\nsage: t = M._compute_hecke_matrix(5)     # long time (2s) ## line 813 ##\nsage: f = t.charpoly()                   # long time (4s) ## line 814 ##\nyou are running out of primes. 1000 coprime primes found\n```\n\nCC:  @ClementPernet\n\nKeywords: **random_fail**\n\nComponent: **linear algebra**\n\n_Issue created by migration from https://trac.sagemath.org/ticket/15535_\n\n",
    "closed_at": "2018-06-27T06:04:11Z",
    "created_at": "2013-12-17T19:15:36Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/c%3A%20linear%20algebra",
        "https://github.com/sagemath/sage/labels/p%3A%20major%20/%203",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "LinBox: you are running out of primes. 1000 coprime primes found",
    "type": "issue",
    "updated_at": "2018-06-27T06:04:11Z",
    "url": "https://github.com/sagemath/sage/issues/15535",
    "user": "https://github.com/vbraun"
}
```
Old issue, but still happens ocassionally. See also #12883 and https://groups.google.com/d/topic/linbox-use/SgsXVYM7u7s/discussion

```
sage -t --long src/sage/modular/modform/ambient.py
    Timed out
**********************************************************************
Tests run before process (pid=88588) timed out:
sage: chi = DirichletGroup(25,QQ).0; chi ## line 13 ##
Dirichlet character modulo 25 of conductor 5 mapping 2 |--> -1
sage: n = ModularForms(chi,2); n ## line 15 ##
Modular Forms space of dimension 6, character [-1] and weight 2 over Rational Field
sage: type(n) ## line 17 ##
<class 'sage.modular.modform.ambient_eps.ModularFormsAmbient_eps_with_category'>
sage: n.basis() ## line 22 ##
[
1 + O(q^6),
q + O(q^6),
q^2 + O(q^6),
q^3 + O(q^6),
q^4 + O(q^6),
q^5 + O(q^6)
]
sage: n.set_precision(20) ## line 34 ##
sage: n.basis() ## line 35 ##
[
1 + 10*q^10 + 20*q^15 + O(q^20),
q + 5*q^6 + q^9 + 12*q^11 - 3*q^14 + 17*q^16 + 8*q^19 + O(q^20),
q^2 + 4*q^7 - q^8 + 8*q^12 + 2*q^13 + 10*q^17 - 5*q^18 + O(q^20),
q^3 + q^7 + 3*q^8 - q^12 + 5*q^13 + 3*q^17 + 6*q^18 + O(q^20),
q^4 - q^6 + 2*q^9 + 3*q^14 - 2*q^16 + 4*q^19 + O(q^20),
q^5 + q^10 + 2*q^15 + O(q^20)
]
sage: m = ModularForms(Gamma1(20),2,GF(7)) ## line 47 ##
sage: loads(dumps(m)) == m ## line 48 ##
True
sage: m = ModularForms(GammaH(11,[4]), 2); m ## line 53 ##
Modular Forms space of dimension 2 for Congruence Subgroup Gamma_H(11) with H generated by [4] of weight 2 over Rational Field
sage: type(m) ## line 55 ##
<class 'sage.modular.modform.ambient_g1.ModularFormsAmbient_gH_Q_with_category'>
sage: m == loads(dumps(m)) ## line 57 ##
True
sage: sig_on_count() ## line 59 ##
0
sage: m = ModularForms(Gamma1(20),20); m ## line 102 ##
Modular Forms space of dimension 238 for Congruence Subgroup Gamma1(20) of weight 20 over Rational Field
sage: m.is_ambient() ## line 104 ##
True
sage: sig_on_count() ## line 106 ##
0
sage: m = ModularForms(Gamma1(20),100); m._repr_() ## line 127 ##
'Modular Forms space of dimension 1198 for Congruence Subgroup Gamma1(20) of weight 100 over Rational Field'
sage: m.rename('A big modform space') ## line 132 ##
sage: m ## line 133 ##
A big modform space
sage: m._repr_() ## line 135 ##
'Modular Forms space of dimension 1198 for Congruence Subgroup Gamma1(20) of weight 100 over Rational Field'
sage: sig_on_count() ## line 137 ##
0
sage: m = ModularForms(Gamma0(20),2) ## line 151 ##
sage: m._submodule_class() ## line 152 ##
<class 'sage.modular.modform.submodule.ModularFormsSubmodule'>
sage: sig_on_count() ## line 154 ##
0
sage: M = ModularForms(Gamma0(37),2) ## line 169 ##
sage: M.basis() ## line 170 ##
[
q + q^3 - 2*q^4 + O(q^6),
q^2 + 2*q^3 - 2*q^4 + q^5 + O(q^6),
1 + 2/3*q + 2*q^2 + 8/3*q^3 + 14/3*q^4 + 4*q^5 + O(q^6)
]
sage: M3 = M.change_ring(GF(3)) ## line 182 ##
sage: M3.basis() ## line 183 ##
[
1 + q^3 + q^4 + 2*q^5 + O(q^6),
q + q^3 + q^4 + O(q^6),
q^2 + 2*q^3 + q^4 + q^5 + O(q^6)
]
sage: sig_on_count() ## line 189 ##
0
sage: m = ModularForms(Gamma1(20),20) ## line 202 ##
sage: m.dimension() ## line 203 ##
238
sage: sig_on_count() ## line 205 ##
0
sage: ModularForms(25, 6).hecke_module_of_level(5) ## line 220 ##
Modular Forms space of dimension 3 for Congruence Subgroup Gamma0(5) of weight 6 over Rational Field
sage: ModularForms(Gamma1(4), 3).hecke_module_of_level(8) ## line 222 ##
Modular Forms space of dimension 7 for Congruence Subgroup Gamma1(8) of weight 3 over Rational Field
sage: ModularForms(Gamma1(4), 3).hecke_module_of_level(9) ## line 224 ##
sage: sig_on_count() ## line 228 ##
0
sage: ModularForms(22, 2)._degeneracy_raising_matrix(ModularForms(44, 2), 1) ## line 242 ##
[  1   0  -1  -2   0   0   0   0   0]
[  0   1   0  -2   0   0   0   0   0]
[  0   0   0   0   1   0   0   0  24]
[  0   0   0   0   0   1   0  -2  21]
[  0   0   0   0   0   0   1   3 -10]
sage: ModularForms(22, 2)._degeneracy_raising_matrix(ModularForms(44, 2), 2) ## line 248 ##
[0 1 0 0 0 0 0 0 0]
[0 0 0 1 0 0 0 0 0]
[0 0 0 0 1 0 0 0 0]
[0 0 0 0 0 0 1 0 0]
[0 0 0 0 0 0 0 1 0]
sage: sig_on_count() ## line 254 ##
0
sage: m = ModularForms(Gamma0(20),4) ## line 272 ##
sage: m.rank() ## line 273 ##
12
sage: m.dimension() ## line 275 ##
12
sage: sig_on_count() ## line 277 ##
0
sage: m = ModularForms(Gamma0(3),30) ## line 287 ##
sage: m.ambient_space() is m ## line 288 ##
True
sage: sig_on_count() ## line 290 ##
0
sage: ModularForms(11).is_ambient() ## line 301 ##
True
sage: CuspForms(11).is_ambient() ## line 303 ##
False
sage: sig_on_count() ## line 305 ##
0
sage: S = ModularForms(11,2) ## line 315 ##
sage: S.modular_symbols() ## line 316 ##
Modular Symbols space of dimension 3 for Gamma_0(11) of weight 2 with sign 0 over Rational Field
sage: S.modular_symbols(sign=1) ## line 318 ##
Modular Symbols space of dimension 2 for Gamma_0(11) of weight 2 with sign 1 over Rational Field
sage: S.modular_symbols(sign=-1) ## line 320 ##
Modular Symbols space of dimension 1 for Gamma_0(11) of weight 2 with sign -1 over Rational Field
sage: ModularForms(1,12).modular_symbols() ## line 325 ##
Modular Symbols space of dimension 3 for Gamma_0(1) of weight 12 with sign 0 over Rational Field
sage: sig_on_count() ## line 327 ##
0
sage: m = ModularForms(Gamma1(13),10) ## line 357 ##
sage: m.free_module() ## line 358 ##
Vector space of dimension 69 over Rational Field
sage: ModularForms(Gamma1(13),4, GF(49,'b')).free_module() ## line 360 ##
Vector space of dimension 27 over Finite Field in b of size 7^2
sage: M = ModularForms(Gamma1(57), 1); M ## line 367 ##
Modular Forms space of dimension (unknown) for Congruence Subgroup Gamma1(57) of weight 1 over Rational Field
sage: M.module() ## line 369 ##
Vector space of dimension 36 over Rational Field
sage: M.basis() ## line 371 ##
sage: sig_on_count() ## line 375 ##
0
sage: ModularForms(37).free_module() ## line 402 ##
Vector space of dimension 3 over Rational Field
sage: sig_on_count() ## line 404 ##
0
sage: M = ModularForms(1,12, prec=3) ## line 421 ##
sage: M.prec() ## line 422 ##
3
sage: M.basis() ## line 427 ##
[
q - 24*q^2 + O(q^3),
1 + 65520/691*q + 134250480/691*q^2 + O(q^3)
]
sage: M.prec(5) ## line 435 ##
5
sage: M.basis() ## line 437 ##
[
q - 24*q^2 + 252*q^3 - 1472*q^4 + O(q^5),
1 + 65520/691*q + 134250480/691*q^2 + 11606736960/691*q^3 + 274945048560/691*q^4 + O(q^5)
]
sage: sig_on_count() ## line 442 ##
0
sage: m = ModularForms(Gamma1(5),2) ## line 457 ##
sage: m.set_precision(10) ## line 458 ##
sage: m.basis() ## line 459 ##
[
1 + 60*q^3 - 120*q^4 + 240*q^5 - 300*q^6 + 300*q^7 - 180*q^9 + O(q^10),
q + 6*q^3 - 9*q^4 + 27*q^5 - 28*q^6 + 30*q^7 - 11*q^9 + O(q^10),
q^2 - 4*q^3 + 12*q^4 - 22*q^5 + 30*q^6 - 24*q^7 + 5*q^8 + 18*q^9 + O(q^10)
]
sage: m.set_precision(5) ## line 465 ##
sage: m.basis() ## line 466 ##
[
1 + 60*q^3 - 120*q^4 + O(q^5),
q + 6*q^3 - 9*q^4 + O(q^5),
q^2 - 4*q^3 + 12*q^4 + O(q^5)
]
sage: sig_on_count() ## line 472 ##
0
sage: ModularForms(Gamma1(13)).cuspidal_submodule() ## line 486 ##
Cuspidal subspace of dimension 2 of Modular Forms space of dimension 13 for Congruence Subgroup Gamma1(13) of weight 2 over Rational Field
sage: sig_on_count() ## line 489 ##
0
sage: m = ModularForms(Gamma1(13),2); m ## line 502 ##
Modular Forms space of dimension 13 for Congruence Subgroup Gamma1(13) of weight 2 over Rational Field
sage: m.eisenstein_submodule() ## line 504 ##
Eisenstein subspace of dimension 11 of Modular Forms space of dimension 13 for Congruence Subgroup Gamma1(13) of weight 2 over Rational Field
sage: sig_on_count() ## line 506 ##
0
sage: m = ModularForms(Gamma0(33),2); m ## line 527 ##
Modular Forms space of dimension 6 for Congruence Subgroup Gamma0(33) of weight 2 over Rational Field
sage: m.new_submodule() ## line 529 ##
Modular Forms subspace of dimension 1 of Modular Forms space of dimension 6 for Congruence Subgroup Gamma0(33) of weight 2 over Rational Field
sage: M = ModularForms(17,4) ## line 534 ##
sage: N = M.new_subspace(); N ## line 535 ##
Modular Forms subspace of dimension 4 of Modular Forms space of dimension 6 for Congruence Subgroup Gamma0(17) of weight 4 over Rational Field
sage: N.basis() ## line 537 ##
[
q + 2*q^5 + O(q^6),
q^2 - 3/2*q^5 + O(q^6),
q^3 + O(q^6),
q^4 - 1/2*q^5 + O(q^6)
]
sage: ModularForms(12,4).new_submodule() ## line 547 ##
Modular Forms subspace of dimension 1 of Modular Forms space of dimension 9 for Congruence Subgroup Gamma0(12) of weight 4 over Rational Field
sage: sig_on_count() ## line 561 ##
0
sage: m = ModularForms(Gamma0(23),2); m ## line 594 ##
Modular Forms space of dimension 3 for Congruence Subgroup Gamma0(23) of weight 2 over Rational Field
sage: m.basis() ## line 596 ##
[
q - q^3 - q^4 + O(q^6),
q^2 - 2*q^3 - q^4 + 2*q^5 + O(q^6),
1 + 12/11*q + 36/11*q^2 + 48/11*q^3 + 84/11*q^4 + 72/11*q^5 + O(q^6)
]
sage: m._q_expansion([1,2,0], 5) ## line 602 ##
q + 2*q^2 - 5*q^3 - 3*q^4 + O(q^5)
sage: sig_on_count() ## line 604 ##
0
sage: m = ModularForms(GammaH(11,[4]), 2); m ## line 623 ##
Modular Forms space of dimension 2 for Congruence Subgroup Gamma_H(11) with H generated by [4] of weight 2 over Rational Field
sage: m._dim_cuspidal() ## line 625 ##
1
sage: sig_on_count() ## line 627 ##
0
sage: m = ModularForms(GammaH(13,[4]), 2); m ## line 644 ##
Modular Forms space of dimension 3 for Congruence Subgroup Gamma_H(13) with H generated by [4] of weight 2 over Rational Field
sage: m._dim_eisenstein() ## line 646 ##
3
sage: sig_on_count() ## line 648 ##
0
sage: m = ModularForms(GammaH(11,[2]), 2); m._dim_new_cuspidal() ## line 668 ##
1
sage: sig_on_count() ## line 670 ##
0
sage: m = ModularForms(Gamma0(11), 4) ## line 686 ##
sage: m._dim_new_eisenstein() ## line 687 ##
0
sage: m = ModularForms(Gamma0(11), 2) ## line 689 ##
sage: m._dim_new_eisenstein() ## line 690 ##
1
sage: sig_on_count() ## line 692 ##
0
sage: m = ModularForms(Gamma0(22), 2) ## line 720 ##
sage: v = m.eisenstein_params(); v ## line 721 ##
[(Dirichlet character modulo 22 of conductor 1 mapping 13 |--> 1, Dirichlet character modulo 22 of conductor 1 mapping 13 |--> 1, 2), (Dirichlet character modulo 22 of conductor 1 mapping 13 |--> 1, Dirichlet character modulo 22 of conductor 1 mapping 13 |--> 1, 11), (Dirichlet character modulo 22 of conductor 1 mapping 13 |--> 1, Dirichlet character modulo 22 of conductor 1 mapping 13 |--> 1, 22)]
sage: type(v) ## line 723 ##
<class 'sage.structure.sequence.Sequence_generic'>
sage: sig_on_count() ## line 725 ##
0
sage: ModularForms(27,2).eisenstein_series() ## line 745 ##
[
q^3 + O(q^6),
q - 3*q^2 + 7*q^4 - 6*q^5 + O(q^6),
1/12 + q + 3*q^2 + q^3 + 7*q^4 + 6*q^5 + O(q^6),
1/3 + q + 3*q^2 + 4*q^3 + 7*q^4 + 6*q^5 + O(q^6),
13/12 + q + 3*q^2 + 4*q^3 + 7*q^4 + 6*q^5 + O(q^6)
]
sage: ModularForms(Gamma1(5),3).eisenstein_series() ## line 756 ##
[
-1/5*zeta4 - 2/5 + q + (4*zeta4 + 1)*q^2 + (-9*zeta4 + 1)*q^3 + (4*zeta4 - 15)*q^4 + q^5 + O(q^6),
q + (zeta4 + 4)*q^2 + (-zeta4 + 9)*q^3 + (4*zeta4 + 15)*q^4 + 25*q^5 + O(q^6),
1/5*zeta4 - 2/5 + q + (-4*zeta4 + 1)*q^2 + (9*zeta4 + 1)*q^3 + (-4*zeta4 - 15)*q^4 + q^5 + O(q^6),
q + (-zeta4 + 4)*q^2 + (zeta4 + 9)*q^3 + (-4*zeta4 + 15)*q^4 + 25*q^5 + O(q^6)
]
sage: eps = DirichletGroup(13).0^2 ## line 766 ##
sage: ModularForms(eps,2).eisenstein_series() ## line 767 ##
[
-7/13*zeta6 - 11/13 + q + (2*zeta6 + 1)*q^2 + (-3*zeta6 + 1)*q^3 + (6*zeta6 - 3)*q^4 - 4*q^5 + O(q^6),
q + (zeta6 + 2)*q^2 + (-zeta6 + 3)*q^3 + (3*zeta6 + 3)*q^4 + 4*q^5 + O(q^6)
]
sage: sig_on_count() ## line 772 ##
0
sage: m = ModularForms(11,4) ## line 779 ##
sage: m._compute_q_expansion_basis(5) ## line 780 ##
[q + 3*q^3 - 6*q^4 + O(q^5), q^2 - 4*q^3 + 2*q^4 + O(q^5), 1 + O(q^5), q + 9*q^2 + 28*q^3 + 73*q^4 + O(q^5)]
sage: sig_on_count() ## line 782 ##
0
sage: M = ModularForms(11, 2) ## line 800 ##
sage: M._compute_hecke_matrix(6) ## line 801 ##
[ 2  0]
[ 0 12]
sage: M = ModularForms(1, 512) ## line 812 ##
sage: t = M._compute_hecke_matrix(5)     # long time (2s) ## line 813 ##
sage: f = t.charpoly()                   # long time (4s) ## line 814 ##
you are running out of primes. 1000 coprime primes found
```

CC:  @ClementPernet

Keywords: **random_fail**

Component: **linear algebra**

_Issue created by migration from https://trac.sagemath.org/ticket/15535_





---

archive/issue_events_219333.json:
```json
{
    "actor": "https://github.com/vbraun",
    "created_at": "2013-12-17T19:15:36Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/15535",
    "milestone_number": null,
    "milestone_title": "sage-6.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15535#event-219333"
}
```



---

archive/issue_events_219334.json:
```json
{
    "actor": "https://github.com/vbraun",
    "created_at": "2013-12-17T19:15:36Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/15535",
    "label": "https://github.com/sagemath/sage/labels/c%3A%20linear%20algebra",
    "label_color": "0000ff",
    "label_name": "c: linear algebra",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15535#event-219334"
}
```



---

archive/issue_events_219335.json:
```json
{
    "actor": "https://github.com/vbraun",
    "created_at": "2013-12-17T19:15:36Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/15535",
    "label": "https://github.com/sagemath/sage/labels/p%3A%20major%20/%203",
    "label_color": "ffbb00",
    "label_name": "p: major / 3",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15535#event-219335"
}
```



---

archive/issue_events_219336.json:
```json
{
    "actor": "https://github.com/vbraun",
    "created_at": "2013-12-17T19:15:36Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/15535",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "d73a4a",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15535#event-219336"
}
```



---

archive/issue_events_219337.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-01-30T21:20:52Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/15535",
    "milestone_number": null,
    "milestone_title": "sage-6.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15535#event-219337"
}
```



---

archive/issue_events_219338.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-01-30T21:20:52Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/15535",
    "milestone_number": null,
    "milestone_title": "sage-6.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15535#event-219338"
}
```



---

archive/issue_events_219339.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-05-06T15:20:58Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/15535",
    "milestone_number": null,
    "milestone_title": "sage-6.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15535#event-219339"
}
```



---

archive/issue_events_219340.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-05-06T15:20:58Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/15535",
    "milestone_number": null,
    "milestone_title": "sage-6.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15535#event-219340"
}
```



---

archive/issue_comments_194035.json:
```json
{
    "body": "Changed keywords from none to **random_fail**",
    "created_at": "2014-07-25T04:55:16Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/15535",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/15535#issuecomment-194035",
    "user": "https://github.com/vbraun"
}
```

Changed keywords from none to **random_fail**



---

archive/issue_events_219341.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-08-10T16:51:03Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/15535",
    "milestone_number": null,
    "milestone_title": "sage-6.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15535#event-219341"
}
```



---

archive/issue_events_219342.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-08-10T16:51:03Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/15535",
    "milestone_number": null,
    "milestone_title": "sage-6.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15535#event-219342"
}
```



---

archive/issue_comments_194036.json:
```json
{
    "body": "<div id=\"comment:5\" align=\"right\">comment:5</div>\n\nFollowing works for n=2..6. After several hours it fails for n=7 with same error message \"1000 coprime primes\". Failing function is eigenvalues(), but is this actually same bug?\n\n```\nfrom itertools import product\nS = [0,1]\nfor n in range(2,10):\n    smallest_value=1\n    for m in product(*[S if i>j else [0] if i<j else [1] for i in range(n) for j in range(n)]):\n        M = Matrix(ZZ,n,n,m)\n        t = min( (M*M.transpose()).eigenvalues() )\n        if t < smallest_value:\n            smallest_value = t\n            smallest_matrix=M\n    print \"N=\", n, \" Value\", smallest_value   \n    print smallest_matrix\n    print '-'*10\n```\n\nThis was tested on Sage 6.3. Also n=8 fails.",
    "created_at": "2014-08-20T10:14:59Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/15535",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/15535#issuecomment-194036",
    "user": "https://github.com/jm58660"
}
```

<div id="comment:5" align="right">comment:5</div>

Following works for n=2..6. After several hours it fails for n=7 with same error message "1000 coprime primes". Failing function is eigenvalues(), but is this actually same bug?

```
from itertools import product
S = [0,1]
for n in range(2,10):
    smallest_value=1
    for m in product(*[S if i>j else [0] if i<j else [1] for i in range(n) for j in range(n)]):
        M = Matrix(ZZ,n,n,m)
        t = min( (M*M.transpose()).eigenvalues() )
        if t < smallest_value:
            smallest_value = t
            smallest_matrix=M
    print "N=", n, " Value", smallest_value   
    print smallest_matrix
    print '-'*10
```

This was tested on Sage 6.3. Also n=8 fails.



---

archive/issue_comments_194037.json:
```json
{
    "body": "Branch: **[u/bhutz/ticket/15535](https://github.com/sagemath/sagetrac-mirror/tree/u/bhutz/ticket/15535)**",
    "created_at": "2014-12-22T02:07:01Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/15535",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/15535#issuecomment-194037",
    "user": "https://github.com/bhutz"
}
```

Branch: **[u/bhutz/ticket/15535](https://github.com/sagemath/sagetrac-mirror/tree/u/bhutz/ticket/15535)**



---

archive/issue_comments_194038.json:
```json
{
    "body": "Changed branch from **[u/bhutz/ticket/15535](https://github.com/sagemath/sagetrac-mirror/tree/u/bhutz/ticket/15535)** to none",
    "created_at": "2014-12-22T02:13:55Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/15535",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/15535#issuecomment-194038",
    "user": "https://github.com/bhutz"
}
```

Changed branch from **[u/bhutz/ticket/15535](https://github.com/sagemath/sagetrac-mirror/tree/u/bhutz/ticket/15535)** to none



---

archive/issue_comments_194039.json:
```json
{
    "body": "<div id=\"comment:7\" align=\"right\">comment:7</div>\n\nSorry, I had the wrong ticket checked out.",
    "created_at": "2014-12-22T02:13:55Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/15535",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/15535#issuecomment-194039",
    "user": "https://github.com/bhutz"
}
```

<div id="comment:7" align="right">comment:7</div>

Sorry, I had the wrong ticket checked out.



---

archive/issue_comments_194040.json:
```json
{
    "body": "<div id=\"comment:8\" align=\"right\">comment:8</div>\n\nI ran into this issue on Sage 6.4.1 trying to compute characteristic polynomials.  I was computing the characteristic polynomial of hundreds of thousands of 3x3, 4x4, ..., 8x8 integer matrices, and at some point I got the following:\n\n```\nsage: A = matrix(ZZ, 4, 4, [50528, 38927, 19455, 31617, 58686, 39770, 31059, 21905, 13382, 35615, 18158, 11629, 25923, 12324, 51823, 27000])\nsage: A.charpoly()\nyou are running out of primes. 1000 coprime primes found\n1\nsage: B = copy(A); B.charpoly()\nx^4 - 135456*x^3 + 1234244249*x^2 + 17242461420805*x - 995535814473032365\n```",
    "created_at": "2015-01-14T02:12:22Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/15535",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/15535#issuecomment-194040",
    "user": "https://github.com/roed314"
}
```

<div id="comment:8" align="right">comment:8</div>

I ran into this issue on Sage 6.4.1 trying to compute characteristic polynomials.  I was computing the characteristic polynomial of hundreds of thousands of 3x3, 4x4, ..., 8x8 integer matrices, and at some point I got the following:

```
sage: A = matrix(ZZ, 4, 4, [50528, 38927, 19455, 31617, 58686, 39770, 31059, 21905, 13382, 35615, 18158, 11629, 25923, 12324, 51823, 27000])
sage: A.charpoly()
you are running out of primes. 1000 coprime primes found
1
sage: B = copy(A); B.charpoly()
x^4 - 135456*x^3 + 1234244249*x^2 + 17242461420805*x - 995535814473032365
```



---

archive/issue_comments_194041.json:
```json
{
    "body": "<div id=\"comment:9\" align=\"right\">comment:9</div>\n\nSame happened with #17640.",
    "created_at": "2015-01-18T18:58:33Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/15535",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/15535#issuecomment-194041",
    "user": "https://github.com/nathanncohen"
}
```

<div id="comment:9" align="right">comment:9</div>

Same happened with #17640.



---

archive/issue_comments_194042.json:
```json
{
    "body": "<div id=\"comment:10\" align=\"right\">comment:10</div>\n\nJust got another report of this on `sage-release`...",
    "created_at": "2015-04-13T19:05:21Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/15535",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/15535#issuecomment-194042",
    "user": "https://github.com/jdemeyer"
}
```

<div id="comment:10" align="right">comment:10</div>

Just got another report of this on `sage-release`...



---

archive/issue_events_219343.json:
```json
{
    "actor": "https://github.com/nexttime",
    "created_at": "2015-04-13T19:51:58Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/15535",
    "milestone_number": null,
    "milestone_title": "sage-6.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15535#event-219343"
}
```



---

archive/issue_events_219344.json:
```json
{
    "actor": "https://github.com/nexttime",
    "created_at": "2015-04-13T19:51:58Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/15535",
    "milestone_number": null,
    "milestone_title": "sage-6.6",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15535#event-219344"
}
```



---

archive/issue_events_219345.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2015-09-19T11:00:40Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/15535",
    "milestone_number": null,
    "milestone_title": "sage-6.6",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15535#event-219345"
}
```



---

archive/issue_events_219346.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2015-09-19T11:00:40Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/15535",
    "milestone_number": null,
    "milestone_title": "sage-6.9",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15535#event-219346"
}
```



---

archive/issue_comments_194043.json:
```json
{
    "body": "<div id=\"comment:13\" align=\"right\">comment:13</div>\n\nI just ran into this when trying to compute newforms:\n\n```\nsage:  N_83_4 = Newforms(Gamma1(83),4,names='a')\nyou are running out of primes. 1000 coprime primes found\n```\nand sage ends up aborting to compute the decomposition in the end:\n\n```\nAssertionError: bug in decomposition; the sum of the dimensions (=0) of the factors must equal the dimension (800) of the acted on space:\nFactors found: [\n\n]\nSpace: Vector space of degree 902 and dimension 800 over Rational Field\nBasis matrix:\n800 x 902 dense matrix over Rational Field\n```",
    "created_at": "2016-05-30T17:02:14Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/15535",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/15535#issuecomment-194043",
    "user": "https://github.com/sagetrac-ehlen"
}
```

<div id="comment:13" align="right">comment:13</div>

I just ran into this when trying to compute newforms:

```
sage:  N_83_4 = Newforms(Gamma1(83),4,names='a')
you are running out of primes. 1000 coprime primes found
```
and sage ends up aborting to compute the decomposition in the end:

```
AssertionError: bug in decomposition; the sum of the dimensions (=0) of the factors must equal the dimension (800) of the acted on space:
Factors found: [

]
Space: Vector space of degree 902 and dimension 800 over Rational Field
Basis matrix:
800 x 902 dense matrix over Rational Field
```



---

archive/issue_comments_194044.json:
```json
{
    "body": "<div id=\"comment:14\" align=\"right\">comment:14</div>\n\nFrom sage-devel:\n\n```\nUpdate: I think I finally found the bug that led some rare computations to hang forever: givaro's random iterator was seed from the 6 digits of the current time microseconds, and could, with proba 10^-6 be seeded with 0, and the congurential generator would then always output 0, causing the search for a non-zero krylov vector to hang forever!\n\nThis might be also a fix to https://trac.sagemath.org/ticket/15535\n\n[...]\n\nCl\u00e9ment\n```\n\nSo the probability of failure is actually configurable! B)",
    "created_at": "2016-09-28T12:33:33Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/15535",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/15535#issuecomment-194044",
    "user": "https://github.com/nexttime"
}
```

<div id="comment:14" align="right">comment:14</div>

From sage-devel:

```
Update: I think I finally found the bug that led some rare computations to hang forever: givaro's random iterator was seed from the 6 digits of the current time microseconds, and could, with proba 10^-6 be seeded with 0, and the congurential generator would then always output 0, causing the search for a non-zero krylov vector to hang forever!

This might be also a fix to https://trac.sagemath.org/ticket/15535

[...]

Clément
```

So the probability of failure is actually configurable! B)



---

archive/issue_events_219347.json:
```json
{
    "actor": "https://github.com/nexttime",
    "created_at": "2016-09-28T12:33:33Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/15535",
    "milestone_number": null,
    "milestone_title": "sage-6.9",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15535#event-219347"
}
```



---

archive/issue_events_219348.json:
```json
{
    "actor": "https://github.com/nexttime",
    "created_at": "2016-09-28T12:33:33Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/15535",
    "milestone_number": null,
    "milestone_title": "sage-7.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15535#event-219348"
}
```



---

archive/issue_comments_194045.json:
```json
{
    "body": "<div id=\"comment:15\" align=\"right\">comment:15</div>\n\nand what about this one ? also fixed by #24214 ? could be closed ?",
    "created_at": "2018-06-27T05:29:36Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/15535",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/15535#issuecomment-194045",
    "user": "https://github.com/fchapoton"
}
```

<div id="comment:15" align="right">comment:15</div>

and what about this one ? also fixed by #24214 ? could be closed ?



---

archive/issue_events_219349.json:
```json
{
    "actor": "https://github.com/fchapoton",
    "created_at": "2018-06-27T05:29:36Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/15535",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "7fff00",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15535#event-219349"
}
```



---

archive/issue_events_219350.json:
```json
{
    "actor": "https://github.com/fchapoton",
    "created_at": "2018-06-27T05:29:36Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/15535",
    "milestone_number": null,
    "milestone_title": "sage-7.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15535#event-219350"
}
```



---

archive/issue_comments_194046.json:
```json
{
    "body": "<div id=\"comment:16\" align=\"right\">comment:16</div>\n\nI haven't seen this in a long time",
    "created_at": "2018-06-27T06:04:11Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/15535",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/15535#issuecomment-194046",
    "user": "https://github.com/vbraun"
}
```

<div id="comment:16" align="right">comment:16</div>

I haven't seen this in a long time



---

archive/issue_events_219351.json:
```json
{
    "actor": "https://github.com/vbraun",
    "created_at": "2018-06-27T06:04:11Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/15535",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "7fff00",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15535#event-219351"
}
```



---

archive/issue_events_219352.json:
```json
{
    "actor": "https://github.com/vbraun",
    "created_at": "2018-06-27T06:04:11Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/15535",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15535#event-219352"
}
```
