# Issue 15830: extracting coefficient x-1 out of symbolic series wrong

archive/issues_015593.json:
```json
{
    "body": "\n```\nsage: x.series(x==1,10).coefficient(x-1,0)\nx\n```\nwhich is wrong. It should be `1`, which can be seen by \n\n```\nsage: x.series(x==1,10)\n1 + 1*(x - 1)\n```\n\nWe also have wrong results here:\n\n```\nsage: x.series(x==1,10).coefficient(x-1,1)\n0\nsage: x.series(x==1,10).coefficient(x-1)\n0\n```\n\n**Keywords:** symbolic, series, coefficient, wrong\n\nIssue created by migration from https://trac.sagemath.org/ticket/15830\n\n",
    "created_at": "2014-02-18T10:27:20Z",
    "labels": [
        "component: symbolics",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-6.4",
    "title": "extracting coefficient x-1 out of symbolic series wrong",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/15830",
    "user": "https://github.com/dkrenn"
}
```

```
sage: x.series(x==1,10).coefficient(x-1,0)
x
```
which is wrong. It should be `1`, which can be seen by 

```
sage: x.series(x==1,10)
1 + 1*(x - 1)
```

We also have wrong results here:

```
sage: x.series(x==1,10).coefficient(x-1,1)
0
sage: x.series(x==1,10).coefficient(x-1)
0
```

**Keywords:** symbolic, series, coefficient, wrong

Issue created by migration from https://trac.sagemath.org/ticket/15830





---

archive/issue_events_140793.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-05-06T15:20:58Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/15830",
    "milestone": "sage-6.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/15830#event-140793"
}
```



---

archive/issue_events_140794.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-05-06T15:20:58Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/15830",
    "milestone": "sage-6.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/15830#event-140794"
}
```



---

archive/issue_events_140795.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-08-10T16:51:03Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/15830",
    "milestone": "sage-6.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/15830#event-140795"
}
```



---

archive/issue_events_140796.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-08-10T16:51:03Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/15830",
    "milestone": "sage-6.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/15830#event-140796"
}
```



---

archive/issue_comments_202798.json:
```json
{
    "body": "<a id='comment:3'></a>\nAlso `coefficient` can only deal with monomials: \n\n```\nsage: (x-1).coefficient(x-1)\n0\n```\nDifferent ticket?",
    "created_at": "2014-12-25T08:54:13Z",
    "issue": "https://github.com/sagemath/sagetest/issues/15830",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/15830#issuecomment-202798",
    "user": "https://github.com/rwst"
}
```

<a id='comment:3'></a>
Also `coefficient` can only deal with monomials: 

```
sage: (x-1).coefficient(x-1)
0
```
Different ticket?
