# Issue 15854: series of x^s, when s is symbolic

archive/issues_015617.json:
```json
{
    "body": "We have the following behaviour:\n\n```\nsage: var('s')\ns\nsage: (x^s).series(x, 0)\nOrder(1)\nsage: (x^s).series(x, 1)\n(0^s) + Order(x)\nsage: (x^s).series(x, 2)\n---------------------------------------------------------------------------\nValueError                                Traceback (most recent call last)\n<ipython-input-4-5abc79662303> in <module>()\n----> 1 (x**s).series(x, Integer(2))\n\n/usr/opt/sage-6.1.1/local/lib/python2.7/site-packages/sage/symbolic/expression.so in sage.symbolic.expression.Expression.series (sage/symbolic/expression.cpp:17596)()\n\nValueError: power::eval(): division by zero\n```\nThis output is weird and definitely wrong (since the correct output depends strongly on `s`.). \n\n\n**CC:**  @mforets\n\n**Keywords:** symbolic, series, exponent\n\nIssue created by migration from https://trac.sagemath.org/ticket/15854\n\n",
    "created_at": "2014-02-24T09:25:55Z",
    "labels": [
        "component: symbolics",
        "bug",
        "needs work"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-6.4",
    "title": "series of x^s, when s is symbolic",
    "type": "issue",
    "url": "https://github.com/sagemath/sage/issues/15854",
    "user": "https://github.com/dkrenn"
}
```
We have the following behaviour:

```
sage: var('s')
s
sage: (x^s).series(x, 0)
Order(1)
sage: (x^s).series(x, 1)
(0^s) + Order(x)
sage: (x^s).series(x, 2)
---------------------------------------------------------------------------
ValueError                                Traceback (most recent call last)
<ipython-input-4-5abc79662303> in <module>()
----> 1 (x**s).series(x, Integer(2))

/usr/opt/sage-6.1.1/local/lib/python2.7/site-packages/sage/symbolic/expression.so in sage.symbolic.expression.Expression.series (sage/symbolic/expression.cpp:17596)()

ValueError: power::eval(): division by zero
```
This output is weird and definitely wrong (since the correct output depends strongly on `s`.). 


**CC:**  @mforets

**Keywords:** symbolic, series, exponent

Issue created by migration from https://trac.sagemath.org/ticket/15854





---

archive/issue_events_141010.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-05-06T15:20:58Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/15854",
    "milestone": "sage-6.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15854#event-141010"
}
```



---

archive/issue_events_141011.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-05-06T15:20:58Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/15854",
    "milestone": "sage-6.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15854#event-141011"
}
```



---

archive/issue_events_141012.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-08-10T16:51:03Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/15854",
    "milestone": "sage-6.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15854#event-141012"
}
```



---

archive/issue_events_141013.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-08-10T16:51:03Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/15854",
    "milestone": "sage-6.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15854#event-141013"
}
```



---

archive/issue_comments_203070.json:
```json
{
    "body": "<a id='comment:3'></a>\nStill there in 6.6",
    "created_at": "2015-04-16T20:13:34Z",
    "issue": "https://github.com/sagemath/sage/issues/15854",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/15854#issuecomment-203070",
    "user": "https://github.com/dkrenn"
}
```

<a id='comment:3'></a>
Still there in 6.6



---

archive/issue_comments_203071.json:
```json
{
    "body": "<a id='comment:4'></a>\nCould you please specify what output exactly to expect?",
    "created_at": "2015-06-14T06:38:49Z",
    "issue": "https://github.com/sagemath/sage/issues/15854",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/15854#issuecomment-203071",
    "user": "https://github.com/rwst"
}
```

<a id='comment:4'></a>
Could you please specify what output exactly to expect?



---

archive/issue_events_141014.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2015-06-14T06:38:49Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/15854",
    "label": "needs info",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15854#event-141014"
}
```



---

archive/issue_events_141015.json:
```json
{
    "actor": "https://github.com/mforets",
    "created_at": "2017-05-03T18:38:43Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/15854",
    "label": "needs info",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15854#event-141015"
}
```



---

archive/issue_events_141016.json:
```json
{
    "actor": "https://github.com/mforets",
    "created_at": "2017-05-03T18:38:43Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/15854",
    "label": "needs work",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/15854#event-141016"
}
```



---

archive/issue_comments_203072.json:
```json
{
    "body": "<a id='comment:5'></a>\nthere is no error if you declare `s` as integer:\n\n```\nsage: s = SR.var('s', domain='integer')\nsage: (x^s).series(x, 2) # ok (?) or we expect x^s\n(0^s) + (0^(s - 1)*s)*x + Order(x^2)\n```\n\nto compare, [W|A](http://www.wolframalpha.com/input/?i=series+x%5En+to+order+2) gives various series representations. in this case maybe it could answer just `x^s`?\n\nhowever, there is this closely related issue:\n\n```\nsage: n = SR.var('n', domain='integer')\nsage: ((x+1/x)**n).series(x)  # wrong (what happened with n?)\n1 + Order(x^20)\n```\none expects something like `1/x^n*(1 + n*x^2 + O(x^3))`.\n\nthis behaviour has side effects for example if you want to compute the residue of this function:\n\n```\nsage: f = 1/x*((x^2+1)/(2*x))**(2*k)\nsage: f.residue(x==0)   # wrong\n(1/2)^(2*k)\n```\n\nin fact:\n\n```\nsage: f(k=4)\n1/256*(x^2 + 1)^8/x^9\nsage: f(k=4).residue(x==0)\n35/128\nsage: f.residue(x==0).subs(k==4)\n1/256\nsage: res(k) = 1/2**(2*k)*binomial(2*k, k)   # correct answer\nsage: res(k=4)\n35/128\n```\n\na bit unrelated, but let me mention that SymPy's `residue` gives wrong result for this one (0), and giac gives unevaluated expression.",
    "created_at": "2017-05-03T18:38:43Z",
    "issue": "https://github.com/sagemath/sage/issues/15854",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/15854#issuecomment-203072",
    "user": "https://github.com/mforets"
}
```

<a id='comment:5'></a>
there is no error if you declare `s` as integer:

```
sage: s = SR.var('s', domain='integer')
sage: (x^s).series(x, 2) # ok (?) or we expect x^s
(0^s) + (0^(s - 1)*s)*x + Order(x^2)
```

to compare, [W|A](http://www.wolframalpha.com/input/?i=series+x%5En+to+order+2) gives various series representations. in this case maybe it could answer just `x^s`?

however, there is this closely related issue:

```
sage: n = SR.var('n', domain='integer')
sage: ((x+1/x)**n).series(x)  # wrong (what happened with n?)
1 + Order(x^20)
```
one expects something like `1/x^n*(1 + n*x^2 + O(x^3))`.

this behaviour has side effects for example if you want to compute the residue of this function:

```
sage: f = 1/x*((x^2+1)/(2*x))**(2*k)
sage: f.residue(x==0)   # wrong
(1/2)^(2*k)
```

in fact:

```
sage: f(k=4)
1/256*(x^2 + 1)^8/x^9
sage: f(k=4).residue(x==0)
35/128
sage: f.residue(x==0).subs(k==4)
1/256
sage: res(k) = 1/2**(2*k)*binomial(2*k, k)   # correct answer
sage: res(k=4)
35/128
```

a bit unrelated, but let me mention that SymPy's `residue` gives wrong result for this one (0), and giac gives unevaluated expression.
