# Issue 9417: Tamagawa number calculated incorrectly

archive/issues_009417.json:
```json
{
    "assignees": [],
    "body": "In 4.4.4 the following Tamagawa number gets evaluated as 2:\n\n```\nsage: K.<a> = NumberField(x^2+18*x+1)\nsage: E = EllipticCurve(K, [0, -36, 0, 320, 0])\nsage: E.tamagawa_number(K.ideal(2))\n2\n```\n\nAccording to Magma this should be 4.\n\n**Assignee:** @JohnCremona\n\n**CC:**  @williamstein justin\n\n**Keywords:** tamagawa_number local_data\n\n**Author:** John Cremona\n\n**Reviewer:** Robert Miller\n\n**Merged:** sage-4.7.rc0\n\nIssue created by migration from https://trac.sagemath.org/ticket/9417\n\n",
    "closed_at": "2011-04-20T12:51:16Z",
    "created_at": "2010-07-03T03:41:37Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20elliptic%20curves",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-4.7",
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "Tamagawa number calculated incorrectly",
    "type": "issue",
    "updated_at": "2011-04-20T12:51:16Z",
    "url": "https://github.com/sagemath/sage/issues/9417",
    "user": "https://github.com/arminstraub"
}
```
In 4.4.4 the following Tamagawa number gets evaluated as 2:

```
sage: K.<a> = NumberField(x^2+18*x+1)
sage: E = EllipticCurve(K, [0, -36, 0, 320, 0])
sage: E.tamagawa_number(K.ideal(2))
2
```

According to Magma this should be 4.

**Assignee:** @JohnCremona

**CC:**  @williamstein justin

**Keywords:** tamagawa_number local_data

**Author:** John Cremona

**Reviewer:** Robert Miller

**Merged:** sage-4.7.rc0

Issue created by migration from https://trac.sagemath.org/ticket/9417





---

archive/issue_comments_082400.json:
```json
{
    "body": "<a id='comment:1'></a>\nAs the author of both Sage's and Magma's code for Tamagawa numbers, I have been tracking this one down. It turns out to be due to a bug in how elements of the rings of integers are mapped into residue fields:\n\n```\nsage: K.<a> = NumberField(x^2+18*x+1)\nsage: P = K.ideal(2)\nsage: F = K.residue_field(P)\nsage: R = PolynomialRing(F, 'x')\nsage: R([0, a, a, 1])\nx^3 + abar*x^2 + abar*x\nsage: F(a)\n1\nsage: a.minpoly()\nx^2 + 18*x + 1\nsage: F.gen()\nabar\nsage: F.gen().minpoly()\nx^2 + x + 1\n```\nThe polynomial `x<sup>3+a*x</sup>2+a*x` reduced modulo P=(2) wrongly to `x<sup>3+abar*x</sup>2+abar*x`. Although the generator of the residue field F is suggestively called abar, it it *not* the reduction of a mod P (which is 1 mod P).\n\nI will open a new ticket for that, and try to fix it. This ticket can probably then be closed, so watch this space.",
    "created_at": "2011-03-26T22:50:02Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/9417",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/9417#issuecomment-82400",
    "user": "https://github.com/JohnCremona"
}
```

<a id='comment:1'></a>
As the author of both Sage's and Magma's code for Tamagawa numbers, I have been tracking this one down. It turns out to be due to a bug in how elements of the rings of integers are mapped into residue fields:

```
sage: K.<a> = NumberField(x^2+18*x+1)
sage: P = K.ideal(2)
sage: F = K.residue_field(P)
sage: R = PolynomialRing(F, 'x')
sage: R([0, a, a, 1])
x^3 + abar*x^2 + abar*x
sage: F(a)
1
sage: a.minpoly()
x^2 + 18*x + 1
sage: F.gen()
abar
sage: F.gen().minpoly()
x^2 + x + 1
```
The polynomial `x<sup>3+a*x</sup>2+a*x` reduced modulo P=(2) wrongly to `x<sup>3+abar*x</sup>2+abar*x`. Although the generator of the residue field F is suggestively called abar, it it *not* the reduction of a mod P (which is 1 mod P).

I will open a new ticket for that, and try to fix it. This ticket can probably then be closed, so watch this space.



---

archive/issue_comments_082401.json:
```json
{
    "body": "<a id='comment:2'></a>\nSee #11055",
    "created_at": "2011-03-26T22:52:30Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/9417",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/9417#issuecomment-82401",
    "user": "https://github.com/JohnCremona"
}
```

<a id='comment:2'></a>
See #11055



---

archive/issue_comments_082402.json:
```json
{
    "body": "**Attachment:** [trac_9417-tamagawa.patch.gz](https://github.com/sagemath/sage/files/ticket9417/trac_9417-tamagawa.patch.gz)\n\nApplies to 4.7.alpha2",
    "created_at": "2011-03-27T19:13:32Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/9417",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/9417#issuecomment-82402",
    "user": "https://github.com/JohnCremona"
}
```

**Attachment:** [trac_9417-tamagawa.patch.gz](https://github.com/sagemath/sage/files/ticket9417/trac_9417-tamagawa.patch.gz)

Applies to 4.7.alpha2



---

archive/issue_comments_082403.json:
```json
{
    "body": "**Author:** John Cremona",
    "created_at": "2011-03-27T19:15:35Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/9417",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/9417#issuecomment-82403",
    "user": "https://github.com/JohnCremona"
}
```

**Author:** John Cremona



---

archive/issue_events_069127.json:
```json
{
    "actor": "https://github.com/JohnCremona",
    "created_at": "2011-03-27T19:15:35Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/9417",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "008080",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/9417#event-69127"
}
```



---

archive/issue_comments_082404.json:
```json
{
    "body": "<a id='comment:3'></a>\nThe patch applies the simple workaround described at #11055.  Now we correctly get\n\n```\nsage: K.<a> = NumberField(x^2+18*x+1)\nsage: E = EllipticCurve(K, [0, -36, 0, 320, 0])\nsage: E.tamagawa_number(K.ideal(2))\n4\n```\nand a doctest has been added.",
    "created_at": "2011-03-27T19:15:35Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/9417",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/9417#issuecomment-82404",
    "user": "https://github.com/JohnCremona"
}
```

<a id='comment:3'></a>
The patch applies the simple workaround described at #11055.  Now we correctly get

```
sage: K.<a> = NumberField(x^2+18*x+1)
sage: E = EllipticCurve(K, [0, -36, 0, 320, 0])
sage: E.tamagawa_number(K.ideal(2))
4
```
and a doctest has been added.



---

archive/issue_events_069128.json:
```json
{
    "actor": "https://github.com/rlmill",
    "created_at": "2011-04-17T21:34:31Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/9417",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "008080",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/9417#event-69128"
}
```



---

archive/issue_events_069129.json:
```json
{
    "actor": "https://github.com/rlmill",
    "created_at": "2011-04-17T21:34:31Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/9417",
    "label": "https://github.com/sagemath/sage/labels/positive%20review",
    "label_color": "008080",
    "label_name": "positive review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/9417#event-69129"
}
```



---

archive/issue_comments_082405.json:
```json
{
    "body": "**Reviewer:** Robert Miller",
    "created_at": "2011-04-17T21:34:31Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/9417",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/9417#issuecomment-82405",
    "user": "https://github.com/rlmill"
}
```

**Reviewer:** Robert Miller



---

archive/issue_comments_082406.json:
```json
{
    "body": "<a id='comment:4'></a>\nLooks good to me!",
    "created_at": "2011-04-17T21:34:31Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/9417",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/9417#issuecomment-82406",
    "user": "https://github.com/rlmill"
}
```

<a id='comment:4'></a>
Looks good to me!



---

archive/issue_events_069130.json:
```json
{
    "actor": "https://github.com/rlmill",
    "created_at": "2011-04-17T21:34:31Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/9417",
    "milestone_number": null,
    "milestone_title": "sage-4.7",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/9417#event-69130"
}
```



---

archive/issue_events_069131.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2011-04-20T12:51:16Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/9417",
    "label": "https://github.com/sagemath/sage/labels/positive%20review",
    "label_color": "008080",
    "label_name": "positive review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/9417#event-69131"
}
```



---

archive/issue_events_069132.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2011-04-20T12:51:16Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/9417",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/9417#event-69132"
}
```



---

archive/issue_comments_082407.json:
```json
{
    "body": "**Merged:** sage-4.7.rc0",
    "created_at": "2011-04-20T12:51:16Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/9417",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/9417#issuecomment-82407",
    "user": "https://github.com/jdemeyer"
}
```

**Merged:** sage-4.7.rc0
