# Issue 9458: Bug with variable names in solve()

archive/issues_009458.json:
```json
{
    "body": "Some variable names yield strange behavior with the solve() function. Here is an example:\n\n```\n----------------------------------------------------------------------\n| Sage Version 4.4.2, Release Date: 2010-05-19                       |\n| Type notebook() for the GUI, and license() for information.        |\n----------------------------------------------------------------------\nsage: var('d2 d3 x')\n(d2, d3, x)\nsage: solve((d2+d3)*x==1, x)\n[x == factorial(2*k + 6*n)/(d3*factorial(2*k + 6*n) + factorial(k + 3*n - 1))]\n```\n\nThese factorials are strange. They don't occur with other variable names, e.g.,\n\n```\nsage: var('y1 y2 x')\n(y1, y2, x)\nsage: solve((y1+y2)*x==1, x)\n[x == (1/(y1 + y2))]\n```\n\nDocumentation for solve() does not mention reserved variable names.\n\n**Assignee:** @aghitza\n\n**Keywords:** var solve name factorial\n\nIssue created by migration from https://trac.sagemath.org/ticket/9458\n\n",
    "closed_at": "2010-07-08T19:37:31Z",
    "created_at": "2010-07-08T18:33:47Z",
    "labels": [
        "component: algebra",
        "bug",
        "duplicate"
    ],
    "title": "Bug with variable names in solve()",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/9458",
    "user": "https://trac.sagemath.org/admin/accounts/users/tastalian"
}
```
Some variable names yield strange behavior with the solve() function. Here is an example:

```
----------------------------------------------------------------------
| Sage Version 4.4.2, Release Date: 2010-05-19                       |
| Type notebook() for the GUI, and license() for information.        |
----------------------------------------------------------------------
sage: var('d2 d3 x')
(d2, d3, x)
sage: solve((d2+d3)*x==1, x)
[x == factorial(2*k + 6*n)/(d3*factorial(2*k + 6*n) + factorial(k + 3*n - 1))]
```

These factorials are strange. They don't occur with other variable names, e.g.,

```
sage: var('y1 y2 x')
(y1, y2, x)
sage: solve((y1+y2)*x==1, x)
[x == (1/(y1 + y2))]
```

Documentation for solve() does not mention reserved variable names.

**Assignee:** @aghitza

**Keywords:** var solve name factorial

Issue created by migration from https://trac.sagemath.org/ticket/9458





---

archive/issue_events_069641.json:
```json
{
    "actor": "https://github.com/mwhansen",
    "created_at": "2010-07-08T19:37:31Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/9458",
    "milestone": "sage-4.5",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/9458#event-69641"
}
```



---

archive/issue_events_069642.json:
```json
{
    "actor": "https://github.com/mwhansen",
    "created_at": "2010-07-08T19:37:31Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sagetest/issues/9458",
    "label": "duplicate",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/9458#event-69642"
}
```



---

archive/issue_comments_083359.json:
```json
{
    "body": "<a id='comment:1'></a>\nThis is basically a duplicate of #8734.",
    "created_at": "2010-07-08T19:37:31Z",
    "issue": "https://github.com/sagemath/sagetest/issues/9458",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/9458#issuecomment-83359",
    "user": "https://github.com/mwhansen"
}
```

<a id='comment:1'></a>
This is basically a duplicate of #8734.



---

archive/issue_events_069643.json:
```json
{
    "actor": "https://github.com/mwhansen",
    "created_at": "2010-07-08T19:37:31Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/9458",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/9458#event-69643"
}
```
