# Issue 9980: Deprecate functionality of `PowerSeriesRing` which conflicts with construction of multivariate power series

archive/issues_009979.json:
```json
{
    "body": "Multivariate power series are implemented by #1956.  As mentioned on that ticket, the existing code for `PowerSeriesRing` did not allow multivariate power series rings to be constructed using the same arguments as multivariate polynomials accept:\n\n```\nsage: T = PowerSeriesRing(QQ,3,'t'); T\nMultivariate Power Series Ring in t0, t1, t2 over Rational Field\n\nsage: T = PowerSeriesRing(QQ,'t',3); T\nPower Series Ring in t over Rational Field\nsage: T.default_prec()\n3\n\nsage: P = PolynomialRing(QQ,'t',3); P\nMultivariate Polynomial Ring in t0, t1, t2 over Rational Field\n```\n\nThere is a non-trivial body of code (elliptic curves, and maybe p-adics) which makes use of this syntax.\n\n\n\n**Assignee:** @malb\n\n**CC:**  @nilesjohnson\n\n**Keywords:** power series, deprecation warning\n\n**Status:** new\n\nIssue created by migration from https://trac.sagemath.org/ticket/9980\n\n",
    "created_at": "2010-09-23T17:44:33Z",
    "labels": [
        "component: commutative algebra",
        "bug"
    ],
    "title": "Deprecate functionality of `PowerSeriesRing` which conflicts with construction of multivariate power series",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/9980",
    "user": "https://github.com/nilesjohnson"
}
```
Multivariate power series are implemented by #1956.  As mentioned on that ticket, the existing code for `PowerSeriesRing` did not allow multivariate power series rings to be constructed using the same arguments as multivariate polynomials accept:

```
sage: T = PowerSeriesRing(QQ,3,'t'); T
Multivariate Power Series Ring in t0, t1, t2 over Rational Field

sage: T = PowerSeriesRing(QQ,'t',3); T
Power Series Ring in t over Rational Field
sage: T.default_prec()
3

sage: P = PolynomialRing(QQ,'t',3); P
Multivariate Polynomial Ring in t0, t1, t2 over Rational Field
```

There is a non-trivial body of code (elliptic curves, and maybe p-adics) which makes use of this syntax.



**Assignee:** @malb

**CC:**  @nilesjohnson

**Keywords:** power series, deprecation warning

**Status:** new

Issue created by migration from https://trac.sagemath.org/ticket/9980


