# Issue 21123: monomials() and lt() for expansions of SymmetricFunctions over SymbolicRing broken

archive/issues_020886.json:
```json
{
    "assignees": [],
    "body": "smc user reported these inconsistencies related to listing monomials of a symmetric function:\n\n```\ne = SymmetricFunctions(SR).e()\nf = e([2]).expand(3)\nf\nf.monomials()\nf.lt()\n\nx0*x1 + x0*x2 + x1*x2\n[1]\nx0*x1 + x0*x2 + x1*x2\n```\n\ni.e. just `[1]` and the whole polynomial, while over `QQ`:\n\n```\ne = SymmetricFunctions(QQ).e()\nf = e([2]).expand(3)\nf\nf.monomials()\nf.lt()\n\nx0*x1 + x0*x2 + x1*x2\n[x0*x1, x0*x2, x1*x2]\nx0*x1\n```\n\nlists all three monomials and only one term for `lt()`.\n\nCC:  @nthiery\n\nComponent: **symbolics**\n\n_Issue created by migration from https://trac.sagemath.org/ticket/21123_\n\n",
    "created_at": "2016-07-29T08:28:57Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/c%3A%20symbolics",
        "https://github.com/sagemath/sage/labels/p%3A%20major%20/%203",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "monomials() and lt() for expansions of SymmetricFunctions over SymbolicRing broken",
    "type": "issue",
    "updated_at": "2022-12-29T01:36:35Z",
    "url": "https://github.com/sagemath/sage/issues/21123",
    "user": "https://github.com/haraldschilly"
}
```
smc user reported these inconsistencies related to listing monomials of a symmetric function:

```
e = SymmetricFunctions(SR).e()
f = e([2]).expand(3)
f
f.monomials()
f.lt()

x0*x1 + x0*x2 + x1*x2
[1]
x0*x1 + x0*x2 + x1*x2
```

i.e. just `[1]` and the whole polynomial, while over `QQ`:

```
e = SymmetricFunctions(QQ).e()
f = e([2]).expand(3)
f
f.monomials()
f.lt()

x0*x1 + x0*x2 + x1*x2
[x0*x1, x0*x2, x1*x2]
x0*x1
```

lists all three monomials and only one term for `lt()`.

CC:  @nthiery

Component: **symbolics**

_Issue created by migration from https://trac.sagemath.org/ticket/21123_





---

archive/issue_events_294388.json:
```json
{
    "actor": "https://github.com/haraldschilly",
    "created_at": "2016-07-29T08:28:57Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/21123",
    "milestone_number": null,
    "milestone_title": "sage-7.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/21123#event-294388"
}
```



---

archive/issue_events_294389.json:
```json
{
    "actor": "https://github.com/haraldschilly",
    "created_at": "2016-07-29T08:28:57Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/21123",
    "label": "https://github.com/sagemath/sage/labels/c%3A%20symbolics",
    "label_color": "0000ff",
    "label_name": "c: symbolics",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/21123#event-294389"
}
```



---

archive/issue_events_294390.json:
```json
{
    "actor": "https://github.com/haraldschilly",
    "created_at": "2016-07-29T08:28:57Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/21123",
    "label": "https://github.com/sagemath/sage/labels/p%3A%20major%20/%203",
    "label_color": "ffbb00",
    "label_name": "p: major / 3",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/21123#event-294390"
}
```



---

archive/issue_events_294391.json:
```json
{
    "actor": "https://github.com/haraldschilly",
    "created_at": "2016-07-29T08:28:57Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/21123",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "d73a4a",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/21123#event-294391"
}
```



---

archive/issue_comments_307694.json:
```json
{
    "body": "<div id=\"comment:1\" align=\"right\">comment:1</div>\n\nMost probably `SymmetricFunctions` should not allow `SR` as an argument. By right, \n\n```\ne = SymmetricFunctions(SR).e()\nf = e([2]).expand(3)\n```\nshould create `f` in `SR`, but it does something totally different:\n\n```\nsage: type(f)\n<class 'sage.rings.polynomial.multi_polynomial_element.MPolynomial_polydict'>\n```\nHowever it is possible to convert `f` into a symbolic expression:\n\n```\nsage: ff=SR(f)\nsage: type(ff)\n<type 'sage.symbolic.expression.Expression'>\nsage: ff.operands()\n[x0*x1, x0*x2, x1*x2]\n```\nSo the latter might be used as a workaround...",
    "created_at": "2016-07-29T11:03:02Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/21123",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/21123#issuecomment-307694",
    "user": "https://github.com/dimpase"
}
```

<div id="comment:1" align="right">comment:1</div>

Most probably `SymmetricFunctions` should not allow `SR` as an argument. By right, 

```
e = SymmetricFunctions(SR).e()
f = e([2]).expand(3)
```
should create `f` in `SR`, but it does something totally different:

```
sage: type(f)
<class 'sage.rings.polynomial.multi_polynomial_element.MPolynomial_polydict'>
```
However it is possible to convert `f` into a symbolic expression:

```
sage: ff=SR(f)
sage: type(ff)
<type 'sage.symbolic.expression.Expression'>
sage: ff.operands()
[x0*x1, x0*x2, x1*x2]
```
So the latter might be used as a workaround...



---

archive/issue_comments_307695.json:
```json
{
    "body": "<div id=\"comment:2\" align=\"right\">comment:2</div>\n\nNicolas, do you know who can comment on this, what would be a way to resolve this?",
    "created_at": "2016-07-29T11:05:40Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/21123",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/21123#issuecomment-307695",
    "user": "https://github.com/dimpase"
}
```

<div id="comment:2" align="right">comment:2</div>

Nicolas, do you know who can comment on this, what would be a way to resolve this?



---

archive/issue_events_294392.json:
```json
{
    "actor": "https://github.com/dimpase",
    "created_at": "2016-07-29T11:05:40Z",
    "event": "renamed",
    "issue": "https://github.com/sagemath/sage/issues/21123",
    "title_is": "monomials() and lt() for expansions of SymmetricFunctions over SymbolicRing broken",
    "title_was": "monomials() and lt() for SymmetricFunctions over SymbolicRing broken",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/21123#event-294392"
}
```



---

archive/issue_comments_307696.json:
```json
{
    "body": "<div id=\"comment:3\" align=\"right\">comment:3</div>\n\nThis is actually not a problem with symmetric functions, but how coercion into a polynomial ring over `SR` works:\n\n```\nsage: R.<x,y,z> = PolynomialRing(ZZ)\nsage: p = x + y\nsage: S.<x,y,z> = PolynomialRing(SR)\nsage: f = S(p); f  # This is what is used in symmetric functions in expand()\nx + y\nsage: f.monomials()\n[1]\nsage: f.coefficients()\n[x + y]\nsage: S.coerce_map_from(R)(p).monomials()\n[1]\nsage: S.coerce_map_from(R)\nComposite map:\n  From: Multivariate Polynomial Ring in x, y, z over Integer Ring\n  To:   Multivariate Polynomial Ring in x, y, z over Symbolic Ring\n  Defn:   Conversion via _symbolic_ method map:\n          From: Multivariate Polynomial Ring in x, y, z over Integer Ring\n          To:   Symbolic Ring\n        then\n          Generic morphism:\n          From: Symbolic Ring\n          To:   Multivariate Polynomial Ring in x, y, z over Symbolic Ring\n```\nWe probably check to see if the input can be considered a coefficient first, then try variable to variable. I would think the latter is actually a faster check, but it is probably a lesser-used code path.",
    "created_at": "2016-07-30T14:43:43Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/21123",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/21123#issuecomment-307696",
    "user": "https://github.com/tscrim"
}
```

<div id="comment:3" align="right">comment:3</div>

This is actually not a problem with symmetric functions, but how coercion into a polynomial ring over `SR` works:

```
sage: R.<x,y,z> = PolynomialRing(ZZ)
sage: p = x + y
sage: S.<x,y,z> = PolynomialRing(SR)
sage: f = S(p); f  # This is what is used in symmetric functions in expand()
x + y
sage: f.monomials()
[1]
sage: f.coefficients()
[x + y]
sage: S.coerce_map_from(R)(p).monomials()
[1]
sage: S.coerce_map_from(R)
Composite map:
  From: Multivariate Polynomial Ring in x, y, z over Integer Ring
  To:   Multivariate Polynomial Ring in x, y, z over Symbolic Ring
  Defn:   Conversion via _symbolic_ method map:
          From: Multivariate Polynomial Ring in x, y, z over Integer Ring
          To:   Symbolic Ring
        then
          Generic morphism:
          From: Symbolic Ring
          To:   Multivariate Polynomial Ring in x, y, z over Symbolic Ring
```
We probably check to see if the input can be considered a coefficient first, then try variable to variable. I would think the latter is actually a faster check, but it is probably a lesser-used code path.



---

archive/issue_comments_307697.json:
```json
{
    "body": "<div id=\"comment:4\" align=\"right\">comment:4</div>\n\nReplying to [@tscrim](#comment%3A3):\n> This is actually not a problem with symmetric functions, but how coercion into a polynomial ring over `SR` works:\n\n[...]\n> We probably check to see if the input can be considered a coefficient first, then try variable to variable. I would think the latter is actually a faster check, but it is probably a lesser-used code path.\n\nTo me this all sounds strange. Shouldn't a polynomial ring over SR be in SR itself, or it least it should be possible to coerse it there? But one gets:\n\n```\nsage: S.<x,y,z> = PolynomialRing(SR)\nsage: p=x+y\nsage: p in SR\nFalse\nsage: SR(p)\n---------------------------------------------------------------------------\nTypeError                                 Traceback (most recent call last)\n[...]\nTypeError: not a constant polynomial\nsage: \n```",
    "created_at": "2016-08-09T11:37:26Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/21123",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/21123#issuecomment-307697",
    "user": "https://github.com/dimpase"
}
```

<div id="comment:4" align="right">comment:4</div>

Replying to [@tscrim](#comment%3A3):
> This is actually not a problem with symmetric functions, but how coercion into a polynomial ring over `SR` works:

[...]
> We probably check to see if the input can be considered a coefficient first, then try variable to variable. I would think the latter is actually a faster check, but it is probably a lesser-used code path.

To me this all sounds strange. Shouldn't a polynomial ring over SR be in SR itself, or it least it should be possible to coerse it there? But one gets:

```
sage: S.<x,y,z> = PolynomialRing(SR)
sage: p=x+y
sage: p in SR
False
sage: SR(p)
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)
[...]
TypeError: not a constant polynomial
sage: 
```



---

archive/issue_comments_307698.json:
```json
{
    "body": "<div id=\"comment:5\" align=\"right\">comment:5</div>\n\nSee also #20454.",
    "created_at": "2016-08-10T06:43:16Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/21123",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/21123#issuecomment-307698",
    "user": "https://github.com/rwst"
}
```

<div id="comment:5" align="right">comment:5</div>

See also #20454.



---

archive/issue_events_294393.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-12-29T01:36:35Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/21123",
    "milestone_number": null,
    "milestone_title": "sage-7.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/21123#event-294393"
}
```
