# Issue 21665: AsymptoticRing.substitute fails with exponents in QQbar

archive/issues_021428.json:
```json
{
    "assignees": [],
    "body": "Presence of a redundant exponential growth group lets substitution fail.\n\n```\nsage: A.<T> = AsymptoticRing('T^QQbar', SR)\nsage: B.<n> = AsymptoticRing('QQbar^n*n^QQbar', SR)\nsage: C.<p> = AsymptoticRing('n^QQbar', SR)\nsage: e1 = T^QQbar(sqrt(2))\nsage: e1.subs(T=p)\nn^(1.414213562373095?)\nsage: e1.subs(T=n)\nTraceback (most recent call last):\n...\nTypeError: Cannot apply the substitution rules {T: n} on T^(1.414213562373095?) in Asymptotic Ring <T^(Algebraic Field)> over Symbolic Ring.\n> *previous* ValueError: Cannot substitute in T^(1.414213562373095?) in Asymptotic Ring <T^(Algebraic Field)> over Symbolic Ring.\n>> *previous* ValueError: Cannot substitute in T^(1.414213562373095?) in Exact Term Monoid T^(Algebraic Field) with coefficients in Symbolic Ring.\n>>> *previous* ValueError: Cannot substitute in T^(1.414213562373095?) in Growth Group T^(Algebraic Field).\n>>>> *previous* ValueError: Cannot take n to the exponent 1.414213562373095?.\n>>>>> *previous* TypeError: no canonical coercion from Algebraic Field to Rational Field\n```\n\nDepends on #22120\n\nCC:  @behackl @dkrenn\n\nComponent: **asymptotic expansions**\n\n_Issue created by migration from https://trac.sagemath.org/ticket/21665_\n\n",
    "created_at": "2016-10-08T05:00:43Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/c%3A%20asymptotic%20expansions",
        "https://github.com/sagemath/sage/labels/p%3A%203%20%E2%80%93%20major",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "AsymptoticRing.substitute fails with exponents in QQbar",
    "type": "issue",
    "updated_at": "2022-12-29T01:37:14Z",
    "url": "https://github.com/sagemath/sage/issues/21665",
    "user": "https://github.com/cheuberg"
}
```
Presence of a redundant exponential growth group lets substitution fail.

```
sage: A.<T> = AsymptoticRing('T^QQbar', SR)
sage: B.<n> = AsymptoticRing('QQbar^n*n^QQbar', SR)
sage: C.<p> = AsymptoticRing('n^QQbar', SR)
sage: e1 = T^QQbar(sqrt(2))
sage: e1.subs(T=p)
n^(1.414213562373095?)
sage: e1.subs(T=n)
Traceback (most recent call last):
...
TypeError: Cannot apply the substitution rules {T: n} on T^(1.414213562373095?) in Asymptotic Ring <T^(Algebraic Field)> over Symbolic Ring.
> *previous* ValueError: Cannot substitute in T^(1.414213562373095?) in Asymptotic Ring <T^(Algebraic Field)> over Symbolic Ring.
>> *previous* ValueError: Cannot substitute in T^(1.414213562373095?) in Exact Term Monoid T^(Algebraic Field) with coefficients in Symbolic Ring.
>>> *previous* ValueError: Cannot substitute in T^(1.414213562373095?) in Growth Group T^(Algebraic Field).
>>>> *previous* ValueError: Cannot take n to the exponent 1.414213562373095?.
>>>>> *previous* TypeError: no canonical coercion from Algebraic Field to Rational Field
```

Depends on #22120

CC:  @behackl @dkrenn

Component: **asymptotic expansions**

_Issue created by migration from https://trac.sagemath.org/ticket/21665_





---

archive/issue_events_305533.json:
```json
{
    "actor": "https://github.com/cheuberg",
    "created_at": "2016-10-08T05:00:43Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/21665",
    "milestone_number": null,
    "milestone_title": "sage-7.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/21665#event-305533"
}
```



---

archive/issue_events_305534.json:
```json
{
    "actor": "https://github.com/cheuberg",
    "created_at": "2016-10-08T05:00:43Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/21665",
    "label": "https://github.com/sagemath/sage/labels/c%3A%20asymptotic%20expansions",
    "label_color": "eeeeee",
    "label_name": "c: asymptotic expansions",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/21665#event-305534"
}
```



---

archive/issue_events_305535.json:
```json
{
    "actor": "https://github.com/cheuberg",
    "created_at": "2016-10-08T05:00:43Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/21665",
    "label": "https://github.com/sagemath/sage/labels/p%3A%203%20%E2%80%93%20major",
    "label_color": "ffbb00",
    "label_name": "p: 3 \u2013 major",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/21665#event-305535"
}
```



---

archive/issue_events_305536.json:
```json
{
    "actor": "https://github.com/cheuberg",
    "created_at": "2016-10-08T05:00:43Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/21665",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "d73a4a",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/21665#event-305536"
}
```



---

archive/issue_comments_318324.json:
```json
{
    "body": "<div id=\"comment:1\" align=\"right\">comment:1</div>\n\nThe problem boils down to the following:\n\n```\nsage: from sage.rings.asymptotic.growth_group import GrowthGroup\nsage: G = GrowthGroup('m^QQbar')\nsage: H = GrowthGroup('QQbar^n * n^QQbar')\nsage: K = GrowthGroup('QQbar^p')\nsage: m = G('m')\nsage: n = H('n')\nsage: alpha = QQbar(sqrt(2))\nsage: m^alpha\nm^(1.414213562373095?)\nsage: n^alpha\nTraceback (most recent call last):\n...\n/local/sage/sage-7.4.beta6/local/lib/python2.7/site-packages/sage/rings/qqbar.pyc in __pow__(self, e)\n   3878             1.000000000000000? + 0.?e-18*I\n   3879         \"\"\"\n-> 3880         e = QQ._coerce_(e)\n   3881         n = e.numerator()\n   3882         d = e.denominator()\n...\nTypeError: no canonical coercion from Algebraic Field to Rational Field\nsage: K('1')^alpha\nTraceback (most recent call last):\n...\n/local/sage/sage-7.4.beta6/local/lib/python2.7/site-packages/sage/rings/qqbar.pyc in __pow__(self, e)\n   3878             1.000000000000000? + 0.?e-18*I\n   3879         \"\"\"\n-> 3880         e = QQ._coerce_(e)\n   3881         n = e.numerator()\n   3882         d = e.denominator()\n...\nTypeError: no canonical coercion from Algebraic Field to Rational Field\n```\n\nSo the problem is that we cannot compute `QQbar(1)^alpha`.\n\nI see the following options:\n1. Fix `QQbar` so that `QQbar(1)^everything == QQbar(1)`.\n2. Fix `ExponentialGrowthElement.__pow__` such that `base == 1` leads to result `1`, irrespective of `exponent`.\n3. Fix `GenericProduct.Element.__pow__` such that trivial factors are ignored.",
    "created_at": "2016-10-08T07:11:12Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/21665",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/21665#issuecomment-318324",
    "user": "https://github.com/cheuberg"
}
```

<div id="comment:1" align="right">comment:1</div>

The problem boils down to the following:

```
sage: from sage.rings.asymptotic.growth_group import GrowthGroup
sage: G = GrowthGroup('m^QQbar')
sage: H = GrowthGroup('QQbar^n * n^QQbar')
sage: K = GrowthGroup('QQbar^p')
sage: m = G('m')
sage: n = H('n')
sage: alpha = QQbar(sqrt(2))
sage: m^alpha
m^(1.414213562373095?)
sage: n^alpha
Traceback (most recent call last):
...
/local/sage/sage-7.4.beta6/local/lib/python2.7/site-packages/sage/rings/qqbar.pyc in __pow__(self, e)
   3878             1.000000000000000? + 0.?e-18*I
   3879         """
-> 3880         e = QQ._coerce_(e)
   3881         n = e.numerator()
   3882         d = e.denominator()
...
TypeError: no canonical coercion from Algebraic Field to Rational Field
sage: K('1')^alpha
Traceback (most recent call last):
...
/local/sage/sage-7.4.beta6/local/lib/python2.7/site-packages/sage/rings/qqbar.pyc in __pow__(self, e)
   3878             1.000000000000000? + 0.?e-18*I
   3879         """
-> 3880         e = QQ._coerce_(e)
   3881         n = e.numerator()
   3882         d = e.denominator()
...
TypeError: no canonical coercion from Algebraic Field to Rational Field
```

So the problem is that we cannot compute `QQbar(1)^alpha`.

I see the following options:
1. Fix `QQbar` so that `QQbar(1)^everything == QQbar(1)`.
2. Fix `ExponentialGrowthElement.__pow__` such that `base == 1` leads to result `1`, irrespective of `exponent`.
3. Fix `GenericProduct.Element.__pow__` such that trivial factors are ignored.



---

archive/issue_comments_318325.json:
```json
{
    "body": "<div id=\"comment:2\" align=\"right\">comment:2</div>\n\nAnother related problem:\n\n```\nsage: R.<n> = AsymptoticRing('QQbar^n*n^QQbar', SR)\nsage: alpha = QQbar(sqrt(2))\nsage: n.rpow(alpha)\nTraceback (most recent call last):\n...\nValueError: Cannot construct the power of 1.414213562373095? to the exponent n in Asymptotic Ring <(Algebraic Field)^n * n^(Algebraic Field)> over Symbolic Ring.\n> *previous* ValueError: Cannot take 1.414213562373095?^n to the exponent 1.\n>> *previous* TypeError: no canonical coercion from Symbolic Ring to Rational Field\n```\n\u200b\nSo basically, in order to have `alpha<sup>n*n</sup>alpha`, it is currently necessary to use the following work-around:\n\n```\nsage: R1 = AsymptoticRing('QQbar^n', SR)\nsage: R2.<n> = AsymptoticRing('n^QQbar', SR)\nsage: R = AsymptoticRing('QQbar^n*n^QQbar', SR)\nsage: alpha = QQbar(sqrt(2))\nsage: t1 = R1(R1.growth_group(raw_element=alpha)); t1\nsage: t2 = n^alpha\nsage: R(t1)*t2\n```",
    "created_at": "2016-10-08T08:39:25Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/21665",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/21665#issuecomment-318325",
    "user": "https://github.com/cheuberg"
}
```

<div id="comment:2" align="right">comment:2</div>

Another related problem:

```
sage: R.<n> = AsymptoticRing('QQbar^n*n^QQbar', SR)
sage: alpha = QQbar(sqrt(2))
sage: n.rpow(alpha)
Traceback (most recent call last):
...
ValueError: Cannot construct the power of 1.414213562373095? to the exponent n in Asymptotic Ring <(Algebraic Field)^n * n^(Algebraic Field)> over Symbolic Ring.
> *previous* ValueError: Cannot take 1.414213562373095?^n to the exponent 1.
>> *previous* TypeError: no canonical coercion from Symbolic Ring to Rational Field
```
​
So basically, in order to have `alpha<sup>n*n</sup>alpha`, it is currently necessary to use the following work-around:

```
sage: R1 = AsymptoticRing('QQbar^n', SR)
sage: R2.<n> = AsymptoticRing('n^QQbar', SR)
sage: R = AsymptoticRing('QQbar^n*n^QQbar', SR)
sage: alpha = QQbar(sqrt(2))
sage: t1 = R1(R1.growth_group(raw_element=alpha)); t1
sage: t2 = n^alpha
sage: R(t1)*t2
```



---

archive/issue_comments_318326.json:
```json
{
    "body": "Dependencies: **#22120**",
    "created_at": "2017-01-02T17:16:53Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/21665",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/21665#issuecomment-318326",
    "user": "https://github.com/dkrenn"
}
```

Dependencies: **#22120**



---

archive/issue_comments_318327.json:
```json
{
    "body": "<div id=\"comment:3\" align=\"right\">comment:3</div>\n\nReplying to [@cheuberg](#comment:1):\n> I see the following options:\n> 1. Fix `QQbar` so that `QQbar(1)^everything == QQbar(1)`.\n\nThis is now #22120.",
    "created_at": "2017-01-02T17:16:53Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/21665",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/21665#issuecomment-318327",
    "user": "https://github.com/dkrenn"
}
```

<div id="comment:3" align="right">comment:3</div>

Replying to [@cheuberg](#comment:1):
> I see the following options:
> 1. Fix `QQbar` so that `QQbar(1)^everything == QQbar(1)`.

This is now #22120.



---

archive/issue_events_305537.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-12-29T01:37:14Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/21665",
    "milestone_number": null,
    "milestone_title": "sage-7.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/21665#event-305537"
}
```
