# Issue 21665: AsymptoticRing.substitute fails with exponents in QQbar

archive/issues_021428.json:
```json
{
    "body": "Presence of a redundant exponential growth group lets substitution fail.\n\n```\nsage: A.<T> = AsymptoticRing('T^QQbar', SR)\nsage: B.<n> = AsymptoticRing('QQbar^n*n^QQbar', SR)\nsage: C.<p> = AsymptoticRing('n^QQbar', SR)\nsage: e1 = T^QQbar(sqrt(2))\nsage: e1.subs(T=p)\nn^(1.414213562373095?)\nsage: e1.subs(T=n)\nTraceback (most recent call last):\n...\nTypeError: Cannot apply the substitution rules {T: n} on T^(1.414213562373095?) in Asymptotic Ring <T^(Algebraic Field)> over Symbolic Ring.\n> *previous* ValueError: Cannot substitute in T^(1.414213562373095?) in Asymptotic Ring <T^(Algebraic Field)> over Symbolic Ring.\n>> *previous* ValueError: Cannot substitute in T^(1.414213562373095?) in Exact Term Monoid T^(Algebraic Field) with coefficients in Symbolic Ring.\n>>> *previous* ValueError: Cannot substitute in T^(1.414213562373095?) in Growth Group T^(Algebraic Field).\n>>>> *previous* ValueError: Cannot take n to the exponent 1.414213562373095?.\n>>>>> *previous* TypeError: no canonical coercion from Algebraic Field to Rational Field\n```\n\n**CC:**  @behackl @dkrenn\n\n**Status:** new\n\n**Dependencies:** #22120\n\nIssue created by migration from https://trac.sagemath.org/ticket/21665\n\n",
    "created_at": "2016-10-08T05:00:43Z",
    "labels": [
        "component: asymptotic expansions",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-7.4",
    "title": "AsymptoticRing.substitute fails with exponents in QQbar",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/21665",
    "user": "https://github.com/cheuberg"
}
```
Presence of a redundant exponential growth group lets substitution fail.

```
sage: A.<T> = AsymptoticRing('T^QQbar', SR)
sage: B.<n> = AsymptoticRing('QQbar^n*n^QQbar', SR)
sage: C.<p> = AsymptoticRing('n^QQbar', SR)
sage: e1 = T^QQbar(sqrt(2))
sage: e1.subs(T=p)
n^(1.414213562373095?)
sage: e1.subs(T=n)
Traceback (most recent call last):
...
TypeError: Cannot apply the substitution rules {T: n} on T^(1.414213562373095?) in Asymptotic Ring <T^(Algebraic Field)> over Symbolic Ring.
> *previous* ValueError: Cannot substitute in T^(1.414213562373095?) in Asymptotic Ring <T^(Algebraic Field)> over Symbolic Ring.
>> *previous* ValueError: Cannot substitute in T^(1.414213562373095?) in Exact Term Monoid T^(Algebraic Field) with coefficients in Symbolic Ring.
>>> *previous* ValueError: Cannot substitute in T^(1.414213562373095?) in Growth Group T^(Algebraic Field).
>>>> *previous* ValueError: Cannot take n to the exponent 1.414213562373095?.
>>>>> *previous* TypeError: no canonical coercion from Algebraic Field to Rational Field
```

**CC:**  @behackl @dkrenn

**Status:** new

**Dependencies:** #22120

Issue created by migration from https://trac.sagemath.org/ticket/21665





---

archive/issue_comments_382828.json:
```json
{
    "body": "<a id='comment:1'></a>\nThe problem boils down to the following:\n\n```\nsage: from sage.rings.asymptotic.growth_group import GrowthGroup\nsage: G = GrowthGroup('m^QQbar')\nsage: H = GrowthGroup('QQbar^n * n^QQbar')\nsage: K = GrowthGroup('QQbar^p')\nsage: m = G('m')\nsage: n = H('n')\nsage: alpha = QQbar(sqrt(2))\nsage: m^alpha\nm^(1.414213562373095?)\nsage: n^alpha\nTraceback (most recent call last):\n...\n/local/sage/sage-7.4.beta6/local/lib/python2.7/site-packages/sage/rings/qqbar.pyc in __pow__(self, e)\n   3878             1.000000000000000? + 0.?e-18*I\n   3879         \"\"\"\n-> 3880         e = QQ._coerce_(e)\n   3881         n = e.numerator()\n   3882         d = e.denominator()\n...\nTypeError: no canonical coercion from Algebraic Field to Rational Field\nsage: K('1')^alpha\nTraceback (most recent call last):\n...\n/local/sage/sage-7.4.beta6/local/lib/python2.7/site-packages/sage/rings/qqbar.pyc in __pow__(self, e)\n   3878             1.000000000000000? + 0.?e-18*I\n   3879         \"\"\"\n-> 3880         e = QQ._coerce_(e)\n   3881         n = e.numerator()\n   3882         d = e.denominator()\n...\nTypeError: no canonical coercion from Algebraic Field to Rational Field\n```\n\nSo the problem is that we cannot compute `QQbar(1)^alpha`.\n\nI see the following options:\n1. Fix `QQbar` so that `QQbar(1)^everything == QQbar(1)`.\n2. Fix `ExponentialGrowthElement.__pow__` such that `base == 1` leads to result `1`, irrespective of `exponent`.\n3. Fix `GenericProduct.Element.__pow__` such that trivial factors are ignored.",
    "created_at": "2016-10-08T07:11:12Z",
    "issue": "https://github.com/sagemath/sagetest/issues/21665",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/21665#issuecomment-382828",
    "user": "https://github.com/cheuberg"
}
```

<a id='comment:1'></a>
The problem boils down to the following:

```
sage: from sage.rings.asymptotic.growth_group import GrowthGroup
sage: G = GrowthGroup('m^QQbar')
sage: H = GrowthGroup('QQbar^n * n^QQbar')
sage: K = GrowthGroup('QQbar^p')
sage: m = G('m')
sage: n = H('n')
sage: alpha = QQbar(sqrt(2))
sage: m^alpha
m^(1.414213562373095?)
sage: n^alpha
Traceback (most recent call last):
...
/local/sage/sage-7.4.beta6/local/lib/python2.7/site-packages/sage/rings/qqbar.pyc in __pow__(self, e)
   3878             1.000000000000000? + 0.?e-18*I
   3879         """
-> 3880         e = QQ._coerce_(e)
   3881         n = e.numerator()
   3882         d = e.denominator()
...
TypeError: no canonical coercion from Algebraic Field to Rational Field
sage: K('1')^alpha
Traceback (most recent call last):
...
/local/sage/sage-7.4.beta6/local/lib/python2.7/site-packages/sage/rings/qqbar.pyc in __pow__(self, e)
   3878             1.000000000000000? + 0.?e-18*I
   3879         """
-> 3880         e = QQ._coerce_(e)
   3881         n = e.numerator()
   3882         d = e.denominator()
...
TypeError: no canonical coercion from Algebraic Field to Rational Field
```

So the problem is that we cannot compute `QQbar(1)^alpha`.

I see the following options:
1. Fix `QQbar` so that `QQbar(1)^everything == QQbar(1)`.
2. Fix `ExponentialGrowthElement.__pow__` such that `base == 1` leads to result `1`, irrespective of `exponent`.
3. Fix `GenericProduct.Element.__pow__` such that trivial factors are ignored.



---

archive/issue_comments_382829.json:
```json
{
    "body": "<a id='comment:2'></a>\nAnother related problem:\n\n```\nsage: R.<n> = AsymptoticRing('QQbar^n*n^QQbar', SR)\nsage: alpha = QQbar(sqrt(2))\nsage: n.rpow(alpha)\nTraceback (most recent call last):\n...\nValueError: Cannot construct the power of 1.414213562373095? to the exponent n in Asymptotic Ring <(Algebraic Field)^n * n^(Algebraic Field)> over Symbolic Ring.\n> *previous* ValueError: Cannot take 1.414213562373095?^n to the exponent 1.\n>> *previous* TypeError: no canonical coercion from Symbolic Ring to Rational Field\n```\n\u200b\nSo basically, in order to have `alpha<sup>n*n</sup>alpha`, it is currently necessary to use the following work-around:\n\n```\nsage: R1 = AsymptoticRing('QQbar^n', SR)\nsage: R2.<n> = AsymptoticRing('n^QQbar', SR)\nsage: R = AsymptoticRing('QQbar^n*n^QQbar', SR)\nsage: alpha = QQbar(sqrt(2))\nsage: t1 = R1(R1.growth_group(raw_element=alpha)); t1\nsage: t2 = n^alpha\nsage: R(t1)*t2\n```",
    "created_at": "2016-10-08T08:39:25Z",
    "issue": "https://github.com/sagemath/sagetest/issues/21665",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/21665#issuecomment-382829",
    "user": "https://github.com/cheuberg"
}
```

<a id='comment:2'></a>
Another related problem:

```
sage: R.<n> = AsymptoticRing('QQbar^n*n^QQbar', SR)
sage: alpha = QQbar(sqrt(2))
sage: n.rpow(alpha)
Traceback (most recent call last):
...
ValueError: Cannot construct the power of 1.414213562373095? to the exponent n in Asymptotic Ring <(Algebraic Field)^n * n^(Algebraic Field)> over Symbolic Ring.
> *previous* ValueError: Cannot take 1.414213562373095?^n to the exponent 1.
>> *previous* TypeError: no canonical coercion from Symbolic Ring to Rational Field
```
â€‹
So basically, in order to have `alpha<sup>n*n</sup>alpha`, it is currently necessary to use the following work-around:

```
sage: R1 = AsymptoticRing('QQbar^n', SR)
sage: R2.<n> = AsymptoticRing('n^QQbar', SR)
sage: R = AsymptoticRing('QQbar^n*n^QQbar', SR)
sage: alpha = QQbar(sqrt(2))
sage: t1 = R1(R1.growth_group(raw_element=alpha)); t1
sage: t2 = n^alpha
sage: R(t1)*t2
```



---

archive/issue_comments_382830.json:
```json
{
    "body": "**Dependencies:** #22120",
    "created_at": "2017-01-02T17:16:53Z",
    "issue": "https://github.com/sagemath/sagetest/issues/21665",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/21665#issuecomment-382830",
    "user": "https://github.com/dkrenn"
}
```

**Dependencies:** #22120



---

archive/issue_comments_382831.json:
```json
{
    "body": "<a id='comment:3'></a>\nReplying to [cheuberg](#comment%3A1):\n> I see the following options:\n> 1. Fix `QQbar` so that `QQbar(1)^everything == QQbar(1)`.\n\n\nThis is now #22120.",
    "created_at": "2017-01-02T17:16:53Z",
    "issue": "https://github.com/sagemath/sagetest/issues/21665",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/21665#issuecomment-382831",
    "user": "https://github.com/dkrenn"
}
```

<a id='comment:3'></a>
Replying to [cheuberg](#comment%3A1):
> I see the following options:
> 1. Fix `QQbar` so that `QQbar(1)^everything == QQbar(1)`.


This is now #22120.
