# Issue 21786: coercion failures with finite fields with ntl implementation

archive/issues_021549.json:
```json
{
    "assignees": [],
    "body": "- `GF(2)` acting on `GF(4)[x]`\n\n```\nsage: cm = get_coercion_model()\nsage: cm.explain(GF(2), GF(4)['x'])\nAction discovered.\n...\nUnivariate Polynomial Ring in x over Finite Field in z2 of size 2^2\nsage: cm.explain(GF(2, impl='ntl'), GF(4)['x'])\nTraceback (most recent call last):\n...\nTypeError: unable to coerce <type 'sage.rings.finite_rings.element_ntl_gf2e.FiniteField_ntl_gf2eElement'>\n```\n- `GF(4)` acting on `GF(2)[x]` (pushout)\n\n```\nsage: cm.explain(GF(4, impl='ntl'), GF(2)['x'])\nCoercion on left operand via\n...\nResult lives in Univariate Polynomial Ring in x over Finite Field in z2 of size 2^2\nUnivariate Polynomial Ring in x over Finite Field in z2 of size 2^2\nsage: cm.explain(GF(4, impl='ntl'), GF(2,impl='ntl')['x'])\nWill try _r_action and _l_action\nUnknown result parent.\n```\n\nIssue created by migration from https://trac.sagemath.org/ticket/21786\n\n",
    "created_at": "2016-10-30T14:20:42Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20coercion",
        "https://github.com/sagemath/sage/labels/critical",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-7.5",
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "coercion failures with finite fields with ntl implementation",
    "type": "issue",
    "updated_at": "2016-10-30T14:20:42Z",
    "url": "https://github.com/sagemath/sage/issues/21786",
    "user": "https://github.com/videlec"
}
```
- `GF(2)` acting on `GF(4)[x]`

```
sage: cm = get_coercion_model()
sage: cm.explain(GF(2), GF(4)['x'])
Action discovered.
...
Univariate Polynomial Ring in x over Finite Field in z2 of size 2^2
sage: cm.explain(GF(2, impl='ntl'), GF(4)['x'])
Traceback (most recent call last):
...
TypeError: unable to coerce <type 'sage.rings.finite_rings.element_ntl_gf2e.FiniteField_ntl_gf2eElement'>
```
- `GF(4)` acting on `GF(2)[x]` (pushout)

```
sage: cm.explain(GF(4, impl='ntl'), GF(2)['x'])
Coercion on left operand via
...
Result lives in Univariate Polynomial Ring in x over Finite Field in z2 of size 2^2
Univariate Polynomial Ring in x over Finite Field in z2 of size 2^2
sage: cm.explain(GF(4, impl='ntl'), GF(2,impl='ntl')['x'])
Will try _r_action and _l_action
Unknown result parent.
```

Issue created by migration from https://trac.sagemath.org/ticket/21786


