# Issue 21862: Symbolic methods work inconsistently on relational expressions

archive/issues_021625.json:
```json
{
    "body": "Symbolic methods on relational expressions (equalities and inequalities) work inconsistently. Some of them directly apply to both sides, some don't do anything at all, and some behave unexpectedly.\n\nFor example, `collect` does nothing (same with inequalities):\n\n```\nsage: var('y')\ny\nsage: eq = x^2 + x*y + 3*x == 0\nsage: eq.collect(x)\nx^2 + x*y + 3*x == 0\nsage: eq.lhs().collect(x)\nx^2 + x*(y + 3)\n```\n\n`limit` behaves differently with different arguments, and it's not at all clear what it's doing:\n\n```\nsage: eq = exp(-x) == x\nsage: eq.limit(x=0)\n0\nsage: eq.limit(x=2)\ne^(-2) == 2\n```\n\n`factor` takes equalities and returns a non-relational expression:\n\n```\nsage: (x^2 + x == 0).factor()\n(x + 1)*x\n```\nand doesn't work at all with inequalities:\n\n```\nsage: (x^2 + x > 0).factor()\nValueError: Unable to represent as a polynomial\n```\n\nEven more strange:\n\n```\nsage: (x == 3).exp()\ne^(x == 3)\n```\n\nIssue created by migration from https://trac.sagemath.org/ticket/21862\n\n",
    "created_at": "2016-11-11T18:56:24Z",
    "labels": [
        "component: symbolics",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-7.5",
    "title": "Symbolic methods work inconsistently on relational expressions",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/21862",
    "user": "https://github.com/eviatarbach"
}
```
Symbolic methods on relational expressions (equalities and inequalities) work inconsistently. Some of them directly apply to both sides, some don't do anything at all, and some behave unexpectedly.

For example, `collect` does nothing (same with inequalities):

```
sage: var('y')
y
sage: eq = x^2 + x*y + 3*x == 0
sage: eq.collect(x)
x^2 + x*y + 3*x == 0
sage: eq.lhs().collect(x)
x^2 + x*(y + 3)
```

`limit` behaves differently with different arguments, and it's not at all clear what it's doing:

```
sage: eq = exp(-x) == x
sage: eq.limit(x=0)
0
sage: eq.limit(x=2)
e^(-2) == 2
```

`factor` takes equalities and returns a non-relational expression:

```
sage: (x^2 + x == 0).factor()
(x + 1)*x
```
and doesn't work at all with inequalities:

```
sage: (x^2 + x > 0).factor()
ValueError: Unable to represent as a polynomial
```

Even more strange:

```
sage: (x == 3).exp()
e^(x == 3)
```

Issue created by migration from https://trac.sagemath.org/ticket/21862





---

archive/issue_comments_325787.json:
```json
{
    "body": "<a id='comment:1'></a>\nSee also #7660 (EDIT: and #11651).",
    "created_at": "2016-12-04T08:02:08Z",
    "issue": "https://github.com/sagemath/sagetest/issues/21862",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/21862#issuecomment-325787",
    "user": "https://github.com/rwst"
}
```

<a id='comment:1'></a>
See also #7660 (EDIT: and #11651).
