# Issue 21897: Fix __div__ for multivariate polynomials in K[X][Y]

archive/issues_021660.json:
```json
{
    "assignees": [],
    "body": "Polynomial Rings in any number of variables are able to symplify fraction in which the denominator divides the numerator. The following example shows e Newton divided difference (which contains a division but is always a polynomial, it works)\n\n```\nsage: K.<x1,x2,x3,x4> = PolynomialRing(QQ, 4)\nsage: P = x1^3*x2 - 8*x2*x3*x4^2; P\nx1^3*x2 - 8*x2*x3*x4^2\nsage: Q = P.parent((P - P(x1,x3,x2,x4))/(x2-x3)); Q\nx1^3\nsage: Q.parent()\nMultivariate Polynomial Ring in x1, x2, x3, x4 over Rational Field\n```\nSuch symplification are not possible in K[X][Y] (it stay ok in K[X,Y]).\n\n```\nsage: K.<x> = PolynomialRing(QQ, 1)\nsage: L.<y> = PolynomialRing(K, 1)\nsage: y/y\ny/y\nsage: L(y/y)\nTraceback (most recent call last):\n\nTypeError: unable to coerce since the denominator is not 1\nsage: y.divides(y)\nTraceback (most recent call last):\n\nTypeError: no conversion of this ring to a Singular ring defined\nsage: y/y == 1\nTrue\nsage: y/y - 1\n0\nsage: (y/y).reduce()\nTraceback (most recent call last):\n\nArithmeticError: unable to reduce because gcd algorithm doesn't work on input\n```\n\n_Issue created by migration from https://trac.sagemath.org/ticket/21897_\n\n",
    "created_at": "2016-11-18T19:46:02Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20commutative%20algebra",
        "https://github.com/sagemath/sage/labels/p3%20%E2%80%93%20major",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "Fix __div__ for multivariate polynomials in K[X][Y]",
    "type": "issue",
    "updated_at": "2022-12-29T01:37:47Z",
    "url": "https://github.com/sagemath/sage/issues/21897",
    "user": "https://github.com/sagetrac-nborie"
}
```
Polynomial Rings in any number of variables are able to symplify fraction in which the denominator divides the numerator. The following example shows e Newton divided difference (which contains a division but is always a polynomial, it works)

```
sage: K.<x1,x2,x3,x4> = PolynomialRing(QQ, 4)
sage: P = x1^3*x2 - 8*x2*x3*x4^2; P
x1^3*x2 - 8*x2*x3*x4^2
sage: Q = P.parent((P - P(x1,x3,x2,x4))/(x2-x3)); Q
x1^3
sage: Q.parent()
Multivariate Polynomial Ring in x1, x2, x3, x4 over Rational Field
```
Such symplification are not possible in K[X][Y] (it stay ok in K[X,Y]).

```
sage: K.<x> = PolynomialRing(QQ, 1)
sage: L.<y> = PolynomialRing(K, 1)
sage: y/y
y/y
sage: L(y/y)
Traceback (most recent call last):

TypeError: unable to coerce since the denominator is not 1
sage: y.divides(y)
Traceback (most recent call last):

TypeError: no conversion of this ring to a Singular ring defined
sage: y/y == 1
True
sage: y/y - 1
0
sage: (y/y).reduce()
Traceback (most recent call last):

ArithmeticError: unable to reduce because gcd algorithm doesn't work on input
```

_Issue created by migration from https://trac.sagemath.org/ticket/21897_





---

archive/issue_events_278697.json:
```json
{
    "actor": "https://github.com/sagetrac-nborie",
    "created_at": "2016-11-18T19:46:02Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/21897",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20commutative%20algebra",
    "label_color": "0000ff",
    "label_name": "component: commutative algebra",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/21897#event-278697"
}
```



---

archive/issue_events_278698.json:
```json
{
    "actor": "https://github.com/sagetrac-nborie",
    "created_at": "2016-11-18T19:46:02Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/21897",
    "label": "https://github.com/sagemath/sage/labels/p3%20%E2%80%93%20major",
    "label_color": "ffbb00",
    "label_name": "p3 \u2013 major",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/21897#event-278698"
}
```



---

archive/issue_events_278699.json:
```json
{
    "actor": "https://github.com/sagetrac-nborie",
    "created_at": "2016-11-18T19:46:02Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/21897",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "d73a4a",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/21897#event-278699"
}
```



---

archive/issue_events_278700.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-12-29T01:37:47Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/21897",
    "milestone_number": null,
    "milestone_title": "sage-7.5",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/21897#event-278700"
}
```
