# Issue 21897: Fix __div__ for multivariate polynomials in K[X][Y]

archive/issues_021660.json:
```json
{
    "body": "Polynomial Rings in any number of variables are able to symplify fraction in which the denominator divides the numerator. The following example shows e Newton divided difference (which contains a division but is always a polynomial, it works)\n\n```\nsage: K.<x1,x2,x3,x4> = PolynomialRing(QQ, 4)\nsage: P = x1^3*x2 - 8*x2*x3*x4^2; P\nx1^3*x2 - 8*x2*x3*x4^2\nsage: Q = P.parent((P - P(x1,x3,x2,x4))/(x2-x3)); Q\nx1^3\nsage: Q.parent()\nMultivariate Polynomial Ring in x1, x2, x3, x4 over Rational Field\n```\nSuch symplification are not possible in K[X][Y] (it stay ok in K[X,Y]).\n\n```\nsage: K.<x> = PolynomialRing(QQ, 1)\nsage: L.<y> = PolynomialRing(K, 1)\nsage: y/y\ny/y\nsage: L(y/y)\nTraceback (most recent call last):\n\nTypeError: unable to coerce since the denominator is not 1\nsage: y.divides(y)\nTraceback (most recent call last):\n\nTypeError: no conversion of this ring to a Singular ring defined\nsage: y/y == 1\nTrue\nsage: y/y - 1\n0\nsage: (y/y).reduce()\nTraceback (most recent call last):\n\nArithmeticError: unable to reduce because gcd algorithm doesn't work on input\n```\n\nStatus: new\n\nIssue created by migration from https://trac.sagemath.org/ticket/21897\n\n",
    "created_at": "2016-11-18T19:46:02Z",
    "labels": [
        "component: commutative algebra",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-7.5",
    "title": "Fix __div__ for multivariate polynomials in K[X][Y]",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/21897",
    "user": "https://trac.sagemath.org/admin/accounts/users/nborie"
}
```
Polynomial Rings in any number of variables are able to symplify fraction in which the denominator divides the numerator. The following example shows e Newton divided difference (which contains a division but is always a polynomial, it works)

```
sage: K.<x1,x2,x3,x4> = PolynomialRing(QQ, 4)
sage: P = x1^3*x2 - 8*x2*x3*x4^2; P
x1^3*x2 - 8*x2*x3*x4^2
sage: Q = P.parent((P - P(x1,x3,x2,x4))/(x2-x3)); Q
x1^3
sage: Q.parent()
Multivariate Polynomial Ring in x1, x2, x3, x4 over Rational Field
```
Such symplification are not possible in K[X][Y] (it stay ok in K[X,Y]).

```
sage: K.<x> = PolynomialRing(QQ, 1)
sage: L.<y> = PolynomialRing(K, 1)
sage: y/y
y/y
sage: L(y/y)
Traceback (most recent call last):

TypeError: unable to coerce since the denominator is not 1
sage: y.divides(y)
Traceback (most recent call last):

TypeError: no conversion of this ring to a Singular ring defined
sage: y/y == 1
True
sage: y/y - 1
0
sage: (y/y).reduce()
Traceback (most recent call last):

ArithmeticError: unable to reduce because gcd algorithm doesn't work on input
```

Status: new

Issue created by migration from https://trac.sagemath.org/ticket/21897


