# Issue 19038: Better hash on FPGroups

archive/issues_018801.json:
```json
{
    "body": "As is pointed out on #19016 the hash on FPGroup elements is currently based on the (non-canonical) representation, whereas the equality test is a more elaborate one borrowed from Gap. That means currently, there are elements that are equal but have different hashes\n\n```\nsage: G.<a,b>=FreeGroup()\nsage: Q=G.quotient([a*b])\nsage: U=Q(a)*Q(b)\nsage: V=Q(1)\nsage: U==V\nTrue\nsage: hash(U)==hash(V)\nFalse\n```\nWhen Gap does succeed in testing equality, it does so via a normal form of its elements. One way of equipping FPGroups with a well-behaved hash is by getting that normal form from gap and hash that.\n\nThe main inspiration for how to do this would come from Gap's [MakeFpGroupCompMethod source](https://github.com/gap-system/gap/blob/master/lib/grpfp.gi#L236)\n\nCC:  @nathanncohen\n\nStatus: new\n\nIssue created by migration from https://trac.sagemath.org/ticket/19038\n\n",
    "created_at": "2015-08-15T18:29:53Z",
    "labels": [
        "component: algebra",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-6.9",
    "title": "Better hash on FPGroups",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/19038",
    "user": "https://github.com/nbruin"
}
```
As is pointed out on #19016 the hash on FPGroup elements is currently based on the (non-canonical) representation, whereas the equality test is a more elaborate one borrowed from Gap. That means currently, there are elements that are equal but have different hashes

```
sage: G.<a,b>=FreeGroup()
sage: Q=G.quotient([a*b])
sage: U=Q(a)*Q(b)
sage: V=Q(1)
sage: U==V
True
sage: hash(U)==hash(V)
False
```
When Gap does succeed in testing equality, it does so via a normal form of its elements. One way of equipping FPGroups with a well-behaved hash is by getting that normal form from gap and hash that.

The main inspiration for how to do this would come from Gap's [MakeFpGroupCompMethod source](https://github.com/gap-system/gap/blob/master/lib/grpfp.gi#L236)

CC:  @nathanncohen

Status: new

Issue created by migration from https://trac.sagemath.org/ticket/19038





---

archive/issue_comments_256764.json:
```json
{
    "body": "<a id='comment:1'></a>One case Gap can handle is that of finite groups:\n\n```\nsage: G.<a,b>=FreeGroup()\nsage: A5=G.quotient([a^3,b^3,(a/b/a/b)^2,(a^(-1)*b/a/b)^2])\n```\nand we're getting it wrong presently. (Perhaps if #19016 gets fixed, we just won't have a hash at all)\n\n```\nsage: A5(a^3)==A5(1)\nTrue\nsage: hash(A5(a^3))==hash(A5(1))\nFalse\n```\nWe can improve the situation in the following way:\n\n```\nFamilyObj=libgap.function_factory(\"FamilyObj\")\nElementsFamily=libgap.function_factory(\"ElementsFamily\")\nFPFaithHom=libgap.function_factory(\"FPFaithHom\")\nImage=libgap.function_factory(\"Image\")\n```\nwhith these definitions:\n\n```\nsage: f=FPFaithHom(ElementsFamily(FamilyObj(A5.gap())))\nsage: newhash=lambda a: hash(Image(f,a.gap()))\nsage: newhash(A5(a^3))==newhash(A5(1))\nTrue\nsage: import collections\nsage: collections.Counter((u==v,newhash(u)==newhash(v) ) for (u,v) in ( (A5.random_element(),A5.random_element()) for j in range(6000)) )\nCounter({(False, False): 5899, (True, True): 101})\n```\nGap correctly find from this finite presentation that the group is A5 and the map f is its standard permutation representation in Sym(6).",
    "created_at": "2015-08-15T18:54:18Z",
    "issue": "https://github.com/sagemath/sagetest/issues/19038",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/19038#issuecomment-256764",
    "user": "https://github.com/nbruin"
}
```

<a id='comment:1'></a>One case Gap can handle is that of finite groups:

```
sage: G.<a,b>=FreeGroup()
sage: A5=G.quotient([a^3,b^3,(a/b/a/b)^2,(a^(-1)*b/a/b)^2])
```
and we're getting it wrong presently. (Perhaps if #19016 gets fixed, we just won't have a hash at all)

```
sage: A5(a^3)==A5(1)
True
sage: hash(A5(a^3))==hash(A5(1))
False
```
We can improve the situation in the following way:

```
FamilyObj=libgap.function_factory("FamilyObj")
ElementsFamily=libgap.function_factory("ElementsFamily")
FPFaithHom=libgap.function_factory("FPFaithHom")
Image=libgap.function_factory("Image")
```
whith these definitions:

```
sage: f=FPFaithHom(ElementsFamily(FamilyObj(A5.gap())))
sage: newhash=lambda a: hash(Image(f,a.gap()))
sage: newhash(A5(a^3))==newhash(A5(1))
True
sage: import collections
sage: collections.Counter((u==v,newhash(u)==newhash(v) ) for (u,v) in ( (A5.random_element(),A5.random_element()) for j in range(6000)) )
Counter({(False, False): 5899, (True, True): 101})
```
Gap correctly find from this finite presentation that the group is A5 and the map f is its standard permutation representation in Sym(6).



---

archive/issue_comments_256765.json:
```json
{
    "body": "<a id='comment:3'></a>For a non-finite group we'd end up doing something like this:\n\n```\nFpElementNFFunction=libgap.function_factory(\"FpElementNFFunction\")\nUnderlyingElement=libgap.function_factory(\"UnderlyingElement\")\n```\n\n```\nsage: Q=G.quotient([a*b])\nsage: f=FpElementNFFunction(ElementsFamily(FamilyObj(Q.gap())))\nsage: newhash=lambda q: hash(f(UnderlyingElement(q.gap())))\nsage: L=[Q.0^i*Q.1^j*Q.0^k for i in range(-2,2) for j in range(-2,2) for k in range(-2,2)]\nsage: collections.Counter((u==v,newhash(u)==newhash(v) ) for u in L for v in L)\nCounter({(False, False): 3516, (True, True): 580})\n```",
    "created_at": "2015-08-15T19:09:05Z",
    "issue": "https://github.com/sagemath/sagetest/issues/19038",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/19038#issuecomment-256765",
    "user": "https://github.com/nbruin"
}
```

<a id='comment:3'></a>For a non-finite group we'd end up doing something like this:

```
FpElementNFFunction=libgap.function_factory("FpElementNFFunction")
UnderlyingElement=libgap.function_factory("UnderlyingElement")
```

```
sage: Q=G.quotient([a*b])
sage: f=FpElementNFFunction(ElementsFamily(FamilyObj(Q.gap())))
sage: newhash=lambda q: hash(f(UnderlyingElement(q.gap())))
sage: L=[Q.0^i*Q.1^j*Q.0^k for i in range(-2,2) for j in range(-2,2) for k in range(-2,2)]
sage: collections.Counter((u==v,newhash(u)==newhash(v) ) for u in L for v in L)
Counter({(False, False): 3516, (True, True): 580})
```



---

archive/issue_comments_256766.json:
```json
{
    "body": "<a id='comment:5'></a>Are you sure that gap can always get it right for finite groups? It sounds hard to believe, since just deciding if the group is trivial or not is an undecidable problem.",
    "created_at": "2015-08-16T21:33:05Z",
    "issue": "https://github.com/sagemath/sagetest/issues/19038",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/19038#issuecomment-256766",
    "user": "https://github.com/miguelmarco"
}
```

<a id='comment:5'></a>Are you sure that gap can always get it right for finite groups? It sounds hard to believe, since just deciding if the group is trivial or not is an undecidable problem.



---

archive/issue_comments_256767.json:
```json
{
    "body": "<a id='comment:6'></a>Replying to [comment:5 mmarco]:\n> Are you sure that gap can always get it right for finite groups? It sounds hard to believe, since just deciding if the group is trivial or not is an undecidable problem.\n\n\nThe gap documentation indeed doesn't claim that it does.",
    "created_at": "2015-08-17T01:41:26Z",
    "issue": "https://github.com/sagemath/sagetest/issues/19038",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/19038#issuecomment-256767",
    "user": "https://github.com/nbruin"
}
```

<a id='comment:6'></a>Replying to [comment:5 mmarco]:
> Are you sure that gap can always get it right for finite groups? It sounds hard to believe, since just deciding if the group is trivial or not is an undecidable problem.


The gap documentation indeed doesn't claim that it does.
