# Issue 19038: Better hash on FPGroups

archive/issues_018801.json:
```json
{
    "assignees": [],
    "body": "<div id=\"comment:0\"></div>\n\nAs is pointed out on #19016 the hash on FPGroup elements is currently based on the (non-canonical) representation, whereas the equality test is a more elaborate one borrowed from Gap. That means currently, there are elements that are equal but have different hashes\n\n```\nsage: G.<a,b>=FreeGroup()\nsage: Q=G.quotient([a*b])\nsage: U=Q(a)*Q(b)\nsage: V=Q(1)\nsage: U==V\nTrue\nsage: hash(U)==hash(V)\nFalse\n```\nWhen Gap does succeed in testing equality, it does so via a normal form of its elements. One way of equipping FPGroups with a well-behaved hash is by getting that normal form from gap and hash that.\n\nThe main inspiration for how to do this would come from Gap's [MakeFpGroupCompMethod source](https://github.com/gap-system/gap/blob/master/lib/grpfp.gi#L236)\n\nCC:  @nathanncohen\n\nComponent: **algebra**\n\n_Issue created by migration from https://trac.sagemath.org/ticket/19038_\n\n",
    "created_at": "2015-08-15T18:29:53Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/c%3A%20algebra",
        "https://github.com/sagemath/sage/labels/p%3A%20major%20/%203",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "Better hash on FPGroups",
    "type": "issue",
    "updated_at": "2022-12-29T01:33:44Z",
    "url": "https://github.com/sagemath/sage/issues/19038",
    "user": "https://github.com/nbruin"
}
```
<div id="comment:0"></div>

As is pointed out on #19016 the hash on FPGroup elements is currently based on the (non-canonical) representation, whereas the equality test is a more elaborate one borrowed from Gap. That means currently, there are elements that are equal but have different hashes

```
sage: G.<a,b>=FreeGroup()
sage: Q=G.quotient([a*b])
sage: U=Q(a)*Q(b)
sage: V=Q(1)
sage: U==V
True
sage: hash(U)==hash(V)
False
```
When Gap does succeed in testing equality, it does so via a normal form of its elements. One way of equipping FPGroups with a well-behaved hash is by getting that normal form from gap and hash that.

The main inspiration for how to do this would come from Gap's [MakeFpGroupCompMethod source](https://github.com/gap-system/gap/blob/master/lib/grpfp.gi#L236)

CC:  @nathanncohen

Component: **algebra**

_Issue created by migration from https://trac.sagemath.org/ticket/19038_





---

archive/issue_events_267835.json:
```json
{
    "actor": "https://github.com/nbruin",
    "created_at": "2015-08-15T18:29:53Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/19038",
    "milestone_number": null,
    "milestone_title": "sage-6.9",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/19038#event-267835"
}
```



---

archive/issue_events_267836.json:
```json
{
    "actor": "https://github.com/nbruin",
    "created_at": "2015-08-15T18:29:53Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/19038",
    "label": "https://github.com/sagemath/sage/labels/c%3A%20algebra",
    "label_color": "0000ff",
    "label_name": "c: algebra",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/19038#event-267836"
}
```



---

archive/issue_events_267837.json:
```json
{
    "actor": "https://github.com/nbruin",
    "created_at": "2015-08-15T18:29:53Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/19038",
    "label": "https://github.com/sagemath/sage/labels/p%3A%20major%20/%203",
    "label_color": "ffbb00",
    "label_name": "p: major / 3",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/19038#event-267837"
}
```



---

archive/issue_events_267838.json:
```json
{
    "actor": "https://github.com/nbruin",
    "created_at": "2015-08-15T18:29:53Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/19038",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "d73a4a",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/19038#event-267838"
}
```



---

archive/issue_comments_268232.json:
```json
{
    "body": "<div id=\"comment:1\" align=\"right\">comment:1</div>\n\nOne case Gap can handle is that of finite groups:\n\n```\nsage: G.<a,b>=FreeGroup()\nsage: A5=G.quotient([a^3,b^3,(a/b/a/b)^2,(a^(-1)*b/a/b)^2])\n```\nand we're getting it wrong presently. (Perhaps if #19016 gets fixed, we just won't have a hash at all)\n\n```\nsage: A5(a^3)==A5(1)\nTrue\nsage: hash(A5(a^3))==hash(A5(1))\nFalse\n```\nWe can improve the situation in the following way:\n\n```\nFamilyObj=libgap.function_factory(\"FamilyObj\")\nElementsFamily=libgap.function_factory(\"ElementsFamily\")\nFPFaithHom=libgap.function_factory(\"FPFaithHom\")\nImage=libgap.function_factory(\"Image\")\n```\nwhith these definitions:\n\n```\nsage: f=FPFaithHom(ElementsFamily(FamilyObj(A5.gap())))\nsage: newhash=lambda a: hash(Image(f,a.gap()))\nsage: newhash(A5(a^3))==newhash(A5(1))\nTrue\nsage: import collections\nsage: collections.Counter((u==v,newhash(u)==newhash(v) ) for (u,v) in ( (A5.random_element(),A5.random_element()) for j in range(6000)) )\nCounter({(False, False): 5899, (True, True): 101})\n```\nGap correctly find from this finite presentation that the group is A5 and the map f is its standard permutation representation in Sym(6).",
    "created_at": "2015-08-15T18:54:18Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/19038",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/19038#issuecomment-268232",
    "user": "https://github.com/nbruin"
}
```

<div id="comment:1" align="right">comment:1</div>

One case Gap can handle is that of finite groups:

```
sage: G.<a,b>=FreeGroup()
sage: A5=G.quotient([a^3,b^3,(a/b/a/b)^2,(a^(-1)*b/a/b)^2])
```
and we're getting it wrong presently. (Perhaps if #19016 gets fixed, we just won't have a hash at all)

```
sage: A5(a^3)==A5(1)
True
sage: hash(A5(a^3))==hash(A5(1))
False
```
We can improve the situation in the following way:

```
FamilyObj=libgap.function_factory("FamilyObj")
ElementsFamily=libgap.function_factory("ElementsFamily")
FPFaithHom=libgap.function_factory("FPFaithHom")
Image=libgap.function_factory("Image")
```
whith these definitions:

```
sage: f=FPFaithHom(ElementsFamily(FamilyObj(A5.gap())))
sage: newhash=lambda a: hash(Image(f,a.gap()))
sage: newhash(A5(a^3))==newhash(A5(1))
True
sage: import collections
sage: collections.Counter((u==v,newhash(u)==newhash(v) ) for (u,v) in ( (A5.random_element(),A5.random_element()) for j in range(6000)) )
Counter({(False, False): 5899, (True, True): 101})
```
Gap correctly find from this finite presentation that the group is A5 and the map f is its standard permutation representation in Sym(6).



---

archive/issue_comments_268233.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -11,3 +11,5 @@\n False\n ```\n When Gap does succeed in testing equality, it does so via a normal form of its elements. One way of equipping FPGroups with a well-behaved hash is by getting that normal form from gap and hash that.\n+\n+The main inspiration for how to do this would come from Gap's [MakeFpGroupCompMethod source](https://github.com/gap-system/gap/blob/master/lib/grpfp.gi#L236)\n``````\n",
    "created_at": "2015-08-15T18:56:03Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/19038",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/19038#issuecomment-268233",
    "user": "https://github.com/nbruin"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -11,3 +11,5 @@
 False
 ```
 When Gap does succeed in testing equality, it does so via a normal form of its elements. One way of equipping FPGroups with a well-behaved hash is by getting that normal form from gap and hash that.
+
+The main inspiration for how to do this would come from Gap's [MakeFpGroupCompMethod source](https://github.com/gap-system/gap/blob/master/lib/grpfp.gi#L236)
``````




---

archive/issue_comments_268234.json:
```json
{
    "body": "<div id=\"comment:3\" align=\"right\">comment:3</div>\n\nFor a non-finite group we'd end up doing something like this:\n\n```\nFpElementNFFunction=libgap.function_factory(\"FpElementNFFunction\")\nUnderlyingElement=libgap.function_factory(\"UnderlyingElement\")\n```\n\n```\nsage: Q=G.quotient([a*b])\nsage: f=FpElementNFFunction(ElementsFamily(FamilyObj(Q.gap())))\nsage: newhash=lambda q: hash(f(UnderlyingElement(q.gap())))\nsage: L=[Q.0^i*Q.1^j*Q.0^k for i in range(-2,2) for j in range(-2,2) for k in range(-2,2)]\nsage: collections.Counter((u==v,newhash(u)==newhash(v) ) for u in L for v in L)\nCounter({(False, False): 3516, (True, True): 580})\n```",
    "created_at": "2015-08-15T19:09:05Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/19038",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/19038#issuecomment-268234",
    "user": "https://github.com/nbruin"
}
```

<div id="comment:3" align="right">comment:3</div>

For a non-finite group we'd end up doing something like this:

```
FpElementNFFunction=libgap.function_factory("FpElementNFFunction")
UnderlyingElement=libgap.function_factory("UnderlyingElement")
```

```
sage: Q=G.quotient([a*b])
sage: f=FpElementNFFunction(ElementsFamily(FamilyObj(Q.gap())))
sage: newhash=lambda q: hash(f(UnderlyingElement(q.gap())))
sage: L=[Q.0^i*Q.1^j*Q.0^k for i in range(-2,2) for j in range(-2,2) for k in range(-2,2)]
sage: collections.Counter((u==v,newhash(u)==newhash(v) ) for u in L for v in L)
Counter({(False, False): 3516, (True, True): 580})
```



---

archive/issue_comments_268235.json:
```json
{
    "body": "<div id=\"comment:5\" align=\"right\">comment:5</div>\n\nAre you sure that gap can always get it right for finite groups? It sounds hard to believe, since just deciding if the group is trivial or not is an undecidable problem.",
    "created_at": "2015-08-16T21:33:05Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/19038",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/19038#issuecomment-268235",
    "user": "https://github.com/miguelmarco"
}
```

<div id="comment:5" align="right">comment:5</div>

Are you sure that gap can always get it right for finite groups? It sounds hard to believe, since just deciding if the group is trivial or not is an undecidable problem.



---

archive/issue_comments_268236.json:
```json
{
    "body": "<div id=\"comment:6\" align=\"right\">comment:6</div>\n\nReplying to [@miguelmarco](#comment%3A5):\n> Are you sure that gap can always get it right for finite groups? It sounds hard to believe, since just deciding if the group is trivial or not is an undecidable problem.\n\nThe gap documentation indeed doesn't claim that it does.",
    "created_at": "2015-08-17T01:41:26Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/19038",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/19038#issuecomment-268236",
    "user": "https://github.com/nbruin"
}
```

<div id="comment:6" align="right">comment:6</div>

Replying to [@miguelmarco](#comment%3A5):
> Are you sure that gap can always get it right for finite groups? It sounds hard to believe, since just deciding if the group is trivial or not is an undecidable problem.

The gap documentation indeed doesn't claim that it does.



---

archive/issue_events_267839.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-12-29T01:33:44Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/19038",
    "milestone_number": null,
    "milestone_title": "sage-6.9",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/19038#event-267839"
}
```
