# Issue 19421: let asymptotic terms accept multivariate polynomials

archive/issues_019184.json:
```json
{
    "assignees": [],
    "body": "At the moment we have\n\n```\nsage: from sage.rings.asymptotic.term_monoid import TermMonoid\nsage: from sage.rings.asymptotic.growth_group import GrowthGroup\nsage: G_ZZ = GrowthGroup('y^ZZ*z^ZZ')\nsage: T_ZZ = TermMonoid('exact', G_ZZ, QQ)\nsage: R.<y, z> = ZZ[]\nsage: T_ZZ._get_factors_(5*y*z)\n(5*y*z,)\nsage: G_ZZ(y)*G_ZZ(z)\ny*z\nsage: G_ZZ(y*z)\nTraceback (most recent call last):\n...\nValueError: y*z is not in Growth Group y^ZZ * z^ZZ.\n> *previous* ValueError: y*z is not in any of the factors of Growth Group y^ZZ * z^ZZ\n```\nMake this work...\n\nSee also #19083, comment 64, 26.\n\nDepends on #19083\n\n**CC:**  @cheuberg @behackl\n\nIssue created by migration from https://trac.sagemath.org/ticket/19421\n\n",
    "created_at": "2015-10-16T12:08:01Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20asymptotic%20expansions",
        "https://github.com/sagemath/sage/labels/enhancement"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-6.10",
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "let asymptotic terms accept multivariate polynomials",
    "type": "issue",
    "updated_at": "2015-10-18T13:17:06Z",
    "url": "https://github.com/sagemath/sage/issues/19421",
    "user": "https://github.com/dkrenn"
}
```
At the moment we have

```
sage: from sage.rings.asymptotic.term_monoid import TermMonoid
sage: from sage.rings.asymptotic.growth_group import GrowthGroup
sage: G_ZZ = GrowthGroup('y^ZZ*z^ZZ')
sage: T_ZZ = TermMonoid('exact', G_ZZ, QQ)
sage: R.<y, z> = ZZ[]
sage: T_ZZ._get_factors_(5*y*z)
(5*y*z,)
sage: G_ZZ(y)*G_ZZ(z)
y*z
sage: G_ZZ(y*z)
Traceback (most recent call last):
...
ValueError: y*z is not in Growth Group y^ZZ * z^ZZ.
> *previous* ValueError: y*z is not in any of the factors of Growth Group y^ZZ * z^ZZ
```
Make this work...

See also #19083, comment 64, 26.

Depends on #19083

**CC:**  @cheuberg @behackl

Issue created by migration from https://trac.sagemath.org/ticket/19421





---

archive/issue_events_237464.json:
```json
{
    "actor": "https://github.com/dkrenn",
    "created_at": "2015-10-16T12:08:01Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/19421",
    "milestone_number": null,
    "milestone_title": "sage-6.10",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/19421#event-237464"
}
```



---

archive/issue_events_237465.json:
```json
{
    "actor": "https://github.com/dkrenn",
    "created_at": "2015-10-16T12:08:01Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/19421",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20asymptotic%20expansions",
    "label_color": "08517b",
    "label_name": "component: asymptotic expansions",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/19421#event-237465"
}
```



---

archive/issue_events_237466.json:
```json
{
    "actor": "https://github.com/dkrenn",
    "created_at": "2015-10-16T12:08:01Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/19421",
    "label": "https://github.com/sagemath/sage/labels/enhancement",
    "label_color": "008080",
    "label_name": "enhancement",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/19421#event-237466"
}
```
