# Issue 19974: Unify matrix __init__ methods

archive/issues_019974.json:
```json
{
    "body": "CC:  @videlec\n\nThere are various inconsistencies in matrix `__init__` methods (details to follow).\n\n1. This should work:\n\n```\nsage: M = MatrixSpace(ZZ, 2)\nsage: p = pari('[1, 2; 3, 4]')\nsage: M(p)\nTraceback (most recent call last):\n...\nTypeError: entries has the wrong length\n```\n\n2.\n\n```\nsage: MatrixSpace(ZZ, 1, 1)([1])\n[1]\nsage: MatrixSpace(ZZ, 1, 1)(vector([1]))\n---------------------------------------------------------------------------\nTypeError                                 Traceback (most recent call last)\n<ipython-input-12-d1b8d7e0999e> in <module>()\n----> 1 MatrixSpace(ZZ, Integer(1), Integer(1))(vector([Integer(1)]))\n\n/usr/local/src/sage-config/local/lib/python2.7/site-packages/sage/matrix/matrix_space.pyc in __call__(self, entries, coerce, copy, sparse)\n    549             [t]\n    550         \"\"\"\n--> 551         return self.matrix(entries, coerce, copy)\n    552 \n    553     def change_ring(self, R):\n\n/usr/local/src/sage-config/local/lib/python2.7/site-packages/sage/matrix/matrix_space.pyc in matrix(self, x, coerce, copy)\n   1564                 x = list_to_dict(x, m, n)\n   1565                 copy = False\n-> 1566         return MC(self, x, copy=copy, coerce=coerce)\n   1567 \n   1568     def matrix_space(self, nrows=None, ncols=None, sparse=False):\n\n/usr/local/src/sage-config/src/sage/matrix/matrix_integer_dense.pyx in sage.matrix.matrix_integer_dense.Matrix_integer_dense.__init__ (build/cythonized/sage/matrix/matrix_integer_dense.c:6848)()\n    349                 x = ZZ(entries)\n    350             except TypeError:\n--> 351                 raise TypeError(\"unable to coerce entry to an integer\")\n    352             is_list = False\n    353         elif type(entries) is list:\n\nTypeError: unable to coerce entry to an integer\n```\n\n3. The error message does not correspond to what is happening with other entries\n\n```\nsage: matrix(QQ,2,2,0)\n[0 0]\n[0 0]\nsage: matrix(QQ,2,2,0.0)\n[0 0]\n[0 0]\nsage: matrix(QQ,2,2,'0')\n[0 0]\n[0 0]\nsage: matrix(QQ,2,2,'0.0')\n...\nTypeError: entries must be coercible to a list or integer\n```\nIf the data must be coercible then the last 3 should fail. Though, if the ring is provided I would be less strict and also allow conversion (and make all the above work).\n\n4. The following should either work or not work for all rings\n\n```\nsage: matrix(QQ,2,2,'3')\n[3 0]\n[0 3]\nsage: matrix(RBF,2,2,'3')\n[3.000000000000000                 0]\n[                0 3.000000000000000]\nsage: matrix(ZZ,2,2,'3')\n...\nTypeError: entries has the wrong length\nsage: matrix(QQbar,2,2,'3')\n...\nTypeError: entries has the wrong length\n```\n(there is something weird above since `QQbar('3')` does not work but `ZZ('3')` does)\n\nIssue created by migration from https://trac.sagemath.org/ticket/20211\n\n",
    "closed_at": "2018-03-01T14:49:59Z",
    "created_at": "2016-03-15T10:14:41Z",
    "labels": [
        "component: linear algebra",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-duplicate/invalid/wontfix",
    "title": "Unify matrix __init__ methods",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/19974",
    "user": "https://github.com/jdemeyer"
}
```
CC:  @videlec

There are various inconsistencies in matrix `__init__` methods (details to follow).

1. This should work:

```
sage: M = MatrixSpace(ZZ, 2)
sage: p = pari('[1, 2; 3, 4]')
sage: M(p)
Traceback (most recent call last):
...
TypeError: entries has the wrong length
```

2.

```
sage: MatrixSpace(ZZ, 1, 1)([1])
[1]
sage: MatrixSpace(ZZ, 1, 1)(vector([1]))
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)
<ipython-input-12-d1b8d7e0999e> in <module>()
----> 1 MatrixSpace(ZZ, Integer(1), Integer(1))(vector([Integer(1)]))

/usr/local/src/sage-config/local/lib/python2.7/site-packages/sage/matrix/matrix_space.pyc in __call__(self, entries, coerce, copy, sparse)
    549             [t]
    550         """
--> 551         return self.matrix(entries, coerce, copy)
    552 
    553     def change_ring(self, R):

/usr/local/src/sage-config/local/lib/python2.7/site-packages/sage/matrix/matrix_space.pyc in matrix(self, x, coerce, copy)
   1564                 x = list_to_dict(x, m, n)
   1565                 copy = False
-> 1566         return MC(self, x, copy=copy, coerce=coerce)
   1567 
   1568     def matrix_space(self, nrows=None, ncols=None, sparse=False):

/usr/local/src/sage-config/src/sage/matrix/matrix_integer_dense.pyx in sage.matrix.matrix_integer_dense.Matrix_integer_dense.__init__ (build/cythonized/sage/matrix/matrix_integer_dense.c:6848)()
    349                 x = ZZ(entries)
    350             except TypeError:
--> 351                 raise TypeError("unable to coerce entry to an integer")
    352             is_list = False
    353         elif type(entries) is list:

TypeError: unable to coerce entry to an integer
```

3. The error message does not correspond to what is happening with other entries

```
sage: matrix(QQ,2,2,0)
[0 0]
[0 0]
sage: matrix(QQ,2,2,0.0)
[0 0]
[0 0]
sage: matrix(QQ,2,2,'0')
[0 0]
[0 0]
sage: matrix(QQ,2,2,'0.0')
...
TypeError: entries must be coercible to a list or integer
```
If the data must be coercible then the last 3 should fail. Though, if the ring is provided I would be less strict and also allow conversion (and make all the above work).

4. The following should either work or not work for all rings

```
sage: matrix(QQ,2,2,'3')
[3 0]
[0 3]
sage: matrix(RBF,2,2,'3')
[3.000000000000000                 0]
[                0 3.000000000000000]
sage: matrix(ZZ,2,2,'3')
...
TypeError: entries has the wrong length
sage: matrix(QQbar,2,2,'3')
...
TypeError: entries has the wrong length
```
(there is something weird above since `QQbar('3')` does not work but `ZZ('3')` does)

Issue created by migration from https://trac.sagemath.org/ticket/20211





---

archive/issue_events_054897.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2017-08-28T11:07:58Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/19974",
    "milestone": "sage-8.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/19974#event-54897"
}
```



---

archive/issue_comments_274622.json:
```json
{
    "body": "I noticed that you closed #19700 to move its resolution here, you might want to do the same with #19134.",
    "created_at": "2017-08-28T12:11:13Z",
    "issue": "https://github.com/sagemath/sagetest/issues/19974",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/19974#issuecomment-274622",
    "user": "https://github.com/mezzarobba"
}
```

I noticed that you closed #19700 to move its resolution here, you might want to do the same with #19134.



---

archive/issue_comments_274623.json:
```json
{
    "body": "Replying to [ticket:20211 jdemeyer]:\n> Though, if the ring is provided I would be less strict and also allow conversion (and make all the above work).\n\n\nIn #24742, I am disallowing strings. So `0.0` should work but not `\"0\"`.",
    "created_at": "2018-02-27T20:57:28Z",
    "issue": "https://github.com/sagemath/sagetest/issues/19974",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/19974#issuecomment-274623",
    "user": "https://github.com/jdemeyer"
}
```

Replying to [ticket:20211 jdemeyer]:
> Though, if the ring is provided I would be less strict and also allow conversion (and make all the above work).


In #24742, I am disallowing strings. So `0.0` should work but not `"0"`.



---

archive/issue_comments_274624.json:
```json
{
    "body": "I'm removing issue 5 since that's just `QQbar(3.0)` versus `ZZ(3.0)`. That has nothing to do with matrices.",
    "created_at": "2018-02-27T21:04:26Z",
    "issue": "https://github.com/sagemath/sagetest/issues/19974",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/19974#issuecomment-274624",
    "user": "https://github.com/jdemeyer"
}
```

I'm removing issue 5 since that's just `QQbar(3.0)` versus `ZZ(3.0)`. That has nothing to do with matrices.



---

archive/issue_comments_274625.json:
```json
{
    "body": "So far, issues 2, 3 and 4 are fixed in #24742. The examples involving strings all become an error and the rest works.",
    "created_at": "2018-02-27T21:05:11Z",
    "issue": "https://github.com/sagemath/sagetest/issues/19974",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/19974#issuecomment-274625",
    "user": "https://github.com/jdemeyer"
}
```

So far, issues 2, 3 and 4 are fixed in #24742. The examples involving strings all become an error and the rest works.



---

archive/issue_comments_274626.json:
```json
{
    "body": "And 1. is subtly wrong with the current version of #24742:\n\n```\nsage: M = MatrixSpace(ZZ, 2)\nsage: p = pari('[1, 2; 3, 4]')\nsage: M(p)\n[1 3]\n[2 4]\n```",
    "created_at": "2018-02-27T21:09:20Z",
    "issue": "https://github.com/sagemath/sagetest/issues/19974",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/19974#issuecomment-274626",
    "user": "https://github.com/jdemeyer"
}
```

And 1. is subtly wrong with the current version of #24742:

```
sage: M = MatrixSpace(ZZ, 2)
sage: p = pari('[1, 2; 3, 4]')
sage: M(p)
[1 3]
[2 4]
```



---

archive/issue_events_054898.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2018-03-01T14:49:59Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/19974",
    "milestone": "sage-8.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/19974#event-54898"
}
```



---

archive/issue_events_054899.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2018-03-01T14:49:59Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/19974",
    "milestone": "sage-duplicate/invalid/wontfix",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/19974#event-54899"
}
```



---

archive/issue_comments_274627.json:
```json
{
    "body": "Resolution: duplicate",
    "created_at": "2018-03-01T14:49:59Z",
    "issue": "https://github.com/sagemath/sagetest/issues/19974",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/19974#issuecomment-274627",
    "user": "https://github.com/jdemeyer"
}
```

Resolution: duplicate



---

archive/issue_events_054900.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2018-03-01T14:49:59Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/19974",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/19974#event-54900"
}
```



---

archive/issue_comments_274628.json:
```json
{
    "body": "All fixed in #24742.",
    "created_at": "2018-03-01T14:50:21Z",
    "issue": "https://github.com/sagemath/sagetest/issues/19974",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/19974#issuecomment-274628",
    "user": "https://github.com/jdemeyer"
}
```

All fixed in #24742.
