# Issue 19998: Check for and handle symbolic series in simplify

archive/issues_019761.json:
```json
{
    "assignees": [],
    "body": "\n```\nsage: (x+1).series(x,2)\n1 + 1*x\nsage: (x+1).series(x,2).operator() is None\nTrue\nsage: (x+1).series(x,2).operands()\n[1, x]\n```\nRelated (maybe a consequence) is \n\n```\nsage: (x+1).series(x,2) - 1\n(1 + 1*x) - 1\nsage: ((x+1).series(x,2) - 1).simplify()\n...\nValueError: The name \"1\" is not a valid Python identifier.\n```\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/19998\n\n",
    "created_at": "2016-02-01T12:00:53Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20symbolics",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-7.4",
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "Check for and handle symbolic series in simplify",
    "type": "issue",
    "updated_at": "2016-08-03T08:03:52Z",
    "url": "https://github.com/sagemath/sage/issues/19998",
    "user": "https://github.com/dkrenn"
}
```

```
sage: (x+1).series(x,2)
1 + 1*x
sage: (x+1).series(x,2).operator() is None
True
sage: (x+1).series(x,2).operands()
[1, x]
```
Related (maybe a consequence) is 

```
sage: (x+1).series(x,2) - 1
(1 + 1*x) - 1
sage: ((x+1).series(x,2) - 1).simplify()
...
ValueError: The name "1" is not a valid Python identifier.
```


Issue created by migration from https://trac.sagemath.org/ticket/19998





---

archive/issue_events_243954.json:
```json
{
    "actor": "https://github.com/dkrenn",
    "created_at": "2016-02-01T12:00:53Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/19998",
    "milestone_number": null,
    "milestone_title": "sage-7.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/19998#event-243954"
}
```



---

archive/issue_events_243955.json:
```json
{
    "actor": "https://github.com/dkrenn",
    "created_at": "2016-02-01T12:00:53Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/19998",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20symbolics",
    "label_color": "08517b",
    "label_name": "component: symbolics",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/19998#event-243955"
}
```



---

archive/issue_events_243956.json:
```json
{
    "actor": "https://github.com/dkrenn",
    "created_at": "2016-02-01T12:00:53Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/19998",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "008080",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/19998#event-243956"
}
```



---

archive/issue_comments_288950.json:
```json
{
    "body": "<a id='comment:1'>**Comment 1:**</a>\nIt is both a consequence of the special status series have in GiNaC. As to the latter, the documentation notes you need to apply series again for getting results:\n\n```\nsage: (x+1).series(x,2)\n1 + 1*x\nsage: _-1\n(1 + 1*x) - 1\nsage: _.series(x,2)\n1*x\n```",
    "created_at": "2016-02-05T09:16:32Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/19998",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/19998#issuecomment-288950",
    "user": "https://github.com/rwst"
}
```

<a id='comment:1'>**Comment 1:**</a>
It is both a consequence of the special status series have in GiNaC. As to the latter, the documentation notes you need to apply series again for getting results:

```
sage: (x+1).series(x,2)
1 + 1*x
sage: _-1
(1 + 1*x) - 1
sage: _.series(x,2)
1*x
```



---

archive/issue_events_243957.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2016-08-03T08:01:42Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/19998",
    "milestone_number": null,
    "milestone_title": "sage-7.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/19998#event-243957"
}
```



---

archive/issue_events_243958.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2016-08-03T08:01:42Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/19998",
    "milestone_number": null,
    "milestone_title": "sage-7.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/19998#event-243958"
}
```



---

archive/issue_events_243959.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2016-08-03T08:01:42Z",
    "event": "renamed",
    "issue": "https://github.com/sagemath/sage/issues/19998",
    "rename": {
        "from": "missing operator in symbolic series",
        "to": "Check for and handle symbolic series in simplify"
    },
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/19998#event-243959"
}
```



---

archive/issue_comments_288951.json:
```json
{
    "body": "<a id='comment:2'>**Comment 2:**</a>\nThe best way to give users what they want---apart from always automatically applying the series operator---would be to apply it in `simplify()` if the expression has a series, i.e., `((x+1).series(x,2) - 1).simplify()` should give `1*x` instead of an exception. This means that the operator to-be-applied should have as precision the min of all operators precisions in the expression.",
    "created_at": "2016-08-03T08:01:42Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/19998",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/19998#issuecomment-288951",
    "user": "https://github.com/rwst"
}
```

<a id='comment:2'>**Comment 2:**</a>
The best way to give users what they want---apart from always automatically applying the series operator---would be to apply it in `simplify()` if the expression has a series, i.e., `((x+1).series(x,2) - 1).simplify()` should give `1*x` instead of an exception. This means that the operator to-be-applied should have as precision the min of all operators precisions in the expression.
