# Issue 19998: Check for and handle symbolic series in simplify

archive/issues_019761.json:
```json
{
    "assignees": [],
    "body": "\n```\nsage: (x+1).series(x,2)\n1 + 1*x\nsage: (x+1).series(x,2).operator() is None\nTrue\nsage: (x+1).series(x,2).operands()\n[1, x]\n```\nRelated (maybe a consequence) is \n\n```\nsage: (x+1).series(x,2) - 1\n(1 + 1*x) - 1\nsage: ((x+1).series(x,2) - 1).simplify()\n...\nValueError: The name \"1\" is not a valid Python identifier.\n```\n\n\n_Issue created by migration from https://trac.sagemath.org/ticket/19998_\n\n",
    "created_at": "2016-02-01T12:00:53Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20symbolics",
        "https://github.com/sagemath/sage/labels/p3%20%E2%80%93%20major",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "Check for and handle symbolic series in simplify",
    "type": "issue",
    "updated_at": "2022-12-29T01:37:14Z",
    "url": "https://github.com/sagemath/sage/issues/19998",
    "user": "https://github.com/dkrenn"
}
```

```
sage: (x+1).series(x,2)
1 + 1*x
sage: (x+1).series(x,2).operator() is None
True
sage: (x+1).series(x,2).operands()
[1, x]
```
Related (maybe a consequence) is 

```
sage: (x+1).series(x,2) - 1
(1 + 1*x) - 1
sage: ((x+1).series(x,2) - 1).simplify()
...
ValueError: The name "1" is not a valid Python identifier.
```


_Issue created by migration from https://trac.sagemath.org/ticket/19998_





---

archive/issue_events_264711.json:
```json
{
    "actor": "https://github.com/dkrenn",
    "created_at": "2016-02-01T12:00:53Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/19998",
    "milestone_number": null,
    "milestone_title": "sage-7.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/19998#event-264711"
}
```



---

archive/issue_events_264712.json:
```json
{
    "actor": "https://github.com/dkrenn",
    "created_at": "2016-02-01T12:00:53Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/19998",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20symbolics",
    "label_color": "0000ff",
    "label_name": "component: symbolics",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/19998#event-264712"
}
```



---

archive/issue_events_264713.json:
```json
{
    "actor": "https://github.com/dkrenn",
    "created_at": "2016-02-01T12:00:53Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/19998",
    "label": "https://github.com/sagemath/sage/labels/p3%20%E2%80%93%20major",
    "label_color": "ffbb00",
    "label_name": "p3 \u2013 major",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/19998#event-264713"
}
```



---

archive/issue_events_264714.json:
```json
{
    "actor": "https://github.com/dkrenn",
    "created_at": "2016-02-01T12:00:53Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/19998",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "d73a4a",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/19998#event-264714"
}
```



---

archive/issue_comments_289025.json:
```json
{
    "body": "<a id='comment:1'>Comment 1:</a>\nIt is both a consequence of the special status series have in GiNaC. As to the latter, the documentation notes you need to apply series again for getting results:\n\n```\nsage: (x+1).series(x,2)\n1 + 1*x\nsage: _-1\n(1 + 1*x) - 1\nsage: _.series(x,2)\n1*x\n```",
    "created_at": "2016-02-05T09:16:32Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/19998",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/19998#issuecomment-289025",
    "user": "https://github.com/rwst"
}
```

<a id='comment:1'>Comment 1:</a>
It is both a consequence of the special status series have in GiNaC. As to the latter, the documentation notes you need to apply series again for getting results:

```
sage: (x+1).series(x,2)
1 + 1*x
sage: _-1
(1 + 1*x) - 1
sage: _.series(x,2)
1*x
```



---

archive/issue_events_264715.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2016-08-03T08:01:42Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/19998",
    "milestone_number": null,
    "milestone_title": "sage-7.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/19998#event-264715"
}
```



---

archive/issue_events_264716.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2016-08-03T08:01:42Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/19998",
    "milestone_number": null,
    "milestone_title": "sage-7.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/19998#event-264716"
}
```



---

archive/issue_events_264717.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2016-08-03T08:01:42Z",
    "event": "renamed",
    "issue": "https://github.com/sagemath/sage/issues/19998",
    "title_is": "Check for and handle symbolic series in simplify",
    "title_was": "missing operator in symbolic series",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/19998#event-264717"
}
```



---

archive/issue_comments_289026.json:
```json
{
    "body": "<a id='comment:2'>Comment 2:</a>\nThe best way to give users what they want---apart from always automatically applying the series operator---would be to apply it in `simplify()` if the expression has a series, i.e., `((x+1).series(x,2) - 1).simplify()` should give `1*x` instead of an exception. This means that the operator to-be-applied should have as precision the min of all operators precisions in the expression.",
    "created_at": "2016-08-03T08:01:42Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/19998",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/19998#issuecomment-289026",
    "user": "https://github.com/rwst"
}
```

<a id='comment:2'>Comment 2:</a>
The best way to give users what they want---apart from always automatically applying the series operator---would be to apply it in `simplify()` if the expression has a series, i.e., `((x+1).series(x,2) - 1).simplify()` should give `1*x` instead of an exception. This means that the operator to-be-applied should have as precision the min of all operators precisions in the expression.



---

archive/issue_events_264718.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-12-29T01:37:14Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/19998",
    "milestone_number": null,
    "milestone_title": "sage-7.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/19998#event-264718"
}
```
