# Issue 162: high precision log calls seg fault

archive/issues_000162.json:
```json
{
    "body": "This code (which I noticed in `Integer.exact_log`) causes a segfault:\n\n```\nsage: x = 3\nsage: bits = 31699256\nsage: R = RealField(bits)\nsage: y = R(x)\nsage: z = y.log()\n```\n\nI haven't investigated the underlying cause.\n\n\n\nAssignee: somebody\n\nResolution: fixed\n\nIssue created by migration from https://trac.sagemath.org/ticket/162\n\n",
    "closed_at": "2007-08-16T10:23:49Z",
    "created_at": "2006-10-29T21:56:58Z",
    "labels": [
        "component: basic arithmetic",
        "bug"
    ],
    "title": "high precision log calls seg fault",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/162",
    "user": "https://trac.sagemath.org/admin/accounts/users/dmharvey"
}
```
This code (which I noticed in `Integer.exact_log`) causes a segfault:

```
sage: x = 3
sage: bits = 31699256
sage: R = RealField(bits)
sage: y = R(x)
sage: z = y.log()
```

I haven't investigated the underlying cause.



Assignee: somebody

Resolution: fixed

Issue created by migration from https://trac.sagemath.org/ticket/162





---

archive/issue_comments_000787.json:
```json
{
    "body": "<a id='comment:1'></a>It's mpfr (=gmp) running out of memory.   I don't know how or if it is\npossible to resolve this -- they might make assumptions in those libraries\nthat preclude us dealing with the problem.  These things were much worse\nwith GMP-4.0, by the way...",
    "created_at": "2006-11-06T07:46:14Z",
    "issue": "https://github.com/sagemath/sagetest/issues/162",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/162#issuecomment-787",
    "user": "https://github.com/williamstein"
}
```

<a id='comment:1'></a>It's mpfr (=gmp) running out of memory.   I don't know how or if it is
possible to resolve this -- they might make assumptions in those libraries
that preclude us dealing with the problem.  These things were much worse
with GMP-4.0, by the way...



---

archive/issue_comments_000788.json:
```json
{
    "body": "<a id='comment:2'></a>Looking again, it's basically just that GMP doesn't work with ridiculously\nlarge precisions -- it just dies. \n\nInteresting, MAGMA seg faults on exactly the same sort of computation, and of course MAGMA uses GMP/MPFR behind the scenes:\n\n```\nwas@sage:~$ magma\nMagma V2.13-5     Fri Jan 12 2007 17:05:25 on sage     [Seed = 853493552]\nType ? for help.  Type <Ctrl>-D to quit.\n> x := 3**10000000;\n\n>> x := 3**10000000;\n         ^\nUser error: bad syntax\n> x := 3^10000000; \n> R := RealField(31699256);\n> y := R!x;\n> time z=Log(y);\n\n>> time z=Log(y);\n        ^\nUser error: Identifier 'z' has not been declared or assigned\n> time z:=Log(y);\nSegmentation fault\n```",
    "created_at": "2007-01-13T01:06:35Z",
    "issue": "https://github.com/sagemath/sagetest/issues/162",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/162#issuecomment-788",
    "user": "https://github.com/williamstein"
}
```

<a id='comment:2'></a>Looking again, it's basically just that GMP doesn't work with ridiculously
large precisions -- it just dies. 

Interesting, MAGMA seg faults on exactly the same sort of computation, and of course MAGMA uses GMP/MPFR behind the scenes:

```
was@sage:~$ magma
Magma V2.13-5     Fri Jan 12 2007 17:05:25 on sage     [Seed = 853493552]
Type ? for help.  Type <Ctrl>-D to quit.
> x := 3**10000000;

>> x := 3**10000000;
         ^
User error: bad syntax
> x := 3^10000000; 
> R := RealField(31699256);
> y := R!x;
> time z=Log(y);

>> time z=Log(y);
        ^
User error: Identifier 'z' has not been declared or assigned
> time z:=Log(y);
Segmentation fault
```



---

archive/issue_comments_000789.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -4,7 +4,7 @@\n sage: x = 3**10000000\n sage: bits = 31699256\n sage: R = RealField(bits)\n-sage: y = x._mpfr_(R)\n+sage: y = R(x)\n sage: z = y.log()\n ```\n \n``````\n",
    "created_at": "2007-01-24T03:48:10Z",
    "issue": "https://github.com/sagemath/sagetest/issues/162",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/162#issuecomment-789",
    "user": "https://github.com/williamstein"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -4,7 +4,7 @@
 sage: x = 3**10000000
 sage: bits = 31699256
 sage: R = RealField(bits)
-sage: y = x._mpfr_(R)
+sage: y = R(x)
 sage: z = y.log()
 ```
 
``````




---

archive/issue_comments_000790.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -1,7 +1,7 @@\n This code (which I noticed in `Integer.exact_log`) causes a segfault:\n \n ```\n-sage: x = 3**10000000\n+sage: x = 3\n sage: bits = 31699256\n sage: R = RealField(bits)\n sage: y = R(x)\n``````\n",
    "created_at": "2007-08-16T09:51:29Z",
    "issue": "https://github.com/sagemath/sagetest/issues/162",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/162#issuecomment-790",
    "user": "https://github.com/williamstein"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -1,7 +1,7 @@
 This code (which I noticed in `Integer.exact_log`) causes a segfault:
 
 ```
-sage: x = 3**10000000
+sage: x = 3
 sage: bits = 31699256
 sage: R = RealField(bits)
 sage: y = R(x)
``````




---

archive/issue_comments_000791.json:
```json
{
    "body": "<a id='comment:6'></a>This is a basic mpfr problem.  Any super-high precision arithmetic breaks with SAGE or Magma:\n\n```\nwas@ubuntu:~$ magma\nMagma V2.13-10    Thu Aug 16 2007 02:54:37 on ubuntu   [Seed = 3360329821]\nType ? for help.  Type <Ctrl>-D to quit.\n> R := RealField(31699256);\n> y := R!3;\n> z := y*y;\nSegmentation fault\nwas@ubuntu:~$    \n\nSame on 64-bit:\n\nwas@sage:~$ magma\nMagma V2.13-5     Thu Aug 16 2007 02:56:05 on sage     [Seed = 4101418455]\nType ? for help.  Type <Ctrl>-D to quit.\n> R := RealField(31699256);\n> y := R!3;\n> z := y*y;\nSegmentation fault\nwas@sage:~$   \n```\n\nProposed solution -- in SAGE, don't allow construction of RealField(n) for\nn > 2^23.",
    "created_at": "2007-08-16T10:06:26Z",
    "issue": "https://github.com/sagemath/sagetest/issues/162",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/162#issuecomment-791",
    "user": "https://github.com/williamstein"
}
```

<a id='comment:6'></a>This is a basic mpfr problem.  Any super-high precision arithmetic breaks with SAGE or Magma:

```
was@ubuntu:~$ magma
Magma V2.13-10    Thu Aug 16 2007 02:54:37 on ubuntu   [Seed = 3360329821]
Type ? for help.  Type <Ctrl>-D to quit.
> R := RealField(31699256);
> y := R!3;
> z := y*y;
Segmentation fault
was@ubuntu:~$    

Same on 64-bit:

was@sage:~$ magma
Magma V2.13-5     Thu Aug 16 2007 02:56:05 on sage     [Seed = 4101418455]
Type ? for help.  Type <Ctrl>-D to quit.
> R := RealField(31699256);
> y := R!3;
> z := y*y;
Segmentation fault
was@sage:~$   
```

Proposed solution -- in SAGE, don't allow construction of RealField(n) for
n > 2^23.



---

archive/issue_comments_000792.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -10,3 +10,4 @@\n \n I haven't investigated the underlying cause.\n \n+\n``````\n",
    "created_at": "2007-08-16T10:06:26Z",
    "issue": "https://github.com/sagemath/sagetest/issues/162",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/162#issuecomment-792",
    "user": "https://github.com/williamstein"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -10,3 +10,4 @@
 
 I haven't investigated the underlying cause.
 
+
``````




---

archive/issue_comments_000793.json:
```json
{
    "body": "Attachment [5762.patch](tarball://root/attachments/some-uuid/ticket162/5762.patch) by @williamstein created at 2007-08-16 10:23:27\n\nfix",
    "created_at": "2007-08-16T10:23:27Z",
    "issue": "https://github.com/sagemath/sagetest/issues/162",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/162#issuecomment-793",
    "user": "https://github.com/williamstein"
}
```

Attachment [5762.patch](tarball://root/attachments/some-uuid/ticket162/5762.patch) by @williamstein created at 2007-08-16 10:23:27

fix



---

archive/issue_events_000296.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2007-08-16T10:23:49Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/162",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/162#event-296"
}
```



---

archive/issue_comments_000794.json:
```json
{
    "body": "Resolution: fixed",
    "created_at": "2007-08-16T10:23:49Z",
    "issue": "https://github.com/sagemath/sagetest/issues/162",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/162#issuecomment-794",
    "user": "https://github.com/williamstein"
}
```

Resolution: fixed
