# Issue 178: Sage()._get() does not return the correct result in some instances

archive/issues_000178.json:
```json
{
    "assignees": [
        "https://github.com/boothby"
    ],
    "body": "\n```\nsage: P = Sage()\nsage: P._send('factor(2^250-1)')\nsage: P._get()\n(True, 'factor(2^250-1)\\r\\n251\\r\\n')\nsage: P._get()\n(False, '')\nsage: \n\nThe output from factor(2^250-1) should be:\nsage: factor(2^250-1)\n3 * 11 * 31 * 251 * 601 * 1801 * 4051 * 229668251 * 269089806001 * 4710883168879506001 * 5519485418336288303251\n\nAny idea why it is dropping off chars left and right?\n```\n\nComponent: **notebook**\n\nKeywords: **Sage() expect Pexpect**\n\n_Issue created by migration from https://trac.sagemath.org/ticket/178_\n\n",
    "closed_at": "2006-12-08T01:31:33Z",
    "created_at": "2006-12-08T01:17:31Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/c%3A%20user%20interface",
        "https://github.com/sagemath/sage/labels/p%3A%20major%20/%203",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-1.5",
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "Sage()._get() does not return the correct result in some instances",
    "type": "issue",
    "updated_at": "2006-12-08T01:31:33Z",
    "url": "https://github.com/sagemath/sage/issues/178",
    "user": "https://github.com/yqiang"
}
```

```
sage: P = Sage()
sage: P._send('factor(2^250-1)')
sage: P._get()
(True, 'factor(2^250-1)\r\n251\r\n')
sage: P._get()
(False, '')
sage: 

The output from factor(2^250-1) should be:
sage: factor(2^250-1)
3 * 11 * 31 * 251 * 601 * 1801 * 4051 * 229668251 * 269089806001 * 4710883168879506001 * 5519485418336288303251

Any idea why it is dropping off chars left and right?
```

Component: **notebook**

Keywords: **Sage() expect Pexpect**

_Issue created by migration from https://trac.sagemath.org/ticket/178_





---

archive/issue_events_001264.json:
```json
{
    "actor": "https://github.com/yqiang",
    "created_at": "2006-12-08T01:17:31Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/178",
    "milestone_number": null,
    "milestone_title": "sage-1.5",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/178#event-1264"
}
```



---

archive/issue_events_001265.json:
```json
{
    "actor": "https://github.com/yqiang",
    "created_at": "2006-12-08T01:17:31Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/178",
    "label": "https://github.com/sagemath/sage/labels/c%3A%20user%20interface",
    "label_color": "0000b0",
    "label_name": "c: user interface",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/178#event-1265"
}
```



---

archive/issue_events_001266.json:
```json
{
    "actor": "https://github.com/yqiang",
    "created_at": "2006-12-08T01:17:31Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/178",
    "label": "https://github.com/sagemath/sage/labels/p%3A%20major%20/%203",
    "label_color": "ffbb00",
    "label_name": "p: major / 3",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/178#event-1266"
}
```



---

archive/issue_events_001267.json:
```json
{
    "actor": "https://github.com/yqiang",
    "created_at": "2006-12-08T01:17:31Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/178",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "d73a4a",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/178#event-1267"
}
```



---

archive/issue_events_001268.json:
```json
{
    "actor": "https://github.com/boothby",
    "created_at": "2006-12-08T01:17:31Z",
    "event": "assigned",
    "issue": "https://github.com/sagemath/sage/issues/178",
    "subject": "https://github.com/yqiang",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/178#event-1268"
}
```



---

archive/issue_comments_000566.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -1,3 +1,5 @@\n+\n+```\n sage: P = Sage()\n sage: P._send('factor(2^250-1)')\n sage: P._get()\n@@ -11,3 +13,4 @@\n 3 * 11 * 31 * 251 * 601 * 1801 * 4051 * 229668251 * 269089806001 * 4710883168879506001 * 5519485418336288303251\n \n Any idea why it is dropping off chars left and right?\n+```\n``````\n",
    "created_at": "2006-12-08T01:29:30Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/178",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/178#issuecomment-566",
    "user": "https://github.com/williamstein"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -1,3 +1,5 @@
+
+```
 sage: P = Sage()
 sage: P._send('factor(2^250-1)')
 sage: P._get()
@@ -11,3 +13,4 @@
 3 * 11 * 31 * 251 * 601 * 1801 * 4051 * 229668251 * 269089806001 * 4710883168879506001 * 5519485418336288303251
 
 Any idea why it is dropping off chars left and right?
+```
``````




---

archive/issue_events_001269.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2006-12-08T01:31:33Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/178",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/178#event-1269"
}
```



---

archive/issue_comments_000567.json:
```json
{
    "body": "<div id=\"comment:2\" align=\"right\">comment:2</div>\n\nInput to Sage() is *not* preparsed -- you have to do it.  So 2^250 - 1\nis actually just 251!!  It's \"2 xor 250 minus 1\".",
    "created_at": "2006-12-08T01:31:33Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/178",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/178#issuecomment-567",
    "user": "https://github.com/williamstein"
}
```

<div id="comment:2" align="right">comment:2</div>

Input to Sage() is *not* preparsed -- you have to do it.  So 2^250 - 1
is actually just 251!!  It's "2 xor 250 minus 1".
