# Issue 20: coercion issues

archive/issues_000020.json:
```json
{
    "assignees": [],
    "body": "\n```\nFrom David Harvey:\nFurther to our discussion of a few days ago, I found something quite confusing, not sure what the correct behaviour should be.\n \nsage: poly_ring1.<gen1> = PolynomialRing(QQ)\nsage: poly_ring2.<gen2> = PolynomialRing(QQ)\nsage: huge_ring.<x> = PolynomialRing(poly_ring1)\nsage: huge_ring(gen1)\n gen1\nsage: huge_ring(gen2)\n x\n \nIn the first example gen1 is getting coerced into a constant polynomial because it belongs to the coefficient ring, and in the second example it's \"renaming the variable\". I suppose that makes sense, although I'm a bit uneasy about the second one.\n \nBUT it's not consistent with the behaviour for power series:\n \nsage: power_ring1.<gen1> = PowerSeriesRing(QQ)\nsage: power_ring2.<gen2> = PowerSeriesRing(QQ)\nsage: huge_power_ring.<x> = PowerSeriesRing(power_ring1)\nsage: huge_power_ring(gen1)\n x\nsage: huge_power_ring(gen2)\n x\n \nIs this a bug?\n\nResponse: from william: \"Yes\"\n```\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/20\n\n",
    "closed_at": "2007-01-07T03:36:23Z",
    "created_at": "2006-09-12T23:20:48Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20basic%20arithmetic",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "coercion issues",
    "type": "issue",
    "updated_at": "2007-01-07T03:36:23Z",
    "url": "https://github.com/sagemath/sage/issues/20",
    "user": "https://github.com/williamstein"
}
```

```
From David Harvey:
Further to our discussion of a few days ago, I found something quite confusing, not sure what the correct behaviour should be.
 
sage: poly_ring1.<gen1> = PolynomialRing(QQ)
sage: poly_ring2.<gen2> = PolynomialRing(QQ)
sage: huge_ring.<x> = PolynomialRing(poly_ring1)
sage: huge_ring(gen1)
 gen1
sage: huge_ring(gen2)
 x
 
In the first example gen1 is getting coerced into a constant polynomial because it belongs to the coefficient ring, and in the second example it's "renaming the variable". I suppose that makes sense, although I'm a bit uneasy about the second one.
 
BUT it's not consistent with the behaviour for power series:
 
sage: power_ring1.<gen1> = PowerSeriesRing(QQ)
sage: power_ring2.<gen2> = PowerSeriesRing(QQ)
sage: huge_power_ring.<x> = PowerSeriesRing(power_ring1)
sage: huge_power_ring(gen1)
 x
sage: huge_power_ring(gen2)
 x
 
Is this a bug?

Response: from william: "Yes"
```


Issue created by migration from https://trac.sagemath.org/ticket/20





---

archive/issue_events_000110.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2006-09-12T23:20:48Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/20",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20basic%20arithmetic",
    "label_color": "08517b",
    "label_name": "component: basic arithmetic",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/20#event-110"
}
```



---

archive/issue_events_000111.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2006-09-12T23:20:48Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/20",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "008080",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/20#event-111"
}
```



---

archive/issue_comments_000052.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -1,4 +1,6 @@\n-{{{From David Harvey:\n+\n+```\n+From David Harvey:\n Further to our discussion of a few days ago, I found something quite confusing, not sure what the correct behaviour should be.\n  \n sage: poly_ring1.<gen1> = PolynomialRing(QQ)\n@@ -24,5 +26,5 @@\n Is this a bug?\n \n Response: from william: \"Yes\"\n-}}}\n+```\n \n``````\n",
    "created_at": "2007-01-07T03:31:59Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/20",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/20#issuecomment-52",
    "user": "https://github.com/williamstein"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -1,4 +1,6 @@
-{{{From David Harvey:
+
+```
+From David Harvey:
 Further to our discussion of a few days ago, I found something quite confusing, not sure what the correct behaviour should be.
  
 sage: poly_ring1.<gen1> = PolynomialRing(QQ)
@@ -24,5 +26,5 @@
 Is this a bug?
 
 Response: from william: "Yes"
-}}}
+```
 
``````




---

archive/issue_events_000112.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2007-01-07T03:36:23Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/20",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/20#event-112"
}
```



---

archive/issue_comments_000053.json:
```json
{
    "body": "<a id='comment:2'>**Comment 2:**</a>\nThis is fixed in sage-1.5:\n\n```\nsage: power_ring1.<gen1> = PowerSeriesRing(QQ)\nsage: power_ring2.<gen2> = PowerSeriesRing(QQ)\nsage: huge_power_ring.<x> = PowerSeriesRing(power_ring1)\nsage: huge_power_ring(gen1)\ngen1\nsage: huge_power_ring(gen2)\nx\n```",
    "created_at": "2007-01-07T03:36:23Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/20",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/20#issuecomment-53",
    "user": "https://github.com/williamstein"
}
```

<a id='comment:2'>**Comment 2:**</a>
This is fixed in sage-1.5:

```
sage: power_ring1.<gen1> = PowerSeriesRing(QQ)
sage: power_ring2.<gen2> = PowerSeriesRing(QQ)
sage: huge_power_ring.<x> = PowerSeriesRing(power_ring1)
sage: huge_power_ring(gen1)
gen1
sage: huge_power_ring(gen2)
x
```
