# Issue 203: more elliptic curve n*P problems

archive/issues_000203.json:
```json
{
    "assignees": [
        "https://github.com/williamstein"
    ],
    "body": "\n```\nArgh!  Curves over extension fields don't work?\n \nsage: E\nElliptic Curve defined by y^2  = x^3 + x over Finite Field in a of size 5^2\n \nsage: P\n(a : 2*a + 4 : 1)\n \nsage: P+P+P+P+P\n(2*a + 3 : 2*a : 1)\n \nsage: 5*P\n(0 : 1 : 0)\n\n \nsage: 5*P\n(0 : 1 : 0)\n \nsage: P*5\n(2*a + 3 : 2*a : 1)\n```\n\nComponent: **algebraic geometry**\n\n_Issue created by migration from https://trac.sagemath.org/ticket/203_\n\n",
    "closed_at": "2007-01-23T23:30:33Z",
    "created_at": "2007-01-21T03:44:16Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/c%3A%20algebraic%20geometry",
        "https://github.com/sagemath/sage/labels/p%3A%203%20%E2%80%93%20major",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-1.9",
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "more elliptic curve n*P problems",
    "type": "issue",
    "updated_at": "2007-01-23T23:30:33Z",
    "url": "https://github.com/sagemath/sage/issues/203",
    "user": "https://github.com/williamstein"
}
```

```
Argh!  Curves over extension fields don't work?
 
sage: E
Elliptic Curve defined by y^2  = x^3 + x over Finite Field in a of size 5^2
 
sage: P
(a : 2*a + 4 : 1)
 
sage: P+P+P+P+P
(2*a + 3 : 2*a : 1)
 
sage: 5*P
(0 : 1 : 0)

 
sage: 5*P
(0 : 1 : 0)
 
sage: P*5
(2*a + 3 : 2*a : 1)
```

Component: **algebraic geometry**

_Issue created by migration from https://trac.sagemath.org/ticket/203_





---

archive/issue_events_001504.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2007-01-21T03:44:16Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/203",
    "milestone_number": null,
    "milestone_title": "sage-1.9",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/203#event-1504"
}
```



---

archive/issue_events_001505.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2007-01-21T03:44:16Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/203",
    "label": "https://github.com/sagemath/sage/labels/c%3A%20algebraic%20geometry",
    "label_color": "0000ff",
    "label_name": "c: algebraic geometry",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/203#event-1505"
}
```



---

archive/issue_events_001506.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2007-01-21T03:44:16Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/203",
    "label": "https://github.com/sagemath/sage/labels/p%3A%203%20%E2%80%93%20major",
    "label_color": "ffbb00",
    "label_name": "p: 3 \u2013 major",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/203#event-1506"
}
```



---

archive/issue_events_001507.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2007-01-21T03:44:16Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/203",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "d73a4a",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/203#event-1507"
}
```



---

archive/issue_events_001508.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2007-01-21T03:44:16Z",
    "event": "assigned",
    "issue": "https://github.com/sagemath/sage/issues/203",
    "subject": "https://github.com/williamstein",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/203#event-1508"
}
```



---

archive/issue_comments_000628.json:
```json
{
    "body": "<div id=\"comment:1\" align=\"right\">comment:1</div>\n\nThis is caused because\n\n  P.parent().base() \n\nis the finite field instead of ZZ.  But that base is supposed to be\nthe base ring for the module that P is in!  Ouch.\n\nWilliam",
    "created_at": "2007-01-23T22:05:53Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/203",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/203#issuecomment-628",
    "user": "https://github.com/williamstein"
}
```

<div id="comment:1" align="right">comment:1</div>

This is caused because

  P.parent().base() 

is the finite field instead of ZZ.  But that base is supposed to be
the base ring for the module that P is in!  Ouch.

William



---

archive/issue_comments_000629.json:
```json
{
    "body": "<div id=\"comment:2\" align=\"right\">comment:2</div>\n\nFixed for sage > 1.8.  Actually pretty subtle to fix...",
    "created_at": "2007-01-23T23:30:33Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/203",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/203#issuecomment-629",
    "user": "https://github.com/williamstein"
}
```

<div id="comment:2" align="right">comment:2</div>

Fixed for sage > 1.8.  Actually pretty subtle to fix...



---

archive/issue_events_001509.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2007-01-23T23:30:33Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/203",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/203#event-1509"
}
```
