# Issue 232: assert statement does not work in sage

archive/issues_000232.json:
```json
{
    "assignees": [],
    "body": "Different behavior in sage shell than in regular python shell:\n\n```\nsage: x = 5\nsage: y = 3\nsage: assert x==y\nsage:\n\nin python:\n>>> x = 5\n>>> y = 3\n>>> assert x==y\nTraceback (most recent call last):\n  File \"<stdin>\", line 1, in <module>\nAssertionError\n>>>\n\n```\n\n\n**Assignee:** @williamstein\n\n**Keywords:** python assert\n\nIssue created by migration from https://trac.sagemath.org/ticket/232\n\n",
    "closed_at": "2007-01-29T20:41:07Z",
    "created_at": "2007-01-29T20:07:29Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20interfaces",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "assert statement does not work in sage",
    "type": "issue",
    "updated_at": "2007-01-29T20:41:07Z",
    "url": "https://github.com/sagemath/sage/issues/232",
    "user": "https://github.com/yqiang"
}
```
Different behavior in sage shell than in regular python shell:

```
sage: x = 5
sage: y = 3
sage: assert x==y
sage:

in python:
>>> x = 5
>>> y = 3
>>> assert x==y
Traceback (most recent call last):
  File "<stdin>", line 1, in <module>
AssertionError
>>>

```


**Assignee:** @williamstein

**Keywords:** python assert

Issue created by migration from https://trac.sagemath.org/ticket/232





---

archive/issue_comments_000735.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -1,5 +1,6 @@\n Different behavior in sage shell than in regular python shell:\n \n+```\n sage: x = 5\n sage: y = 3\n sage: assert x==y\n@@ -9,11 +10,10 @@\n >>> x = 5\n >>> y = 3\n >>> assert x==y\n-\n Traceback (most recent call last):\n   File \"<stdin>\", line 1, in <module>\n AssertionError\n >>>\n \n+```\n \n-\n``````\n",
    "created_at": "2007-01-29T20:14:46Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/232",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/232#issuecomment-735",
    "user": "https://github.com/williamstein"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -1,5 +1,6 @@
 Different behavior in sage shell than in regular python shell:
 
+```
 sage: x = 5
 sage: y = 3
 sage: assert x==y
@@ -9,11 +10,10 @@
 >>> x = 5
 >>> y = 3
 >>> assert x==y
-
 Traceback (most recent call last):
   File "<stdin>", line 1, in <module>
 AssertionError
 >>>
 
+```
 
-
``````




---

archive/issue_comments_000736.json:
```json
{
    "body": "<a id='comment:2'></a>\nThis is a SAGE/Ipython interaction problem, since assert works fine in the SAGE Notebook, and with dsage.client...",
    "created_at": "2007-01-29T20:17:41Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/232",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/232#issuecomment-736",
    "user": "https://github.com/williamstein"
}
```

<a id='comment:2'></a>
This is a SAGE/Ipython interaction problem, since assert works fine in the SAGE Notebook, and with dsage.client...



---

archive/issue_comments_000737.json:
```json
{
    "body": "<a id='comment:3'></a>\nFixed for sage > 2.0.",
    "created_at": "2007-01-29T20:41:07Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/232",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/232#issuecomment-737",
    "user": "https://github.com/williamstein"
}
```

<a id='comment:3'></a>
Fixed for sage > 2.0.



---

archive/issue_events_000786.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2007-01-29T20:41:07Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/232",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/232#event-786"
}
```
