# Issue 239: x^(3/4) powering/coercion issue

archive/issues_000239.json:
```json
{
    "assignees": [],
    "body": "\n\n```\n> Can someone please add support for evaluating say 2^(3/4) or 7^(5/3).\n>  \n> > \n>  \n \nAbout this I just found this bug:\n \nsage: x=maxima('x')\n \nsage: x^(3/4)\n x^3/4\n \nsage: x=maxima('2')\n \nsage: x^150\n 1427247692705959881058285969449495136382746624\n \nsage: x^(3/4)\n 2\n \nsage: maxima(3/4)\n 3/4\n \nGreg\n```\n\nGreg's problem is that the exponent is rounded maybe, since `x^(3/4)` should be the same as `x^(maxima('3/4'))`. \n\n\nComponent: **basic arithmetic**\n\n_Issue created by migration from https://trac.sagemath.org/ticket/239_\n\n",
    "closed_at": "2007-02-03T17:33:16Z",
    "created_at": "2007-02-03T10:13:33Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/c%3A%20basic%20arithmetic",
        "https://github.com/sagemath/sage/labels/p%3A%204%20%E2%80%93%20minor",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "x^(3/4) powering/coercion issue",
    "type": "issue",
    "updated_at": "2007-02-03T17:33:16Z",
    "url": "https://github.com/sagemath/sage/issues/239",
    "user": "https://github.com/williamstein"
}
```


```
> Can someone please add support for evaluating say 2^(3/4) or 7^(5/3).
>  
> > 
>  
 
About this I just found this bug:
 
sage: x=maxima('x')
 
sage: x^(3/4)
 x^3/4
 
sage: x=maxima('2')
 
sage: x^150
 1427247692705959881058285969449495136382746624
 
sage: x^(3/4)
 2
 
sage: maxima(3/4)
 3/4
 
Greg
```

Greg's problem is that the exponent is rounded maybe, since `x^(3/4)` should be the same as `x^(maxima('3/4'))`. 


Component: **basic arithmetic**

_Issue created by migration from https://trac.sagemath.org/ticket/239_





---

archive/issue_events_001784.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2007-02-03T10:13:33Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/239",
    "label": "https://github.com/sagemath/sage/labels/c%3A%20basic%20arithmetic",
    "label_color": "0000ff",
    "label_name": "c: basic arithmetic",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/239#event-1784"
}
```



---

archive/issue_events_001785.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2007-02-03T10:13:33Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/239",
    "label": "https://github.com/sagemath/sage/labels/p%3A%204%20%E2%80%93%20minor",
    "label_color": "ffe799",
    "label_name": "p: 4 \u2013 minor",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/239#event-1785"
}
```



---

archive/issue_events_001786.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2007-02-03T10:13:33Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/239",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "d73a4a",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/239#event-1786"
}
```



---

archive/issue_events_001787.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2007-02-03T10:13:49Z",
    "event": "renamed",
    "issue": "https://github.com/sagemath/sage/issues/239",
    "title_is": "x^(3/4) powering/coercion issue",
    "title_was": "x^(3/4) rounding issue",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/239#event-1787"
}
```



---

archive/issue_comments_000733.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -27,5 +27,5 @@\n Greg\n ```\n \n-Greg's problem is that the exponent is rounded maybe, since x^(3/4) should be the same as x^(maxima('3/4')). \n+Greg's problem is that the exponent is rounded maybe, since `x^(3/4)` should be the same as `x^(maxima('3/4'))`. \n \n``````\n",
    "created_at": "2007-02-03T10:14:08Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/239",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/239#issuecomment-733",
    "user": "https://github.com/williamstein"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -27,5 +27,5 @@
 Greg
 ```
 
-Greg's problem is that the exponent is rounded maybe, since x^(3/4) should be the same as x^(maxima('3/4')). 
+Greg's problem is that the exponent is rounded maybe, since `x^(3/4)` should be the same as `x^(maxima('3/4'))`. 
 
``````




---

archive/issue_comments_000734.json:
```json
{
    "body": "<div id=\"comment:3\" align=\"right\">comment:3</div>\n\n\n```\nIs this the same bug?  The types involved seem very diverse, but the strange \nresult appears remarkably similar.\n \nsage: CF=CyclotomicField(3)\nsage: two=CF(2)\nsage: two^(1/3)\n1\nsage: me=two^(1/3)\nsage: me.parent()\nCyclotomic Field of order 3 and degree 2\n \n--\n```",
    "created_at": "2007-02-03T16:52:02Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/239",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/239#issuecomment-734",
    "user": "https://github.com/williamstein"
}
```

<div id="comment:3" align="right">comment:3</div>


```
Is this the same bug?  The types involved seem very diverse, but the strange 
result appears remarkably similar.
 
sage: CF=CyclotomicField(3)
sage: two=CF(2)
sage: two^(1/3)
1
sage: me=two^(1/3)
sage: me.parent()
Cyclotomic Field of order 3 and degree 2
 
--
```



---

archive/issue_events_001788.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2007-02-03T17:33:16Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/239",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/239#event-1788"
}
```



---

archive/issue_comments_000735.json:
```json
{
    "body": "<div id=\"comment:4\" align=\"right\">comment:4</div>\n\nThis is now fixed for sage 2.1.   The fix involved making `__pow__` more careful (to raise an error in many cases).",
    "created_at": "2007-02-03T17:33:16Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/239",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/239#issuecomment-735",
    "user": "https://github.com/williamstein"
}
```

<div id="comment:4" align="right">comment:4</div>

This is now fixed for sage 2.1.   The fix involved making `__pow__` more careful (to raise an error in many cases).
