# Issue 281: [looks fixed] Errors in matrix for extensions of NumberFields

archive/issues_000281.json:
```json
{
    "assignees": [],
    "body": "The following is incorrect:\n\n```\nsage: K.<a> = NumberField(ZZ['x'].0^3 - 5)\n\nsage: L.<b> = K.extension(K['x'].0^2 - 3)\n\nsage: b.matrix()\n \n[0 1]\n[0 0]\n\nsage: M.<c> = NumberField(ZZ['x'].0^2 - 3)\n\nsage: c.matrix()\n \n[0 1]\n[3 0]\n```\n\n**Keywords:** extension numberfield matrix polynomial\n\nIssue created by migration from https://trac.sagemath.org/ticket/281\n\n",
    "closed_at": "2007-10-24T03:38:14Z",
    "created_at": "2007-02-23T20:01:46Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20basic%20arithmetic",
        "https://github.com/sagemath/sage/labels/enhancement"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-2.8.9",
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "[looks fixed] Errors in matrix for extensions of NumberFields",
    "type": "issue",
    "updated_at": "2007-10-24T12:18:17Z",
    "url": "https://github.com/sagemath/sage/issues/281",
    "user": "https://github.com/ncalexan"
}
```
The following is incorrect:

```
sage: K.<a> = NumberField(ZZ['x'].0^3 - 5)

sage: L.<b> = K.extension(K['x'].0^2 - 3)

sage: b.matrix()
 
[0 1]
[0 0]

sage: M.<c> = NumberField(ZZ['x'].0^2 - 3)

sage: c.matrix()
 
[0 1]
[3 0]
```

**Keywords:** extension numberfield matrix polynomial

Issue created by migration from https://trac.sagemath.org/ticket/281





---

archive/issue_comments_001018.json:
```json
{
    "body": "<a id='comment:1'></a>\nThis is simply not implemented, and will be hard to do without rewriting number fields completely :-)\nDavid Roe?\n\nAnyway, in sAge-2.8 it raises a notimplementederror, so I've changed this from bug to enhancement.\n\nWilliam\n\n```\nsage: K.<a> = NumberField(ZZ['x'].0^3 - 5)\nsage: L.<b> = K.extension(K['x'].0^2 - 3)\nsage: b.matrix()\n...    \nTraceback (most recent call last):\n...\nNotImplementedError\n```",
    "created_at": "2007-08-18T20:54:35Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/281",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/281#issuecomment-1018",
    "user": "https://github.com/williamstein"
}
```

<a id='comment:1'></a>
This is simply not implemented, and will be hard to do without rewriting number fields completely :-)
David Roe?

Anyway, in sAge-2.8 it raises a notimplementederror, so I've changed this from bug to enhancement.

William

```
sage: K.<a> = NumberField(ZZ['x'].0^3 - 5)
sage: L.<b> = K.extension(K['x'].0^2 - 3)
sage: b.matrix()
...    
Traceback (most recent call last):
...
NotImplementedError
```



---

archive/issue_events_001046.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2007-08-18T20:54:35Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/281",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "008080",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/281#event-1046"
}
```



---

archive/issue_events_001047.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2007-08-18T20:54:35Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/281",
    "label": "https://github.com/sagemath/sage/labels/enhancement",
    "label_color": "008080",
    "label_name": "enhancement",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/281#event-1047"
}
```



---

archive/issue_events_001048.json:
```json
{
    "actor": "https://github.com/sagetrac-mabshoff",
    "created_at": "2007-09-10T05:27:38Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/281",
    "label": "https://github.com/sagemath/sage/labels/feature",
    "label_color": "008080",
    "label_name": "feature",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/281#event-1048"
}
```



---

archive/issue_events_001049.json:
```json
{
    "actor": "https://github.com/sagetrac-mabshoff",
    "created_at": "2007-10-21T13:55:55Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/281",
    "milestone_number": null,
    "milestone_title": "sage-2.8.9",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/281#event-1049"
}
```



---

archive/issue_events_001050.json:
```json
{
    "actor": "https://github.com/sagetrac-mabshoff",
    "created_at": "2007-10-21T13:55:55Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/281",
    "label": "https://github.com/sagemath/sage/labels/feature",
    "label_color": "008080",
    "label_name": "feature",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/281#event-1050"
}
```



---

archive/issue_comments_001019.json:
```json
{
    "body": "<a id='comment:3'></a>\nIt works with Sage 2.8.8:\n\n```\nmabshoff@sage:/tmp/Work-mabshoff/sage-2.8.8$ sage\n----------------------------------------------------------------------\n| SAGE Version 2.8.8, Release Date: 2007-10-20                       |\n| Type notebook() for the GUI, and license() for information.        |\n----------------------------------------------------------------------\n\nsage: sage: K.<a> = NumberField(ZZ['x'].0^3 - 5)\nsage: sage: L.<b> = K.extension(K['x'].0^2 - 3)\nsage: sage: b.matrix()\n\n[0 1]\n[3 0]\nsage: \n```\n\nCheers,\n\nMichael",
    "created_at": "2007-10-21T13:55:55Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/281",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/281#issuecomment-1019",
    "user": "https://github.com/sagetrac-mabshoff"
}
```

<a id='comment:3'></a>
It works with Sage 2.8.8:

```
mabshoff@sage:/tmp/Work-mabshoff/sage-2.8.8$ sage
----------------------------------------------------------------------
| SAGE Version 2.8.8, Release Date: 2007-10-20                       |
| Type notebook() for the GUI, and license() for information.        |
----------------------------------------------------------------------

sage: sage: K.<a> = NumberField(ZZ['x'].0^3 - 5)
sage: sage: L.<b> = K.extension(K['x'].0^2 - 3)
sage: sage: b.matrix()

[0 1]
[3 0]
sage: 
```

Cheers,

Michael



---

archive/issue_events_001051.json:
```json
{
    "actor": "https://github.com/mwhansen",
    "created_at": "2007-10-24T01:52:30Z",
    "event": "renamed",
    "issue": "https://github.com/sagemath/sage/issues/281",
    "rename": {
        "from": "Errors in matrix for extensions of NumberFields",
        "to": "[looks invalid] Errors in matrix for extensions of NumberFields"
    },
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/281#event-1051"
}
```



---

archive/issue_comments_001020.json:
```json
{
    "body": "<a id='comment:5'></a>\nI would actually say that this was fixed by roed's rewrite. So it would be \"fixed\" in my book.\n\nCheers,\n\nMichael",
    "created_at": "2007-10-24T03:34:35Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/281",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/281#issuecomment-1020",
    "user": "https://github.com/sagetrac-mabshoff"
}
```

<a id='comment:5'></a>
I would actually say that this was fixed by roed's rewrite. So it would be "fixed" in my book.

Cheers,

Michael



---

archive/issue_events_001052.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2007-10-24T03:38:14Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/281",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/281#event-1052"
}
```



---

archive/issue_comments_001021.json:
```json
{
    "body": "<a id='comment:6'></a>\nyep, fixed by my rewrite (not david's).",
    "created_at": "2007-10-24T03:38:14Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/281",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/281#issuecomment-1021",
    "user": "https://github.com/williamstein"
}
```

<a id='comment:6'></a>
yep, fixed by my rewrite (not david's).



---

archive/issue_events_001053.json:
```json
{
    "actor": "https://github.com/mwhansen",
    "created_at": "2007-10-24T12:18:17Z",
    "event": "renamed",
    "issue": "https://github.com/sagemath/sage/issues/281",
    "rename": {
        "from": "[looks invalid] Errors in matrix for extensions of NumberFields",
        "to": "[looks fixed] Errors in matrix for extensions of NumberFields"
    },
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/281#event-1053"
}
```
