# Issue 291: strange printing of -1 in multivariate polynomial rings

archive/issues_000291.json:
```json
{
    "body": "\n```\nsage: R.<r1, r0, s1, s2, z> = QQ['r1', 'r0', 's1', 's2', 'z']\nsage: R(-r1)\n-1*r1\n```\n\nThis is tricky.  This is an issue with stacking rings... how does QQ['x']['y'] tell (QQ['x'](-1))*y to print as '-y'?  I don't know.\n\n**Assignee:** @ncalexan\n\n**Keywords:** multivariate polynomial ring printing\n\nIssue created by migration from https://trac.sagemath.org/ticket/291\n\n",
    "closed_at": "2008-03-21T23:29:58Z",
    "created_at": "2007-02-24T05:13:52Z",
    "labels": [
        "component: basic arithmetic",
        "enhancement"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-2.11",
    "title": "strange printing of -1 in multivariate polynomial rings",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/291",
    "user": "https://github.com/ncalexan"
}
```

```
sage: R.<r1, r0, s1, s2, z> = QQ['r1', 'r0', 's1', 's2', 'z']
sage: R(-r1)
-1*r1
```

This is tricky.  This is an issue with stacking rings... how does QQ['x']['y'] tell (QQ['x'](-1))*y to print as '-y'?  I don't know.

**Assignee:** @ncalexan

**Keywords:** multivariate polynomial ring printing

Issue created by migration from https://trac.sagemath.org/ticket/291





---

archive/issue_comments_001164.json:
```json
{
    "body": "**Assignee:** @ncalexan",
    "created_at": "2007-02-25T09:37:18Z",
    "issue": "https://github.com/sagemath/sagetest/issues/291",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/291#issuecomment-1164",
    "user": "https://github.com/ncalexan"
}
```

**Assignee:** @ncalexan



---

archive/issue_comments_001165.json:
```json
{
    "body": "<a id='comment:1'></a>\nThe following demonstrates this nicely:\n\n```\nsage: K.<a> = NumberField(ZZ['x'].0^2 - 3)\n\nsage: L.<b> = K.extension(K['x'].0^2 - 5)\n\nsage: L\n Extension by x^2 + -5 of the Number Field in a with defining polynomial x^2 - 3\n```",
    "created_at": "2007-02-25T09:37:18Z",
    "issue": "https://github.com/sagemath/sagetest/issues/291",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/291#issuecomment-1165",
    "user": "https://github.com/ncalexan"
}
```

<a id='comment:1'></a>
The following demonstrates this nicely:

```
sage: K.<a> = NumberField(ZZ['x'].0^2 - 3)

sage: L.<b> = K.extension(K['x'].0^2 - 5)

sage: L
 Extension by x^2 + -5 of the Number Field in a with defining polynomial x^2 - 3
```



---

archive/issue_comments_001166.json:
```json
{
    "body": "<a id='comment:2'></a>\nnick's xeample is annoying, but it illustrates a completely different problem.\n\nIn any case the original multivariate example no longer fails since singular does the printing.\nHowever this example fails:\n\n```\nsage: K.<a> = NumberField(ZZ['x'].0^2 - 3) \nsage: R.<r1, r0, s1, s2, z> = K['r1', 'r0', 's1', 's2', 'z']\nsage: -r1\n(-1)*r1\n```\n\nHowever, since the output is correct, this is not a bug, but an enhancement issue.",
    "created_at": "2007-08-18T21:06:29Z",
    "issue": "https://github.com/sagemath/sagetest/issues/291",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/291#issuecomment-1166",
    "user": "https://github.com/williamstein"
}
```

<a id='comment:2'></a>
nick's xeample is annoying, but it illustrates a completely different problem.

In any case the original multivariate example no longer fails since singular does the printing.
However this example fails:

```
sage: K.<a> = NumberField(ZZ['x'].0^2 - 3) 
sage: R.<r1, r0, s1, s2, z> = K['r1', 'r0', 's1', 's2', 'z']
sage: -r1
(-1)*r1
```

However, since the output is correct, this is not a bug, but an enhancement issue.



---

archive/issue_comments_001167.json:
```json
{
    "body": "<a id='comment:3'></a>\nThe original printing issue has been solved by 2.8.1pre:\n\n```\nsage: R.<r1, r0, s1, s2, z> = QQ['r1', 'r0', 's1', 's2', 'z']\nsage: R(-r1)\n-r1\n```\nThe points made by was in the replies still apply.\n\nCheers,\n\nMichael",
    "created_at": "2007-08-21T13:03:37Z",
    "issue": "https://github.com/sagemath/sagetest/issues/291",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/291#issuecomment-1167",
    "user": "https://trac.sagemath.org/admin/accounts/users/mabshoff"
}
```

<a id='comment:3'></a>
The original printing issue has been solved by 2.8.1pre:

```
sage: R.<r1, r0, s1, s2, z> = QQ['r1', 'r0', 's1', 's2', 'z']
sage: R(-r1)
-r1
```
The points made by was in the replies still apply.

Cheers,

Michael



---

archive/attachments_000076.json:
```json
{
    "asset_content_type": "application/octet-stream",
    "asset_name": "mpoly-str.patch",
    "asset_url": "tarball://root/attachments/some-uuid/ticket291/mpoly-str.patch",
    "created_at": "2008-03-20T12:01:47Z",
    "issue": "https://github.com/sagemath/sagetest/issues/291",
    "type": "attachment",
    "url": "https://github.com/assets/some-id/some-uuid.patch",
    "user": "https://trac.sagemath.org/admin/accounts/users/jbmohler"
}
```



---

archive/issue_comments_001168.json:
```json
{
    "body": "",
    "created_at": "2008-03-20T12:01:47Z",
    "issue": "https://github.com/sagemath/sagetest/issues/291",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/291#issuecomment-1168",
    "user": "https://trac.sagemath.org/admin/accounts/users/jbmohler"
}
```





---

archive/issue_comments_001169.json:
```json
{
    "body": "**Changing status** from new to needs_review.",
    "created_at": "2008-03-20T12:11:28Z",
    "issue": "https://github.com/sagemath/sagetest/issues/291",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/291#issuecomment-1169",
    "user": "https://trac.sagemath.org/admin/accounts/users/jbmohler"
}
```

**Changing status** from new to needs_review.



---

archive/issue_events_000740.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/jbmohler",
    "created_at": "2008-03-20T12:11:28Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/291",
    "milestone": "sage-2.11",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/291#event-740"
}
```



---

archive/issue_comments_001170.json:
```json
{
    "body": "<a id='comment:5'></a>\nThe attached patch fixes this bug and the associated doc-tests.  As an added bonus, it speeds up the str conversion just a little bit too.\n\nBefore patch:\n\n```\nsage: R.<x,y,z> = ZZ[]\nsage: f=prod([2*g^2-4*g+8 for g in R.gens()])\nsage: len(f.monomials())\n27\nsage: %timeit str(f)\n100 loops, best of 3: 2.85 ms per loop\n```\n\nAfter patch:\n\n```\nsage: R.<x,y,z> = ZZ[]\nsage: f=prod([2*g^2-4*g+8 for g in R.gens()])\nsage: len(f.monomials())\n27\nsage: %timeit str(f)\n100 loops, best of 3: 2.43 ms per loop\n```",
    "created_at": "2008-03-20T12:11:28Z",
    "issue": "https://github.com/sagemath/sagetest/issues/291",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/291#issuecomment-1170",
    "user": "https://trac.sagemath.org/admin/accounts/users/jbmohler"
}
```

<a id='comment:5'></a>
The attached patch fixes this bug and the associated doc-tests.  As an added bonus, it speeds up the str conversion just a little bit too.

Before patch:

```
sage: R.<x,y,z> = ZZ[]
sage: f=prod([2*g^2-4*g+8 for g in R.gens()])
sage: len(f.monomials())
27
sage: %timeit str(f)
100 loops, best of 3: 2.85 ms per loop
```

After patch:

```
sage: R.<x,y,z> = ZZ[]
sage: f=prod([2*g^2-4*g+8 for g in R.gens()])
sage: len(f.monomials())
27
sage: %timeit str(f)
100 loops, best of 3: 2.43 ms per loop
```



---

archive/issue_comments_001171.json:
```json
{
    "body": "**Changing status** from needs_review to positive_review.",
    "created_at": "2008-03-21T22:49:30Z",
    "issue": "https://github.com/sagemath/sagetest/issues/291",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/291#issuecomment-1171",
    "user": "https://github.com/aghitza"
}
```

**Changing status** from needs_review to positive_review.



---

archive/issue_comments_001172.json:
```json
{
    "body": "<a id='comment:6'></a>\nLooks good.",
    "created_at": "2008-03-21T22:49:30Z",
    "issue": "https://github.com/sagemath/sagetest/issues/291",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/291#issuecomment-1172",
    "user": "https://github.com/aghitza"
}
```

<a id='comment:6'></a>
Looks good.



---

archive/issue_events_000741.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/mabshoff",
    "created_at": "2008-03-21T23:29:58Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/291",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/291#event-741"
}
```



---

archive/issue_comments_001173.json:
```json
{
    "body": "<a id='comment:7'></a>\nMerged in Sage 2.11.alpha1",
    "created_at": "2008-03-21T23:29:58Z",
    "issue": "https://github.com/sagemath/sagetest/issues/291",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/291#issuecomment-1173",
    "user": "https://trac.sagemath.org/admin/accounts/users/mabshoff"
}
```

<a id='comment:7'></a>
Merged in Sage 2.11.alpha1



---

archive/issue_comments_001174.json:
```json
{
    "body": "fixes two trivial doctest failures in const.tex",
    "created_at": "2008-03-22T00:04:03Z",
    "issue": "https://github.com/sagemath/sagetest/issues/291",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/291#issuecomment-1174",
    "user": "https://trac.sagemath.org/admin/accounts/users/mabshoff"
}
```

fixes two trivial doctest failures in const.tex



---

archive/attachments_000077.json:
```json
{
    "asset_content_type": "application/octet-stream",
    "asset_name": "trac_291-doctest-failures.patch",
    "asset_url": "tarball://root/attachments/some-uuid/ticket291/trac_291-doctest-failures.patch",
    "created_at": "2008-03-22T00:05:37Z",
    "issue": "https://github.com/sagemath/sagetest/issues/291",
    "type": "attachment",
    "url": "https://github.com/assets/some-id/some-uuid.patch",
    "user": "https://trac.sagemath.org/admin/accounts/users/mabshoff"
}
```



---

archive/issue_comments_001175.json:
```json
{
    "body": "<a id='comment:8'></a>\nMerged trac_291-doctest-failures.patch in Sage 2.11.alpha1 - if anybody does want to review this patch feel free to do so.\n\nCheers,\n\nMichael",
    "created_at": "2008-03-22T00:05:37Z",
    "issue": "https://github.com/sagemath/sagetest/issues/291",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/291#issuecomment-1175",
    "user": "https://trac.sagemath.org/admin/accounts/users/mabshoff"
}
```

<a id='comment:8'></a>
Merged trac_291-doctest-failures.patch in Sage 2.11.alpha1 - if anybody does want to review this patch feel free to do so.

Cheers,

Michael
