# Issue 395: flatten command for nested lists

archive/issues_000395.json:
```json
{
    "assignees": [],
    "body": "The attached file has a candidate function for a flatten command. The default types to flatten are lists and tuples, but more can be added.\n\n```\ndef flatten(in_list, ltypes=(list, tuple)):\n    \"\"\"\n    Flattens a nested list.\n\n    INPUT:\n        in_list -- a list or tuple\n        ltypes -- optional list of particular types to flatten\n\n    OUTPUT:\n        a flat list of the entries of in_list\n\n    EXAMPLES:\n        sage: flatten([[1,1],[1],2])\n        [1, 1, 1, 2]\n        sage: flatten((['Hi',2,vector(QQ,[1,2,3])],(4,5,6)))\n        ['Hi', 2, (1, 2, 3), 4, 5, 6]\n        sage: flatten((['Hi',2,vector(QQ,[1,2,3])],(4,5,6)),ltypes=(list, tuple, sage.modules.vector_rational_dense.Vector_rational_dense))\n        ['Hi', 2, 1, 2, 3, 4, 5, 6]\n    \"\"\"\n    index = 0\n    new_list = [x for x in in_list]\n    while index < len(new_list):\n        if not new_list[index]:\n            new_list.pop(index)\n            continue\n        while isinstance(new_list[index], ltypes):\n            new_list[index : index + 1] = list(new_list[index])\n        index += 1\n    return new_list\n```\n\n\n**Assignee:** mhampton\n\n**Keywords:** lists, flatten\n\nIssue created by migration from https://trac.sagemath.org/ticket/395\n\n",
    "closed_at": "2007-09-13T15:03:45Z",
    "created_at": "2007-06-28T16:06:22Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20basic%20arithmetic"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-2.8.4.2",
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "flatten command for nested lists",
    "type": "issue",
    "updated_at": "2007-09-13T15:03:45Z",
    "url": "https://github.com/sagemath/sage/issues/395",
    "user": "https://github.com/sagetrac-mhampton"
}
```
The attached file has a candidate function for a flatten command. The default types to flatten are lists and tuples, but more can be added.

```
def flatten(in_list, ltypes=(list, tuple)):
    """
    Flattens a nested list.

    INPUT:
        in_list -- a list or tuple
        ltypes -- optional list of particular types to flatten

    OUTPUT:
        a flat list of the entries of in_list

    EXAMPLES:
        sage: flatten([[1,1],[1],2])
        [1, 1, 1, 2]
        sage: flatten((['Hi',2,vector(QQ,[1,2,3])],(4,5,6)))
        ['Hi', 2, (1, 2, 3), 4, 5, 6]
        sage: flatten((['Hi',2,vector(QQ,[1,2,3])],(4,5,6)),ltypes=(list, tuple, sage.modules.vector_rational_dense.Vector_rational_dense))
        ['Hi', 2, 1, 2, 3, 4, 5, 6]
    """
    index = 0
    new_list = [x for x in in_list]
    while index < len(new_list):
        if not new_list[index]:
            new_list.pop(index)
            continue
        while isinstance(new_list[index], ltypes):
            new_list[index : index + 1] = list(new_list[index])
        index += 1
    return new_list
```


**Assignee:** mhampton

**Keywords:** lists, flatten

Issue created by migration from https://trac.sagemath.org/ticket/395





---

archive/issue_events_002735.json:
```json
{
    "actor": "https://github.com/sagetrac-mhampton",
    "created_at": "2007-06-28T16:06:22Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "milestone_number": null,
    "milestone_title": "sage-2.8.4.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/395#event-2735"
}
```



---

archive/issue_events_002736.json:
```json
{
    "actor": "https://github.com/sagetrac-mhampton",
    "created_at": "2007-06-28T16:06:22Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20basic%20arithmetic",
    "label_color": "08517b",
    "label_name": "component: basic arithmetic",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/395#event-2736"
}
```



---

archive/issue_events_002737.json:
```json
{
    "actor": "https://github.com/sagetrac-mhampton",
    "created_at": "2007-06-28T16:06:22Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "label": "https://github.com/sagemath/sage/labels/minor",
    "label_color": "ff0000",
    "label_name": "minor",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/395#event-2737"
}
```



---

archive/issue_events_002738.json:
```json
{
    "actor": "https://github.com/sagetrac-mhampton",
    "created_at": "2007-06-28T16:06:22Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "label": "https://github.com/sagemath/sage/labels/enhancement",
    "label_color": "008080",
    "label_name": "enhancement",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/395#event-2738"
}
```



---

archive/issue_comments_001454.json:
```json
{
    "body": "<a id='comment:2'></a>\nNew version:\n\ndef flatten(in_list, ltypes=(list, tuple)):\n    \"\"\"\n    Flattens a nested list.\n\n    INPUT:\n        in_list -- a list or tuple\n        ltypes -- optional list of particular types to flatten\n\n    OUTPUT:\n        a flat list of the entries of in_list\n\n    EXAMPLES:\n        sage: flatten([[1,1],[1],2])\n        [1, 1, 1, 2]\n        sage: flatten([[1,2,3], (4,5), [[[1],[2]]]])\n        [1, 2, 3, 4, 5, 1, 2]\n\n    In the following example, the vector isn't flattened because\n    it is not given in the ltypes input.\n        sage: flatten((['Hi',2,vector(QQ,[1,2,3])],(4,5,6)))\n        ['Hi', 2, (1, 2, 3), 4, 5, 6]\n\n    We give the vector type and then even the vector gets flattened:\n        sage: flatten((['Hi',2,vector(QQ,[1,2,3])], (4,5,6)),\nltypes=(list,\ntuple,sage.modules.vector_rational_dense.Vector_rational_dense))\n        ['Hi', 2, 1, 2, 3, 4, 5, 6]\n\n    We flatten a finite field.\n        sage: flatten(GF(5))\n        [0, 1, 2, 3, 4]\n        sage: flatten([GF(5)])\n        [Finite Field of size 5]\n        sage: flatten([GF(5)], ltypes = (list, tuple,\nsage.rings.finite_field.FiniteField_prime_modn))\n        [0, 1, 2, 3, 4]\n\n    \"\"\"\n    index = 0\n    new_list = [x for x in in_list]\n    while index < len(new_list):\n        while isinstance(new_list[index], ltypes):\n            if len(new_list[index]) != 0:\n                new_list[index : index + 1] = list(new_list[index])\n            else:\n                new_list.pop(index)\n                break\n        index += 1\n    return new_list",
    "created_at": "2007-07-05T15:57:34Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/395#issuecomment-1454",
    "user": "https://github.com/sagetrac-mhampton"
}
```

<a id='comment:2'></a>
New version:

def flatten(in_list, ltypes=(list, tuple)):
    """
    Flattens a nested list.

    INPUT:
        in_list -- a list or tuple
        ltypes -- optional list of particular types to flatten

    OUTPUT:
        a flat list of the entries of in_list

    EXAMPLES:
        sage: flatten([[1,1],[1],2])
        [1, 1, 1, 2]
        sage: flatten([[1,2,3], (4,5), [[[1],[2]]]])
        [1, 2, 3, 4, 5, 1, 2]

    In the following example, the vector isn't flattened because
    it is not given in the ltypes input.
        sage: flatten((['Hi',2,vector(QQ,[1,2,3])],(4,5,6)))
        ['Hi', 2, (1, 2, 3), 4, 5, 6]

    We give the vector type and then even the vector gets flattened:
        sage: flatten((['Hi',2,vector(QQ,[1,2,3])], (4,5,6)),
ltypes=(list,
tuple,sage.modules.vector_rational_dense.Vector_rational_dense))
        ['Hi', 2, 1, 2, 3, 4, 5, 6]

    We flatten a finite field.
        sage: flatten(GF(5))
        [0, 1, 2, 3, 4]
        sage: flatten([GF(5)])
        [Finite Field of size 5]
        sage: flatten([GF(5)], ltypes = (list, tuple,
sage.rings.finite_field.FiniteField_prime_modn))
        [0, 1, 2, 3, 4]

    """
    index = 0
    new_list = [x for x in in_list]
    while index < len(new_list):
        while isinstance(new_list[index], ltypes):
            if len(new_list[index]) != 0:
                new_list[index : index + 1] = list(new_list[index])
            else:
                new_list.pop(index)
                break
        index += 1
    return new_list



---

archive/issue_comments_001455.json:
```json
{
    "body": "<a id='comment:3'></a>\nSage 2.8.2 has a flatten command. It also seems to work on nested lists:\n\n```\nsage: L\n[[1, 2], [1, 2]]\nsage: flatten(L)\n[1, 2, 1, 2]\nsage: L=[L,[L,[L,[L]]]]\nsage: L\n[[[1, 2], [1, 2]], [[[1, 2], [1, 2]], [[[1, 2], [1, 2]], [[[1, 2], [1, 2]]]]]]\nsage: flatten(L)\n[1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2]\n```\nSo am I correct to assume that this ticket can be closed? \n\nCheers,\n\nMichael",
    "created_at": "2007-08-23T12:50:50Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/395#issuecomment-1455",
    "user": "https://github.com/sagetrac-mabshoff"
}
```

<a id='comment:3'></a>
Sage 2.8.2 has a flatten command. It also seems to work on nested lists:

```
sage: L
[[1, 2], [1, 2]]
sage: flatten(L)
[1, 2, 1, 2]
sage: L=[L,[L,[L,[L]]]]
sage: L
[[[1, 2], [1, 2]], [[[1, 2], [1, 2]], [[[1, 2], [1, 2]], [[[1, 2], [1, 2]]]]]]
sage: flatten(L)
[1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2]
```
So am I correct to assume that this ticket can be closed? 

Cheers,

Michael



---

archive/issue_events_002739.json:
```json
{
    "actor": "https://github.com/sagetrac-mabshoff",
    "created_at": "2007-08-23T12:50:50Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "milestone_number": null,
    "milestone_title": "sage-2.8.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/395#event-2739"
}
```



---

archive/issue_events_002740.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2007-08-29T02:39:43Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/395#event-2740"
}
```



---

archive/issue_comments_001456.json:
```json
{
    "body": "<a id='comment:4'></a>\nYep, this has been in SAGE a while.",
    "created_at": "2007-08-29T02:39:43Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/395#issuecomment-1456",
    "user": "https://github.com/williamstein"
}
```

<a id='comment:4'></a>
Yep, this has been in SAGE a while.



---

archive/issue_comments_001457.json:
```json
{
    "body": "<a id='comment:5'></a>\nThis still has some problems on empty lists, which I (Marshall Hampton) will try to fix soon.  the simplest example of the problem for the current (2.8.4.1) behavior is:\nflatten([[],[]])\n[[]]\n\nIt should return [].",
    "created_at": "2007-09-11T16:48:26Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/395#issuecomment-1457",
    "user": "https://github.com/sagetrac-mhampton"
}
```

<a id='comment:5'></a>
This still has some problems on empty lists, which I (Marshall Hampton) will try to fix soon.  the simplest example of the problem for the current (2.8.4.1) behavior is:
flatten([[],[]])
[[]]

It should return [].



---

archive/issue_events_002741.json:
```json
{
    "actor": "https://github.com/sagetrac-mhampton",
    "created_at": "2007-09-11T16:48:26Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "label": "https://github.com/sagemath/sage/labels/enhancement",
    "label_color": "008080",
    "label_name": "enhancement",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/395#event-2741"
}
```



---

archive/issue_events_002742.json:
```json
{
    "actor": "https://github.com/sagetrac-mhampton",
    "created_at": "2007-09-11T16:48:26Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "008080",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/395#event-2742"
}
```



---

archive/issue_events_002743.json:
```json
{
    "actor": "https://github.com/sagetrac-mhampton",
    "created_at": "2007-09-11T16:48:26Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "milestone_number": null,
    "milestone_title": "sage-2.8.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/395#event-2743"
}
```



---

archive/issue_events_002744.json:
```json
{
    "actor": "https://github.com/sagetrac-mhampton",
    "created_at": "2007-09-11T16:48:26Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "label": "https://github.com/sagemath/sage/labels/feature",
    "label_color": "008080",
    "label_name": "feature",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/395#event-2744"
}
```



---

archive/issue_comments_001458.json:
```json
{
    "body": "<a id='comment:7'></a>\nReplying to [mhampton](#comment%3A6):\n\nSorry, I am not used to this formatting.  My example should be:\n\nflatten([[],[]])\n\n[[]]\n",
    "created_at": "2007-09-11T16:50:32Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/395#issuecomment-1458",
    "user": "https://github.com/sagetrac-mhampton"
}
```

<a id='comment:7'></a>
Replying to [mhampton](#comment%3A6):

Sorry, I am not used to this formatting.  My example should be:

flatten([[],[]])

[[]]




---

archive/issue_comments_001459.json:
```json
{
    "body": "<a id='comment:9'></a>\nHere is a new version that I believe fixes the problem.\n\n```\ndef flatten(in_list, ltypes=(list, tuple)):\n   \"\"\"\n   Flattens a nested list.\n\n   INPUT:\n       in_list -- a list or tuple\n       ltypes -- optional list of particular types to flatten\n\n   OUTPUT:\n       a flat list of the entries of in_list\n\n   EXAMPLES:\n       sage: flatten([[1,1],[1],2])\n       [1, 1, 1, 2]\n       sage: flatten([[1,2,3], (4,5), [[[1],[2]]]])\n       [1, 2, 3, 4, 5, 1, 2]\n\n   In the following example, the vector isn't flattened because\n   it is not given in the ltypes input. \n       sage: flatten((['Hi',2,vector(QQ,[1,2,3])],(4,5,6)))\n       ['Hi', 2, (1, 2, 3), 4, 5, 6]\n\n   We give the vector type and then even the vector gets flattened:\n       sage: flatten((['Hi',2,vector(QQ,[1,2,3])], (4,5,6)), ltypes=(list, tuple,sage.modules.vector_rational_dense.Vector_rational_dense))\n       ['Hi', 2, 1, 2, 3, 4, 5, 6]\n\n   We flatten a finite field. \n       sage: flatten(GF(5))\n       [0, 1, 2, 3, 4]\n       sage: flatten([GF(5)])\n       [Finite Field of size 5]\n       sage: flatten([GF(5)], ltypes = (list, tuple, sage.rings.finite_field.FiniteField_prime_modn))\n       [0, 1, 2, 3, 4]\n\n   Degenerate cases:\n      sage: flatten([[],[]])\n      []\n      sage: flatten([[[]]])\n      []\n   \"\"\"\n   index = 0\n   new_list = [x for x in in_list]\n   while index < len(new_list):\n      while isinstance(new_list[index], ltypes):\n         v = list(new_list[index])\n         if len(v) != 0:\n            new_list[index : index + 1] = v\n         else:\n            new_list.pop(index)\n            index += -1\n            break\n      index += 1\n   return new_list\n\n```",
    "created_at": "2007-09-11T20:33:24Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/395#issuecomment-1459",
    "user": "https://github.com/sagetrac-mhampton"
}
```

<a id='comment:9'></a>
Here is a new version that I believe fixes the problem.

```
def flatten(in_list, ltypes=(list, tuple)):
   """
   Flattens a nested list.

   INPUT:
       in_list -- a list or tuple
       ltypes -- optional list of particular types to flatten

   OUTPUT:
       a flat list of the entries of in_list

   EXAMPLES:
       sage: flatten([[1,1],[1],2])
       [1, 1, 1, 2]
       sage: flatten([[1,2,3], (4,5), [[[1],[2]]]])
       [1, 2, 3, 4, 5, 1, 2]

   In the following example, the vector isn't flattened because
   it is not given in the ltypes input. 
       sage: flatten((['Hi',2,vector(QQ,[1,2,3])],(4,5,6)))
       ['Hi', 2, (1, 2, 3), 4, 5, 6]

   We give the vector type and then even the vector gets flattened:
       sage: flatten((['Hi',2,vector(QQ,[1,2,3])], (4,5,6)), ltypes=(list, tuple,sage.modules.vector_rational_dense.Vector_rational_dense))
       ['Hi', 2, 1, 2, 3, 4, 5, 6]

   We flatten a finite field. 
       sage: flatten(GF(5))
       [0, 1, 2, 3, 4]
       sage: flatten([GF(5)])
       [Finite Field of size 5]
       sage: flatten([GF(5)], ltypes = (list, tuple, sage.rings.finite_field.FiniteField_prime_modn))
       [0, 1, 2, 3, 4]

   Degenerate cases:
      sage: flatten([[],[]])
      []
      sage: flatten([[[]]])
      []
   """
   index = 0
   new_list = [x for x in in_list]
   while index < len(new_list):
      while isinstance(new_list[index], ltypes):
         v = list(new_list[index])
         if len(v) != 0:
            new_list[index : index + 1] = v
         else:
            new_list.pop(index)
            index += -1
            break
      index += 1
   return new_list

```



---

archive/issue_events_002745.json:
```json
{
    "actor": "https://github.com/sagetrac-mhampton",
    "created_at": "2007-09-11T20:33:24Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "milestone_number": null,
    "milestone_title": "sage-2.9.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/395#event-2745"
}
```



---

archive/issue_events_002746.json:
```json
{
    "actor": "https://github.com/sagetrac-mhampton",
    "created_at": "2007-09-11T20:33:24Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "label": "https://github.com/sagemath/sage/labels/feature",
    "label_color": "008080",
    "label_name": "feature",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/395#event-2746"
}
```



---

archive/issue_events_002747.json:
```json
{
    "actor": "https://github.com/sagetrac-mhampton",
    "created_at": "2007-09-11T20:33:24Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "008080",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/395#event-2747"
}
```



---

archive/issue_events_002748.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2007-09-11T22:59:45Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "milestone_number": null,
    "milestone_title": "sage-2.9.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/395#event-2748"
}
```



---

archive/issue_events_002749.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2007-09-11T22:59:45Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "milestone_number": null,
    "milestone_title": "sage-2.8.4.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/395#event-2749"
}
```



---

archive/issue_events_002750.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2007-09-11T23:00:21Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "label": "https://github.com/sagemath/sage/labels/minor",
    "label_color": "ff0000",
    "label_name": "minor",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/395#event-2750"
}
```



---

archive/issue_comments_001460.json:
```json
{
    "body": "<a id='comment:12'></a>\napplied for sage-2.8.4.2.",
    "created_at": "2007-09-13T15:03:45Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/395#issuecomment-1460",
    "user": "https://github.com/williamstein"
}
```

<a id='comment:12'></a>
applied for sage-2.8.4.2.



---

archive/issue_events_002751.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2007-09-13T15:03:45Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/395#event-2751"
}
```
