# Issue 395: flatten command for nested lists

archive/issues_000395.json:
```json
{
    "assignees": [
        "https://github.com/sagetrac-mhampton"
    ],
    "body": "The attached file has a candidate function for a flatten command. The default types to flatten are lists and tuples, but more can be added.\n\n```\ndef flatten(in_list, ltypes=(list, tuple)):\n    \"\"\"\n    Flattens a nested list.\n\n    INPUT:\n        in_list -- a list or tuple\n        ltypes -- optional list of particular types to flatten\n\n    OUTPUT:\n        a flat list of the entries of in_list\n\n    EXAMPLES:\n        sage: flatten([[1,1],[1],2])\n        [1, 1, 1, 2]\n        sage: flatten((['Hi',2,vector(QQ,[1,2,3])],(4,5,6)))\n        ['Hi', 2, (1, 2, 3), 4, 5, 6]\n        sage: flatten((['Hi',2,vector(QQ,[1,2,3])],(4,5,6)),ltypes=(list, tuple, sage.modules.vector_rational_dense.Vector_rational_dense))\n        ['Hi', 2, 1, 2, 3, 4, 5, 6]\n    \"\"\"\n    index = 0\n    new_list = [x for x in in_list]\n    while index < len(new_list):\n        if not new_list[index]:\n            new_list.pop(index)\n            continue\n        while isinstance(new_list[index], ltypes):\n            new_list[index : index + 1] = list(new_list[index])\n        index += 1\n    return new_list\n```\n\n\nKeywords: **lists, flatten**\n\nComponent: **basic arithmetic**\n\n_Issue created by migration from https://trac.sagemath.org/ticket/395_\n\n",
    "closed_at": "2007-09-13T15:03:45Z",
    "created_at": "2007-06-28T16:06:22Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/c%3A%20basic%20arithmetic",
        "https://github.com/sagemath/sage/labels/p%3A%203%20%E2%80%93%20major"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-2.8.4.2",
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "flatten command for nested lists",
    "type": "issue",
    "updated_at": "2007-09-13T15:03:45Z",
    "url": "https://github.com/sagemath/sage/issues/395",
    "user": "https://github.com/sagetrac-mhampton"
}
```
The attached file has a candidate function for a flatten command. The default types to flatten are lists and tuples, but more can be added.

```
def flatten(in_list, ltypes=(list, tuple)):
    """
    Flattens a nested list.

    INPUT:
        in_list -- a list or tuple
        ltypes -- optional list of particular types to flatten

    OUTPUT:
        a flat list of the entries of in_list

    EXAMPLES:
        sage: flatten([[1,1],[1],2])
        [1, 1, 1, 2]
        sage: flatten((['Hi',2,vector(QQ,[1,2,3])],(4,5,6)))
        ['Hi', 2, (1, 2, 3), 4, 5, 6]
        sage: flatten((['Hi',2,vector(QQ,[1,2,3])],(4,5,6)),ltypes=(list, tuple, sage.modules.vector_rational_dense.Vector_rational_dense))
        ['Hi', 2, 1, 2, 3, 4, 5, 6]
    """
    index = 0
    new_list = [x for x in in_list]
    while index < len(new_list):
        if not new_list[index]:
            new_list.pop(index)
            continue
        while isinstance(new_list[index], ltypes):
            new_list[index : index + 1] = list(new_list[index])
        index += 1
    return new_list
```


Keywords: **lists, flatten**

Component: **basic arithmetic**

_Issue created by migration from https://trac.sagemath.org/ticket/395_





---

archive/issue_events_003266.json:
```json
{
    "actor": "https://github.com/sagetrac-mhampton",
    "created_at": "2007-06-28T16:06:22Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "label": "https://github.com/sagemath/sage/labels/c%3A%20basic%20arithmetic",
    "label_color": "0000ff",
    "label_name": "c: basic arithmetic",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/395#event-3266"
}
```



---

archive/issue_events_003267.json:
```json
{
    "actor": "https://github.com/sagetrac-mhampton",
    "created_at": "2007-06-28T16:06:22Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "label": "https://github.com/sagemath/sage/labels/p%3A%204%20%E2%80%93%20minor",
    "label_color": "ffe799",
    "label_name": "p: 4 \u2013 minor",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/395#event-3267"
}
```



---

archive/issue_events_003268.json:
```json
{
    "actor": "https://github.com/sagetrac-mhampton",
    "created_at": "2007-06-28T16:06:22Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "label": "https://github.com/sagemath/sage/labels/enhancement",
    "label_color": "696969",
    "label_name": "enhancement",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/395#event-3268"
}
```



---

archive/issue_events_003269.json:
```json
{
    "actor": "https://github.com/sagetrac-mhampton",
    "created_at": "2007-06-28T16:06:22Z",
    "event": "assigned",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "subject": "https://github.com/sagetrac-mhampton",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/395#event-3269"
}
```



---

archive/issue_comments_001371.json:
```json
{
    "body": "<div id=\"comment:2\" align=\"right\">comment:2</div>\n\nNew version:\n\ndef flatten(in_list, ltypes=(list, tuple)):\n    \"\"\"\n    Flattens a nested list.\n\n    INPUT:\n        in_list -- a list or tuple\n        ltypes -- optional list of particular types to flatten\n\n    OUTPUT:\n        a flat list of the entries of in_list\n\n    EXAMPLES:\n        sage: flatten([[1,1],[1],2])\n        [1, 1, 1, 2]\n        sage: flatten([[1,2,3], (4,5), [[[1],[2]]]])\n        [1, 2, 3, 4, 5, 1, 2]\n\n    In the following example, the vector isn't flattened because\n    it is not given in the ltypes input.\n        sage: flatten((['Hi',2,vector(QQ,[1,2,3])],(4,5,6)))\n        ['Hi', 2, (1, 2, 3), 4, 5, 6]\n\n    We give the vector type and then even the vector gets flattened:\n        sage: flatten((['Hi',2,vector(QQ,[1,2,3])], (4,5,6)),\nltypes=(list,\ntuple,sage.modules.vector_rational_dense.Vector_rational_dense))\n        ['Hi', 2, 1, 2, 3, 4, 5, 6]\n\n    We flatten a finite field.\n        sage: flatten(GF(5))\n        [0, 1, 2, 3, 4]\n        sage: flatten([GF(5)])\n        [Finite Field of size 5]\n        sage: flatten([GF(5)], ltypes = (list, tuple,\nsage.rings.finite_field.FiniteField_prime_modn))\n        [0, 1, 2, 3, 4]\n\n    \"\"\"\n    index = 0\n    new_list = [x for x in in_list]\n    while index < len(new_list):\n        while isinstance(new_list[index], ltypes):\n            if len(new_list[index]) != 0:\n                new_list[index : index + 1] = list(new_list[index])\n            else:\n                new_list.pop(index)\n                break\n        index += 1\n    return new_list",
    "created_at": "2007-07-05T15:57:34Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/395#issuecomment-1371",
    "user": "https://github.com/sagetrac-mhampton"
}
```

<div id="comment:2" align="right">comment:2</div>

New version:

def flatten(in_list, ltypes=(list, tuple)):
    """
    Flattens a nested list.

    INPUT:
        in_list -- a list or tuple
        ltypes -- optional list of particular types to flatten

    OUTPUT:
        a flat list of the entries of in_list

    EXAMPLES:
        sage: flatten([[1,1],[1],2])
        [1, 1, 1, 2]
        sage: flatten([[1,2,3], (4,5), [[[1],[2]]]])
        [1, 2, 3, 4, 5, 1, 2]

    In the following example, the vector isn't flattened because
    it is not given in the ltypes input.
        sage: flatten((['Hi',2,vector(QQ,[1,2,3])],(4,5,6)))
        ['Hi', 2, (1, 2, 3), 4, 5, 6]

    We give the vector type and then even the vector gets flattened:
        sage: flatten((['Hi',2,vector(QQ,[1,2,3])], (4,5,6)),
ltypes=(list,
tuple,sage.modules.vector_rational_dense.Vector_rational_dense))
        ['Hi', 2, 1, 2, 3, 4, 5, 6]

    We flatten a finite field.
        sage: flatten(GF(5))
        [0, 1, 2, 3, 4]
        sage: flatten([GF(5)])
        [Finite Field of size 5]
        sage: flatten([GF(5)], ltypes = (list, tuple,
sage.rings.finite_field.FiniteField_prime_modn))
        [0, 1, 2, 3, 4]

    """
    index = 0
    new_list = [x for x in in_list]
    while index < len(new_list):
        while isinstance(new_list[index], ltypes):
            if len(new_list[index]) != 0:
                new_list[index : index + 1] = list(new_list[index])
            else:
                new_list.pop(index)
                break
        index += 1
    return new_list



---

archive/issue_comments_001372.json:
```json
{
    "body": "<div id=\"comment:3\" align=\"right\">comment:3</div>\n\nSage 2.8.2 has a flatten command. It also seems to work on nested lists:\n\n```\nsage: L\n[[1, 2], [1, 2]]\nsage: flatten(L)\n[1, 2, 1, 2]\nsage: L=[L,[L,[L,[L]]]]\nsage: L\n[[[1, 2], [1, 2]], [[[1, 2], [1, 2]], [[[1, 2], [1, 2]], [[[1, 2], [1, 2]]]]]]\nsage: flatten(L)\n[1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2]\n```\nSo am I correct to assume that this ticket can be closed? \n\nCheers,\n\nMichael",
    "created_at": "2007-08-23T12:50:50Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/395#issuecomment-1372",
    "user": "https://github.com/sagetrac-mabshoff"
}
```

<div id="comment:3" align="right">comment:3</div>

Sage 2.8.2 has a flatten command. It also seems to work on nested lists:

```
sage: L
[[1, 2], [1, 2]]
sage: flatten(L)
[1, 2, 1, 2]
sage: L=[L,[L,[L,[L]]]]
sage: L
[[[1, 2], [1, 2]], [[[1, 2], [1, 2]], [[[1, 2], [1, 2]], [[[1, 2], [1, 2]]]]]]
sage: flatten(L)
[1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2]
```
So am I correct to assume that this ticket can be closed? 

Cheers,

Michael



---

archive/issue_events_003270.json:
```json
{
    "actor": "https://github.com/sagetrac-mabshoff",
    "created_at": "2007-08-23T12:50:50Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "milestone_number": null,
    "milestone_title": "sage-2.8.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/395#event-3270"
}
```



---

archive/issue_events_003271.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2007-08-29T02:39:43Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/395#event-3271"
}
```



---

archive/issue_comments_001373.json:
```json
{
    "body": "<div id=\"comment:4\" align=\"right\">comment:4</div>\n\nYep, this has been in SAGE a while.",
    "created_at": "2007-08-29T02:39:43Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/395#issuecomment-1373",
    "user": "https://github.com/williamstein"
}
```

<div id="comment:4" align="right">comment:4</div>

Yep, this has been in SAGE a while.



---

archive/issue_comments_001374.json:
```json
{
    "body": "<div id=\"comment:5\" align=\"right\">comment:5</div>\n\nThis still has some problems on empty lists, which I (Marshall Hampton) will try to fix soon.  the simplest example of the problem for the current (2.8.4.1) behavior is:\nflatten([[],[]])\n[[]]\n\nIt should return [].",
    "created_at": "2007-09-11T16:48:26Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/395#issuecomment-1374",
    "user": "https://github.com/sagetrac-mhampton"
}
```

<div id="comment:5" align="right">comment:5</div>

This still has some problems on empty lists, which I (Marshall Hampton) will try to fix soon.  the simplest example of the problem for the current (2.8.4.1) behavior is:
flatten([[],[]])
[[]]

It should return [].



---

archive/issue_events_003272.json:
```json
{
    "actor": "https://github.com/sagetrac-mhampton",
    "created_at": "2007-09-11T16:48:26Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "label": "https://github.com/sagemath/sage/labels/enhancement",
    "label_color": "696969",
    "label_name": "enhancement",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/395#event-3272"
}
```



---

archive/issue_events_003273.json:
```json
{
    "actor": "https://github.com/sagetrac-mhampton",
    "created_at": "2007-09-11T16:48:26Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "d73a4a",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/395#event-3273"
}
```



---

archive/issue_events_003274.json:
```json
{
    "actor": "https://github.com/sagetrac-mhampton",
    "created_at": "2007-09-11T16:48:26Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "milestone_number": null,
    "milestone_title": "sage-2.8.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/395#event-3274"
}
```



---

archive/issue_events_003275.json:
```json
{
    "actor": "https://github.com/sagetrac-mhampton",
    "created_at": "2007-09-11T16:48:26Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "label": "https://github.com/sagemath/sage/labels/feature",
    "label_color": "008080",
    "label_name": "feature",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/395#event-3275"
}
```



---

archive/issue_comments_001375.json:
```json
{
    "body": "<div id=\"comment:7\" align=\"right\">comment:7</div>\n\nReplying to [@sagetrac-mhampton](#comment:6):\n\nSorry, I am not used to this formatting.  My example should be:\n\nflatten([[],[]])\n\n[[]]\n",
    "created_at": "2007-09-11T16:50:32Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/395#issuecomment-1375",
    "user": "https://github.com/sagetrac-mhampton"
}
```

<div id="comment:7" align="right">comment:7</div>

Replying to [@sagetrac-mhampton](#comment:6):

Sorry, I am not used to this formatting.  My example should be:

flatten([[],[]])

[[]]




---

archive/issue_comments_001376.json:
```json
{
    "body": "<div id=\"comment:9\" align=\"right\">comment:9</div>\n\nHere is a new version that I believe fixes the problem.\n\n```\ndef flatten(in_list, ltypes=(list, tuple)):\n   \"\"\"\n   Flattens a nested list.\n\n   INPUT:\n       in_list -- a list or tuple\n       ltypes -- optional list of particular types to flatten\n\n   OUTPUT:\n       a flat list of the entries of in_list\n\n   EXAMPLES:\n       sage: flatten([[1,1],[1],2])\n       [1, 1, 1, 2]\n       sage: flatten([[1,2,3], (4,5), [[[1],[2]]]])\n       [1, 2, 3, 4, 5, 1, 2]\n\n   In the following example, the vector isn't flattened because\n   it is not given in the ltypes input. \n       sage: flatten((['Hi',2,vector(QQ,[1,2,3])],(4,5,6)))\n       ['Hi', 2, (1, 2, 3), 4, 5, 6]\n\n   We give the vector type and then even the vector gets flattened:\n       sage: flatten((['Hi',2,vector(QQ,[1,2,3])], (4,5,6)), ltypes=(list, tuple,sage.modules.vector_rational_dense.Vector_rational_dense))\n       ['Hi', 2, 1, 2, 3, 4, 5, 6]\n\n   We flatten a finite field. \n       sage: flatten(GF(5))\n       [0, 1, 2, 3, 4]\n       sage: flatten([GF(5)])\n       [Finite Field of size 5]\n       sage: flatten([GF(5)], ltypes = (list, tuple, sage.rings.finite_field.FiniteField_prime_modn))\n       [0, 1, 2, 3, 4]\n\n   Degenerate cases:\n      sage: flatten([[],[]])\n      []\n      sage: flatten([[[]]])\n      []\n   \"\"\"\n   index = 0\n   new_list = [x for x in in_list]\n   while index < len(new_list):\n      while isinstance(new_list[index], ltypes):\n         v = list(new_list[index])\n         if len(v) != 0:\n            new_list[index : index + 1] = v\n         else:\n            new_list.pop(index)\n            index += -1\n            break\n      index += 1\n   return new_list\n\n```",
    "created_at": "2007-09-11T20:33:24Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/395#issuecomment-1376",
    "user": "https://github.com/sagetrac-mhampton"
}
```

<div id="comment:9" align="right">comment:9</div>

Here is a new version that I believe fixes the problem.

```
def flatten(in_list, ltypes=(list, tuple)):
   """
   Flattens a nested list.

   INPUT:
       in_list -- a list or tuple
       ltypes -- optional list of particular types to flatten

   OUTPUT:
       a flat list of the entries of in_list

   EXAMPLES:
       sage: flatten([[1,1],[1],2])
       [1, 1, 1, 2]
       sage: flatten([[1,2,3], (4,5), [[[1],[2]]]])
       [1, 2, 3, 4, 5, 1, 2]

   In the following example, the vector isn't flattened because
   it is not given in the ltypes input. 
       sage: flatten((['Hi',2,vector(QQ,[1,2,3])],(4,5,6)))
       ['Hi', 2, (1, 2, 3), 4, 5, 6]

   We give the vector type and then even the vector gets flattened:
       sage: flatten((['Hi',2,vector(QQ,[1,2,3])], (4,5,6)), ltypes=(list, tuple,sage.modules.vector_rational_dense.Vector_rational_dense))
       ['Hi', 2, 1, 2, 3, 4, 5, 6]

   We flatten a finite field. 
       sage: flatten(GF(5))
       [0, 1, 2, 3, 4]
       sage: flatten([GF(5)])
       [Finite Field of size 5]
       sage: flatten([GF(5)], ltypes = (list, tuple, sage.rings.finite_field.FiniteField_prime_modn))
       [0, 1, 2, 3, 4]

   Degenerate cases:
      sage: flatten([[],[]])
      []
      sage: flatten([[[]]])
      []
   """
   index = 0
   new_list = [x for x in in_list]
   while index < len(new_list):
      while isinstance(new_list[index], ltypes):
         v = list(new_list[index])
         if len(v) != 0:
            new_list[index : index + 1] = v
         else:
            new_list.pop(index)
            index += -1
            break
      index += 1
   return new_list

```



---

archive/issue_events_003276.json:
```json
{
    "actor": "https://github.com/sagetrac-mhampton",
    "created_at": "2007-09-11T20:33:24Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "milestone_number": null,
    "milestone_title": "sage-2.9.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/395#event-3276"
}
```



---

archive/issue_events_003277.json:
```json
{
    "actor": "https://github.com/sagetrac-mhampton",
    "created_at": "2007-09-11T20:33:24Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "label": "https://github.com/sagemath/sage/labels/feature",
    "label_color": "008080",
    "label_name": "feature",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/395#event-3277"
}
```



---

archive/issue_events_003278.json:
```json
{
    "actor": "https://github.com/sagetrac-mhampton",
    "created_at": "2007-09-11T20:33:24Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "d73a4a",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/395#event-3278"
}
```



---

archive/issue_events_003279.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2007-09-11T22:59:45Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "milestone_number": null,
    "milestone_title": "sage-2.9.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/395#event-3279"
}
```



---

archive/issue_events_003280.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2007-09-11T22:59:45Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "milestone_number": null,
    "milestone_title": "sage-2.8.4.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/395#event-3280"
}
```



---

archive/issue_events_003281.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2007-09-11T23:00:21Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "label": "https://github.com/sagemath/sage/labels/p%3A%204%20%E2%80%93%20minor",
    "label_color": "ffe799",
    "label_name": "p: 4 \u2013 minor",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/395#event-3281"
}
```



---

archive/issue_events_003282.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2007-09-11T23:00:21Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "label": "https://github.com/sagemath/sage/labels/p%3A%203%20%E2%80%93%20major",
    "label_color": "ffbb00",
    "label_name": "p: 3 \u2013 major",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/395#event-3282"
}
```



---

archive/issue_comments_001377.json:
```json
{
    "body": "<div id=\"comment:12\" align=\"right\">comment:12</div>\n\napplied for sage-2.8.4.2.",
    "created_at": "2007-09-13T15:03:45Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/395#issuecomment-1377",
    "user": "https://github.com/williamstein"
}
```

<div id="comment:12" align="right">comment:12</div>

applied for sage-2.8.4.2.



---

archive/issue_events_003283.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2007-09-13T15:03:45Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/395",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/395#event-3283"
}
```
