# Issue 395: flatten command for nested lists

archive/issues_000395.json:
```json
{
    "body": "The attached file has a candidate function for a flatten command. The default types to flatten are lists and tuples, but more can be added.\n\n```\ndef flatten(in_list, ltypes=(list, tuple)):\n    \"\"\"\n    Flattens a nested list.\n\n    INPUT:\n        in_list -- a list or tuple\n        ltypes -- optional list of particular types to flatten\n\n    OUTPUT:\n        a flat list of the entries of in_list\n\n    EXAMPLES:\n        sage: flatten([[1,1],[1],2])\n        [1, 1, 1, 2]\n        sage: flatten((['Hi',2,vector(QQ,[1,2,3])],(4,5,6)))\n        ['Hi', 2, (1, 2, 3), 4, 5, 6]\n        sage: flatten((['Hi',2,vector(QQ,[1,2,3])],(4,5,6)),ltypes=(list, tuple, sage.modules.vector_rational_dense.Vector_rational_dense))\n        ['Hi', 2, 1, 2, 3, 4, 5, 6]\n    \"\"\"\n    index = 0\n    new_list = [x for x in in_list]\n    while index < len(new_list):\n        if not new_list[index]:\n            new_list.pop(index)\n            continue\n        while isinstance(new_list[index], ltypes):\n            new_list[index : index + 1] = list(new_list[index])\n        index += 1\n    return new_list\n```\n\n\n**Assignee:** mhampton\n\n**Keywords:** lists, flatten\n\nIssue created by migration from https://trac.sagemath.org/ticket/395\n\n",
    "closed_at": "2007-09-13T15:03:45Z",
    "created_at": "2007-06-28T16:06:22Z",
    "labels": [
        "component: basic arithmetic"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-2.8.4.2",
    "title": "flatten command for nested lists",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/395",
    "user": "https://trac.sagemath.org/admin/accounts/users/mhampton"
}
```
The attached file has a candidate function for a flatten command. The default types to flatten are lists and tuples, but more can be added.

```
def flatten(in_list, ltypes=(list, tuple)):
    """
    Flattens a nested list.

    INPUT:
        in_list -- a list or tuple
        ltypes -- optional list of particular types to flatten

    OUTPUT:
        a flat list of the entries of in_list

    EXAMPLES:
        sage: flatten([[1,1],[1],2])
        [1, 1, 1, 2]
        sage: flatten((['Hi',2,vector(QQ,[1,2,3])],(4,5,6)))
        ['Hi', 2, (1, 2, 3), 4, 5, 6]
        sage: flatten((['Hi',2,vector(QQ,[1,2,3])],(4,5,6)),ltypes=(list, tuple, sage.modules.vector_rational_dense.Vector_rational_dense))
        ['Hi', 2, 1, 2, 3, 4, 5, 6]
    """
    index = 0
    new_list = [x for x in in_list]
    while index < len(new_list):
        if not new_list[index]:
            new_list.pop(index)
            continue
        while isinstance(new_list[index], ltypes):
            new_list[index : index + 1] = list(new_list[index])
        index += 1
    return new_list
```


**Assignee:** mhampton

**Keywords:** lists, flatten

Issue created by migration from https://trac.sagemath.org/ticket/395





---

archive/issue_comments_001658.json:
```json
{
    "body": "**Changing status** from new to assigned.",
    "created_at": "2007-06-28T16:06:39Z",
    "issue": "https://github.com/sagemath/sagetest/issues/395",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/395#issuecomment-1658",
    "user": "https://trac.sagemath.org/admin/accounts/users/mhampton"
}
```

**Changing status** from new to assigned.



---

archive/issue_comments_001659.json:
```json
{
    "body": "<a id='comment:2'></a>\nNew version:\n\ndef flatten(in_list, ltypes=(list, tuple)):\n    \"\"\"\n    Flattens a nested list.\n\n    INPUT:\n        in_list -- a list or tuple\n        ltypes -- optional list of particular types to flatten\n\n    OUTPUT:\n        a flat list of the entries of in_list\n\n    EXAMPLES:\n        sage: flatten([[1,1],[1],2])\n        [1, 1, 1, 2]\n        sage: flatten([[1,2,3], (4,5), [[[1],[2]]]])\n        [1, 2, 3, 4, 5, 1, 2]\n\n    In the following example, the vector isn't flattened because\n    it is not given in the ltypes input.\n        sage: flatten((['Hi',2,vector(QQ,[1,2,3])],(4,5,6)))\n        ['Hi', 2, (1, 2, 3), 4, 5, 6]\n\n    We give the vector type and then even the vector gets flattened:\n        sage: flatten((['Hi',2,vector(QQ,[1,2,3])], (4,5,6)),\nltypes=(list,\ntuple,sage.modules.vector_rational_dense.Vector_rational_dense))\n        ['Hi', 2, 1, 2, 3, 4, 5, 6]\n\n    We flatten a finite field.\n        sage: flatten(GF(5))\n        [0, 1, 2, 3, 4]\n        sage: flatten([GF(5)])\n        [Finite Field of size 5]\n        sage: flatten([GF(5)], ltypes = (list, tuple,\nsage.rings.finite_field.FiniteField_prime_modn))\n        [0, 1, 2, 3, 4]\n\n    \"\"\"\n    index = 0\n    new_list = [x for x in in_list]\n    while index < len(new_list):\n        while isinstance(new_list[index], ltypes):\n            if len(new_list[index]) != 0:\n                new_list[index : index + 1] = list(new_list[index])\n            else:\n                new_list.pop(index)\n                break\n        index += 1\n    return new_list",
    "created_at": "2007-07-05T15:57:34Z",
    "issue": "https://github.com/sagemath/sagetest/issues/395",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/395#issuecomment-1659",
    "user": "https://trac.sagemath.org/admin/accounts/users/mhampton"
}
```

<a id='comment:2'></a>
New version:

def flatten(in_list, ltypes=(list, tuple)):
    """
    Flattens a nested list.

    INPUT:
        in_list -- a list or tuple
        ltypes -- optional list of particular types to flatten

    OUTPUT:
        a flat list of the entries of in_list

    EXAMPLES:
        sage: flatten([[1,1],[1],2])
        [1, 1, 1, 2]
        sage: flatten([[1,2,3], (4,5), [[[1],[2]]]])
        [1, 2, 3, 4, 5, 1, 2]

    In the following example, the vector isn't flattened because
    it is not given in the ltypes input.
        sage: flatten((['Hi',2,vector(QQ,[1,2,3])],(4,5,6)))
        ['Hi', 2, (1, 2, 3), 4, 5, 6]

    We give the vector type and then even the vector gets flattened:
        sage: flatten((['Hi',2,vector(QQ,[1,2,3])], (4,5,6)),
ltypes=(list,
tuple,sage.modules.vector_rational_dense.Vector_rational_dense))
        ['Hi', 2, 1, 2, 3, 4, 5, 6]

    We flatten a finite field.
        sage: flatten(GF(5))
        [0, 1, 2, 3, 4]
        sage: flatten([GF(5)])
        [Finite Field of size 5]
        sage: flatten([GF(5)], ltypes = (list, tuple,
sage.rings.finite_field.FiniteField_prime_modn))
        [0, 1, 2, 3, 4]

    """
    index = 0
    new_list = [x for x in in_list]
    while index < len(new_list):
        while isinstance(new_list[index], ltypes):
            if len(new_list[index]) != 0:
                new_list[index : index + 1] = list(new_list[index])
            else:
                new_list.pop(index)
                break
        index += 1
    return new_list



---

archive/issue_comments_001660.json:
```json
{
    "body": "<a id='comment:3'></a>\nSage 2.8.2 has a flatten command. It also seems to work on nested lists:\n\n```\nsage: L\n[[1, 2], [1, 2]]\nsage: flatten(L)\n[1, 2, 1, 2]\nsage: L=[L,[L,[L,[L]]]]\nsage: L\n[[[1, 2], [1, 2]], [[[1, 2], [1, 2]], [[[1, 2], [1, 2]], [[[1, 2], [1, 2]]]]]]\nsage: flatten(L)\n[1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2]\n```\nSo am I correct to assume that this ticket can be closed? \n\nCheers,\n\nMichael",
    "created_at": "2007-08-23T12:50:50Z",
    "issue": "https://github.com/sagemath/sagetest/issues/395",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/395#issuecomment-1660",
    "user": "https://trac.sagemath.org/admin/accounts/users/mabshoff"
}
```

<a id='comment:3'></a>
Sage 2.8.2 has a flatten command. It also seems to work on nested lists:

```
sage: L
[[1, 2], [1, 2]]
sage: flatten(L)
[1, 2, 1, 2]
sage: L=[L,[L,[L,[L]]]]
sage: L
[[[1, 2], [1, 2]], [[[1, 2], [1, 2]], [[[1, 2], [1, 2]], [[[1, 2], [1, 2]]]]]]
sage: flatten(L)
[1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2]
```
So am I correct to assume that this ticket can be closed? 

Cheers,

Michael



---

archive/issue_events_001047.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/mabshoff",
    "created_at": "2007-08-23T12:50:50Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/395",
    "milestone": "sage-2.8.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/395#event-1047"
}
```



---

archive/issue_events_001048.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2007-08-29T02:39:43Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/395",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/395#event-1048"
}
```



---

archive/issue_comments_001661.json:
```json
{
    "body": "<a id='comment:4'></a>\nYep, this has been in SAGE a while.",
    "created_at": "2007-08-29T02:39:43Z",
    "issue": "https://github.com/sagemath/sagetest/issues/395",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/395#issuecomment-1661",
    "user": "https://github.com/williamstein"
}
```

<a id='comment:4'></a>
Yep, this has been in SAGE a while.



---

archive/issue_comments_001662.json:
```json
{
    "body": "<a id='comment:5'></a>\nThis still has some problems on empty lists, which I (Marshall Hampton) will try to fix soon.  the simplest example of the problem for the current (2.8.4.1) behavior is:\nflatten([[],[]])\n[[]]\n\nIt should return [].",
    "created_at": "2007-09-11T16:48:26Z",
    "issue": "https://github.com/sagemath/sagetest/issues/395",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/395#issuecomment-1662",
    "user": "https://trac.sagemath.org/admin/accounts/users/mhampton"
}
```

<a id='comment:5'></a>
This still has some problems on empty lists, which I (Marshall Hampton) will try to fix soon.  the simplest example of the problem for the current (2.8.4.1) behavior is:
flatten([[],[]])
[[]]

It should return [].



---

archive/issue_events_001049.json:
```json
{
    "event": "labeled",
    "issue": "https://github.com/sagemath/sagetest/issues/395",
    "label": "bug",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/395#event-1049"
}
```



---

archive/issue_events_001050.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/mhampton",
    "created_at": "2007-09-11T16:48:26Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/395",
    "milestone": "sage-2.8.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/395#event-1050"
}
```



---

archive/issue_events_001051.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/mhampton",
    "created_at": "2007-09-11T16:48:26Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/395",
    "milestone": "sage-feature",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/395#event-1051"
}
```



---

archive/issue_comments_001663.json:
```json
{
    "body": "**Changing status** from closed to reopened.",
    "created_at": "2007-09-11T16:48:26Z",
    "issue": "https://github.com/sagemath/sagetest/issues/395",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/395#issuecomment-1663",
    "user": "https://trac.sagemath.org/admin/accounts/users/mhampton"
}
```

**Changing status** from closed to reopened.



---

archive/issue_comments_001664.json:
```json
{
    "body": "**Changing status** from reopened to new.",
    "created_at": "2007-09-11T16:48:58Z",
    "issue": "https://github.com/sagemath/sagetest/issues/395",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/395#issuecomment-1664",
    "user": "https://trac.sagemath.org/admin/accounts/users/mhampton"
}
```

**Changing status** from reopened to new.



---

archive/issue_comments_001665.json:
```json
{
    "body": "<a id='comment:7'></a>\nReplying to [mhampton](#comment%3A6):\n\nSorry, I am not used to this formatting.  My example should be:\n\nflatten([[],[]])\n\n[[]]\n",
    "created_at": "2007-09-11T16:50:32Z",
    "issue": "https://github.com/sagemath/sagetest/issues/395",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/395#issuecomment-1665",
    "user": "https://trac.sagemath.org/admin/accounts/users/mhampton"
}
```

<a id='comment:7'></a>
Replying to [mhampton](#comment%3A6):

Sorry, I am not used to this formatting.  My example should be:

flatten([[],[]])

[[]]




---

archive/issue_comments_001666.json:
```json
{
    "body": "**Changing status** from new to assigned.",
    "created_at": "2007-09-11T20:31:33Z",
    "issue": "https://github.com/sagemath/sagetest/issues/395",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/395#issuecomment-1666",
    "user": "https://trac.sagemath.org/admin/accounts/users/mhampton"
}
```

**Changing status** from new to assigned.



---

archive/issue_comments_001667.json:
```json
{
    "body": "<a id='comment:9'></a>\nHere is a new version that I believe fixes the problem.\n\n```\ndef flatten(in_list, ltypes=(list, tuple)):\n   \"\"\"\n   Flattens a nested list.\n\n   INPUT:\n       in_list -- a list or tuple\n       ltypes -- optional list of particular types to flatten\n\n   OUTPUT:\n       a flat list of the entries of in_list\n\n   EXAMPLES:\n       sage: flatten([[1,1],[1],2])\n       [1, 1, 1, 2]\n       sage: flatten([[1,2,3], (4,5), [[[1],[2]]]])\n       [1, 2, 3, 4, 5, 1, 2]\n\n   In the following example, the vector isn't flattened because\n   it is not given in the ltypes input. \n       sage: flatten((['Hi',2,vector(QQ,[1,2,3])],(4,5,6)))\n       ['Hi', 2, (1, 2, 3), 4, 5, 6]\n\n   We give the vector type and then even the vector gets flattened:\n       sage: flatten((['Hi',2,vector(QQ,[1,2,3])], (4,5,6)), ltypes=(list, tuple,sage.modules.vector_rational_dense.Vector_rational_dense))\n       ['Hi', 2, 1, 2, 3, 4, 5, 6]\n\n   We flatten a finite field. \n       sage: flatten(GF(5))\n       [0, 1, 2, 3, 4]\n       sage: flatten([GF(5)])\n       [Finite Field of size 5]\n       sage: flatten([GF(5)], ltypes = (list, tuple, sage.rings.finite_field.FiniteField_prime_modn))\n       [0, 1, 2, 3, 4]\n\n   Degenerate cases:\n      sage: flatten([[],[]])\n      []\n      sage: flatten([[[]]])\n      []\n   \"\"\"\n   index = 0\n   new_list = [x for x in in_list]\n   while index < len(new_list):\n      while isinstance(new_list[index], ltypes):\n         v = list(new_list[index])\n         if len(v) != 0:\n            new_list[index : index + 1] = v\n         else:\n            new_list.pop(index)\n            index += -1\n            break\n      index += 1\n   return new_list\n\n```",
    "created_at": "2007-09-11T20:33:24Z",
    "issue": "https://github.com/sagemath/sagetest/issues/395",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/395#issuecomment-1667",
    "user": "https://trac.sagemath.org/admin/accounts/users/mhampton"
}
```

<a id='comment:9'></a>
Here is a new version that I believe fixes the problem.

```
def flatten(in_list, ltypes=(list, tuple)):
   """
   Flattens a nested list.

   INPUT:
       in_list -- a list or tuple
       ltypes -- optional list of particular types to flatten

   OUTPUT:
       a flat list of the entries of in_list

   EXAMPLES:
       sage: flatten([[1,1],[1],2])
       [1, 1, 1, 2]
       sage: flatten([[1,2,3], (4,5), [[[1],[2]]]])
       [1, 2, 3, 4, 5, 1, 2]

   In the following example, the vector isn't flattened because
   it is not given in the ltypes input. 
       sage: flatten((['Hi',2,vector(QQ,[1,2,3])],(4,5,6)))
       ['Hi', 2, (1, 2, 3), 4, 5, 6]

   We give the vector type and then even the vector gets flattened:
       sage: flatten((['Hi',2,vector(QQ,[1,2,3])], (4,5,6)), ltypes=(list, tuple,sage.modules.vector_rational_dense.Vector_rational_dense))
       ['Hi', 2, 1, 2, 3, 4, 5, 6]

   We flatten a finite field. 
       sage: flatten(GF(5))
       [0, 1, 2, 3, 4]
       sage: flatten([GF(5)])
       [Finite Field of size 5]
       sage: flatten([GF(5)], ltypes = (list, tuple, sage.rings.finite_field.FiniteField_prime_modn))
       [0, 1, 2, 3, 4]

   Degenerate cases:
      sage: flatten([[],[]])
      []
      sage: flatten([[[]]])
      []
   """
   index = 0
   new_list = [x for x in in_list]
   while index < len(new_list):
      while isinstance(new_list[index], ltypes):
         v = list(new_list[index])
         if len(v) != 0:
            new_list[index : index + 1] = v
         else:
            new_list.pop(index)
            index += -1
            break
      index += 1
   return new_list

```



---

archive/issue_events_001052.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/mhampton",
    "created_at": "2007-09-11T20:33:24Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/395",
    "milestone": "sage-feature",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/395#event-1052"
}
```



---

archive/issue_events_001053.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/mhampton",
    "created_at": "2007-09-11T20:33:24Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/395",
    "milestone": "sage-2.9.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/395#event-1053"
}
```



---

archive/issue_events_001054.json:
```json
{
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sagetest/issues/395",
    "label": "bug",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/395#event-1054"
}
```



---

archive/issue_events_001055.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2007-09-11T22:59:45Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/395",
    "milestone": "sage-2.9.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/395#event-1055"
}
```



---

archive/issue_events_001056.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2007-09-11T22:59:45Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/395",
    "milestone": "sage-2.8.4.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/395#event-1056"
}
```



---

archive/issue_comments_001668.json:
```json
{
    "body": "<a id='comment:12'></a>\napplied for sage-2.8.4.2.",
    "created_at": "2007-09-13T15:03:45Z",
    "issue": "https://github.com/sagemath/sagetest/issues/395",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/395#issuecomment-1668",
    "user": "https://github.com/williamstein"
}
```

<a id='comment:12'></a>
applied for sage-2.8.4.2.



---

archive/issue_events_001057.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2007-09-13T15:03:45Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/395",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/395#event-1057"
}
```
