# Issue 401: list * integer works but integer * list doesn't work

archive/issues_000401.json:
```json
{
    "body": "In SAGE 2.6, you can do list * integer but not integer * list. Either they should both work (more like python) or neither of them should work (for internal consistency).\n\n```\nsage: [3, 4, 5] * 2\n [3, 4, 5, 3, 4, 5]\n\nsage: 2 * [3, 4, 5]\n---------------------------------------------------------------------------\n<type 'exceptions.TypeError'>             Traceback (most recent call last)\n\n/home/dmharvey/sage-2.6/<ipython console> in <module>()\n\n/home/dmharvey/sage-2.6/element.pyx in element.RingElement.__mul__()\n\n/home/dmharvey/sage-2.6/element.pyx in element.bin_op_c()\n\n<type 'exceptions.TypeError'>: unsupported operand parent(s) for '*': 'Integer Ring' and '<type 'list'>'\n```\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/401\n\n",
    "closed_at": "2007-08-24T13:05:57Z",
    "created_at": "2007-07-10T00:16:34Z",
    "labels": [
        "component: basic arithmetic",
        "minor",
        "bug",
        "worksforme"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-2.8.3",
    "title": "list * integer works but integer * list doesn't work",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/401",
    "user": "https://trac.sagemath.org/admin/accounts/users/dmharvey"
}
```
In SAGE 2.6, you can do list * integer but not integer * list. Either they should both work (more like python) or neither of them should work (for internal consistency).

```
sage: [3, 4, 5] * 2
 [3, 4, 5, 3, 4, 5]

sage: 2 * [3, 4, 5]
---------------------------------------------------------------------------
<type 'exceptions.TypeError'>             Traceback (most recent call last)

/home/dmharvey/sage-2.6/<ipython console> in <module>()

/home/dmharvey/sage-2.6/element.pyx in element.RingElement.__mul__()

/home/dmharvey/sage-2.6/element.pyx in element.bin_op_c()

<type 'exceptions.TypeError'>: unsupported operand parent(s) for '*': 'Integer Ring' and '<type 'list'>'
```


Issue created by migration from https://trac.sagemath.org/ticket/401





---

archive/issue_events_001076.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/mabshoff",
    "created_at": "2007-08-24T13:05:57Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/401",
    "milestone": "sage-2.8.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/401#event-1076"
}
```



---

archive/issue_events_001077.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/mabshoff",
    "created_at": "2007-08-24T13:05:57Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/401",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/401#event-1077"
}
```



---

archive/issue_comments_001688.json:
```json
{
    "body": "<a id='comment:1'></a>\nWork's for me with Sage 2.8.2:\n\n```\nsage: [3,4,5]*3\n[3, 4, 5, 3, 4, 5, 3, 4, 5]\nsage: 3*[4,5,6]\n[4, 5, 6, 4, 5, 6, 4, 5, 6]\n```\n\nCheers,\n\nMichael",
    "created_at": "2007-08-24T13:05:57Z",
    "issue": "https://github.com/sagemath/sagetest/issues/401",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/401#issuecomment-1688",
    "user": "https://trac.sagemath.org/admin/accounts/users/mabshoff"
}
```

<a id='comment:1'></a>
Work's for me with Sage 2.8.2:

```
sage: [3,4,5]*3
[3, 4, 5, 3, 4, 5, 3, 4, 5]
sage: 3*[4,5,6]
[4, 5, 6, 4, 5, 6, 4, 5, 6]
```

Cheers,

Michael
