# Issue 484: multivariate polynomial coercion bug

archive/issues_000484.json:
```json
{
    "assignees": [],
    "body": "\n```\nsage: x,y=PolynomialRing(QQ,2,\"xy\").gens()\nsage: f = 5*x+y-5\nsage: f(1,1)\n 1\nsage: type(f(1,1))\n <type 'sage.rings.polynomial.multi_polynomial_libsingular.MPolynomial_libsingular'>\n```\n\nI usually think of the values of a polynomial as belonging to the\nground ring as opposed to the polynomial ring.\n\n**Assignee:** @williamstein\n\nIssue created by migration from https://trac.sagemath.org/ticket/484\n\n",
    "closed_at": "2007-08-30T12:21:45Z",
    "created_at": "2007-08-23T16:53:19Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20basic%20arithmetic",
        "https://github.com/sagemath/sage/labels/minor",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-2.8.3",
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "multivariate polynomial coercion bug",
    "type": "issue",
    "updated_at": "2007-08-30T12:21:45Z",
    "url": "https://github.com/sagemath/sage/issues/484",
    "user": "https://github.com/wdjoyner"
}
```

```
sage: x,y=PolynomialRing(QQ,2,"xy").gens()
sage: f = 5*x+y-5
sage: f(1,1)
 1
sage: type(f(1,1))
 <type 'sage.rings.polynomial.multi_polynomial_libsingular.MPolynomial_libsingular'>
```

I usually think of the values of a polynomial as belonging to the
ground ring as opposed to the polynomial ring.

**Assignee:** @williamstein

Issue created by migration from https://trac.sagemath.org/ticket/484





---

archive/issue_events_002023.json:
```json
{
    "actor": "https://github.com/sagetrac-mabshoff",
    "created_at": "2007-08-30T12:21:45Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/484",
    "milestone_number": null,
    "milestone_title": "sage-2.8.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/484#event-2023"
}
```



---

archive/issue_events_002024.json:
```json
{
    "actor": "https://github.com/sagetrac-mabshoff",
    "created_at": "2007-08-30T12:21:45Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/484",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/484#event-2024"
}
```



---

archive/issue_comments_001790.json:
```json
{
    "body": "<a id='comment:1'></a>\nWorks for me now:\n\n```\n----------------------------------------------------------------------\n| SAGE Version 2.8.3.alpha2, Release Date: 2007-08-29                |\n| Type notebook() for the GUI, and license() for information.        |\n----------------------------------------------------------------------\n\nsage: x,y=PolynomialRing(QQ,2,\"xy\").gens()\nsage: f = 5*x+y-5\nsage: f(1,1)\n1\nsage: type(f(1,1))\n<type 'sage.rings.rational.Rational'>\n```\n\nI guess credit should go to Robert or William.\n\nCheers,\n\nMichael",
    "created_at": "2007-08-30T12:21:45Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/484",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/484#issuecomment-1790",
    "user": "https://github.com/sagetrac-mabshoff"
}
```

<a id='comment:1'></a>
Works for me now:

```
----------------------------------------------------------------------
| SAGE Version 2.8.3.alpha2, Release Date: 2007-08-29                |
| Type notebook() for the GUI, and license() for information.        |
----------------------------------------------------------------------

sage: x,y=PolynomialRing(QQ,2,"xy").gens()
sage: f = 5*x+y-5
sage: f(1,1)
1
sage: type(f(1,1))
<type 'sage.rings.rational.Rational'>
```

I guess credit should go to Robert or William.

Cheers,

Michael



---

archive/issue_events_002025.json:
```json
{
    "actor": "https://github.com/sagetrac-mabshoff",
    "created_at": "2007-08-30T12:21:45Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/484",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20algebraic%20geometry",
    "label_color": "08517b",
    "label_name": "component: algebraic geometry",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/484#event-2025"
}
```



---

archive/issue_events_002026.json:
```json
{
    "actor": "https://github.com/sagetrac-mabshoff",
    "created_at": "2007-08-30T12:21:45Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/484",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20basic%20arithmetic",
    "label_color": "08517b",
    "label_name": "component: basic arithmetic",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/484#event-2026"
}
```
