# Issue 702: Ellipsis range notation

archive/issues_000702.json:
```json
{
    "body": "There have been proposal to add syntax to SAGE similar to magma/mathmatica/etc 1..n for ranges. See the mailing list for much discusssion. \n\nAssignee: @robertwb\n\nResolution: fixed\n\nIssue created by migration from https://trac.sagemath.org/ticket/702\n\n",
    "closed_at": "2007-09-25T05:32:12Z",
    "created_at": "2007-09-20T11:00:18Z",
    "labels": [
        "component: user interface"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-2.8.5.1",
    "title": "Ellipsis range notation",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/702",
    "user": "https://github.com/robertwb"
}
```
There have been proposal to add syntax to SAGE similar to magma/mathmatica/etc 1..n for ranges. See the mailing list for much discusssion. 

Assignee: @robertwb

Resolution: fixed

Issue created by migration from https://trac.sagemath.org/ticket/702





---

archive/issue_comments_003783.json:
```json
{
    "body": "Attachment [ellipsis_iterator2.diff](tarball://root/attachments/some-uuid/ticket702/ellipsis_iterator2.diff) by @robertwb created at 2007-09-20 11:01:00",
    "created_at": "2007-09-20T11:01:00Z",
    "issue": "https://github.com/sagemath/sagetest/issues/702",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/702#issuecomment-3783",
    "user": "https://github.com/robertwb"
}
```

Attachment [ellipsis_iterator2.diff](tarball://root/attachments/some-uuid/ticket702/ellipsis_iterator2.diff) by @robertwb created at 2007-09-20 11:01:00



---

archive/issue_comments_003784.json:
```json
{
    "body": "<a id='comment:1'></a>\nThe above patches are one such proposal. NOTE: it has not been decided whether or not to include this feature. However, I like it. \n\n```\nsage: [1..10]\n[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]\nsage: n = 5\nsage: [1..n]\n[1, 2, 3, 4, 5]\nsage: [0,2,..,10]\n[0, 2, 4, 6, 8, 10]\nsage: [0,2,..,10,20..30]\n[0, 2, 4, 6, 8, 10, 20, 22, 24, 26, 28, 30]\n\nsage: (0,2,..,10)       \n<generator object at 0xc57cd78>\nsage: A = (5,7,..)\nsage: [A.next() for _ in range(20)]\n[5, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25]\n\n```\n\nAnd a non-trivial example\n\n```\nsage: L = [1..5]\nsage: [L[4], .., next_prime(10), 3, 2, 1]\n[5, 6, 7, 8, 9, 10, 11, 3, 2, 1]\n```",
    "created_at": "2007-09-20T11:14:26Z",
    "issue": "https://github.com/sagemath/sagetest/issues/702",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/702#issuecomment-3784",
    "user": "https://github.com/robertwb"
}
```

<a id='comment:1'></a>
The above patches are one such proposal. NOTE: it has not been decided whether or not to include this feature. However, I like it. 

```
sage: [1..10]
[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
sage: n = 5
sage: [1..n]
[1, 2, 3, 4, 5]
sage: [0,2,..,10]
[0, 2, 4, 6, 8, 10]
sage: [0,2,..,10,20..30]
[0, 2, 4, 6, 8, 10, 20, 22, 24, 26, 28, 30]

sage: (0,2,..,10)       
<generator object at 0xc57cd78>
sage: A = (5,7,..)
sage: [A.next() for _ in range(20)]
[5, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25]

```

And a non-trivial example

```
sage: L = [1..5]
sage: [L[4], .., next_prime(10), 3, 2, 1]
[5, 6, 7, 8, 9, 10, 11, 3, 2, 1]
```



---

archive/issue_comments_003785.json:
```json
{
    "body": "Changing status from new to assigned.",
    "created_at": "2007-09-20T11:14:26Z",
    "issue": "https://github.com/sagemath/sagetest/issues/702",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/702#issuecomment-3785",
    "user": "https://github.com/robertwb"
}
```

Changing status from new to assigned.



---

archive/issue_comments_003786.json:
```json
{
    "body": "Changing assignee from @williamstein to @robertwb.",
    "created_at": "2007-09-20T11:14:26Z",
    "issue": "https://github.com/sagemath/sagetest/issues/702",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/702#issuecomment-3786",
    "user": "https://github.com/robertwb"
}
```

Changing assignee from @williamstein to @robertwb.



---

archive/issue_comments_003787.json:
```json
{
    "body": "Attachment [ellipsis_iterator3.diff](tarball://root/attachments/some-uuid/ticket702/ellipsis_iterator3.diff) by @robertwb created at 2007-09-20 11:21:33",
    "created_at": "2007-09-20T11:21:33Z",
    "issue": "https://github.com/sagemath/sagetest/issues/702",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/702#issuecomment-3787",
    "user": "https://github.com/robertwb"
}
```

Attachment [ellipsis_iterator3.diff](tarball://root/attachments/some-uuid/ticket702/ellipsis_iterator3.diff) by @robertwb created at 2007-09-20 11:21:33



---

archive/issue_comments_003788.json:
```json
{
    "body": "<a id='comment:2'></a>\nFixed:\n\n```\nsage: A = (5,7,..)\nsage: [A.next() for _ in range(10)]\n[5, 7, 9, 11, 13, 15, 17, 19, 21, 23]\n```",
    "created_at": "2007-09-20T11:22:36Z",
    "issue": "https://github.com/sagemath/sagetest/issues/702",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/702#issuecomment-3788",
    "user": "https://github.com/robertwb"
}
```

<a id='comment:2'></a>
Fixed:

```
sage: A = (5,7,..)
sage: [A.next() for _ in range(10)]
[5, 7, 9, 11, 13, 15, 17, 19, 21, 23]
```



---

archive/issue_comments_003789.json:
```json
{
    "body": "Attachment [ellipsis_iterator4.diff](tarball://root/attachments/some-uuid/ticket702/ellipsis_iterator4.diff) by @robertwb created at 2007-09-20 19:06:10",
    "created_at": "2007-09-20T19:06:10Z",
    "issue": "https://github.com/sagemath/sagetest/issues/702",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/702#issuecomment-3789",
    "user": "https://github.com/robertwb"
}
```

Attachment [ellipsis_iterator4.diff](tarball://root/attachments/some-uuid/ticket702/ellipsis_iterator4.diff) by @robertwb created at 2007-09-20 19:06:10



---

archive/issue_comments_003790.json:
```json
{
    "body": "<a id='comment:3'></a>\nFixed an issue with double quotes, and now this works as well \n\n```\nsage: list(1..5)\n[1, 2, 3, 4, 5]\n```",
    "created_at": "2007-09-20T19:07:53Z",
    "issue": "https://github.com/sagemath/sagetest/issues/702",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/702#issuecomment-3790",
    "user": "https://github.com/robertwb"
}
```

<a id='comment:3'></a>
Fixed an issue with double quotes, and now this works as well 

```
sage: list(1..5)
[1, 2, 3, 4, 5]
```



---

archive/issue_events_002232.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2007-09-20T20:11:03Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/702",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/702#event-2232"
}
```



---

archive/issue_comments_003791.json:
```json
{
    "body": "<a id='comment:4'></a>\nAttachment [ellipsis_iterator1-4.hg](tarball://root/attachments/some-uuid/ticket702/ellipsis_iterator1-4.hg) by @williamstein created at 2007-09-20 20:11:03\n\nApplied.  (And I fixed a few bugs.)",
    "created_at": "2007-09-20T20:11:03Z",
    "issue": "https://github.com/sagemath/sagetest/issues/702",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/702#issuecomment-3791",
    "user": "https://github.com/williamstein"
}
```

<a id='comment:4'></a>
Attachment [ellipsis_iterator1-4.hg](tarball://root/attachments/some-uuid/ticket702/ellipsis_iterator1-4.hg) by @williamstein created at 2007-09-20 20:11:03

Applied.  (And I fixed a few bugs.)



---

archive/issue_comments_003792.json:
```json
{
    "body": "Resolution: fixed",
    "created_at": "2007-09-20T20:11:03Z",
    "issue": "https://github.com/sagemath/sagetest/issues/702",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/702#issuecomment-3792",
    "user": "https://github.com/williamstein"
}
```

Resolution: fixed



---

archive/issue_comments_003793.json:
```json
{
    "body": "Resolution changed from fixed to ",
    "created_at": "2007-09-21T22:58:38Z",
    "issue": "https://github.com/sagemath/sagetest/issues/702",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/702#issuecomment-3793",
    "user": "https://github.com/robertwb"
}
```

Resolution changed from fixed to 



---

archive/issue_comments_003794.json:
```json
{
    "body": "Changing status from closed to reopened.",
    "created_at": "2007-09-21T22:58:38Z",
    "issue": "https://github.com/sagemath/sagetest/issues/702",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/702#issuecomment-3794",
    "user": "https://github.com/robertwb"
}
```

Changing status from closed to reopened.



---

archive/issue_events_002233.json:
```json
{
    "actor": "https://github.com/robertwb",
    "created_at": "2007-09-21T22:58:38Z",
    "event": "reopened",
    "issue": "https://github.com/sagemath/sagetest/issues/702",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/702#event-2233"
}
```



---

archive/issue_comments_003795.json:
```json
{
    "body": "<a id='comment:5'></a>\n[1,2,..,-10] should return the empty list.",
    "created_at": "2007-09-21T22:58:38Z",
    "issue": "https://github.com/sagemath/sagetest/issues/702",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/702#issuecomment-3795",
    "user": "https://github.com/robertwb"
}
```

<a id='comment:5'></a>
[1,2,..,-10] should return the empty list.



---

archive/issue_events_002234.json:
```json
{
    "actor": "https://github.com/robertwb",
    "created_at": "2007-09-21T22:58:38Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/702",
    "milestone": "sage-2.8.5.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/702#event-2234"
}
```



---

archive/issue_comments_003796.json:
```json
{
    "body": "Attachment [ellipsis-empty-range.hg](tarball://root/attachments/some-uuid/ticket702/ellipsis-empty-range.hg) by @robertwb created at 2007-09-21 22:58:52",
    "created_at": "2007-09-21T22:58:52Z",
    "issue": "https://github.com/sagemath/sagetest/issues/702",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/702#issuecomment-3796",
    "user": "https://github.com/robertwb"
}
```

Attachment [ellipsis-empty-range.hg](tarball://root/attachments/some-uuid/ticket702/ellipsis-empty-range.hg) by @robertwb created at 2007-09-21 22:58:52



---

archive/issue_comments_003797.json:
```json
{
    "body": "<a id='comment:6'></a>\nFixed. \n\n```\nsage: [1,2..-1]\n[]\nsage: [10..1]\n[]\nsage: [1..10]\n[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]\nsage: [1..10,step=2] # no extra preparsing needed\n[1, 3, 5, 7, 9]\n```",
    "created_at": "2007-09-21T23:01:12Z",
    "issue": "https://github.com/sagemath/sagetest/issues/702",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/702#issuecomment-3797",
    "user": "https://github.com/robertwb"
}
```

<a id='comment:6'></a>
Fixed. 

```
sage: [1,2..-1]
[]
sage: [10..1]
[]
sage: [1..10]
[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
sage: [1..10,step=2] # no extra preparsing needed
[1, 3, 5, 7, 9]
```



---

archive/issue_comments_003798.json:
```json
{
    "body": "<a id='comment:7'></a>\nWhy doesn't [10..1] return [10,9,8,7,6,5,4,3,2,1]?",
    "created_at": "2007-09-22T00:05:19Z",
    "issue": "https://github.com/sagemath/sagetest/issues/702",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/702#issuecomment-3798",
    "user": "https://github.com/jasongrout"
}
```

<a id='comment:7'></a>
Why doesn't [10..1] return [10,9,8,7,6,5,4,3,2,1]?



---

archive/issue_comments_003799.json:
```json
{
    "body": "<a id='comment:8'></a>\nI don't think this should be an error:\n\n```\nsage: [1..5, step=0.5]\n<type 'exceptions.TypeError'>: unable to coerce element to an integer\n```\n\ni.e., the universe stuff should take into account the step if given.",
    "created_at": "2007-09-23T21:35:33Z",
    "issue": "https://github.com/sagemath/sagetest/issues/702",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/702#issuecomment-3799",
    "user": "https://github.com/williamstein"
}
```

<a id='comment:8'></a>
I don't think this should be an error:

```
sage: [1..5, step=0.5]
<type 'exceptions.TypeError'>: unable to coerce element to an integer
```

i.e., the universe stuff should take into account the step if given.



---

archive/issue_comments_003800.json:
```json
{
    "body": "<a id='comment:9'></a>\nFixed now by Robert...",
    "created_at": "2007-09-25T05:32:12Z",
    "issue": "https://github.com/sagemath/sagetest/issues/702",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/702#issuecomment-3800",
    "user": "https://github.com/williamstein"
}
```

<a id='comment:9'></a>
Fixed now by Robert...



---

archive/issue_events_002235.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2007-09-25T05:32:12Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/702",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/702#event-2235"
}
```



---

archive/issue_comments_003801.json:
```json
{
    "body": "Resolution: fixed",
    "created_at": "2007-09-25T05:32:12Z",
    "issue": "https://github.com/sagemath/sagetest/issues/702",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/702#issuecomment-3801",
    "user": "https://github.com/williamstein"
}
```

Resolution: fixed
