# Issue 816: [with patch] Commutative Algebra assorted functionality

archive/issues_000816.json:
```json
{
    "body": "ideal quotients:\n\n```\nsage: R.<x,y,z> = PolynomialRing(GF(181),3)\nsage: I = Ideal([x^2+x*y*z,y^2-z^3*y,z^3+y^5*x*z])\nsage: J = Ideal([x])\nsage: Q = I.quotient(J)\nsage: y*z + x in I\nFalse\nsage: x in J\nTrue\nsage: x * (y*z + x) in I\nTrue\n```\n\nchanging rings for ideals:\n\n```\nsage: P.<x,y,z> = PolynomialRing(QQ,3,order='lex')\nsage: I = sage.rings.ideal.Cyclic(P)\nsage: I\nIdeal (x + y + z, x*y + x*z + y*z, x*y*z - 1) of Polynomial Ring in x, y, z over Rational Field\nsage: I.groebner_basis()\n[z^3 - 1, y^2 + y*z + z^2, x + y + z]\nsage: Q.<x,y,z> = P.new_ring(order='degrevlex'); Q\nPolynomial Ring in x, y, z over Rational Field\nsage: Q.term_order()\nDegree reverse lexicographic term order\n\nsage: J = I.change_ring(Q)\nIdeal (x + y + z, x*y + x*z + y*z, x*y*z - 1) of Polynomial Ring in x, y, z over Rational Field\nsage: J.groebner_basis()\n[x + y + z, y^2 + y*z + z^2, z^3 - 1]\n```\n\nconstructing new rings\n\n```\nsage: P.<x,y,z> = PolynomialRing(GF(127),3,order='lex')\nsage: x > y^2\nTrue\nsage: Q.<x,y,z> = P.new_ring(order='degrevlex')\nsage: x > y^2\nFalse\n```\n\n\nAssignee: @malb\n\nResolution: fixed\n\nIssue created by migration from https://trac.sagemath.org/ticket/816\n\n",
    "closed_at": "2007-10-04T17:14:07Z",
    "created_at": "2007-10-04T00:38:17Z",
    "labels": [
        "component: commutative algebra"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-2.8.6",
    "title": "[with patch] Commutative Algebra assorted functionality",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/816",
    "user": "https://github.com/malb"
}
```
ideal quotients:

```
sage: R.<x,y,z> = PolynomialRing(GF(181),3)
sage: I = Ideal([x^2+x*y*z,y^2-z^3*y,z^3+y^5*x*z])
sage: J = Ideal([x])
sage: Q = I.quotient(J)
sage: y*z + x in I
False
sage: x in J
True
sage: x * (y*z + x) in I
True
```

changing rings for ideals:

```
sage: P.<x,y,z> = PolynomialRing(QQ,3,order='lex')
sage: I = sage.rings.ideal.Cyclic(P)
sage: I
Ideal (x + y + z, x*y + x*z + y*z, x*y*z - 1) of Polynomial Ring in x, y, z over Rational Field
sage: I.groebner_basis()
[z^3 - 1, y^2 + y*z + z^2, x + y + z]
sage: Q.<x,y,z> = P.new_ring(order='degrevlex'); Q
Polynomial Ring in x, y, z over Rational Field
sage: Q.term_order()
Degree reverse lexicographic term order

sage: J = I.change_ring(Q)
Ideal (x + y + z, x*y + x*z + y*z, x*y*z - 1) of Polynomial Ring in x, y, z over Rational Field
sage: J.groebner_basis()
[x + y + z, y^2 + y*z + z^2, z^3 - 1]
```

constructing new rings

```
sage: P.<x,y,z> = PolynomialRing(GF(127),3,order='lex')
sage: x > y^2
True
sage: Q.<x,y,z> = P.new_ring(order='degrevlex')
sage: x > y^2
False
```


Assignee: @malb

Resolution: fixed

Issue created by migration from https://trac.sagemath.org/ticket/816





---

archive/issue_comments_005232.json:
```json
{
    "body": "Attachment [ca.patch](tarball://root/attachments/some-uuid/ticket816/ca.patch) by @malb created at 2007-10-04 00:38:38",
    "created_at": "2007-10-04T00:38:38Z",
    "issue": "https://github.com/sagemath/sagetest/issues/816",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/816#issuecomment-5232",
    "user": "https://github.com/malb"
}
```

Attachment [ca.patch](tarball://root/attachments/some-uuid/ticket816/ca.patch) by @malb created at 2007-10-04 00:38:38



---

archive/issue_comments_005233.json:
```json
{
    "body": "Changing assignee from @williamstein to @malb.",
    "created_at": "2007-10-04T00:44:05Z",
    "issue": "https://github.com/sagemath/sagetest/issues/816",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/816#issuecomment-5233",
    "user": "https://github.com/malb"
}
```

Changing assignee from @williamstein to @malb.



---

archive/issue_comments_005234.json:
```json
{
    "body": "Changing component from algebraic geometry to commutative algebra.",
    "created_at": "2007-10-04T00:44:05Z",
    "issue": "https://github.com/sagemath/sagetest/issues/816",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/816#issuecomment-5234",
    "user": "https://github.com/malb"
}
```

Changing component from algebraic geometry to commutative algebra.



---

archive/issue_comments_005235.json:
```json
{
    "body": "Changing status from new to assigned.",
    "created_at": "2007-10-04T00:44:05Z",
    "issue": "https://github.com/sagemath/sagetest/issues/816",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/816#issuecomment-5235",
    "user": "https://github.com/malb"
}
```

Changing status from new to assigned.



---

archive/issue_comments_005236.json:
```json
{
    "body": "Resolution: fixed",
    "created_at": "2007-10-04T17:14:07Z",
    "issue": "https://github.com/sagemath/sagetest/issues/816",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/816#issuecomment-5236",
    "user": "https://github.com/williamstein"
}
```

Resolution: fixed



---

archive/issue_events_002300.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2007-10-04T17:14:07Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/816",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/816#event-2300"
}
```
