# Issue 82: bug in eigenvalues over a number field

archive/issues_000082.json:
```json
{
    "assignees": [],
    "body": "\n```\n\nsage: M = MatrixSpace(RationalField(),2,2)\nsage: A = M([1,-4,1, -1])\nsage: p = A.charpoly()\nsage: K = NumberField(p,'alpha')\nsage: M = MatrixSpace(K,2,2)\nsage: A = M([1,-4,1, -1])\nsage: A.eigenvectors()\n```\n\nfails at the last step. However, \n\n```\nsage: M = MatrixSpace(RationalField(),2,2)\nsage: A = M([1,-4,1, -1])\nsage: A.eigenvectors()\n [(1, a - 1)]\n```\nworks, though \"a\" is undefined.\n\n**Assignee:** @williamstein\n\nIssue created by migration from https://trac.sagemath.org/ticket/82\n\n",
    "closed_at": "2007-01-12T22:20:47Z",
    "created_at": "2006-09-24T19:43:16Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20linear%20algebra",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "bug in eigenvalues over a number field",
    "type": "issue",
    "updated_at": "2007-01-12T22:20:47Z",
    "url": "https://github.com/sagemath/sage/issues/82",
    "user": "https://github.com/wdjoyner"
}
```

```

sage: M = MatrixSpace(RationalField(),2,2)
sage: A = M([1,-4,1, -1])
sage: p = A.charpoly()
sage: K = NumberField(p,'alpha')
sage: M = MatrixSpace(K,2,2)
sage: A = M([1,-4,1, -1])
sage: A.eigenvectors()
```

fails at the last step. However, 

```
sage: M = MatrixSpace(RationalField(),2,2)
sage: A = M([1,-4,1, -1])
sage: A.eigenvectors()
 [(1, a - 1)]
```
works, though "a" is undefined.

**Assignee:** @williamstein

Issue created by migration from https://trac.sagemath.org/ticket/82





---

archive/issue_comments_000309.json:
```json
{
    "body": "<a id='comment:1'></a>\nNote.  In the second example a is not undefined.  It's the print representation of the generator\nof a number field.  It's not supposed to suddenly be injected into the current scope. \n\n```\nsage: V =A.eigenvectors()\nsage: V[0][1].parent()\n Number Field in a with defining polynomial x^2 + 3\n```",
    "created_at": "2006-09-25T23:12:32Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/82",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/82#issuecomment-309",
    "user": "https://github.com/williamstein"
}
```

<a id='comment:1'></a>
Note.  In the second example a is not undefined.  It's the print representation of the generator
of a number field.  It's not supposed to suddenly be injected into the current scope. 

```
sage: V =A.eigenvectors()
sage: V[0][1].parent()
 Number Field in a with defining polynomial x^2 + 3
```



---

archive/issue_comments_000310.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -1,3 +1,5 @@\n+\n+```\n sage: M = MatrixSpace(RationalField(),2,2)\n \n sage: A = M([1,-4,1, -1])\n@@ -11,9 +13,11 @@\n sage: A = M([1,-4,1, -1])\n \n sage: A.eigenvectors()\n+```\n \n fails at the last step. However, \n \n+```\n sage: M = MatrixSpace(RationalField(),2,2)\n \n sage: A = M([1,-4,1, -1])\n@@ -21,5 +25,5 @@\n sage: A.eigenvectors()\n \n  [(1, a - 1)]\n-\n+```\n works, though \"a\" is undefined.\n``````\n",
    "created_at": "2007-01-12T22:18:37Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/82",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/82#issuecomment-310",
    "user": "https://github.com/williamstein"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -1,3 +1,5 @@
+
+```
 sage: M = MatrixSpace(RationalField(),2,2)
 
 sage: A = M([1,-4,1, -1])
@@ -11,9 +13,11 @@
 sage: A = M([1,-4,1, -1])
 
 sage: A.eigenvectors()
+```
 
 fails at the last step. However, 
 
+```
 sage: M = MatrixSpace(RationalField(),2,2)
 
 sage: A = M([1,-4,1, -1])
@@ -21,5 +25,5 @@
 sage: A.eigenvectors()
 
  [(1, a - 1)]
-
+```
 works, though "a" is undefined.
``````




---

archive/issue_comments_000311.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -1,17 +1,12 @@\n \n ```\n+\n sage: M = MatrixSpace(RationalField(),2,2)\n-\n sage: A = M([1,-4,1, -1])\n-\n sage: p = A.charpoly()\n-\n sage: K = NumberField(p,'alpha')\n-\n sage: M = MatrixSpace(K,2,2)\n-\n sage: A = M([1,-4,1, -1])\n-\n sage: A.eigenvectors()\n ```\n \n@@ -19,11 +14,8 @@\n \n ```\n sage: M = MatrixSpace(RationalField(),2,2)\n-\n sage: A = M([1,-4,1, -1])\n-\n sage: A.eigenvectors()\n-\n  [(1, a - 1)]\n ```\n works, though \"a\" is undefined.\n``````\n",
    "created_at": "2007-01-12T22:19:50Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/82",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/82#issuecomment-311",
    "user": "https://github.com/williamstein"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -1,17 +1,12 @@
 
 ```
+
 sage: M = MatrixSpace(RationalField(),2,2)
-
 sage: A = M([1,-4,1, -1])
-
 sage: p = A.charpoly()
-
 sage: K = NumberField(p,'alpha')
-
 sage: M = MatrixSpace(K,2,2)
-
 sage: A = M([1,-4,1, -1])
-
 sage: A.eigenvectors()
 ```
 
@@ -19,11 +14,8 @@
 
 ```
 sage: M = MatrixSpace(RationalField(),2,2)
-
 sage: A = M([1,-4,1, -1])
-
 sage: A.eigenvectors()
-
  [(1, a - 1)]
 ```
 works, though "a" is undefined.
``````




---

archive/issue_comments_000312.json:
```json
{
    "body": "<a id='comment:4'></a>\nIt now works (though notation slightly different now):\n\n```\nsage: M = MatrixSpace(RationalField(),2,2)\nsage: A = M([1,-4,1, -1])\nsage: p = A.charpoly()\nsage: K = NumberField(p,'alpha')\nsage: M = MatrixSpace(K,2,2)\nsage: A = M([1,-4,1, -1])\nsage: A.eigenspaces()\n[\n(alpha, [\n(1, alpha - 1)\n]),\n(-alpha, [\n(1, -alpha - 1)\n])\n]\n```",
    "created_at": "2007-01-12T22:20:47Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/82",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/82#issuecomment-312",
    "user": "https://github.com/williamstein"
}
```

<a id='comment:4'></a>
It now works (though notation slightly different now):

```
sage: M = MatrixSpace(RationalField(),2,2)
sage: A = M([1,-4,1, -1])
sage: p = A.charpoly()
sage: K = NumberField(p,'alpha')
sage: M = MatrixSpace(K,2,2)
sage: A = M([1,-4,1, -1])
sage: A.eigenspaces()
[
(alpha, [
(1, alpha - 1)
]),
(-alpha, [
(1, -alpha - 1)
])
]
```



---

archive/issue_events_000315.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2007-01-12T22:20:47Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/82",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/82#event-315"
}
```
