# Issue 82: bug in eigenvalues over a number field

archive/issues_000082.json:
```json
{
    "body": "```\n\nsage: M = MatrixSpace(RationalField(),2,2)\nsage: A = M([1,-4,1, -1])\nsage: p = A.charpoly()\nsage: K = NumberField(p,'alpha')\nsage: M = MatrixSpace(K,2,2)\nsage: A = M([1,-4,1, -1])\nsage: A.eigenvectors()\n```\n\nfails at the last step. However, \n\n```\nsage: M = MatrixSpace(RationalField(),2,2)\nsage: A = M([1,-4,1, -1])\nsage: A.eigenvectors()\n [(1, a - 1)]\n```\nworks, though \"a\" is undefined.\n\nAssignee: @williamstein\n\nResolution: fixed\n\nIssue created by migration from https://trac.sagemath.org/ticket/82\n\n",
    "closed_at": "2007-01-12T22:20:47Z",
    "created_at": "2006-09-24T19:43:16Z",
    "labels": [
        "component: linear algebra",
        "bug"
    ],
    "title": "bug in eigenvalues over a number field",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/82",
    "user": "https://github.com/wdjoyner"
}
```
```

sage: M = MatrixSpace(RationalField(),2,2)
sage: A = M([1,-4,1, -1])
sage: p = A.charpoly()
sage: K = NumberField(p,'alpha')
sage: M = MatrixSpace(K,2,2)
sage: A = M([1,-4,1, -1])
sage: A.eigenvectors()
```

fails at the last step. However, 

```
sage: M = MatrixSpace(RationalField(),2,2)
sage: A = M([1,-4,1, -1])
sage: A.eigenvectors()
 [(1, a - 1)]
```
works, though "a" is undefined.

Assignee: @williamstein

Resolution: fixed

Issue created by migration from https://trac.sagemath.org/ticket/82





---

archive/issue_comments_000435.json:
```json
{
    "body": "<a id='comment:1'></a>Note.  In the second example a is not undefined.  It's the print representation of the generator\nof a number field.  It's not supposed to suddenly be injected into the current scope. \n\n```\nsage: V =A.eigenvectors()\nsage: V[0][1].parent()\n Number Field in a with defining polynomial x^2 + 3\n```",
    "created_at": "2006-09-25T23:12:32Z",
    "issue": "https://github.com/sagemath/sagetest/issues/82",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/82#issuecomment-435",
    "user": "https://github.com/williamstein"
}
```

<a id='comment:1'></a>Note.  In the second example a is not undefined.  It's the print representation of the generator
of a number field.  It's not supposed to suddenly be injected into the current scope. 

```
sage: V =A.eigenvectors()
sage: V[0][1].parent()
 Number Field in a with defining polynomial x^2 + 3
```



---

archive/issue_comments_000436.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -1,3 +1,4 @@\n+```\n sage: M = MatrixSpace(RationalField(),2,2)\n \n sage: A = M([1,-4,1, -1])\n@@ -11,9 +12,11 @@\n sage: A = M([1,-4,1, -1])\n \n sage: A.eigenvectors()\n+```\n \n fails at the last step. However, \n \n+```\n sage: M = MatrixSpace(RationalField(),2,2)\n \n sage: A = M([1,-4,1, -1])\n@@ -21,7 +24,7 @@\n sage: A.eigenvectors()\n \n  [(1, a - 1)]\n-\n+```\n works, though \"a\" is undefined.\n \n Comment: 1\n``````\n",
    "created_at": "2007-01-12T22:18:37Z",
    "issue": "https://github.com/sagemath/sagetest/issues/82",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/82#issuecomment-436",
    "user": "https://github.com/williamstein"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -1,3 +1,4 @@
+```
 sage: M = MatrixSpace(RationalField(),2,2)
 
 sage: A = M([1,-4,1, -1])
@@ -11,9 +12,11 @@
 sage: A = M([1,-4,1, -1])
 
 sage: A.eigenvectors()
+```
 
 fails at the last step. However, 
 
+```
 sage: M = MatrixSpace(RationalField(),2,2)
 
 sage: A = M([1,-4,1, -1])
@@ -21,7 +24,7 @@
 sage: A.eigenvectors()
 
  [(1, a - 1)]
-
+```
 works, though "a" is undefined.
 
 Comment: 1
``````




---

archive/issue_comments_000437.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -1,4 +1,23 @@\n+```\n \n+sage: M = MatrixSpace(RationalField(),2,2)\n+sage: A = M([1,-4,1, -1])\n+sage: p = A.charpoly()\n+sage: K = NumberField(p,'alpha')\n+sage: M = MatrixSpace(K,2,2)\n+sage: A = M([1,-4,1, -1])\n+sage: A.eigenvectors()\n+```\n+\n+fails at the last step. However, \n+\n+```\n+sage: M = MatrixSpace(RationalField(),2,2)\n+sage: A = M([1,-4,1, -1])\n+sage: A.eigenvectors()\n+ [(1, a - 1)]\n+```\n+works, though \"a\" is undefined.\n \n Comment: 1\n \n``````\n",
    "created_at": "2007-01-12T22:19:50Z",
    "issue": "https://github.com/sagemath/sagetest/issues/82",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/82#issuecomment-437",
    "user": "https://github.com/williamstein"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -1,4 +1,23 @@
+```
 
+sage: M = MatrixSpace(RationalField(),2,2)
+sage: A = M([1,-4,1, -1])
+sage: p = A.charpoly()
+sage: K = NumberField(p,'alpha')
+sage: M = MatrixSpace(K,2,2)
+sage: A = M([1,-4,1, -1])
+sage: A.eigenvectors()
+```
+
+fails at the last step. However, 
+
+```
+sage: M = MatrixSpace(RationalField(),2,2)
+sage: A = M([1,-4,1, -1])
+sage: A.eigenvectors()
+ [(1, a - 1)]
+```
+works, though "a" is undefined.
 
 Comment: 1
 
``````




---

archive/issue_comments_000438.json:
```json
{
    "body": "Resolution: fixed",
    "created_at": "2007-01-12T22:20:47Z",
    "issue": "https://github.com/sagemath/sagetest/issues/82",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/82#issuecomment-438",
    "user": "https://github.com/williamstein"
}
```

Resolution: fixed



---

archive/issue_comments_000439.json:
```json
{
    "body": "<a id='comment:4'></a>It now works (though notation slightly different now):\n\n```\nsage: M = MatrixSpace(RationalField(),2,2)\nsage: A = M([1,-4,1, -1])\nsage: p = A.charpoly()\nsage: K = NumberField(p,'alpha')\nsage: M = MatrixSpace(K,2,2)\nsage: A = M([1,-4,1, -1])\nsage: A.eigenspaces()\n[\n(alpha, [\n(1, alpha - 1)\n]),\n(-alpha, [\n(1, -alpha - 1)\n])\n]\n```",
    "created_at": "2007-01-12T22:20:47Z",
    "issue": "https://github.com/sagemath/sagetest/issues/82",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/82#issuecomment-439",
    "user": "https://github.com/williamstein"
}
```

<a id='comment:4'></a>It now works (though notation slightly different now):

```
sage: M = MatrixSpace(RationalField(),2,2)
sage: A = M([1,-4,1, -1])
sage: p = A.charpoly()
sage: K = NumberField(p,'alpha')
sage: M = MatrixSpace(K,2,2)
sage: A = M([1,-4,1, -1])
sage: A.eigenspaces()
[
(alpha, [
(1, alpha - 1)
]),
(-alpha, [
(1, -alpha - 1)
])
]
```



---

archive/issue_events_000177.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2007-01-12T22:20:47Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/82",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/82#event-177"
}
```
