# Issue 841: hash() on algebraic reals is not stable

archive/issues_000841.json:
```json
{
    "assignees": [],
    "body": "The hash() function applied to a single algebraic real may give different results at different times:\n\n```\nsage: foo = sqrt(AA(4))\nsage: hash(foo)\n-1289340516\nsage: foo == 2\nTrue\nsage: hash(foo)\n2105051955\n```\n\n(I plan to fix this problem very soon.)\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/841\n\n",
    "closed_at": "2007-10-13T07:10:03Z",
    "created_at": "2007-10-09T00:42:55Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20basic%20arithmetic",
        "https://github.com/sagemath/sage/labels/minor",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-2.8.7",
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "hash() on algebraic reals is not stable",
    "type": "issue",
    "updated_at": "2007-10-13T07:10:03Z",
    "url": "https://github.com/sagemath/sage/issues/841",
    "user": "https://github.com/sagetrac-cwitty"
}
```
The hash() function applied to a single algebraic real may give different results at different times:

```
sage: foo = sqrt(AA(4))
sage: hash(foo)
-1289340516
sage: foo == 2
True
sage: hash(foo)
2105051955
```

(I plan to fix this problem very soon.)


Issue created by migration from https://trac.sagemath.org/ticket/841





---

archive/issue_comments_003971.json:
```json
{
    "body": "<a id='comment:1'></a>\n**Attachment:** [6719.patch.gz](https://github.com/sagemath/sage/files/ticket841/6719.patch.gz)\n\nOK, here's a patch that makes hash() on algebraic reals stable.  New results after the patch:\n\n```\nsage: foo = sqrt(AA(4))\nsage: hash(foo)\n-1968313278\nsage: foo == 2\nTrue\nsage: hash(foo)\n-1968313278\n```",
    "created_at": "2007-10-09T01:03:52Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/841",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/841#issuecomment-3971",
    "user": "https://github.com/sagetrac-cwitty"
}
```

<a id='comment:1'></a>
**Attachment:** [6719.patch.gz](https://github.com/sagemath/sage/files/ticket841/6719.patch.gz)

OK, here's a patch that makes hash() on algebraic reals stable.  New results after the patch:

```
sage: foo = sqrt(AA(4))
sage: hash(foo)
-1968313278
sage: foo == 2
True
sage: hash(foo)
-1968313278
```



---

archive/issue_comments_003972.json:
```json
{
    "body": "**Remove assignee** cwitty.",
    "created_at": "2007-10-09T01:03:52Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/841",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/841#issuecomment-3972",
    "user": "https://github.com/sagetrac-cwitty"
}
```

**Remove assignee** cwitty.



---

archive/issue_events_004006.json:
```json
{
    "actor": "https://github.com/sagetrac-cwitty",
    "created_at": "2007-10-09T01:03:52Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/841",
    "milestone_number": null,
    "milestone_title": "sage-2.9",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/841#event-4006"
}
```



---

archive/issue_events_004007.json:
```json
{
    "actor": "https://github.com/sagetrac-cwitty",
    "created_at": "2007-10-09T01:03:52Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/841",
    "milestone_number": null,
    "milestone_title": "sage-2.8.7",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/841#event-4007"
}
```



---

archive/issue_events_004008.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2007-10-13T07:10:03Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/841",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/841#event-4008"
}
```
