# Issue 841: [with patch] hash() on algebraic reals is not stable

archive/issues_000841.json:
```json
{
    "body": "The hash() function applied to a single algebraic real may give different results at different times:\n\n```\nsage: foo = sqrt(AA(4))\nsage: hash(foo)\n-1289340516\nsage: foo == 2\nTrue\nsage: hash(foo)\n2105051955\n```\n\n(I plan to fix this problem very soon.)\n\n\nAssignee: tbd\n\nResolution: fixed\n\nIssue created by migration from https://trac.sagemath.org/ticket/841\n\n",
    "closed_at": "2007-10-13T07:10:03Z",
    "created_at": "2007-10-09T00:42:55Z",
    "labels": [
        "component: basic arithmetic",
        "minor",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-2.8.7",
    "title": "[with patch] hash() on algebraic reals is not stable",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/841",
    "user": "https://trac.sagemath.org/admin/accounts/users/cwitty"
}
```
The hash() function applied to a single algebraic real may give different results at different times:

```
sage: foo = sqrt(AA(4))
sage: hash(foo)
-1289340516
sage: foo == 2
True
sage: hash(foo)
2105051955
```

(I plan to fix this problem very soon.)


Assignee: tbd

Resolution: fixed

Issue created by migration from https://trac.sagemath.org/ticket/841





---

archive/issue_comments_005674.json:
```json
{
    "body": "<a id='comment:1'></a>Attachment [6719.patch](tarball://root/attachments/some-uuid/ticket841/6719.patch) by cwitty created at 2007-10-09 01:03:52\n\nOK, here's a patch that makes hash() on algebraic reals stable.  New results after the patch:\n\n```\nsage: foo = sqrt(AA(4))\nsage: hash(foo)\n-1968313278\nsage: foo == 2\nTrue\nsage: hash(foo)\n-1968313278\n```",
    "created_at": "2007-10-09T01:03:52Z",
    "issue": "https://github.com/sagemath/sagetest/issues/841",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/841#issuecomment-5674",
    "user": "https://trac.sagemath.org/admin/accounts/users/cwitty"
}
```

<a id='comment:1'></a>Attachment [6719.patch](tarball://root/attachments/some-uuid/ticket841/6719.patch) by cwitty created at 2007-10-09 01:03:52

OK, here's a patch that makes hash() on algebraic reals stable.  New results after the patch:

```
sage: foo = sqrt(AA(4))
sage: hash(foo)
-1968313278
sage: foo == 2
True
sage: hash(foo)
-1968313278
```



---

archive/issue_comments_005675.json:
```json
{
    "body": "Changing assignee from cwitty to tbd.",
    "created_at": "2007-10-09T01:03:52Z",
    "issue": "https://github.com/sagemath/sagetest/issues/841",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/841#issuecomment-5675",
    "user": "https://trac.sagemath.org/admin/accounts/users/cwitty"
}
```

Changing assignee from cwitty to tbd.



---

archive/issue_events_002371.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/cwitty",
    "created_at": "2007-10-09T01:03:52Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/841",
    "milestone": "sage-2.8.7",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/841#event-2371"
}
```



---

archive/issue_comments_005676.json:
```json
{
    "body": "Resolution: fixed",
    "created_at": "2007-10-13T07:10:03Z",
    "issue": "https://github.com/sagemath/sagetest/issues/841",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/841#issuecomment-5676",
    "user": "https://github.com/williamstein"
}
```

Resolution: fixed



---

archive/issue_events_002372.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2007-10-13T07:10:03Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/841",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/841#event-2372"
}
```
