# Issue 14693: Conversion of power series to symbolic ring

archive/issues_014489.json:
```json
{
    "body": "Converting a power series to the symbolic ring doesn't work as expected:\n\n```\nsage: R.<t> = PowerSeriesRing(QQ)\nsage: p = R([1,2,3])\nsage: SR(p).variables()\n()\nsage: diff(SR(p))\n0\n```\n\nPerhaps it could be converted to a polynomial first and then converted to the symbolic ring?\n\n```\nsage: SR(p.polynomial()).variables()\n(t,)\nsage: diff(SR(p.polynomial()))      \n6*t + 2\n```\n\nOr maybe just raise an error (as per #13360)?\n\n**Assignee:** @burcin\n\n**Status:** needs_info\n\nIssue created by migration from https://trac.sagemath.org/ticket/14693\n\n",
    "created_at": "2013-06-05T20:05:43Z",
    "labels": [
        "component: symbolics",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-6.4",
    "title": "Conversion of power series to symbolic ring",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/14693",
    "user": "https://github.com/eviatarbach"
}
```
Converting a power series to the symbolic ring doesn't work as expected:

```
sage: R.<t> = PowerSeriesRing(QQ)
sage: p = R([1,2,3])
sage: SR(p).variables()
()
sage: diff(SR(p))
0
```

Perhaps it could be converted to a polynomial first and then converted to the symbolic ring?

```
sage: SR(p.polynomial()).variables()
(t,)
sage: diff(SR(p.polynomial()))      
6*t + 2
```

Or maybe just raise an error (as per #13360)?

**Assignee:** @burcin

**Status:** needs_info

Issue created by migration from https://trac.sagemath.org/ticket/14693





---

archive/issue_comments_220759.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -17,3 +17,5 @@\n sage: diff(SR(p.polynomial()))      \n 6*t + 2\n ```\n+\n+Or maybe just raise an error (as per #13360)?\n``````\n",
    "created_at": "2013-06-05T20:08:53Z",
    "issue": "https://github.com/sagemath/sagetest/issues/14693",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/14693#issuecomment-220759",
    "user": "https://github.com/eviatarbach"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -17,3 +17,5 @@
 sage: diff(SR(p.polynomial()))      
 6*t + 2
 ```
+
+Or maybe just raise an error (as per #13360)?
``````




---

archive/issue_events_047981.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2013-08-13T15:35:53Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/14693",
    "milestone": "sage-5.12",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/14693#event-47981"
}
```



---

archive/issue_events_047982.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-01-30T21:20:52Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/14693",
    "milestone": "sage-5.12",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/14693#event-47982"
}
```



---

archive/issue_events_047983.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-01-30T21:20:52Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/14693",
    "milestone": "sage-6.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/14693#event-47983"
}
```



---

archive/issue_comments_220760.json:
```json
{
    "body": "<a id='comment:4'></a>\n#15707 is related.",
    "created_at": "2014-02-12T08:44:30Z",
    "issue": "https://github.com/sagemath/sagetest/issues/14693",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/14693#issuecomment-220760",
    "user": "https://github.com/eviatarbach"
}
```

<a id='comment:4'></a>
#15707 is related.



---

archive/issue_events_047984.json:
```json
{
    "event": "renamed",
    "issue": "https://github.com/sagemath/sagetest/issues/14693",
    "rename": {
        "from": "Coercion of power series to symbolic ring",
        "to": "Conversion of power series to symbolic ring"
    },
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/14693#event-47984"
}
```



---

archive/issue_comments_220761.json:
```json
{
    "body": "<a id='comment:5'></a>\nThe examples here refer to conversion; not coercion. That fact that power series over \"basic\" ring types such as rationals or integers don't convert into SR is, I think, a shortcoming that can be fixed. The main thing is to find how to represent the relevant \"big-Oh\" in SR. Maxima does have power series, so there is at least one back-end that provides some support: [http://maxima.sourceforge.net/docs/manual/en/maxima_28.html#IDX1221](http://maxima.sourceforge.net/docs/manual/en/maxima_28.html#IDX1221). Linking up maxima's internal format with sage might need some work:\n\n```\nsage: F=maxima_calculus('taylor(sin(x),x,0,3)')\nsage: F\nx-x^3/6\nsage: F.ecl()\n<ECL: ((MRAT SIMP (((%SIN SIMP) $X) $X) (#:|sin(x)2136| #:X2137)\n  (($X ((3 . 1)) 0 NIL #:X2137 . 2)) TRUNC)\n PS (#:X2137 . 2) ((3 . 1)) ((1 . 1) 1 . 1) ((3 . 1) -1 . 6))>\nsage: F-x+x^3/6\n+0\nsage: (F-x+x^3/6).ecl()\n<ECL: ((MRAT SIMP ($X) (#:X2145) (($X ((3 . 1)) 0 NIL #:X2145 . 1)) TRUNC) 0 . 1)>\n```\n(in maxima this prints with dots, so it knows it's a power series)",
    "created_at": "2014-02-12T16:32:12Z",
    "issue": "https://github.com/sagemath/sagetest/issues/14693",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/14693#issuecomment-220761",
    "user": "https://github.com/nbruin"
}
```

<a id='comment:5'></a>
The examples here refer to conversion; not coercion. That fact that power series over "basic" ring types such as rationals or integers don't convert into SR is, I think, a shortcoming that can be fixed. The main thing is to find how to represent the relevant "big-Oh" in SR. Maxima does have power series, so there is at least one back-end that provides some support: [http://maxima.sourceforge.net/docs/manual/en/maxima_28.html#IDX1221](http://maxima.sourceforge.net/docs/manual/en/maxima_28.html#IDX1221). Linking up maxima's internal format with sage might need some work:

```
sage: F=maxima_calculus('taylor(sin(x),x,0,3)')
sage: F
x-x^3/6
sage: F.ecl()
<ECL: ((MRAT SIMP (((%SIN SIMP) $X) $X) (#:|sin(x)2136| #:X2137)
  (($X ((3 . 1)) 0 NIL #:X2137 . 2)) TRUNC)
 PS (#:X2137 . 2) ((3 . 1)) ((1 . 1) 1 . 1) ((3 . 1) -1 . 6))>
sage: F-x+x^3/6
+0
sage: (F-x+x^3/6).ecl()
<ECL: ((MRAT SIMP ($X) (#:X2145) (($X ((3 . 1)) 0 NIL #:X2145 . 1)) TRUNC) 0 . 1)>
```
(in maxima this prints with dots, so it knows it's a power series)



---

archive/issue_comments_220762.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -1,4 +1,4 @@\n-Coercing a power series to the symbolic ring doesn't work as expected:\n+Converting a power series to the symbolic ring doesn't work as expected:\n \n ```\n sage: R.<t> = PowerSeriesRing(QQ)\n@@ -9,7 +9,7 @@\n 0\n ```\n \n-Perhaps it could be converted to a polynomial first and then coerced to the symbolic ring?\n+Perhaps it could be converted to a polynomial first and then converted to the symbolic ring?\n \n ```\n sage: SR(p.polynomial()).variables()\n``````\n",
    "created_at": "2014-02-12T16:32:12Z",
    "issue": "https://github.com/sagemath/sagetest/issues/14693",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/14693#issuecomment-220762",
    "user": "https://github.com/nbruin"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -1,4 +1,4 @@
-Coercing a power series to the symbolic ring doesn't work as expected:
+Converting a power series to the symbolic ring doesn't work as expected:
 
 ```
 sage: R.<t> = PowerSeriesRing(QQ)
@@ -9,7 +9,7 @@
 0
 ```
 
-Perhaps it could be converted to a polynomial first and then coerced to the symbolic ring?
+Perhaps it could be converted to a polynomial first and then converted to the symbolic ring?
 
 ```
 sage: SR(p.polynomial()).variables()
``````




---

archive/issue_events_047985.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-05-06T15:20:58Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/14693",
    "milestone": "sage-6.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/14693#event-47985"
}
```



---

archive/issue_events_047986.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-05-06T15:20:58Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/14693",
    "milestone": "sage-6.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/14693#event-47986"
}
```



---

archive/issue_events_047987.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-08-10T16:51:03Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/14693",
    "milestone": "sage-6.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/14693#event-47987"
}
```



---

archive/issue_events_047988.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-08-10T16:51:03Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/14693",
    "milestone": "sage-6.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/14693#event-47988"
}
```



---

archive/issue_comments_220763.json:
```json
{
    "body": "**Changing status** from new to needs_info.",
    "created_at": "2016-07-09T15:05:57Z",
    "issue": "https://github.com/sagemath/sagetest/issues/14693",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/14693#issuecomment-220763",
    "user": "https://trac.sagemath.org/admin/accounts/users/jakobkroeker"
}
```

**Changing status** from new to needs_info.



---

archive/issue_comments_220764.json:
```json
{
    "body": "<a id='comment:8'></a>\nseems fixed?",
    "created_at": "2016-07-09T15:05:57Z",
    "issue": "https://github.com/sagemath/sagetest/issues/14693",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/14693#issuecomment-220764",
    "user": "https://trac.sagemath.org/admin/accounts/users/jakobkroeker"
}
```

<a id='comment:8'></a>
seems fixed?
