# Issue 25271: exact division sometimes fails in QQbar[x,y]

archive/issues_025034.json:
```json
{
    "body": "The following example (cribbed from Sage's multivariate polynomial discriminant code and an algebraic curve test case) is an exact division (output suppressed for brevity):\n\n```\nsage: R.<x,y> = QQ[]\nsage: f = 3*x*(x-1)*y^4 -4*(x-1)*(x-2)*y^3 + (4/27)*(x-2)^4\nsage: ans = f.resultant(f.derivative(y), y) / (f.coefficient(y^4))\nsage: R(ans);\n```\n\nHowever, if we try the same thing over `QQbar`, it doesn't work:\n\n```\nsage: R.<x,y> = QQbar[]\nsage: f = 3*x*(x-1)*y^4 -4*(x-1)*(x-2)*y^3 + (4/27)*(x-2)^4\nsage: ans = f.resultant(f.derivative(y), y) / (f.coefficient(y^4))\nsage: R(ans);\nTypeError: unable to coerce since the denominator is not 1\n```\n\nIn both cases, `ans` comes back in a fraction field, though in the first example, it is a polynomial and be converted back to `R`.  In the second example, it is an (improper) rational function.\n\n`ans` doesn't involve `y`, and one way to \"fix\" this is to convert into `QQbar[x]` before performing the division:\n\n```\nsage: R.<x,y> = QQbar[]\nsage: f = 3*x*(x-1)*y^4 -4*(x-1)*(x-2)*y^3 + (4/27)*(x-2)^4\nsage: Rx = QQbar[x]\nsage: ans = Rx(f.resultant(f.derivative(y), y)) / Rx(f.coefficient(y^4))\nsage: R(Rx(ans));\n```\n\n`ans` still comes back in a fraction field, and has to be converted to `Rx` before it can be converted to `R`, but at least the univariate code recognizes it as an exact division, where the multivariate code seems not to.\n\nStatus: new\n\nIssue created by migration from https://trac.sagemath.org/ticket/25271\n\n",
    "created_at": "2018-05-01T05:22:32Z",
    "labels": [
        "component: commutative algebra",
        "minor",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-8.3",
    "title": "exact division sometimes fails in QQbar[x,y]",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/25271",
    "user": "https://github.com/BrentBaccala"
}
```
The following example (cribbed from Sage's multivariate polynomial discriminant code and an algebraic curve test case) is an exact division (output suppressed for brevity):

```
sage: R.<x,y> = QQ[]
sage: f = 3*x*(x-1)*y^4 -4*(x-1)*(x-2)*y^3 + (4/27)*(x-2)^4
sage: ans = f.resultant(f.derivative(y), y) / (f.coefficient(y^4))
sage: R(ans);
```

However, if we try the same thing over `QQbar`, it doesn't work:

```
sage: R.<x,y> = QQbar[]
sage: f = 3*x*(x-1)*y^4 -4*(x-1)*(x-2)*y^3 + (4/27)*(x-2)^4
sage: ans = f.resultant(f.derivative(y), y) / (f.coefficient(y^4))
sage: R(ans);
TypeError: unable to coerce since the denominator is not 1
```

In both cases, `ans` comes back in a fraction field, though in the first example, it is a polynomial and be converted back to `R`.  In the second example, it is an (improper) rational function.

`ans` doesn't involve `y`, and one way to "fix" this is to convert into `QQbar[x]` before performing the division:

```
sage: R.<x,y> = QQbar[]
sage: f = 3*x*(x-1)*y^4 -4*(x-1)*(x-2)*y^3 + (4/27)*(x-2)^4
sage: Rx = QQbar[x]
sage: ans = Rx(f.resultant(f.derivative(y), y)) / Rx(f.coefficient(y^4))
sage: R(Rx(ans));
```

`ans` still comes back in a fraction field, and has to be converted to `Rx` before it can be converted to `R`, but at least the univariate code recognizes it as an exact division, where the multivariate code seems not to.

Status: new

Issue created by migration from https://trac.sagemath.org/ticket/25271


