# Issue 25313: Speed up exact division in ℤ[x,y,...]

archive/issues_025076.json:
```json
{
    "body": "...by directly calling Singular instead of first converting polynomials over\u00a0\u211a (similar to #25287).\n\n```\nsage: p = 3*(-x^8*y^2 - x*y^9 + 6*x^8*y + 17*x^2*y^6 - x^3*y^2)\nsage: q = 7*(x^2 + x*y + y^2 + 1)\nsage: %timeit p//q # before\n1000 loops, best of 3: 278 \u00b5s per loop\nsage: %timeit p//q # after\nThe slowest run took 4.27 times longer than the fastest. This could mean that an intermediate result is being cached.\n100000 loops, best of 3: 14.2 \u00b5s per loop\n```\n\nNote that this changes the result of some inexact divisions:\n\n```\nsage: P.<x,y> = ZZ[]\nsage: (x+y)//(2*x) # before\n0\nsage: (x^3 + x^2 + 1)//(2*x)\n0\nsage: (x+y)//(2*x) # after\n1\nsage: (x^3 + x^2 + 1)//(2*x)\nx^2 + x\n```\nBut I frankly don't understand the definition that was used before; it seems that it was just an arbitrary choice of quotient that agreed with the exact result for exact divisions. In particular, neither the old definition nor the new one (nor `//` over\u00a0\u211a) satisfies `(p - (p//q)*q).lt() < p.lt()`.\n\n\n**Branch/Commit:** [ffb4507e5c667825d0c1375262eea648c818f0d6](https://github.com/sagemath/sagetrac-mirror/commit/ffb4507e5c667825d0c1375262eea648c818f0d6)\n\n**Reviewer:** Travis Scrimshaw\n\n**Author:** Marc Mezzarobba\n\nIssue created by migration from https://trac.sagemath.org/ticket/25313\n\n",
    "closed_at": "2018-05-15T22:33:26Z",
    "created_at": "2018-05-09T09:07:06Z",
    "labels": [
        "component: commutative algebra",
        "enhancement"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-8.3",
    "title": "Speed up exact division in \u2124[x,y,...]",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/25313",
    "user": "https://github.com/mezzarobba"
}
```
...by directly calling Singular instead of first converting polynomials over ℚ (similar to #25287).

```
sage: p = 3*(-x^8*y^2 - x*y^9 + 6*x^8*y + 17*x^2*y^6 - x^3*y^2)
sage: q = 7*(x^2 + x*y + y^2 + 1)
sage: %timeit p//q # before
1000 loops, best of 3: 278 µs per loop
sage: %timeit p//q # after
The slowest run took 4.27 times longer than the fastest. This could mean that an intermediate result is being cached.
100000 loops, best of 3: 14.2 µs per loop
```

Note that this changes the result of some inexact divisions:

```
sage: P.<x,y> = ZZ[]
sage: (x+y)//(2*x) # before
0
sage: (x^3 + x^2 + 1)//(2*x)
0
sage: (x+y)//(2*x) # after
1
sage: (x^3 + x^2 + 1)//(2*x)
x^2 + x
```
But I frankly don't understand the definition that was used before; it seems that it was just an arbitrary choice of quotient that agreed with the exact result for exact divisions. In particular, neither the old definition nor the new one (nor `//` over ℚ) satisfies `(p - (p//q)*q).lt() < p.lt()`.


**Branch/Commit:** [ffb4507e5c667825d0c1375262eea648c818f0d6](https://github.com/sagemath/sagetrac-mirror/commit/ffb4507e5c667825d0c1375262eea648c818f0d6)

**Reviewer:** Travis Scrimshaw

**Author:** Marc Mezzarobba

Issue created by migration from https://trac.sagemath.org/ticket/25313





---

archive/issue_comments_462570.json:
```json
{
    "body": "**Changing status** from new to needs_review.",
    "created_at": "2018-05-09T12:05:48Z",
    "issue": "https://github.com/sagemath/sagetest/issues/25313",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/25313#issuecomment-462570",
    "user": "https://github.com/mezzarobba"
}
```

**Changing status** from new to needs_review.



---

archive/issue_comments_462571.json:
```json
{
    "body": "<a id='comment:2'></a>\nAt least for `(x+y)//(2*x)`, I would (albeit naively) expect `0` since the monomial `x//x == 1` and `1 * 2 == 0` (with certainly `y*x == 0`). However, it does make sense with `quo_rem`:\n\n```\nsage: (x+y).quo_rem(2*x)\n(1, -x + y)\nsage: (x^3+x^2+1).quo_rem(2*x)\n(x^2 + x, -x^3 - x^2 + 1)\n```\nand it just returning the quotient.",
    "created_at": "2018-05-09T12:15:17Z",
    "issue": "https://github.com/sagemath/sagetest/issues/25313",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/25313#issuecomment-462571",
    "user": "https://github.com/tscrim"
}
```

<a id='comment:2'></a>
At least for `(x+y)//(2*x)`, I would (albeit naively) expect `0` since the monomial `x//x == 1` and `1 * 2 == 0` (with certainly `y*x == 0`). However, it does make sense with `quo_rem`:

```
sage: (x+y).quo_rem(2*x)
(1, -x + y)
sage: (x^3+x^2+1).quo_rem(2*x)
(x^2 + x, -x^3 - x^2 + 1)
```
and it just returning the quotient.



---

archive/issue_comments_462572.json:
```json
{
    "body": "**Changing status** from needs_review to positive_review.",
    "created_at": "2018-05-10T10:23:56Z",
    "issue": "https://github.com/sagemath/sagetest/issues/25313",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/25313#issuecomment-462572",
    "user": "https://github.com/tscrim"
}
```

**Changing status** from needs_review to positive_review.



---

archive/issue_comments_462573.json:
```json
{
    "body": "<a id='comment:3'></a>\nHaving thought more about it, I find the agreement with `quo_rem` to be more desirable. I also do not see the change in behavior as something people should be relying on and should be treated as a [spacebar](https://xkcd.com/1172/) (even after this ticket). So positive review.",
    "created_at": "2018-05-10T10:23:56Z",
    "issue": "https://github.com/sagemath/sagetest/issues/25313",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/25313#issuecomment-462573",
    "user": "https://github.com/tscrim"
}
```

<a id='comment:3'></a>
Having thought more about it, I find the agreement with `quo_rem` to be more desirable. I also do not see the change in behavior as something people should be relying on and should be treated as a [spacebar](https://xkcd.com/1172/) (even after this ticket). So positive review.



---

archive/issue_comments_462574.json:
```json
{
    "body": "**Reviewer:** Travis Scrimshaw",
    "created_at": "2018-05-10T10:23:56Z",
    "issue": "https://github.com/sagemath/sagetest/issues/25313",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/25313#issuecomment-462574",
    "user": "https://github.com/tscrim"
}
```

**Reviewer:** Travis Scrimshaw



---

archive/issue_comments_462575.json:
```json
{
    "body": "<a id='comment:4'></a>\nThanks!",
    "created_at": "2018-05-10T18:02:21Z",
    "issue": "https://github.com/sagemath/sagetest/issues/25313",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/25313#issuecomment-462575",
    "user": "https://github.com/mezzarobba"
}
```

<a id='comment:4'></a>
Thanks!



---

archive/issue_events_071788.json:
```json
{
    "actor": "https://github.com/vbraun",
    "created_at": "2018-05-15T22:33:26Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/25313",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/25313#event-71788"
}
```



---

archive/issue_comments_462576.json:
```json
{
    "body": "**Changing branch** from \"[u/mmezzarobba/mpoly_div_ZZ](https://github.com/sagemath/sagetrac-mirror/tree/u/mmezzarobba/mpoly_div_ZZ)\" to \"[ffb4507e5c667825d0c1375262eea648c818f0d6](https://github.com/sagemath/sagetrac-mirror/commit/ffb4507e5c667825d0c1375262eea648c818f0d6)\".",
    "created_at": "2018-05-15T22:33:26Z",
    "issue": "https://github.com/sagemath/sagetest/issues/25313",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/25313#issuecomment-462576",
    "user": "https://github.com/vbraun"
}
```

**Changing branch** from "[u/mmezzarobba/mpoly_div_ZZ](https://github.com/sagemath/sagetrac-mirror/tree/u/mmezzarobba/mpoly_div_ZZ)" to "[ffb4507e5c667825d0c1375262eea648c818f0d6](https://github.com/sagemath/sagetrac-mirror/commit/ffb4507e5c667825d0c1375262eea648c818f0d6)".
