# Issue 25340: Symbolic functions behave badly on intervals

archive/issues_025103.json:
```json
{
    "body": "CC:  @NathanDunfield marc.culler@gmail.com\n\nI found several problems with complex interval arithmetic:\n\n1. It seems that it takes the dilog of the midpoint and then converts it back to intervals:\n\n```\nsage: dilog(CIF(RIF(4,4.1),RIF(4,4.1)))\n-0.51510330456949305? + 4.2437340770848096?*I\n```\n\n2. It doesn't return intervals:\n\n```\nsage: arccosh(CIF(RIF(4,4.1),RIF(4,4.1)))\n2.43852473711003 + 0.793017478264382*I\n\n```\n\n3. Hangs:\n\n```\nsage: 1 / CIF(RIF(-1,1),RIF(0))\n\n```\n\n1 should either return the right result or fail. 2 doesn't seem to bad until one does the following which seems like valid code and returns an interval, so the user thinks everything is ok:\n\n```\nsage: arccosh(CIF(RIF(4,4.1),RIF(4,4.1))).real() + RIF(3.4)\n5.8385247371100296?\n```\n\n\n*A note in general:* I do like the availability of interval arithmetic in sage a lot, but I think that sage should be conservative and never ever implicitly convert or coerce an interval to a floating point number. The only way to get a floating point number from an interval is by explicitly calling **.lower()**, **.upper()**, **.center()** (and related such as **endpoints()**)! In particular, operations such as adding an interval to a floating point number shouldn't be allowed - and adding to something exact like an integer or rational should return a valid interval.\n\nIssue created by migration from https://trac.sagemath.org/ticket/25340\n\n",
    "created_at": "2018-05-11T06:07:02Z",
    "labels": [
        "component: symbolics",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-8.4",
    "title": "Symbolic functions behave badly on intervals",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/25340",
    "user": "https://github.com/unhyperbolic"
}
```
CC:  @NathanDunfield marc.culler@gmail.com

I found several problems with complex interval arithmetic:

1. It seems that it takes the dilog of the midpoint and then converts it back to intervals:

```
sage: dilog(CIF(RIF(4,4.1),RIF(4,4.1)))
-0.51510330456949305? + 4.2437340770848096?*I
```

2. It doesn't return intervals:

```
sage: arccosh(CIF(RIF(4,4.1),RIF(4,4.1)))
2.43852473711003 + 0.793017478264382*I

```

3. Hangs:

```
sage: 1 / CIF(RIF(-1,1),RIF(0))

```

1 should either return the right result or fail. 2 doesn't seem to bad until one does the following which seems like valid code and returns an interval, so the user thinks everything is ok:

```
sage: arccosh(CIF(RIF(4,4.1),RIF(4,4.1))).real() + RIF(3.4)
5.8385247371100296?
```


*A note in general:* I do like the availability of interval arithmetic in sage a lot, but I think that sage should be conservative and never ever implicitly convert or coerce an interval to a floating point number. The only way to get a floating point number from an interval is by explicitly calling **.lower()**, **.upper()**, **.center()** (and related such as **endpoints()**)! In particular, operations such as adding an interval to a floating point number shouldn't be allowed - and adding to something exact like an integer or rational should return a valid interval.

Issue created by migration from https://trac.sagemath.org/ticket/25340





---

archive/issue_comments_352818.json:
```json
{
    "body": "The first one is also a problem with real intervals:\n\n```\nsage: dilog(RIF(4,4.1))\n2.0475591955473647? - 4.3941986780846492?*I\nsage: dilog(4.05)\n2.04755919558654 - 4.39419867817374*I\n```\n\nThe other two things work OK for real intervals:\n\n```\nsage: arccosh(RIF(4,4.1))\n2.1?\nsage: 1/RIF(-1, 1)\n[-infinity .. +infinity]\n```",
    "created_at": "2018-05-11T16:51:10Z",
    "issue": "https://github.com/sagemath/sagetest/issues/25340",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/25340#issuecomment-352818",
    "user": "https://github.com/NathanDunfield"
}
```

The first one is also a problem with real intervals:

```
sage: dilog(RIF(4,4.1))
2.0475591955473647? - 4.3941986780846492?*I
sage: dilog(4.05)
2.04755919558654 - 4.39419867817374*I
```

The other two things work OK for real intervals:

```
sage: arccosh(RIF(4,4.1))
2.1?
sage: 1/RIF(-1, 1)
[-infinity .. +infinity]
```



---

archive/issue_comments_352819.json:
```json
{
    "body": "Changing component from basic arithmetic to symbolics.",
    "created_at": "2018-05-11T21:11:04Z",
    "issue": "https://github.com/sagemath/sagetest/issues/25340",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/25340#issuecomment-352819",
    "user": "https://github.com/jdemeyer"
}
```

Changing component from basic arithmetic to symbolics.



---

archive/issue_comments_352820.json:
```json
{
    "body": "I have a fix for issue 3 (where the division hangs) and opened a separate ticket #25414 for it.",
    "created_at": "2018-05-21T04:49:59Z",
    "issue": "https://github.com/sagemath/sagetest/issues/25340",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/25340#issuecomment-352820",
    "user": "https://github.com/unhyperbolic"
}
```

I have a fix for issue 3 (where the division hangs) and opened a separate ticket #25414 for it.



---

archive/issue_comments_352821.json:
```json
{
    "body": "And some more:\n\n```\nsage: atan2(RIF(-1,1),RIF(-1))\n3.141592653589794?\n```\n\nI also find this behavior\n\n```\nsage: atan2(RIF(1),RIF(1))\n1/4*pi\n```\ntroublesome because now the type of the result is dependent on the input values.",
    "created_at": "2018-05-22T04:55:59Z",
    "issue": "https://github.com/sagemath/sagetest/issues/25340",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/25340#issuecomment-352821",
    "user": "https://github.com/unhyperbolic"
}
```

And some more:

```
sage: atan2(RIF(-1,1),RIF(-1))
3.141592653589794?
```

I also find this behavior

```
sage: atan2(RIF(1),RIF(1))
1/4*pi
```
troublesome because now the type of the result is dependent on the input values.



---

archive/issue_events_063534.json:
```json
{
    "actor": "https://github.com/videlec",
    "created_at": "2018-08-03T19:20:18Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/25340",
    "milestone": "sage-8.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/25340#event-63534"
}
```



---

archive/issue_comments_352822.json:
```json
{
    "body": "update milestone 8.3 -> 8.4",
    "created_at": "2018-08-03T19:20:18Z",
    "issue": "https://github.com/sagemath/sagetest/issues/25340",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/25340#issuecomment-352822",
    "user": "https://github.com/videlec"
}
```

update milestone 8.3 -> 8.4
