# Issue 25520: Wrong 0th symbolic power of a matrix

archive/issues_025283.json:
```json
{
    "body": "From [this ask question](https://ask.sagemath.org/question/42532/more-problems-with-general-power-of-a-matrix/), the symbolic power of a matrix gives a result that is correct when restricted to positive integers, but wrong on 0:\n\n```\nsage: A = matrix(QQbar,3,3,[[-2,-8,-12],[1,4,4],[0,0,1]])\nsage: k = SR.var('k')\nsage: B = A^k\nsage: B\n[      -2^k     -4*2^k -4*2^k - 4]\n[   1/2*2^k      2*2^k      2*2^k]\n[         0          0          1]\nsage: [B.subs(k=i) == A^i for i in range(20)]\n[False,\n True,\n True,\n True,\n True,\n True,\n True,\n True,\n True,\n True,\n True,\n True,\n True,\n True,\n True,\n True,\n True,\n True,\n True,\n True]\nsage: B.subs(k=0)\n[ -1  -4  -8]\n[1/2   2   2]\n[  0   0   1]\n```\n\n\n**CC:**  @mforets @slel\n\n**Status:** new\n\nIssue created by migration from https://trac.sagemath.org/ticket/25520\n\n",
    "created_at": "2018-06-06T18:39:31Z",
    "labels": [
        "component: symbolics",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-8.3",
    "title": "Wrong 0th symbolic power of a matrix",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/25520",
    "user": "https://trac.sagemath.org/admin/accounts/users/tmonteil"
}
```
From [this ask question](https://ask.sagemath.org/question/42532/more-problems-with-general-power-of-a-matrix/), the symbolic power of a matrix gives a result that is correct when restricted to positive integers, but wrong on 0:

```
sage: A = matrix(QQbar,3,3,[[-2,-8,-12],[1,4,4],[0,0,1]])
sage: k = SR.var('k')
sage: B = A^k
sage: B
[      -2^k     -4*2^k -4*2^k - 4]
[   1/2*2^k      2*2^k      2*2^k]
[         0          0          1]
sage: [B.subs(k=i) == A^i for i in range(20)]
[False,
 True,
 True,
 True,
 True,
 True,
 True,
 True,
 True,
 True,
 True,
 True,
 True,
 True,
 True,
 True,
 True,
 True,
 True,
 True]
sage: B.subs(k=0)
[ -1  -4  -8]
[1/2   2   2]
[  0   0   1]
```


**CC:**  @mforets @slel

**Status:** new

Issue created by migration from https://trac.sagemath.org/ticket/25520





---

archive/issue_comments_467609.json:
```json
{
    "body": "<a id='comment:1'></a>\nThis is not really something we can do anything about, I expect. It's just a consequence of\n\n```\nsage: (0^x).simplify()\n0\n```\nwhich is wrong for `x=0`.",
    "created_at": "2018-06-06T20:50:00Z",
    "issue": "https://github.com/sagemath/sagetest/issues/25520",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/25520#issuecomment-467609",
    "user": "https://github.com/nbruin"
}
```

<a id='comment:1'></a>
This is not really something we can do anything about, I expect. It's just a consequence of

```
sage: (0^x).simplify()
0
```
which is wrong for `x=0`.
