# Issue 25622: SymmetricGroup should accept libgap permutations

archive/issues_025385.json:
```json
{
    "body": "works with gap\n\n```\nsage: SymmetricGroup(3)(gap(\"(1,3)\"))\n(1,3)\n```\nfails with libgap\n\n```\nsage: SymmetricGroup(3)(libgap.eval(\"(1,3)\"))\nTraceback (most recent call last):\n...\nTypeError: 'sage.libs.gap.element.GapElement_Permutation' object is not iterable\n```\nThough we have\n\n```\nsage: libgap.eval(\"(1,3)\").sage()\n(1,3)\nsage: parent(_)\nSymmetric group of order 3! as a permutation group\n```\n\nResolution: worksforme\n\nIssue created by migration from https://trac.sagemath.org/ticket/25622\n\n",
    "closed_at": "2021-02-16T13:29:40Z",
    "created_at": "2018-06-20T17:22:28Z",
    "labels": [
        "component: interfaces"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-duplicate/invalid/wontfix",
    "title": "SymmetricGroup should accept libgap permutations",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/25622",
    "user": "https://github.com/videlec"
}
```
works with gap

```
sage: SymmetricGroup(3)(gap("(1,3)"))
(1,3)
```
fails with libgap

```
sage: SymmetricGroup(3)(libgap.eval("(1,3)"))
Traceback (most recent call last):
...
TypeError: 'sage.libs.gap.element.GapElement_Permutation' object is not iterable
```
Though we have

```
sage: libgap.eval("(1,3)").sage()
(1,3)
sage: parent(_)
Symmetric group of order 3! as a permutation group
```

Resolution: worksforme

Issue created by migration from https://trac.sagemath.org/ticket/25622





---

archive/issue_comments_484856.json:
```json
{
    "body": "Changing status from new to needs_review.",
    "created_at": "2021-02-16T13:25:52Z",
    "issue": "https://github.com/sagemath/sagetest/issues/25622",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/25622#issuecomment-484856",
    "user": "https://github.com/embray"
}
```

Changing status from new to needs_review.



---

archive/issue_events_080789.json:
```json
{
    "actor": "https://github.com/embray",
    "created_at": "2021-02-16T13:25:52Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/25622",
    "milestone": "sage-duplicate/invalid/wontfix",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/25622#event-80789"
}
```



---

archive/issue_comments_484857.json:
```json
{
    "body": "<a id='comment:1'></a>\nThis is fixed by #31404, though this ticket should remain open until/unless that one is merged:\n\n```\nsage: SymmetricGroup(3)(libgap.eval(\"(1,3)\"))                                                                                                                                                    \n(1,3)\nsage: parent(_)                                                                                                                                                                                  \nSymmetric group of order 3! as a permutation group\n```",
    "created_at": "2021-02-16T13:25:52Z",
    "issue": "https://github.com/sagemath/sagetest/issues/25622",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/25622#issuecomment-484857",
    "user": "https://github.com/embray"
}
```

<a id='comment:1'></a>
This is fixed by #31404, though this ticket should remain open until/unless that one is merged:

```
sage: SymmetricGroup(3)(libgap.eval("(1,3)"))                                                                                                                                                    
(1,3)
sage: parent(_)                                                                                                                                                                                  
Symmetric group of order 3! as a permutation group
```



---

archive/issue_events_080790.json:
```json
{
    "actor": "https://github.com/embray",
    "created_at": "2021-02-16T13:29:40Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/25622",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/25622#event-80790"
}
```



---

archive/issue_comments_484858.json:
```json
{
    "body": "<a id='comment:2'></a>\nActually this example is currently fixed in Sage, at least as far back as 9.1--I didn't check further.  It was probably fixed by #18267.",
    "created_at": "2021-02-16T13:29:40Z",
    "issue": "https://github.com/sagemath/sagetest/issues/25622",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/25622#issuecomment-484858",
    "user": "https://github.com/embray"
}
```

<a id='comment:2'></a>
Actually this example is currently fixed in Sage, at least as far back as 9.1--I didn't check further.  It was probably fixed by #18267.



---

archive/issue_comments_484859.json:
```json
{
    "body": "Resolution: worksforme",
    "created_at": "2021-02-16T13:29:40Z",
    "issue": "https://github.com/sagemath/sagetest/issues/25622",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/25622#issuecomment-484859",
    "user": "https://github.com/embray"
}
```

Resolution: worksforme
