# Issue 25713: Implement symbolic q-analogues

archive/issues_025476.json:
```json
{
    "body": "Currently the module sage.combinat.q_analogues does not support symbolic q-analogs.\n\nWe would like things like this to work:\n\n```sage\nsage: from sage.combinat.q_analogues import q_int, q_factorial\nsage: var(\"n\")\nn\nsage: q_int(n)\nq_int(n)\nsage: latex(q_int(n))\n[n]_{q}!\nsage: q_int(3, q=x, hold=True)\nq_int(3, x)\nsage: _(x=4)\n21\n```\n\nThis ticket might serve as a meta-ticket also for more advanced options, of which simplification is the most important:\n\n```sage\nsage: var(\"k\")\nsage: product(q_int(k), k, 1, n)\nq_factorial(n)\nsage: R.<q> = ZZ[]\nsage: simplify(q^k*q_binomial(n-1, k, q) + q_binomial(n-1, k-1, q))\nq_binomial(n, k, q)\n```\n\n**CC:**  @pelegm @rwst @tscrim\n\n**Keywords:** days94, q-analogs, symbolics\n\nIssue created by migration from https://trac.sagemath.org/ticket/25713\n\n",
    "created_at": "2018-06-30T08:49:55Z",
    "labels": [
        "component: symbolics",
        "enhancement",
        "feature"
    ],
    "title": "Implement symbolic q-analogues",
    "type": "issue",
    "url": "https://github.com/sagemath/sage/issues/25713",
    "user": "https://github.com/mathzeta"
}
```
Currently the module sage.combinat.q_analogues does not support symbolic q-analogs.

We would like things like this to work:

```sage
sage: from sage.combinat.q_analogues import q_int, q_factorial
sage: var("n")
n
sage: q_int(n)
q_int(n)
sage: latex(q_int(n))
[n]_{q}!
sage: q_int(3, q=x, hold=True)
q_int(3, x)
sage: _(x=4)
21
```

This ticket might serve as a meta-ticket also for more advanced options, of which simplification is the most important:

```sage
sage: var("k")
sage: product(q_int(k), k, 1, n)
q_factorial(n)
sage: R.<q> = ZZ[]
sage: simplify(q^k*q_binomial(n-1, k, q) + q_binomial(n-1, k-1, q))
q_binomial(n, k, q)
```

**CC:**  @pelegm @rwst @tscrim

**Keywords:** days94, q-analogs, symbolics

Issue created by migration from https://trac.sagemath.org/ticket/25713





---

archive/issue_comments_397746.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -2,7 +2,7 @@\n \n Things like the following should work:\n \n-```\n+```sage\n sage: from sage.combinat.q_analogues import q_int, q_factorial\n sage: var(\"n\")\n n\n@@ -18,7 +18,7 @@\n \n This ticket might serve as a meta-ticket also for more advanced options, of which simplification is the most important:\n \n-```\n+```sage\n sage: var(\"k\")\n sage: product(q_int(k), k, 1, n)\n q_factorial(n)\n``````\n",
    "created_at": "2018-06-30T09:01:53Z",
    "issue": "https://github.com/sagemath/sage/issues/25713",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/25713#issuecomment-397746",
    "user": "https://github.com/pelegm"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -2,7 +2,7 @@
 
 Things like the following should work:
 
-```
+```sage
 sage: from sage.combinat.q_analogues import q_int, q_factorial
 sage: var("n")
 n
@@ -18,7 +18,7 @@
 
 This ticket might serve as a meta-ticket also for more advanced options, of which simplification is the most important:
 
-```
+```sage
 sage: var("k")
 sage: product(q_int(k), k, 1, n)
 q_factorial(n)
``````




---

archive/issue_comments_397747.json:
```json
{
    "body": "<a id='comment:3'></a>\nWe have to figure out how to \"register\" a new ginac function, otherwise this happens:\n\n```\nTraceback (most recent call last):\n...\n  File \"sage/symbolic/function.pyx\", line 114, in sage.symbolic.function.Function.__init__ (build/cythonized/sage/symbolic/function.cpp:4278)\n    if not self._is_registered():\n...\nValueError: cannot find GiNaC function with name q_int and 1 arguments\n```",
    "created_at": "2018-06-30T09:33:17Z",
    "issue": "https://github.com/sagemath/sage/issues/25713",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/25713#issuecomment-397747",
    "user": "https://github.com/pelegm"
}
```

<a id='comment:3'></a>
We have to figure out how to "register" a new ginac function, otherwise this happens:

```
Traceback (most recent call last):
...
  File "sage/symbolic/function.pyx", line 114, in sage.symbolic.function.Function.__init__ (build/cythonized/sage/symbolic/function.cpp:4278)
    if not self._is_registered():
...
ValueError: cannot find GiNaC function with name q_int and 1 arguments
```



---

archive/issue_comments_397748.json:
```json
{
    "body": "<a id='comment:4'></a>\nFirst attempt:\n\n```sage\nfrom sage.symbolic.function import BuiltinFunction\nfrom sage.rings.all import ZZ\n\n\nclass Function_q_int(BuiltinFunction):\n    def __init__(self):\n        BuiltinFunction.__init__(self, \"q_int\", nargs=2, conversions=dict())\n\n    def _eval_(self, n, q):\n        if n not in ZZ:\n            return\n        # if q is None:\n            # q = ZZ['q'].gen()\n        if n == 0:  # Special case\n            return q.parent().zero()\n        if n >= 0:\n            return sum(q**i for i in range(n))\n        return -q**n*sum(q**i for i in range(-n))\n\n    def _print_latex_(self, x):\n        pass\n\n\nq_int2 = Function_q_int()\n\n\ndef q_int(n, q=None):\n    if q is None:\n        q = ZZ['q'].gen()\n    return q_int2(n, q)\n```\n\nThe problem is that `BuiltinFunction` coerces q into an expression, and the result is an `Expression` (and not `Polynomial_integer_dense_flint`).  This is apparently much slower.  Passing `coerce=False` results an exception from here:\n\n```sage\n        else: # coerce == False\n            for a in args:\n                if not isinstance(a, Expression):\n                    raise TypeError(\"arguments must be symbolic expressions\")\n```\n\nOther than that, this implementation seems to be correct.",
    "created_at": "2018-06-30T11:06:59Z",
    "issue": "https://github.com/sagemath/sage/issues/25713",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/25713#issuecomment-397748",
    "user": "https://github.com/pelegm"
}
```

<a id='comment:4'></a>
First attempt:

```sage
from sage.symbolic.function import BuiltinFunction
from sage.rings.all import ZZ


class Function_q_int(BuiltinFunction):
    def __init__(self):
        BuiltinFunction.__init__(self, "q_int", nargs=2, conversions=dict())

    def _eval_(self, n, q):
        if n not in ZZ:
            return
        # if q is None:
            # q = ZZ['q'].gen()
        if n == 0:  # Special case
            return q.parent().zero()
        if n >= 0:
            return sum(q**i for i in range(n))
        return -q**n*sum(q**i for i in range(-n))

    def _print_latex_(self, x):
        pass


q_int2 = Function_q_int()


def q_int(n, q=None):
    if q is None:
        q = ZZ['q'].gen()
    return q_int2(n, q)
```

The problem is that `BuiltinFunction` coerces q into an expression, and the result is an `Expression` (and not `Polynomial_integer_dense_flint`).  This is apparently much slower.  Passing `coerce=False` results an exception from here:

```sage
        else: # coerce == False
            for a in args:
                if not isinstance(a, Expression):
                    raise TypeError("arguments must be symbolic expressions")
```

Other than that, this implementation seems to be correct.



---

archive/issue_comments_397749.json:
```json
{
    "body": "<a id='comment:5'></a>\nIt's not clear to me: will you need held `q_int...` expressions together with expanded series in a single expression? If so, then output to Flint polys is not useful because polys and expressions cannot be mixed. If you decide to go fully with expressions:\n\nIf you need a fast way to get an expression of sum type with identical (or other) coefficients, Pynac can do that. But better first implement it in Python to have a proof of concept. I think you need to decide if the expanded polynomial should be an expression or a poly before you can design everything else.\n\nTry this, here Pynac uses Flint internally, and it has an order term:\n\n```\nsage: var('q')\nq\nsage: (1/(1-q)).series(q,10)\n1 + 1*q + 1*q^2 + 1*q^3 + 1*q^4 + 1*q^5 + 1*q^6 + 1*q^7 + 1*q^8 + 1*q^9 + Order(q^10)\n```\nSeries manipulation of symbolic series like above is also done using Flint.",
    "created_at": "2018-06-30T13:24:30Z",
    "issue": "https://github.com/sagemath/sage/issues/25713",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/25713#issuecomment-397749",
    "user": "https://github.com/rwst"
}
```

<a id='comment:5'></a>
It's not clear to me: will you need held `q_int...` expressions together with expanded series in a single expression? If so, then output to Flint polys is not useful because polys and expressions cannot be mixed. If you decide to go fully with expressions:

If you need a fast way to get an expression of sum type with identical (or other) coefficients, Pynac can do that. But better first implement it in Python to have a proof of concept. I think you need to decide if the expanded polynomial should be an expression or a poly before you can design everything else.

Try this, here Pynac uses Flint internally, and it has an order term:

```
sage: var('q')
q
sage: (1/(1-q)).series(q,10)
1 + 1*q + 1*q^2 + 1*q^3 + 1*q^4 + 1*q^5 + 1*q^6 + 1*q^7 + 1*q^8 + 1*q^9 + Order(q^10)
```
Series manipulation of symbolic series like above is also done using Flint.



---

archive/issue_comments_397750.json:
```json
{
    "body": "<a id='comment:6'></a>\nI softened the ticket description to make not seem like a bug (which is not).",
    "created_at": "2018-07-03T08:09:17Z",
    "issue": "https://github.com/sagemath/sage/issues/25713",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/25713#issuecomment-397750",
    "user": "https://github.com/tscrim"
}
```

<a id='comment:6'></a>
I softened the ticket description to make not seem like a bug (which is not).



---

archive/issue_comments_397751.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -1,6 +1,6 @@\n Currently the module sage.combinat.q_analogues does not support symbolic q-analogs.\n \n-Things like the following should work:\n+We would like things like this to work:\n \n ```sage\n sage: from sage.combinat.q_analogues import q_int, q_factorial\n``````\n",
    "created_at": "2018-07-03T08:09:17Z",
    "issue": "https://github.com/sagemath/sage/issues/25713",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/25713#issuecomment-397751",
    "user": "https://github.com/tscrim"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -1,6 +1,6 @@
 Currently the module sage.combinat.q_analogues does not support symbolic q-analogs.
 
-Things like the following should work:
+We would like things like this to work:
 
 ```sage
 sage: from sage.combinat.q_analogues import q_int, q_factorial
``````

