# Issue 25944: Evaluating polynomial().list() on zero element is inconsistent among different precision types

archive/issues_025707.json:
```json
{
    "body": "I would expect the result of the following six commands to be the same.\n\n```\nsage: ZqFM(4,names='a')(0).polynomial().list()\n[]\nsage: ZqCA(4,names='a')(0).polynomial().list()\n[]\nsage: ZqFP(4,names='a')(0).polynomial().list()\n[]\nsage: QqFP(4,names='a')(0).polynomial().list()\n[]\nsage: ZqCR(4,names='a')(0).polynomial().list()\n[0]\nsage: QqCR(4,names='a')(0).polynomial().list()\n[0]\n```\nHowever, they are not. The ones where the precision model is capped-relative gives [0] instead of the expected [].\n\n**CC:**  @roed314 @xcaruso\n\n**Keywords:** padicIMA, padicBordeaux\n\nIssue created by migration from https://trac.sagemath.org/ticket/25944\n\n",
    "created_at": "2018-07-27T04:27:39Z",
    "labels": [
        "component: padics",
        "minor",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-8.4",
    "title": "Evaluating polynomial().list() on zero element is inconsistent among different precision types",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/25944",
    "user": "https://trac.sagemath.org/admin/accounts/users/varul"
}
```
I would expect the result of the following six commands to be the same.

```
sage: ZqFM(4,names='a')(0).polynomial().list()
[]
sage: ZqCA(4,names='a')(0).polynomial().list()
[]
sage: ZqFP(4,names='a')(0).polynomial().list()
[]
sage: QqFP(4,names='a')(0).polynomial().list()
[]
sage: ZqCR(4,names='a')(0).polynomial().list()
[0]
sage: QqCR(4,names='a')(0).polynomial().list()
[0]
```
However, they are not. The ones where the precision model is capped-relative gives [0] instead of the expected [].

**CC:**  @roed314 @xcaruso

**Keywords:** padicIMA, padicBordeaux

Issue created by migration from https://trac.sagemath.org/ticket/25944





---

archive/issue_events_234373.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/varul",
    "created_at": "2018-07-27T04:27:55Z",
    "event": "renamed",
    "issue": "https://github.com/sagemath/sagetest/issues/25944",
    "rename": {
        "from": "Evaluating polynomial().list() on 0 element is inconsistent among different precision types",
        "to": "Evaluating polynomial().list() on zero element is inconsistent among different precision types"
    },
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/25944#event-234373"
}
```



---

archive/issue_comments_403641.json:
```json
{
    "body": "**Changing keywords** from \"padicIMA\" to \"padicIMA, padicBordeaux\".",
    "created_at": "2019-09-07T12:09:10Z",
    "issue": "https://github.com/sagemath/sagetest/issues/25944",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/25944#issuecomment-403641",
    "user": "https://github.com/roed314"
}
```

**Changing keywords** from "padicIMA" to "padicIMA, padicBordeaux".
