# Issue 26173: Conversion of non-commutative rings from Singular to Sage

archive/issues_025936.json:
```json
{
    "body": "I noticed that a non-commutative ring defined in the Singular pexpect interface is not correctly converted to a non-commutative polynomial ring in Sage:\n\n```\nsage: singular.LIB(\"nctools.lib\")\nsage: R = singular.ring(0,'(a,b,c,d)','dp')\nsage: singular('basering')\npolynomial ring, over a field, global ordering\n// coefficients: QQ\n// number of vars : 4\n//        block   1 : ordering dp\n//                  : names    a b c d\n//        block   2 : ordering C\nsage: NC = singular.superCommutative(2)\nsage: NC.set_ring()\nsage: singular('basering')\npolynomial ring, over a field, global ordering\n// coefficients: QQ\n// number of vars : 4\n//        block   1 : ordering dp\n//                  : names    a b c d\n//        block   2 : ordering C\n// noncommutative relations:\n//    cb=-b*c\n//    db=-b*d\n//    dc=-c*d\n// quotient ring from ideal\n_[1]=d^2\n_[2]=c^2\n_[3]=b^2\nsage: NC.sage()\nQuotient of Multivariate Polynomial Ring in a, b, c, d over Rational Field by the ideal (d^2, c^2, b^2)\nsage: _.is_commutative()\nTrue\n```\nThat ought to be fixed!\n\n**Status:** new\n\nIssue created by migration from https://trac.sagemath.org/ticket/26173\n\n",
    "created_at": "2018-09-01T17:44:27Z",
    "labels": [
        "component: interfaces",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-8.4",
    "title": "Conversion of non-commutative rings from Singular to Sage",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/26173",
    "user": "https://github.com/simon-king-jena"
}
```
I noticed that a non-commutative ring defined in the Singular pexpect interface is not correctly converted to a non-commutative polynomial ring in Sage:

```
sage: singular.LIB("nctools.lib")
sage: R = singular.ring(0,'(a,b,c,d)','dp')
sage: singular('basering')
polynomial ring, over a field, global ordering
// coefficients: QQ
// number of vars : 4
//        block   1 : ordering dp
//                  : names    a b c d
//        block   2 : ordering C
sage: NC = singular.superCommutative(2)
sage: NC.set_ring()
sage: singular('basering')
polynomial ring, over a field, global ordering
// coefficients: QQ
// number of vars : 4
//        block   1 : ordering dp
//                  : names    a b c d
//        block   2 : ordering C
// noncommutative relations:
//    cb=-b*c
//    db=-b*d
//    dc=-c*d
// quotient ring from ideal
_[1]=d^2
_[2]=c^2
_[3]=b^2
sage: NC.sage()
Quotient of Multivariate Polynomial Ring in a, b, c, d over Rational Field by the ideal (d^2, c^2, b^2)
sage: _.is_commutative()
True
```
That ought to be fixed!

**Status:** new

Issue created by migration from https://trac.sagemath.org/ticket/26173


