# Issue 26407: Support slicing and tuples in expansion() of p-adic elements

archive/issues_026170.json:
```json
{
    "assignees": [],
    "body": "As discussed in #13300, we would like to have (probably this already works)\n\n```\nsage: K.<a> = Qq(7^2, 20)\nsage: z = K.random_element()\nsage: z == sum([z.expansion()[i] * 7^i for i in range(20)])\nTrue\n```\n\nOf course, sometimes you want to get at the coefficient of a in z, or the coefficient of a in z.expansion()[0]. Here's an idea. For matrices, we have the following::\n\n```\nsage: M = matrix(ZZ,4,4,range(16))\nsage: M[0]\n(0, 1, 2, 3)\nsage: M[0,0]\n0\nsage: M[0,:]\n[0 1 2 3]\nsage: M[:,0]\n[ 0]\n[ 4]\n[ 8]\n[12]\nsage: M[1:3,1:4]\n[ 5  6  7]\n[ 9 10 11]\n```\n\nWhat if we used a similar tuple indexing scheme for p-adic elements? For example:\n\n```\nsage: K.<a> = Qq(5^4, 5)\nsage: z = K.random_element(); z\na^3*5^-2 + (3*a^3 + 3*a^2)*5^-1 + (3*a^3 + a^2 + 3*a) + 4*a^3*5 + (4*a + 2)*5^2 + O(5^3)\nsage: z.expansion()[0]\n3*a^3 + a^2 + 3*a + O(5^3)\nsage: z.expansion()[2]\n4*a + 2 + O(5)\nsage: z.expansion()[2].parent()\nUnramified Extension of 5-adic Field with capped relative precision 5 in a defined by (1 + O(5^5))*x^4 + (O(5^5))*x^3 + (4 + O(5^5))*x^2 + (4 + O(5^5))*x + (2 + O(5^5))\nsage: z.expansion()[0,0]\nO(5^3)\nsage: z.expansion()[0,0].parent()\n5-adic Field with capped relative precision 5\nsage: z.expansion()[2,0]\n2 + O(5)\nsage: z.expansion()[2,1]\n4 + O(5)\nsage: z.expansion()[:-1]\na^3*5^-2 + O(5^-1)\nsage: z.expansion()[:1]\na^3*5^-2 + (3*a^3 + 3*a^2)*5^-1 + (3*a^3 + a^2 + 3*a) + O(5)\nsage: z.expansion()[:] == z.expansion()[:,:] == z\nTrue\nsage: all([z.expansion()[i,:] == z.expansion()[i] for i in range(-3,2)])\nTrue\nsage: z.expansion()[:,0]\n2*5^2 + O(5^3)\nsage: z.expansion()[:,0].parent()\n5-adic Field with capped relative precision 5\nsage: z.expansion()[:,1]\n3 + 4*5^2 + O(5^3)\nsage: z.expansion()[:,2]\n3*5^-1 + 1 + O(5^3)\nsage: z.expansion()[:,3]\n5^-2 + 3*5^-1 + 3 + 4*5 + O(5^3)\nsage: sum([a^j * z.expansion()[:,j] for j in range(4)]) == z\nTrue\nsage: z.expansion()[-1:2,1:3]\n3*a^2*5^-1 + (a^2 + 3*a) + O(5^2)\n```\n\nThe parent of z.expansion()[i], z.expansion()[i,T] and z.expansion()[S,T] (for integer i and slices S,T) would be the unramified extension; the parent of z.expansion()[i,j] and z.expansion()[S,j] would be the ground field (or ring). Negative indices would never be considered as counting backward from a length, even for ring elements.\n\nKeywords: **padicBordeaux**\n\nComponent: **padics**\n\n_Issue created by migration from https://trac.sagemath.org/ticket/26407_\n\n",
    "created_at": "2018-10-04T23:21:38Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/c%3A%20padics",
        "https://github.com/sagemath/sage/labels/p%3A%203%20%E2%80%93%20major",
        "https://github.com/sagemath/sage/labels/enhancement"
    ],
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "Support slicing and tuples in expansion() of p-adic elements",
    "type": "issue",
    "updated_at": "2022-12-29T01:42:26Z",
    "url": "https://github.com/sagemath/sage/issues/26407",
    "user": "https://github.com/saraedum"
}
```
As discussed in #13300, we would like to have (probably this already works)

```
sage: K.<a> = Qq(7^2, 20)
sage: z = K.random_element()
sage: z == sum([z.expansion()[i] * 7^i for i in range(20)])
True
```

Of course, sometimes you want to get at the coefficient of a in z, or the coefficient of a in z.expansion()[0]. Here's an idea. For matrices, we have the following::

```
sage: M = matrix(ZZ,4,4,range(16))
sage: M[0]
(0, 1, 2, 3)
sage: M[0,0]
0
sage: M[0,:]
[0 1 2 3]
sage: M[:,0]
[ 0]
[ 4]
[ 8]
[12]
sage: M[1:3,1:4]
[ 5  6  7]
[ 9 10 11]
```

What if we used a similar tuple indexing scheme for p-adic elements? For example:

```
sage: K.<a> = Qq(5^4, 5)
sage: z = K.random_element(); z
a^3*5^-2 + (3*a^3 + 3*a^2)*5^-1 + (3*a^3 + a^2 + 3*a) + 4*a^3*5 + (4*a + 2)*5^2 + O(5^3)
sage: z.expansion()[0]
3*a^3 + a^2 + 3*a + O(5^3)
sage: z.expansion()[2]
4*a + 2 + O(5)
sage: z.expansion()[2].parent()
Unramified Extension of 5-adic Field with capped relative precision 5 in a defined by (1 + O(5^5))*x^4 + (O(5^5))*x^3 + (4 + O(5^5))*x^2 + (4 + O(5^5))*x + (2 + O(5^5))
sage: z.expansion()[0,0]
O(5^3)
sage: z.expansion()[0,0].parent()
5-adic Field with capped relative precision 5
sage: z.expansion()[2,0]
2 + O(5)
sage: z.expansion()[2,1]
4 + O(5)
sage: z.expansion()[:-1]
a^3*5^-2 + O(5^-1)
sage: z.expansion()[:1]
a^3*5^-2 + (3*a^3 + 3*a^2)*5^-1 + (3*a^3 + a^2 + 3*a) + O(5)
sage: z.expansion()[:] == z.expansion()[:,:] == z
True
sage: all([z.expansion()[i,:] == z.expansion()[i] for i in range(-3,2)])
True
sage: z.expansion()[:,0]
2*5^2 + O(5^3)
sage: z.expansion()[:,0].parent()
5-adic Field with capped relative precision 5
sage: z.expansion()[:,1]
3 + 4*5^2 + O(5^3)
sage: z.expansion()[:,2]
3*5^-1 + 1 + O(5^3)
sage: z.expansion()[:,3]
5^-2 + 3*5^-1 + 3 + 4*5 + O(5^3)
sage: sum([a^j * z.expansion()[:,j] for j in range(4)]) == z
True
sage: z.expansion()[-1:2,1:3]
3*a^2*5^-1 + (a^2 + 3*a) + O(5^2)
```

The parent of z.expansion()[i], z.expansion()[i,T] and z.expansion()[S,T] (for integer i and slices S,T) would be the unramified extension; the parent of z.expansion()[i,j] and z.expansion()[S,j] would be the ground field (or ring). Negative indices would never be considered as counting backward from a length, even for ring elements.

Keywords: **padicBordeaux**

Component: **padics**

_Issue created by migration from https://trac.sagemath.org/ticket/26407_





---

archive/issue_events_365496.json:
```json
{
    "actor": "https://github.com/saraedum",
    "created_at": "2018-10-04T23:21:38Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/26407",
    "milestone_number": null,
    "milestone_title": "sage-8.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/26407#event-365496"
}
```



---

archive/issue_events_365497.json:
```json
{
    "actor": "https://github.com/saraedum",
    "created_at": "2018-10-04T23:21:38Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/26407",
    "label": "https://github.com/sagemath/sage/labels/c%3A%20padics",
    "label_color": "eeeeee",
    "label_name": "c: padics",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/26407#event-365497"
}
```



---

archive/issue_events_365498.json:
```json
{
    "actor": "https://github.com/saraedum",
    "created_at": "2018-10-04T23:21:38Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/26407",
    "label": "https://github.com/sagemath/sage/labels/p%3A%203%20%E2%80%93%20major",
    "label_color": "ffbb00",
    "label_name": "p: 3 \u2013 major",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/26407#event-365498"
}
```



---

archive/issue_events_365499.json:
```json
{
    "actor": "https://github.com/saraedum",
    "created_at": "2018-10-04T23:21:38Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/26407",
    "label": "https://github.com/sagemath/sage/labels/enhancement",
    "label_color": "696969",
    "label_name": "enhancement",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/26407#event-365499"
}
```



---

archive/issue_comments_407001.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -1 +1,74 @@\n-https://trac.sagemath.org/timeline?from=2012-10-24T06%3A53%3A31Z&precision=second proposes how slicing of `.expansion()` of p-adic elements should work, see also #13300.\n+As discussed in #13300, we would like to have (probably this already works)\n+\n+```\n+sage: K.<a> = Qq(7^2, 20)\n+sage: z = K.random_element()\n+sage: z == sum([z.expansion()[i] * 7^i for i in range(20)])\n+True\n+```\n+\n+Of course, sometimes you want to get at the coefficient of a in z, or the coefficient of a in z.expansion()[0]. Here's an idea. For matrices, we have the following::\n+\n+```\n+sage: M = matrix(ZZ,4,4,range(16))\n+sage: M[0]\n+(0, 1, 2, 3)\n+sage: M[0,0]\n+0\n+sage: M[0,:]\n+[0 1 2 3]\n+sage: M[:,0]\n+[ 0]\n+[ 4]\n+[ 8]\n+[12]\n+sage: M[1:3,1:4]\n+[ 5  6  7]\n+[ 9 10 11]\n+```\n+\n+What if we used a similar tuple indexing scheme for p-adic elements? For example:\n+\n+```\n+sage: K.<a> = Qq(5^4, 5)\n+sage: z = K.random_element(); z\n+a^3*5^-2 + (3*a^3 + 3*a^2)*5^-1 + (3*a^3 + a^2 + 3*a) + 4*a^3*5 + (4*a + 2)*5^2 + O(5^3)\n+sage: z.expansion()[0]\n+3*a^3 + a^2 + 3*a + O(5^3)\n+sage: z.expansion()[2]\n+4*a + 2 + O(5)\n+sage: z.expansion()[2].parent()\n+Unramified Extension of 5-adic Field with capped relative precision 5 in a defined by (1 + O(5^5))*x^4 + (O(5^5))*x^3 + (4 + O(5^5))*x^2 + (4 + O(5^5))*x + (2 + O(5^5))\n+sage: z.expansion()[0,0]\n+O(5^3)\n+sage: z.expansion()[0,0].parent()\n+5-adic Field with capped relative precision 5\n+sage: z.expansion()[2,0]\n+2 + O(5)\n+sage: z.expansion()[2,1]\n+4 + O(5)\n+sage: z.expansion()[:-1]\n+a^3*5^-2 + O(5^-1)\n+sage: z.expansion()[:1]\n+a^3*5^-2 + (3*a^3 + 3*a^2)*5^-1 + (3*a^3 + a^2 + 3*a) + O(5)\n+sage: z.expansion()[:] == z.expansion()[:,:] == z\n+True\n+sage: all([z.expansion()[i,:] == z.expansion()[i] for i in range(-3,2)])\n+True\n+sage: z.expansion()[:,0]\n+2*5^2 + O(5^3)\n+sage: z.expansion()[:,0].parent()\n+5-adic Field with capped relative precision 5\n+sage: z.expansion()[:,1]\n+3 + 4*5^2 + O(5^3)\n+sage: z.expansion()[:,2]\n+3*5^-1 + 1 + O(5^3)\n+sage: z.expansion()[:,3]\n+5^-2 + 3*5^-1 + 3 + 4*5 + O(5^3)\n+sage: sum([a^j * z.expansion()[:,j] for j in range(4)]) == z\n+True\n+sage: z.expansion()[-1:2,1:3]\n+3*a^2*5^-1 + (a^2 + 3*a) + O(5^2)\n+```\n+\n+The parent of z.expansion()[i], z.expansion()[i,T] and z.expansion()[S,T] (for integer i and slices S,T) would be the unramified extension; the parent of z.expansion()[i,j] and z.expansion()[S,j] would be the ground field (or ring). Negative indices would never be considered as counting backward from a length, even for ring elements.\n``````\n",
    "created_at": "2018-10-04T23:47:34Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/26407",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/26407#issuecomment-407001",
    "user": "https://github.com/saraedum"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -1 +1,74 @@
-https://trac.sagemath.org/timeline?from=2012-10-24T06%3A53%3A31Z&precision=second proposes how slicing of `.expansion()` of p-adic elements should work, see also #13300.
+As discussed in #13300, we would like to have (probably this already works)
+
+```
+sage: K.<a> = Qq(7^2, 20)
+sage: z = K.random_element()
+sage: z == sum([z.expansion()[i] * 7^i for i in range(20)])
+True
+```
+
+Of course, sometimes you want to get at the coefficient of a in z, or the coefficient of a in z.expansion()[0]. Here's an idea. For matrices, we have the following::
+
+```
+sage: M = matrix(ZZ,4,4,range(16))
+sage: M[0]
+(0, 1, 2, 3)
+sage: M[0,0]
+0
+sage: M[0,:]
+[0 1 2 3]
+sage: M[:,0]
+[ 0]
+[ 4]
+[ 8]
+[12]
+sage: M[1:3,1:4]
+[ 5  6  7]
+[ 9 10 11]
+```
+
+What if we used a similar tuple indexing scheme for p-adic elements? For example:
+
+```
+sage: K.<a> = Qq(5^4, 5)
+sage: z = K.random_element(); z
+a^3*5^-2 + (3*a^3 + 3*a^2)*5^-1 + (3*a^3 + a^2 + 3*a) + 4*a^3*5 + (4*a + 2)*5^2 + O(5^3)
+sage: z.expansion()[0]
+3*a^3 + a^2 + 3*a + O(5^3)
+sage: z.expansion()[2]
+4*a + 2 + O(5)
+sage: z.expansion()[2].parent()
+Unramified Extension of 5-adic Field with capped relative precision 5 in a defined by (1 + O(5^5))*x^4 + (O(5^5))*x^3 + (4 + O(5^5))*x^2 + (4 + O(5^5))*x + (2 + O(5^5))
+sage: z.expansion()[0,0]
+O(5^3)
+sage: z.expansion()[0,0].parent()
+5-adic Field with capped relative precision 5
+sage: z.expansion()[2,0]
+2 + O(5)
+sage: z.expansion()[2,1]
+4 + O(5)
+sage: z.expansion()[:-1]
+a^3*5^-2 + O(5^-1)
+sage: z.expansion()[:1]
+a^3*5^-2 + (3*a^3 + 3*a^2)*5^-1 + (3*a^3 + a^2 + 3*a) + O(5)
+sage: z.expansion()[:] == z.expansion()[:,:] == z
+True
+sage: all([z.expansion()[i,:] == z.expansion()[i] for i in range(-3,2)])
+True
+sage: z.expansion()[:,0]
+2*5^2 + O(5^3)
+sage: z.expansion()[:,0].parent()
+5-adic Field with capped relative precision 5
+sage: z.expansion()[:,1]
+3 + 4*5^2 + O(5^3)
+sage: z.expansion()[:,2]
+3*5^-1 + 1 + O(5^3)
+sage: z.expansion()[:,3]
+5^-2 + 3*5^-1 + 3 + 4*5 + O(5^3)
+sage: sum([a^j * z.expansion()[:,j] for j in range(4)]) == z
+True
+sage: z.expansion()[-1:2,1:3]
+3*a^2*5^-1 + (a^2 + 3*a) + O(5^2)
+```
+
+The parent of z.expansion()[i], z.expansion()[i,T] and z.expansion()[S,T] (for integer i and slices S,T) would be the unramified extension; the parent of z.expansion()[i,j] and z.expansion()[S,j] would be the ground field (or ring). Negative indices would never be considered as counting backward from a length, even for ring elements.
``````




---

archive/issue_events_365500.json:
```json
{
    "actor": "https://github.com/saraedum",
    "created_at": "2018-10-04T23:47:34Z",
    "event": "renamed",
    "issue": "https://github.com/sagemath/sage/issues/26407",
    "title_is": "Support slicing and tuples in expansion() of p-adic elements",
    "title_was": "Support slicing in expansion() of p-adic elements",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/26407#event-365500"
}
```



---

archive/issue_comments_407002.json:
```json
{
    "body": "Changed keywords from none to **padicBordeaux**",
    "created_at": "2019-09-07T12:37:37Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/26407",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/26407#issuecomment-407002",
    "user": "https://github.com/roed314"
}
```

Changed keywords from none to **padicBordeaux**



---

archive/issue_events_365501.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-12-29T01:42:26Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/26407",
    "milestone_number": null,
    "milestone_title": "sage-8.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/26407#event-365501"
}
```
