# Issue 16240: regression in partial_fraction_decomposition()

archive/issues_016003.json:
```json
{
    "body": "This worked in 6.1.1. Maybe triggered in #15306.\nNote the sign of the denominator:\n\n```\nsage: R.<x> = ZZ['x']\nsage: p=(6*x^2 - 9*x + 5)/(-x^3 + 3*x^2 - 3*x + 1)\nsage: p.partial_fraction_decomposition()\n(0, [6/(x - 1), 3/(x^2 - 2*x + 1), 2/(x^3 - 3*x^2 + 3*x - 1)])\nsage: 6/(x - 1) + 3/(x^2 - 2*x + 1) + 2/(x^3 - 3*x^2 + 3*x - 1)\n(6*x^2 - 9*x + 5)/(x^3 - 3*x^2 + 3*x - 1)\n```\nwhile in SR:\n\n```\nsage: var('x')\nx\nsage: p=(6*x^2 - 9*x + 5)/(-x^3 + 3*x^2 - 3*x + 1)\nsage: p.partial_fraction()\n-6/(x - 1) - 3/(x - 1)^2 - 2/(x - 1)^3\n```\nThe minimal case, showing with odd exponents:\n\n```\nsage: R.<x> = ZZ['x']\nsage: p=1/(-x + 1)\nsage: p.partial_fraction_decomposition()\n(0, [1/(x - 1)])\n```\n\n\nCC:  @robertwb\n\nKeywords: partial fractions, polynomials\n\nBranch/Commit: 41fbef419f6f3d3681eefd4a8f302bd1504effe2\n\nReviewer: Peter Bruin\n\nAuthor: Ralf Stephan\n\nResolution: fixed\n\nIssue created by migration from https://trac.sagemath.org/ticket/16240\n\n",
    "closed_at": "2014-05-07T08:31:06Z",
    "created_at": "2014-04-26T08:00:21Z",
    "labels": [
        "component: commutative algebra",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-6.3",
    "title": "regression in partial_fraction_decomposition()",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/16240",
    "user": "https://github.com/rwst"
}
```
This worked in 6.1.1. Maybe triggered in #15306.
Note the sign of the denominator:

```
sage: R.<x> = ZZ['x']
sage: p=(6*x^2 - 9*x + 5)/(-x^3 + 3*x^2 - 3*x + 1)
sage: p.partial_fraction_decomposition()
(0, [6/(x - 1), 3/(x^2 - 2*x + 1), 2/(x^3 - 3*x^2 + 3*x - 1)])
sage: 6/(x - 1) + 3/(x^2 - 2*x + 1) + 2/(x^3 - 3*x^2 + 3*x - 1)
(6*x^2 - 9*x + 5)/(x^3 - 3*x^2 + 3*x - 1)
```
while in SR:

```
sage: var('x')
x
sage: p=(6*x^2 - 9*x + 5)/(-x^3 + 3*x^2 - 3*x + 1)
sage: p.partial_fraction()
-6/(x - 1) - 3/(x - 1)^2 - 2/(x - 1)^3
```
The minimal case, showing with odd exponents:

```
sage: R.<x> = ZZ['x']
sage: p=1/(-x + 1)
sage: p.partial_fraction_decomposition()
(0, [1/(x - 1)])
```


CC:  @robertwb

Keywords: partial fractions, polynomials

Branch/Commit: 41fbef419f6f3d3681eefd4a8f302bd1504effe2

Reviewer: Peter Bruin

Author: Ralf Stephan

Resolution: fixed

Issue created by migration from https://trac.sagemath.org/ticket/16240





---

archive/issue_comments_207523.json:
```json
{
    "body": "<a id='comment:3'></a>Before commit https://github.com/sagemath/sage/commit/807f60d859f5481a31896945555dc7e41d627cb6\n\n```\nsage: p=1/(-x + 1)\nsage: p.partial_fraction_decomposition()\n(0, [-1/(x - 1)])\n```\nAfter:\n\n```\nsage: p=1/(-x + 1)\nsage: p.partial_fraction_decomposition()\n(0, [1/(x - 1)])\n```",
    "created_at": "2014-04-26T13:22:10Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16240",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16240#issuecomment-207523",
    "user": "https://github.com/rwst"
}
```

<a id='comment:3'></a>Before commit https://github.com/sagemath/sage/commit/807f60d859f5481a31896945555dc7e41d627cb6

```
sage: p=1/(-x + 1)
sage: p.partial_fraction_decomposition()
(0, [-1/(x - 1)])
```
After:

```
sage: p=1/(-x + 1)
sage: p.partial_fraction_decomposition()
(0, [1/(x - 1)])
```



---

archive/issue_comments_207524.json:
```json
{
    "body": "<a id='comment:5'></a>New commits:",
    "created_at": "2014-04-26T14:44:04Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16240",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16240#issuecomment-207524",
    "user": "https://github.com/rwst"
}
```

<a id='comment:5'></a>New commits:



---

archive/issue_comments_207525.json:
```json
{
    "body": "Changing status from new to needs_review.",
    "created_at": "2014-04-26T14:44:04Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16240",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16240#issuecomment-207525",
    "user": "https://github.com/rwst"
}
```

Changing status from new to needs_review.



---

archive/issue_comments_207526.json:
```json
{
    "body": "<a id='comment:6'></a>OK, I convinced myself that if the algorithm is correct in the case where the unit in the factorisation of the denominator is 1 (in which case this patch does not make a difference), then the algorithm is correct for arbitrary units if and only if the patch is applied.\n\nAs Knuth said, \"I have only proved it correct, not tried it\", so now running doctests.",
    "created_at": "2014-05-05T14:59:43Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16240",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16240#issuecomment-207526",
    "user": "https://github.com/pjbruin"
}
```

<a id='comment:6'></a>OK, I convinced myself that if the algorithm is correct in the case where the unit in the factorisation of the denominator is 1 (in which case this patch does not make a difference), then the algorithm is correct for arbitrary units if and only if the patch is applied.

As Knuth said, "I have only proved it correct, not tried it", so now running doctests.



---

archive/issue_comments_207527.json:
```json
{
    "body": "Changing status from needs_review to positive_review.",
    "created_at": "2014-05-05T15:14:25Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16240",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16240#issuecomment-207527",
    "user": "https://github.com/pjbruin"
}
```

Changing status from needs_review to positive_review.



---

archive/issue_comments_207528.json:
```json
{
    "body": "Resolution: fixed",
    "created_at": "2014-05-07T08:31:06Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16240",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16240#issuecomment-207528",
    "user": "https://github.com/vbraun"
}
```

Resolution: fixed



---

archive/issue_events_047867.json:
```json
{
    "actor": "https://github.com/vbraun",
    "created_at": "2014-05-07T08:31:06Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/16240",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/16240#event-47867"
}
```
