# Issue 16436: is_real method should exist for elements of AA, ZZ, QQ,..., and be fixed where it is already defined

archive/issues_016199.json:
```json
{
    "body": "The function `is_real` is useful but it is not practical because it it not implemented for every types of numbers in Sage. And I do not want to do type checking before being able to use it in my code.\n\n```\nsage: CC(3).is_real()\nTrue\nsage: RR(3).is_real()\nTrue\nsage: SR(3).is_real()\nTrue\nsage: ZZ(3).is_real()\nTraceback (most recent call last):\n...\nAttributeError: 'sage.rings.integer.Integer' object has no attribute 'is_real'\nsage: QQ(3).is_real()\nTraceback (most recent call last):\n...\nAttributeError: 'sage.rings.rational.Rational' object has no attribute 'is_real'\nsage: AA(3).is_real()\nTraceback (most recent call last)\n...\nAttributeError: 'AlgebraicReal' object has no attribute 'is_real'\nsage: AlgebraicNumber(3).is_real()\nTraceback (most recent call last)\n...\nAttributeError: 'AlgebraicNumber' object has no attribute 'is_real'\n\nsage: RDF(3).is_real()\nAttributeError: 'sage.rings.real_double.RealDoubleElement' object has no attribute 'is_real'\n\nsage: QQbar(3).is_real()\nAttributeError: 'AlgebraicNumber' object has no attribute 'is_real'\n\n```\n\nI am sure I forget some other rings...\n\nWe need more of this kind of consistency in Sage. `is_imaginary` is another example.\n\nThe `.is_real()` method does not handle `NaN` and `+/-Infinity` correctly, for example:\n\n```\nsage: CC(NaN).is_real()\nTrue\n```\n\n\n**Status:** new\n\nIssue created by migration from https://trac.sagemath.org/ticket/16436\n\n",
    "created_at": "2014-06-03T21:38:30Z",
    "labels": [
        "component: algebra"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-6.4",
    "title": "is_real method should exist for elements of AA, ZZ, QQ,..., and be fixed where it is already defined",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/16436",
    "user": "https://github.com/seblabbe"
}
```
The function `is_real` is useful but it is not practical because it it not implemented for every types of numbers in Sage. And I do not want to do type checking before being able to use it in my code.

```
sage: CC(3).is_real()
True
sage: RR(3).is_real()
True
sage: SR(3).is_real()
True
sage: ZZ(3).is_real()
Traceback (most recent call last):
...
AttributeError: 'sage.rings.integer.Integer' object has no attribute 'is_real'
sage: QQ(3).is_real()
Traceback (most recent call last):
...
AttributeError: 'sage.rings.rational.Rational' object has no attribute 'is_real'
sage: AA(3).is_real()
Traceback (most recent call last)
...
AttributeError: 'AlgebraicReal' object has no attribute 'is_real'
sage: AlgebraicNumber(3).is_real()
Traceback (most recent call last)
...
AttributeError: 'AlgebraicNumber' object has no attribute 'is_real'

sage: RDF(3).is_real()
AttributeError: 'sage.rings.real_double.RealDoubleElement' object has no attribute 'is_real'

sage: QQbar(3).is_real()
AttributeError: 'AlgebraicNumber' object has no attribute 'is_real'

```

I am sure I forget some other rings...

We need more of this kind of consistency in Sage. `is_imaginary` is another example.

The `.is_real()` method does not handle `NaN` and `+/-Infinity` correctly, for example:

```
sage: CC(NaN).is_real()
True
```


**Status:** new

Issue created by migration from https://trac.sagemath.org/ticket/16436





---

archive/issue_comments_274857.json:
```json
{
    "body": "<a id='comment:1'></a>\nHi Sebastien. Note that you can also use coercion with the poorest real representation:\n\n```\nsage: AA(3) in RealField(2)\nTrue\nsage: CC(3) in RealField(2)\nTrue\nsage: RR(3) in RealField(2)\nTrue\nsage: SR(3) in RealField(2)\nTrue\nsage: ZZ(3) in RealField(2)\nTrue\nsage: QQ(3) in RealField(2)\nTrue\nsage: AA(3) in RealField(2)\nTrue\nsage: QQbar(3) in RealField(2)\nTrue\n```\n\nthough you need to be careful with `NaN` and `+/-Infinity` that also belong to `RealField(2)`. By the way: \n\n```\nsage: SR(Infinity).is_real()\nTrue\n```",
    "created_at": "2014-06-04T08:55:21Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16436",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16436#issuecomment-274857",
    "user": "https://trac.sagemath.org/admin/accounts/users/tmonteil"
}
```

<a id='comment:1'></a>
Hi Sebastien. Note that you can also use coercion with the poorest real representation:

```
sage: AA(3) in RealField(2)
True
sage: CC(3) in RealField(2)
True
sage: RR(3) in RealField(2)
True
sage: SR(3) in RealField(2)
True
sage: ZZ(3) in RealField(2)
True
sage: QQ(3) in RealField(2)
True
sage: AA(3) in RealField(2)
True
sage: QQbar(3) in RealField(2)
True
```

though you need to be careful with `NaN` and `+/-Infinity` that also belong to `RealField(2)`. By the way: 

```
sage: SR(Infinity).is_real()
True
```



---

archive/issue_comments_274858.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -20,6 +20,10 @@\n Traceback (most recent call last)\n ...\n AttributeError: 'AlgebraicReal' object has no attribute 'is_real'\n+sage: AlgebraicNumber(3).is_real()\n+Traceback (most recent call last)\n+...\n+AttributeError: 'AlgebraicNumber' object has no attribute 'is_real'\n ```\n \n I am sure I forget some other rings...\n``````\n",
    "created_at": "2014-06-04T12:51:57Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16436",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16436#issuecomment-274858",
    "user": "https://github.com/seblabbe"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -20,6 +20,10 @@
 Traceback (most recent call last)
 ...
 AttributeError: 'AlgebraicReal' object has no attribute 'is_real'
+sage: AlgebraicNumber(3).is_real()
+Traceback (most recent call last)
+...
+AttributeError: 'AlgebraicNumber' object has no attribute 'is_real'
 ```
 
 I am sure I forget some other rings...
``````




---

archive/issue_comments_274859.json:
```json
{
    "body": "<a id='comment:3'></a>\nReplying to [tmonteil](#comment%3A1):\n> Hi Sebastien. Note that you can also use coercion with the poorest real representation:\n\n\nI have been using monkey tricks like that for too long now like `.n().imag() == 0`. I want a clean solution. It should be normal to ask if some eigenvalue of some matrix is a real number.\n\n```\nsage: M = identity_matrix(RR,4)\nsage: [a.is_real() for a in M.eigenvalues()]\n[True, True, True, True]\n```\n\n```\nsage: M = identity_matrix(ZZ,4)\nsage: [a.is_real() for a in M.eigenvalues()]\nTraceback (most recent call last):\n...\nAttributeError: 'sage.rings.rational.Rational' object has no attribute 'is_real'\n```\n\n```\nsage: M = random_matrix(ZZ,4)\nsage: [a.is_real() for a in M.eigenvalues()]\nTraceback (most recent call last):\n...\nAttributeError: 'AlgebraicNumber' object has no attribute 'is_real'\n```",
    "created_at": "2014-06-04T12:59:16Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16436",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16436#issuecomment-274859",
    "user": "https://github.com/seblabbe"
}
```

<a id='comment:3'></a>
Replying to [tmonteil](#comment%3A1):
> Hi Sebastien. Note that you can also use coercion with the poorest real representation:


I have been using monkey tricks like that for too long now like `.n().imag() == 0`. I want a clean solution. It should be normal to ask if some eigenvalue of some matrix is a real number.

```
sage: M = identity_matrix(RR,4)
sage: [a.is_real() for a in M.eigenvalues()]
[True, True, True, True]
```

```
sage: M = identity_matrix(ZZ,4)
sage: [a.is_real() for a in M.eigenvalues()]
Traceback (most recent call last):
...
AttributeError: 'sage.rings.rational.Rational' object has no attribute 'is_real'
```

```
sage: M = random_matrix(ZZ,4)
sage: [a.is_real() for a in M.eigenvalues()]
Traceback (most recent call last):
...
AttributeError: 'AlgebraicNumber' object has no attribute 'is_real'
```



---

archive/issue_comments_274860.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -1,5 +1,5 @@\n \n-The function ``is_real`` is useful but it is not practical because it it not implemented for every types of numbers in Sage. And I do not want to do type checking before being able to use it in my code.\n+The function `is_real` is useful but it is not practical because it it not implemented for every types of numbers in Sage. And I do not want to do type checking before being able to use it in my code.\n \n ```\n sage: CC(3).is_real()\n@@ -28,5 +28,5 @@\n \n I am sure I forget some other rings...\n \n-We need more of this kind of consistency in Sage. ``is_imaginary`` is another example.\n+We need more of this kind of consistency in Sage. `is_imaginary` is another example.\n \n``````\n",
    "created_at": "2014-06-04T13:00:32Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16436",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16436#issuecomment-274860",
    "user": "https://github.com/seblabbe"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -1,5 +1,5 @@
 
-The function ``is_real`` is useful but it is not practical because it it not implemented for every types of numbers in Sage. And I do not want to do type checking before being able to use it in my code.
+The function `is_real` is useful but it is not practical because it it not implemented for every types of numbers in Sage. And I do not want to do type checking before being able to use it in my code.
 
 ```
 sage: CC(3).is_real()
@@ -28,5 +28,5 @@
 
 I am sure I forget some other rings...
 
-We need more of this kind of consistency in Sage. ``is_imaginary`` is another example.
+We need more of this kind of consistency in Sage. `is_imaginary` is another example.
 
``````




---

archive/issue_comments_274861.json:
```json
{
    "body": "<a id='comment:5'></a>\nIf, as i proposed on sage-devel we could have an overlay (say, `RR`) for real fields, the syntax `CC(3) in RR` would be very readable. The only problem with `CC(3) in RealField(2)` is about `NaN` and `+/-Infinity`, but you should notice that the same problem exists with the current `.is_real()` methods, so the solution is not clean either.",
    "created_at": "2014-06-04T20:25:22Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16436",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16436#issuecomment-274861",
    "user": "https://trac.sagemath.org/admin/accounts/users/tmonteil"
}
```

<a id='comment:5'></a>
If, as i proposed on sage-devel we could have an overlay (say, `RR`) for real fields, the syntax `CC(3) in RR` would be very readable. The only problem with `CC(3) in RealField(2)` is about `NaN` and `+/-Infinity`, but you should notice that the same problem exists with the current `.is_real()` methods, so the solution is not clean either.



---

archive/issue_comments_274862.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -1,4 +1,3 @@\n-\n The function `is_real` is useful but it is not practical because it it not implemented for every types of numbers in Sage. And I do not want to do type checking before being able to use it in my code.\n \n ```\n@@ -24,9 +23,23 @@\n Traceback (most recent call last)\n ...\n AttributeError: 'AlgebraicNumber' object has no attribute 'is_real'\n+\n+sage: RDF(3).is_real()\n+AttributeError: 'sage.rings.real_double.RealDoubleElement' object has no attribute 'is_real'\n+\n+sage: QQbar(3).is_real()\n+AttributeError: 'AlgebraicNumber' object has no attribute 'is_real'\n+\n ```\n \n I am sure I forget some other rings...\n \n We need more of this kind of consistency in Sage. `is_imaginary` is another example.\n \n+The `.is_real()` method does not handle `NaN` and `+/-Infinity` correctly, for example:\n+\n+```\n+sage: CC(NaN).is_real()\n+True\n+```\n+\n``````\n",
    "created_at": "2014-06-04T20:30:28Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16436",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16436#issuecomment-274862",
    "user": "https://trac.sagemath.org/admin/accounts/users/tmonteil"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -1,4 +1,3 @@
-
 The function `is_real` is useful but it is not practical because it it not implemented for every types of numbers in Sage. And I do not want to do type checking before being able to use it in my code.
 
 ```
@@ -24,9 +23,23 @@
 Traceback (most recent call last)
 ...
 AttributeError: 'AlgebraicNumber' object has no attribute 'is_real'
+
+sage: RDF(3).is_real()
+AttributeError: 'sage.rings.real_double.RealDoubleElement' object has no attribute 'is_real'
+
+sage: QQbar(3).is_real()
+AttributeError: 'AlgebraicNumber' object has no attribute 'is_real'
+
 ```
 
 I am sure I forget some other rings...
 
 We need more of this kind of consistency in Sage. `is_imaginary` is another example.
 
+The `.is_real()` method does not handle `NaN` and `+/-Infinity` correctly, for example:
+
+```
+sage: CC(NaN).is_real()
+True
+```
+
``````




---

archive/issue_events_054998.json:
```json
{
    "event": "renamed",
    "issue": "https://github.com/sagemath/sagetest/issues/16436",
    "rename": {
        "from": "is_real method should exist for elements of AA, ZZ, QQ",
        "to": "is_real method should exist for elements of AA, ZZ, QQ,..., and be fixed where it is already defined"
    },
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/16436#event-54998"
}
```



---

archive/issue_events_054999.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-08-10T16:51:03Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/16436",
    "milestone": "sage-6.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/16436#event-54999"
}
```



---

archive/issue_comments_274863.json:
```json
{
    "body": "<a id='comment:8'></a>\nReplying to [tmonteil](#comment%3A1):\n> Hi Sebastien. Note that you can also use coercion with the poorest real representation:\n> \n> \n> ```\n> sage: AA(3) in RealField(2)\n> True\n> ```\n\nSee #12967 and #17984 for why `x in RR` will determine elementship in `RR` not in the mathematical **R**. For this `is_real` is meant.",
    "created_at": "2015-03-21T09:45:25Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16436",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16436#issuecomment-274863",
    "user": "https://github.com/rwst"
}
```

<a id='comment:8'></a>
Replying to [tmonteil](#comment%3A1):
> Hi Sebastien. Note that you can also use coercion with the poorest real representation:
> 
> 
> ```
> sage: AA(3) in RealField(2)
> True
> ```

See #12967 and #17984 for why `x in RR` will determine elementship in `RR` not in the mathematical **R**. For this `is_real` is meant.



---

archive/issue_comments_274864.json:
```json
{
    "body": "<a id='comment:9'></a>\nOne clean way to implement `is_real` might be to compare x with its conjugate, which is implemented quite often:\n\n```\nsage: def is_real(x):\n....:     return(x == x.conjugate())\n....:\nsage: is_real(ZZ(3))\nTrue\nsage: is_real(QQ(3))\nTrue\nsage: is_real(AA(3))\nTrue\nsage: is_real(RR(3))\nTrue\nsage: is_real(CC(3))\nTrue\n```\nOne could handle `is_imaginary` similarly.",
    "created_at": "2016-04-09T23:31:29Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16436",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16436#issuecomment-274864",
    "user": "https://github.com/kedlaya"
}
```

<a id='comment:9'></a>
One clean way to implement `is_real` might be to compare x with its conjugate, which is implemented quite often:

```
sage: def is_real(x):
....:     return(x == x.conjugate())
....:
sage: is_real(ZZ(3))
True
sage: is_real(QQ(3))
True
sage: is_real(AA(3))
True
sage: is_real(RR(3))
True
sage: is_real(CC(3))
True
```
One could handle `is_imaginary` similarly.
