# Issue 16848: solve of ideal over QQ[x,y] does not give solution anymore (since 6.3)

archive/issues_016611.json:
```json
{
    "assignees": [],
    "body": "In Sage 6.3 we have\n\n```\nsage: R.<x,y> = QQ[]\nsage: I = R.ideal(y^2 - 2*y + 1, x + 1/4*y - 5/4)\nsage: solve(I.gens(), [SR(x) for x in R.gens()], solution_dict=true)\n[]\n```\nBut in 6.1.1 we got\n\n```\nsage: solve(I.gens(), [SR(x) for x in R.gens()], solution_dict=true)\n[{x: 1, y: 1}]\n```\nwhich was the correct solution.\n\nIssue created by migration from https://trac.sagemath.org/ticket/16848\n\n",
    "created_at": "2014-08-18T19:27:43Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20algebra",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "solve of ideal over QQ[x,y] does not give solution anymore (since 6.3)",
    "type": "issue",
    "updated_at": "2015-06-06T14:38:25Z",
    "url": "https://github.com/sagemath/sage/issues/16848",
    "user": "https://github.com/dkrenn"
}
```
In Sage 6.3 we have

```
sage: R.<x,y> = QQ[]
sage: I = R.ideal(y^2 - 2*y + 1, x + 1/4*y - 5/4)
sage: solve(I.gens(), [SR(x) for x in R.gens()], solution_dict=true)
[]
```
But in 6.1.1 we got

```
sage: solve(I.gens(), [SR(x) for x in R.gens()], solution_dict=true)
[{x: 1, y: 1}]
```
which was the correct solution.

Issue created by migration from https://trac.sagemath.org/ticket/16848





---

archive/issue_events_206214.json:
```json
{
    "actor": "https://github.com/dkrenn",
    "created_at": "2014-08-18T19:27:43Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/16848",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20algebra",
    "label_color": "08517b",
    "label_name": "component: algebra",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/16848#event-206214"
}
```



---

archive/issue_events_206215.json:
```json
{
    "actor": "https://github.com/dkrenn",
    "created_at": "2014-08-18T19:27:43Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/16848",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "008080",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/16848#event-206215"
}
```



---

archive/issue_comments_223986.json:
```json
{
    "body": "<a id='comment:1'></a>\nI've narrowed the search: It works in 6.3.beta5, but not anymore in 6.3.beta6.",
    "created_at": "2014-08-18T19:35:31Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/16848",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/16848#issuecomment-223986",
    "user": "https://github.com/dkrenn"
}
```

<a id='comment:1'></a>
I've narrowed the search: It works in 6.3.beta5, but not anymore in 6.3.beta6.



---

archive/issue_comments_223987.json:
```json
{
    "body": "<a id='comment:2'></a>\nHi,\n\nI would not say this is a bug. If you want to use the function `solve`, you need to feed it with symbolic polynomials\n\n```\nsage: R.<x,y> = QQ[]\nsage: Sx, Sy = var('x,y')\nsage: I = R.ideal(y^2 - 2*y + 1, x + 1/4*y - 5/4)\nsage: f0,f1 = I.gens()\nsage: f0 = f0.subs(x=Sx, y=Sy); f1 = f1.subs(x=Sx, y=Sy)\nsage: solve([f0,f1], [Sx,Sy], solution_dict=true)\n[{x: 1, y: 1}]\n```\n\nThe \"bug\" comes from `solve` which does not type check the input as it should. Note that when the input is one polynomial the check is done\n\n```\nsage: f0,f1 = I.gens()\nsage: solve(f0, [Sx,Sy])\nTraceback (most recent call last): \n...\nTypeError: The first argument must be a symbolic expression or a list of symbolic expressions.\n```\n\nVincent",
    "created_at": "2014-08-24T20:02:05Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/16848",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/16848#issuecomment-223987",
    "user": "https://github.com/videlec"
}
```

<a id='comment:2'></a>
Hi,

I would not say this is a bug. If you want to use the function `solve`, you need to feed it with symbolic polynomials

```
sage: R.<x,y> = QQ[]
sage: Sx, Sy = var('x,y')
sage: I = R.ideal(y^2 - 2*y + 1, x + 1/4*y - 5/4)
sage: f0,f1 = I.gens()
sage: f0 = f0.subs(x=Sx, y=Sy); f1 = f1.subs(x=Sx, y=Sy)
sage: solve([f0,f1], [Sx,Sy], solution_dict=true)
[{x: 1, y: 1}]
```

The "bug" comes from `solve` which does not type check the input as it should. Note that when the input is one polynomial the check is done

```
sage: f0,f1 = I.gens()
sage: solve(f0, [Sx,Sy])
Traceback (most recent call last): 
...
TypeError: The first argument must be a symbolic expression or a list of symbolic expressions.
```

Vincent



---

archive/issue_comments_223988.json:
```json
{
    "body": "<a id='comment:3'></a>\nSee also #13360 automatically coercing from polynomials to symbolics can cause unexpected problems. So, while I acknowledge that this ugly and unconvenient I am more inclined to get used to write\n\n```\nsage: R.<x,y> = QQ[]\nsage: I = R.ideal(y^2 - 2*y + 1, x + 1/4*y - 5/4)\nsage: solve(map(SR,I.gens()), map(SR,R.gens()), solution_dict=true)\n[{y: 1, x: 1}]\n```",
    "created_at": "2015-06-05T08:04:07Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/16848",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/16848#issuecomment-223988",
    "user": "https://github.com/lftabera"
}
```

<a id='comment:3'></a>
See also #13360 automatically coercing from polynomials to symbolics can cause unexpected problems. So, while I acknowledge that this ugly and unconvenient I am more inclined to get used to write

```
sage: R.<x,y> = QQ[]
sage: I = R.ideal(y^2 - 2*y + 1, x + 1/4*y - 5/4)
sage: solve(map(SR,I.gens()), map(SR,R.gens()), solution_dict=true)
[{y: 1, x: 1}]
```



---

archive/issue_comments_223989.json:
```json
{
    "body": "<a id='comment:4'></a>\nReplying to [@lftabera](#comment%3A3):\n> See also #13360 automatically coercing from polynomials to symbolics can cause unexpected problems. So, while I acknowledge that this ugly and unconvenient I am more inclined to get used to write\n> \n> ```\n> sage: R.<x,y> = QQ[]\n> sage: I = R.ideal(y^2 - 2*y + 1, x + 1/4*y - 5/4)\n> sage: solve(map(SR,I.gens()), map(SR,R.gens()), solution_dict=true)\n> [{y: 1, x: 1}]\n> ```\n\nOk, this is definitly a workaround and maybe should be mentioned somewhere. Anyhow, I do not like that solve as in the original problem accepts polynomials but then does not give a solution (while it did some versions ago)",
    "created_at": "2015-06-06T14:38:25Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/16848",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/16848#issuecomment-223989",
    "user": "https://github.com/dkrenn"
}
```

<a id='comment:4'></a>
Replying to [@lftabera](#comment%3A3):
> See also #13360 automatically coercing from polynomials to symbolics can cause unexpected problems. So, while I acknowledge that this ugly and unconvenient I am more inclined to get used to write
> 
> ```
> sage: R.<x,y> = QQ[]
> sage: I = R.ideal(y^2 - 2*y + 1, x + 1/4*y - 5/4)
> sage: solve(map(SR,I.gens()), map(SR,R.gens()), solution_dict=true)
> [{y: 1, x: 1}]
> ```

Ok, this is definitly a workaround and maybe should be mentioned somewhere. Anyhow, I do not like that solve as in the original problem accepts polynomials but then does not give a solution (while it did some versions ago)
