# Issue 16905: GSL can't handle really long intervals for integration?

archive/issues_016668.json:
```json
{
    "body": "\n```\nf1(x)=1/sqrt(x^3+2)\nf2(x)=1/sqrt(x^4+2)\nsage: numerical_integral(f2,1,10^8)\n(0.8815690504421161, 3.309409685784312e-09)\nsage: numerical_integral(f2,1,10^9)\n(0.8815690594421439, 2.7280605832086615e-08)\nsage: numerical_integral(f2,1,10^10)\n(0.8815690603426408, 6.194229607849825e-07)\nsage: numerical_integral(f2,1,10^11)\n(2.3214916598860602e-07, 4.5569931705290324e-07)\n```\nSee [here](https://groups.google.com/forum/#!topic/sage-support/l9sgScn0BX0) for first report.\n\n**CC:**  jakobkroeker\n\n**Status:** new\n\nIssue created by migration from https://trac.sagemath.org/ticket/16905\n\n",
    "created_at": "2014-08-29T16:01:49Z",
    "labels": [
        "component: calculus",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-6.4",
    "title": "GSL can't handle really long intervals for integration?",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/16905",
    "user": "https://github.com/kcrisman"
}
```

```
f1(x)=1/sqrt(x^3+2)
f2(x)=1/sqrt(x^4+2)
sage: numerical_integral(f2,1,10^8)
(0.8815690504421161, 3.309409685784312e-09)
sage: numerical_integral(f2,1,10^9)
(0.8815690594421439, 2.7280605832086615e-08)
sage: numerical_integral(f2,1,10^10)
(0.8815690603426408, 6.194229607849825e-07)
sage: numerical_integral(f2,1,10^11)
(2.3214916598860602e-07, 4.5569931705290324e-07)
```
See [here](https://groups.google.com/forum/#!topic/sage-support/l9sgScn0BX0) for first report.

**CC:**  jakobkroeker

**Status:** new

Issue created by migration from https://trac.sagemath.org/ticket/16905





---

archive/issue_comments_287503.json:
```json
{
    "body": "<a id='comment:1'></a>\nMaxima (the `.nintegrate` method) seems to have a similar problem.",
    "created_at": "2014-08-29T16:06:34Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16905",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16905#issuecomment-287503",
    "user": "https://github.com/kcrisman"
}
```

<a id='comment:1'></a>
Maxima (the `.nintegrate` method) seems to have a similar problem.
