# Issue 16993: Broken fraction field of rational polynomial ring

archive/issues_016756.json:
```json
{
    "body": "\n```\nsage: P.<t> = QQ[]\nsage: p = 4/(-4*t)\nsage: p   # OK, fractions are not automatically reduced\n4/(-4*t)\nsage: p.reduce()\nsage: p   # What the heck...\n4/(-4*t)\nsage: p == -1/t   # At least sage gets this right\nTrue\n```\nSo, not only is the fraction not automatically simplified by \"obvious\" common factors, but also it is not simplified upon request.\n\nNote that the fraction field of an integral polynomial ring works better.\n\n```\nsage: P.<t> = ZZ[]\nsage: p = 4/(-4*t)\nsage: p\n1/-t\n```\n\nFixed by #16268.\n\n**CC:**  @tscrim @yuan-zhou @mkoeppe @etn40ff @slel\n\n**Reviewer:** Marc Mezzarobba\n\n**Resolution:** invalid\n\nIssue created by migration from https://trac.sagemath.org/ticket/16993\n\n",
    "closed_at": "2019-02-26T13:58:00Z",
    "created_at": "2014-09-16T12:49:38Z",
    "labels": [
        "component: commutative algebra",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-duplicate/invalid/wontfix",
    "title": "Broken fraction field of rational polynomial ring",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/16993",
    "user": "https://github.com/simon-king-jena"
}
```

```
sage: P.<t> = QQ[]
sage: p = 4/(-4*t)
sage: p   # OK, fractions are not automatically reduced
4/(-4*t)
sage: p.reduce()
sage: p   # What the heck...
4/(-4*t)
sage: p == -1/t   # At least sage gets this right
True
```
So, not only is the fraction not automatically simplified by "obvious" common factors, but also it is not simplified upon request.

Note that the fraction field of an integral polynomial ring works better.

```
sage: P.<t> = ZZ[]
sage: p = 4/(-4*t)
sage: p
1/-t
```

Fixed by #16268.

**CC:**  @tscrim @yuan-zhou @mkoeppe @etn40ff @slel

**Reviewer:** Marc Mezzarobba

**Resolution:** invalid

Issue created by migration from https://trac.sagemath.org/ticket/16993





---

archive/issue_comments_289592.json:
```json
{
    "body": "<a id='comment:1'></a>\nI think this is fixed in [u/robertwb/ticket/16268](http://git.sagemath.org/sage.git/log/?h=u/robertwb/ticket/16268) which is part of #16268. On #16268, I felt that some of the functions introduced there could not live up to their documentation for nastier rings and should be moved around. Also the description of #16268 then goes on to hashes, which IMHO should be fixed without too much extra normalisation as this normalisation is probably not possible for nasty rings. Sadly I don't have time to work on this.\n\nNow back to this ticket: I am not sure I would call reduce *broken* per se: If *reduce* is interpreted as *divide out gcd*, then the behaviour makes sense to me, since 1 is a generator of the ideal `4*QQ[t] + (-4*t)*QQ[t]` and therefore a gcd.\n\nNormalisation in Q(ZZ[t]) isn't optimal either:\n\n```\nsage: P.<t> = ZZ[]\nsage: (2*t)/(2*t+1)\n2*t/(2*t + 1)\nsage: (-2*t)/(-2*t-1)\n-2*t/(-2*t - 1)\n```\n\nI think Nemo solves this (for unnasty rings) by dividing the denominator by what it calls a canonical unit. My understanding of \"canonical unit\" is this: It is the result of a multiplicative map from the non-zero elements to the units, that is the identity on units. (In particular if this map is called `f`, we have `f(a/f(a)) = 1` for any non-zero element `a`.) In the case of `QQ[t]` the function \"leading coefficient\" works. In the case of `ZZ[t]` the function \"sign after leading coefficient\" works.",
    "created_at": "2014-09-16T14:17:10Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16993",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16993#issuecomment-289592",
    "user": "https://trac.sagemath.org/admin/accounts/users/emassop"
}
```

<a id='comment:1'></a>
I think this is fixed in [u/robertwb/ticket/16268](http://git.sagemath.org/sage.git/log/?h=u/robertwb/ticket/16268) which is part of #16268. On #16268, I felt that some of the functions introduced there could not live up to their documentation for nastier rings and should be moved around. Also the description of #16268 then goes on to hashes, which IMHO should be fixed without too much extra normalisation as this normalisation is probably not possible for nasty rings. Sadly I don't have time to work on this.

Now back to this ticket: I am not sure I would call reduce *broken* per se: If *reduce* is interpreted as *divide out gcd*, then the behaviour makes sense to me, since 1 is a generator of the ideal `4*QQ[t] + (-4*t)*QQ[t]` and therefore a gcd.

Normalisation in Q(ZZ[t]) isn't optimal either:

```
sage: P.<t> = ZZ[]
sage: (2*t)/(2*t+1)
2*t/(2*t + 1)
sage: (-2*t)/(-2*t-1)
-2*t/(-2*t - 1)
```

I think Nemo solves this (for unnasty rings) by dividing the denominator by what it calls a canonical unit. My understanding of "canonical unit" is this: It is the result of a multiplicative map from the non-zero elements to the units, that is the identity on units. (In particular if this map is called `f`, we have `f(a/f(a)) = 1` for any non-zero element `a`.) In the case of `QQ[t]` the function "leading coefficient" works. In the case of `ZZ[t]` the function "sign after leading coefficient" works.



---

archive/issue_comments_289593.json:
```json
{
    "body": "<a id='comment:4'></a>\nMy suggestion would be that if we create a fraction field of some commutative algebra over a field `k` such that `k` is constructed as the fraction field of `R` (perhaps with some extra conditions on the ring), then we create the fraction field over the algebra over `R`. This change would definitely require a discussion on sage-devel, and might be something we do only for polynomial rings or some other nice class of commutative algebras.",
    "created_at": "2015-09-25T22:03:21Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16993",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16993#issuecomment-289593",
    "user": "https://github.com/tscrim"
}
```

<a id='comment:4'></a>
My suggestion would be that if we create a fraction field of some commutative algebra over a field `k` such that `k` is constructed as the fraction field of `R` (perhaps with some extra conditions on the ring), then we create the fraction field over the algebra over `R`. This change would definitely require a discussion on sage-devel, and might be something we do only for polynomial rings or some other nice class of commutative algebras.



---

archive/issue_events_056298.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2018-09-14T04:33:38Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/16993",
    "milestone": "sage-duplicate/invalid/wontfix",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/16993#event-56298"
}
```



---

archive/issue_comments_289594.json:
```json
{
    "body": "**Changing status** from new to needs_review.",
    "created_at": "2018-09-14T04:33:38Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16993",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16993#issuecomment-289594",
    "user": "https://github.com/mkoeppe"
}
```

**Changing status** from new to needs_review.



---

archive/issue_comments_289595.json:
```json
{
    "body": "<a id='comment:7'></a>\nWith #16268, the example now works as expected:\n\n```\nsage: P.<t> = QQ[]\nsage: p = 4/(-4*t)\nsage: p\n-1/t\nsage: p.reduce()\nsage: p\n-1/t\n```\nI would suggest to close this ticket as a duplicate of #16268.",
    "created_at": "2018-09-14T04:33:38Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16993",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16993#issuecomment-289595",
    "user": "https://github.com/mkoeppe"
}
```

<a id='comment:7'></a>
With #16268, the example now works as expected:

```
sage: P.<t> = QQ[]
sage: p = 4/(-4*t)
sage: p
-1/t
sage: p.reduce()
sage: p
-1/t
```
I would suggest to close this ticket as a duplicate of #16268.



---

archive/issue_comments_289596.json:
```json
{
    "body": "**Reviewer:** Marc Mezzarobba",
    "created_at": "2018-09-22T14:36:12Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16993",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16993#issuecomment-289596",
    "user": "https://github.com/mezzarobba"
}
```

**Reviewer:** Marc Mezzarobba



---

archive/issue_comments_289597.json:
```json
{
    "body": "**Changing status** from needs_review to positive_review.",
    "created_at": "2018-09-22T14:36:12Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16993",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16993#issuecomment-289597",
    "user": "https://github.com/mezzarobba"
}
```

**Changing status** from needs_review to positive_review.



---

archive/issue_comments_289598.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -20,3 +20,5 @@\n sage: p\n 1/-t\n ```\n+\n+Fixed by #16268.\n``````\n",
    "created_at": "2018-12-28T09:31:35Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16993",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16993#issuecomment-289598",
    "user": "https://github.com/slel"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -20,3 +20,5 @@
 sage: p
 1/-t
 ```
+
+Fixed by #16268.
``````




---

archive/issue_comments_289599.json:
```json
{
    "body": "<a id='comment:10'></a>\nPresuming these are all correctly reviewed as either duplicate, invalid, or wontfix.",
    "created_at": "2019-02-26T13:58:00Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16993",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16993#issuecomment-289599",
    "user": "https://github.com/embray"
}
```

<a id='comment:10'></a>
Presuming these are all correctly reviewed as either duplicate, invalid, or wontfix.



---

archive/issue_comments_289600.json:
```json
{
    "body": "**Resolution:** invalid",
    "created_at": "2019-02-26T13:58:00Z",
    "issue": "https://github.com/sagemath/sagetest/issues/16993",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/16993#issuecomment-289600",
    "user": "https://github.com/embray"
}
```

**Resolution:** invalid



---

archive/issue_events_056299.json:
```json
{
    "actor": "https://github.com/embray",
    "created_at": "2019-02-26T13:58:00Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/16993",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/16993#event-56299"
}
```
