# Issue 34024: Polynomials over p-adics and power series are wrong

archive/issues_033787.json:
```json
{
    "assignees": [],
    "body": "The design choice made for p-adics and power series is that `O(p^n)` and `O(x^n)` behave similarly to zero in comparisons. All of\n- `a.is_zero()`\n- `not a`\n- `a == a.parent().zero()`\n- `not (a != a.parent().zero()`\nanswer `True` for `O(p^n)` or `O(x^n)`\n\n```\nsage: a = O(2^3)\nsage: a.is_zero()\nTrue\nsage: a.is_zero() and not a and a == a.parent().zero() and not (a != a.parent().zero())\nTrue\nsage: R.<x> = PowerSeriesRing(QQ)\nsage: a = O(x^3)\nsage: a.is_zero() and not a and a == a.parent().zero() and not (a != a.parent().zero())\nTrue\n```\n\nAs a consequence, the generic implementation of uni-variate and multi-variate polynomials are broken on those rings (as it does remove terms whose coefficients are zero).\n\n```\nsage: Z2 = Zp(2)\nsage: R.<x,y> = Z2[]\nsage: R(1) - R(1)\n0\nsage: Z2(1) - Z2(1)\nO(2^20)\n```\n\nDepends on #34000\n\nIssue created by migration from https://trac.sagemath.org/ticket/34024\n\n",
    "created_at": "2022-06-19T18:42:23Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20algebra",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-9.8",
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "Polynomials over p-adics and power series are wrong",
    "type": "issue",
    "updated_at": "2022-09-19T18:58:47Z",
    "url": "https://github.com/sagemath/sage/issues/34024",
    "user": "https://github.com/videlec"
}
```
The design choice made for p-adics and power series is that `O(p^n)` and `O(x^n)` behave similarly to zero in comparisons. All of
- `a.is_zero()`
- `not a`
- `a == a.parent().zero()`
- `not (a != a.parent().zero()`
answer `True` for `O(p^n)` or `O(x^n)`

```
sage: a = O(2^3)
sage: a.is_zero()
True
sage: a.is_zero() and not a and a == a.parent().zero() and not (a != a.parent().zero())
True
sage: R.<x> = PowerSeriesRing(QQ)
sage: a = O(x^3)
sage: a.is_zero() and not a and a == a.parent().zero() and not (a != a.parent().zero())
True
```

As a consequence, the generic implementation of uni-variate and multi-variate polynomials are broken on those rings (as it does remove terms whose coefficients are zero).

```
sage: Z2 = Zp(2)
sage: R.<x,y> = Z2[]
sage: R(1) - R(1)
0
sage: Z2(1) - Z2(1)
O(2^20)
```

Depends on #34000

Issue created by migration from https://trac.sagemath.org/ticket/34024





---

archive/issue_events_410756.json:
```json
{
    "actor": "https://github.com/videlec",
    "created_at": "2022-06-19T18:42:23Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/34024",
    "milestone_number": null,
    "milestone_title": "sage-9.8",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/34024#event-410756"
}
```



---

archive/issue_events_410757.json:
```json
{
    "actor": "https://github.com/videlec",
    "created_at": "2022-06-19T18:42:23Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/34024",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20algebra",
    "label_color": "08517b",
    "label_name": "component: algebra",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/34024#event-410757"
}
```



---

archive/issue_events_410758.json:
```json
{
    "actor": "https://github.com/videlec",
    "created_at": "2022-06-19T18:42:23Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/34024",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "008080",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/34024#event-410758"
}
```



---

archive/issue_comments_552305.json:
```json
{
    "body": "<a id='comment:1'></a>\nMy personal feeling is that `bool(a)` should be equivalent to \"a is not exact zero\".",
    "created_at": "2022-06-19T18:43:24Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/34024",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/34024#issuecomment-552305",
    "user": "https://github.com/videlec"
}
```

<a id='comment:1'></a>
My personal feeling is that `bool(a)` should be equivalent to "a is not exact zero".



---

archive/issue_events_410759.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-09-19T18:58:47Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/34024",
    "milestone_number": null,
    "milestone_title": "sage-9.7",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/34024#event-410759"
}
```



---

archive/issue_events_410760.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-09-19T18:58:47Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/34024",
    "milestone_number": null,
    "milestone_title": "sage-9.8",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/34024#event-410760"
}
```
