# Issue 34302: incorrect computations in Singular ring of characteristic > 2^29

archive/issues_034065.json:
```json
{
    "body": "Example (Sage 9.6):\n\n```sage\nsage: # correct\nsage: F.<t> = GF((2^29-3, 2))\nsage: R.<x> = PolynomialRing(F, implementation='singular')\nsage: ~R(t)\n(-t - 1)\n```\n\n```sage\nsage: # incorrect\nsage: F.<t> = GF((2^29+11, 2))\nsage: R.<x> = PolynomialRing(F, implementation='singular')\nsage: ~R(t)\n0\n```\n\nMoreover, after running the incorrect example, the correct one becomes incorrect too, hinting at some kind of state corruption.\n\nIssue created by migration from https://trac.sagemath.org/ticket/34302\n\n",
    "created_at": "2022-08-08T04:26:22Z",
    "labels": [
        "component: algebra",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-9.8",
    "title": "incorrect computations in Singular ring of characteristic > 2^29",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/34302",
    "user": "https://github.com/yyyyx4"
}
```
Example (Sage 9.6):

```sage
sage: # correct
sage: F.<t> = GF((2^29-3, 2))
sage: R.<x> = PolynomialRing(F, implementation='singular')
sage: ~R(t)
(-t - 1)
```

```sage
sage: # incorrect
sage: F.<t> = GF((2^29+11, 2))
sage: R.<x> = PolynomialRing(F, implementation='singular')
sage: ~R(t)
0
```

Moreover, after running the incorrect example, the correct one becomes incorrect too, hinting at some kind of state corruption.

Issue created by migration from https://trac.sagemath.org/ticket/34302





---

archive/issue_comments_482815.json:
```json
{
    "body": "The [singular manual](https://www.singular.uni-kl.de/hannes/sing_411.htm) says \"the characteristic of a prime field in the factory routines must be less than 536870912 (2<sup>29</sup>)\".  So I think we should be throwing an error in this situation.",
    "created_at": "2022-08-08T05:19:23Z",
    "issue": "https://github.com/sagemath/sagetest/issues/34302",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/34302#issuecomment-482815",
    "user": "https://github.com/DaveWitteMorris"
}
```

The [singular manual](https://www.singular.uni-kl.de/hannes/sing_411.htm) says "the characteristic of a prime field in the factory routines must be less than 536870912 (2<sup>29</sup>)".  So I think we should be throwing an error in this situation.



---

archive/issue_events_089352.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-09-19T18:58:47Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/34302",
    "milestone": "sage-9.8",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/34302#event-89352"
}
```
