# Issue 34438: Interval sets cannot be constructed from embedded number field elements

archive/issues_034201.json:
```json
{
    "assignees": [],
    "body": "Currently, the following fails:\n\n```\nsage: K.<a> = NumberField(x^2 - 2, embedding=1)\nsage: RealSet.unbounded_below_closed(a)\nAttributeError: 'sage.rings.real_lazy.LazyBinop' object has no attribute '_value'\n```\n\nHowever, this works:\n\n```\nsage: RealSet.unbounded_below_closed(AA(a))\n(-oo, 1.414213562373095?]\n```\n\nCC:  @videlec @slel @yuan-zhou\n\n_Issue created by migration from https://trac.sagemath.org/ticket/34438_\n\n",
    "created_at": "2022-08-26T07:49:06Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20number%20fields",
        "https://github.com/sagemath/sage/labels/p3%20%E2%80%93%20major",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-9.8",
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "Interval sets cannot be constructed from embedded number field elements",
    "type": "issue",
    "updated_at": "2022-09-19T18:58:47Z",
    "url": "https://github.com/sagemath/sage/issues/34438",
    "user": "https://github.com/saraedum"
}
```
Currently, the following fails:

```
sage: K.<a> = NumberField(x^2 - 2, embedding=1)
sage: RealSet.unbounded_below_closed(a)
AttributeError: 'sage.rings.real_lazy.LazyBinop' object has no attribute '_value'
```

However, this works:

```
sage: RealSet.unbounded_below_closed(AA(a))
(-oo, 1.414213562373095?]
```

CC:  @videlec @slel @yuan-zhou

_Issue created by migration from https://trac.sagemath.org/ticket/34438_





---

archive/issue_events_437479.json:
```json
{
    "actor": "https://github.com/saraedum",
    "created_at": "2022-08-26T07:49:06Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/34438",
    "milestone_number": null,
    "milestone_title": "sage-9.8",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/34438#event-437479"
}
```



---

archive/issue_events_437480.json:
```json
{
    "actor": "https://github.com/saraedum",
    "created_at": "2022-08-26T07:49:06Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/34438",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20number%20fields",
    "label_color": "0000ff",
    "label_name": "component: number fields",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/34438#event-437480"
}
```



---

archive/issue_events_437481.json:
```json
{
    "actor": "https://github.com/saraedum",
    "created_at": "2022-08-26T07:49:06Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/34438",
    "label": "https://github.com/sagemath/sage/labels/p3%20%E2%80%93%20major",
    "label_color": "ffbb00",
    "label_name": "p3 \u2013 major",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/34438#event-437481"
}
```



---

archive/issue_events_437482.json:
```json
{
    "actor": "https://github.com/saraedum",
    "created_at": "2022-08-26T07:49:06Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/34438",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "d73a4a",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/34438#event-437482"
}
```



---

archive/issue_comments_559474.json:
```json
{
    "body": "<a id='comment:1'>Comment 1:</a>\nThis affects the hyperbolic code at https://github.com/flatsurf/sage-flatsurf/pull/158.",
    "created_at": "2022-08-26T07:49:24Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/34438",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/34438#issuecomment-559474",
    "user": "https://github.com/saraedum"
}
```

<a id='comment:1'>Comment 1:</a>
This affects the hyperbolic code at https://github.com/flatsurf/sage-flatsurf/pull/158.



---

archive/issue_comments_559475.json:
```json
{
    "body": "<a id='comment:2'>Comment 2:</a>\nThere are two problems.\n\nFirst of all, the difference of treatment between number fields and AA is not desirable\n\n```\nsage: type(RealLazyField()(a))\n<class 'sage.rings.real_lazy.LazyBinop'>\nsage: type(RealLazyField()(AA(a)))\n<class 'sage.rings.real_lazy.LazyWrapper'>\n```\nFurthermore, the conversion from number field is extremly weird\n\n```\nsage: RLF = RealLazyField()\nsage: x = RLF(a) # this is ((1 * a) + 0)\nsage: x._op\n<built-in function add>\nsage: (x._left, type(x._left))\n(1.414213562373095?, <class 'sage.rings.real_lazy.LazyBinop'>)\nsage: (x._right, type(x._right))\n(0, <class 'sage.rings.real_lazy.LazyWrapper'>)\nsage: (x._left._left, type(x._left._left))\n(1, <class 'sage.rings.real_lazy.LazyWrapper'>)\nsage: (x._left._right, type(x._left._right))\n(1.414213562373095?, <class 'sage.rings.real_lazy.LazyAlgebraic'>)\n```\nThe conversions indeed differ\n\n```\nsage: type(RLF.convert_map_from(AA))\n<class 'sage.rings.real_lazy.LazyWrapperMorphism'>\nsage: type(RLF.convert_map_from(K))\n<class 'sage.rings.number_field.number_field_morphisms.NumberFieldEmbedding'>\n```\nAnd the conversion from the number field works as `a.polynomial()(K_gen_image)` which is less efficient than the `AA` version which directly wraps the element.\n\nSecondly, the one can not assume that the `RealLazyField` element at hand is a `LazyWrapper` with an underlying `_value`.",
    "created_at": "2022-08-26T08:13:40Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/34438",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/34438#issuecomment-559475",
    "user": "https://github.com/videlec"
}
```

<a id='comment:2'>Comment 2:</a>
There are two problems.

First of all, the difference of treatment between number fields and AA is not desirable

```
sage: type(RealLazyField()(a))
<class 'sage.rings.real_lazy.LazyBinop'>
sage: type(RealLazyField()(AA(a)))
<class 'sage.rings.real_lazy.LazyWrapper'>
```
Furthermore, the conversion from number field is extremly weird

```
sage: RLF = RealLazyField()
sage: x = RLF(a) # this is ((1 * a) + 0)
sage: x._op
<built-in function add>
sage: (x._left, type(x._left))
(1.414213562373095?, <class 'sage.rings.real_lazy.LazyBinop'>)
sage: (x._right, type(x._right))
(0, <class 'sage.rings.real_lazy.LazyWrapper'>)
sage: (x._left._left, type(x._left._left))
(1, <class 'sage.rings.real_lazy.LazyWrapper'>)
sage: (x._left._right, type(x._left._right))
(1.414213562373095?, <class 'sage.rings.real_lazy.LazyAlgebraic'>)
```
The conversions indeed differ

```
sage: type(RLF.convert_map_from(AA))
<class 'sage.rings.real_lazy.LazyWrapperMorphism'>
sage: type(RLF.convert_map_from(K))
<class 'sage.rings.number_field.number_field_morphisms.NumberFieldEmbedding'>
```
And the conversion from the number field works as `a.polynomial()(K_gen_image)` which is less efficient than the `AA` version which directly wraps the element.

Secondly, the one can not assume that the `RealLazyField` element at hand is a `LazyWrapper` with an underlying `_value`.



---

archive/issue_comments_559476.json:
```json
{
    "body": "<a id='comment:4'>Comment 4:</a>\nThe underlying problem for the conversion is that the conversion to `RR` goes via `RLF`.\n\n```\nsage: RR.coerce_map_from(K)\nComposite map:\n  From: Number Field in a with defining polynomial x^2 - 2 with a = 1.414213562373095?\n  To:   Real Field with 53 bits of precision\n  Defn:   Generic morphism:\n          From: Number Field in a with defining polynomial x^2 - 2 with a = 1.414213562373095?\n          To:   Real Lazy Field\n          Defn: a -> 1.414213562373095?\n        then\n          Conversion via _mpfr_ method map:\n          From: Real Lazy Field\n          To:   Real Field with 53 bits of precision\n```\nThe code path in `LazyField._coerce_map_from_` (`sage/rings/real_lazy.pyx` lines 128-183) refuses to use wrapper in this situation.",
    "created_at": "2022-08-26T08:35:59Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/34438",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/34438#issuecomment-559476",
    "user": "https://github.com/videlec"
}
```

<a id='comment:4'>Comment 4:</a>
The underlying problem for the conversion is that the conversion to `RR` goes via `RLF`.

```
sage: RR.coerce_map_from(K)
Composite map:
  From: Number Field in a with defining polynomial x^2 - 2 with a = 1.414213562373095?
  To:   Real Field with 53 bits of precision
  Defn:   Generic morphism:
          From: Number Field in a with defining polynomial x^2 - 2 with a = 1.414213562373095?
          To:   Real Lazy Field
          Defn: a -> 1.414213562373095?
        then
          Conversion via _mpfr_ method map:
          From: Real Lazy Field
          To:   Real Field with 53 bits of precision
```
The code path in `LazyField._coerce_map_from_` (`sage/rings/real_lazy.pyx` lines 128-183) refuses to use wrapper in this situation.



---

archive/issue_comments_559477.json:
```json
{
    "body": "<a id='comment:5'>Comment 5:</a>\nThe trick is probably to implement the coercion from number fields to the real field. I'll give it a try.",
    "created_at": "2022-08-26T09:14:49Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/34438",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/34438#issuecomment-559477",
    "user": "https://github.com/saraedum"
}
```

<a id='comment:5'>Comment 5:</a>
The trick is probably to implement the coercion from number fields to the real field. I'll give it a try.



---

archive/issue_comments_559478.json:
```json
{
    "body": "<a id='comment:6'>Comment 6:</a>\nReplying to [@saraedum](#comment%3A5):\n> The trick is probably to implement the coercion from number fields to the real field. I'll give it a try.\n\nIdeally this should go via the `NumberFieldElement._mpfr_` method (as the `_arb_` coercion does). Though\n- it does not\n- the `_mpfr_` method sucks",
    "created_at": "2022-08-26T09:28:14Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/34438",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/34438#issuecomment-559478",
    "user": "https://github.com/videlec"
}
```

<a id='comment:6'>Comment 6:</a>
Replying to [@saraedum](#comment%3A5):
> The trick is probably to implement the coercion from number fields to the real field. I'll give it a try.

Ideally this should go via the `NumberFieldElement._mpfr_` method (as the `_arb_` coercion does). Though
- it does not
- the `_mpfr_` method sucks



---

archive/issue_events_437483.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-09-19T18:58:47Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/34438",
    "milestone_number": null,
    "milestone_title": "sage-9.7",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/34438#event-437483"
}
```



---

archive/issue_events_437484.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-09-19T18:58:47Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/34438",
    "milestone_number": null,
    "milestone_title": "sage-9.8",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/34438#event-437484"
}
```
