# Issue 34438: Interval sets cannot be constructed from embedded number field elements

archive/issues_034201.json:
```json
{
    "body": "Currently, the following fails:\n\n```\nsage: K.<a> = NumberField(x^2 - 2, embedding=1)\nsage: RealSet.unbounded_below_closed(a)\nAttributeError: 'sage.rings.real_lazy.LazyBinop' object has no attribute '_value'\n```\n\nHowever, this works:\n\n```\nsage: RealSet.unbounded_below_closed(AA(a))\n(-oo, 1.414213562373095?]\n```\n\nCC:  @videlec @slel @yuan-zhou\n\nStatus: new\n\nIssue created by migration from https://trac.sagemath.org/ticket/34438\n\n",
    "created_at": "2022-08-26T07:49:06Z",
    "labels": [
        "component: number fields",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-9.8",
    "title": "Interval sets cannot be constructed from embedded number field elements",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/34438",
    "user": "https://github.com/saraedum"
}
```
Currently, the following fails:

```
sage: K.<a> = NumberField(x^2 - 2, embedding=1)
sage: RealSet.unbounded_below_closed(a)
AttributeError: 'sage.rings.real_lazy.LazyBinop' object has no attribute '_value'
```

However, this works:

```
sage: RealSet.unbounded_below_closed(AA(a))
(-oo, 1.414213562373095?]
```

CC:  @videlec @slel @yuan-zhou

Status: new

Issue created by migration from https://trac.sagemath.org/ticket/34438





---

archive/issue_comments_686049.json:
```json
{
    "body": "<a id='comment:1'></a>This affects the hyperbolic code at https://github.com/flatsurf/sage-flatsurf/pull/158.",
    "created_at": "2022-08-26T07:49:24Z",
    "issue": "https://github.com/sagemath/sagetest/issues/34438",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/34438#issuecomment-686049",
    "user": "https://github.com/saraedum"
}
```

<a id='comment:1'></a>This affects the hyperbolic code at https://github.com/flatsurf/sage-flatsurf/pull/158.



---

archive/issue_comments_686050.json:
```json
{
    "body": "<a id='comment:2'></a>There are two problems.\n\nFirst of all, the difference of treatment between number fields and AA is not desirable\n\n```\nsage: type(RealLazyField()(a))\n<class 'sage.rings.real_lazy.LazyBinop'>\nsage: type(RealLazyField()(AA(a)))\n<class 'sage.rings.real_lazy.LazyWrapper'>\n```\nFurthermore, the conversion from number field is extremly weird\n\n```\nsage: RLF = RealLazyField()\nsage: x = RLF(a) # this is ((1 * a) + 0)\nsage: x._op\n<built-in function add>\nsage: (x._left, type(x._left))\n(1.414213562373095?, <class 'sage.rings.real_lazy.LazyBinop'>)\nsage: (x._right, type(x._right))\n(0, <class 'sage.rings.real_lazy.LazyWrapper'>)\nsage: (x._left._left, type(x._left._left))\n(1, <class 'sage.rings.real_lazy.LazyWrapper'>)\nsage: (x._left._right, type(x._left._right))\n(1.414213562373095?, <class 'sage.rings.real_lazy.LazyAlgebraic'>)\n```\nThe conversions indeed differ\n\n```\nsage: type(RLF.convert_map_from(AA))\n<class 'sage.rings.real_lazy.LazyWrapperMorphism'>\nsage: type(RLF.convert_map_from(K))\n<class 'sage.rings.number_field.number_field_morphisms.NumberFieldEmbedding'>\n```\nAnd the conversion from the number field works as `a.polynomial()(K_gen_image)` which is less efficient than the `AA` version which directly wraps the element.\n\nSecondly, the one can not assume that the `RealLazyField` element at hand is a `LazyWrapper` with an underlying `_value`.",
    "created_at": "2022-08-26T08:13:40Z",
    "issue": "https://github.com/sagemath/sagetest/issues/34438",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/34438#issuecomment-686050",
    "user": "https://github.com/videlec"
}
```

<a id='comment:2'></a>There are two problems.

First of all, the difference of treatment between number fields and AA is not desirable

```
sage: type(RealLazyField()(a))
<class 'sage.rings.real_lazy.LazyBinop'>
sage: type(RealLazyField()(AA(a)))
<class 'sage.rings.real_lazy.LazyWrapper'>
```
Furthermore, the conversion from number field is extremly weird

```
sage: RLF = RealLazyField()
sage: x = RLF(a) # this is ((1 * a) + 0)
sage: x._op
<built-in function add>
sage: (x._left, type(x._left))
(1.414213562373095?, <class 'sage.rings.real_lazy.LazyBinop'>)
sage: (x._right, type(x._right))
(0, <class 'sage.rings.real_lazy.LazyWrapper'>)
sage: (x._left._left, type(x._left._left))
(1, <class 'sage.rings.real_lazy.LazyWrapper'>)
sage: (x._left._right, type(x._left._right))
(1.414213562373095?, <class 'sage.rings.real_lazy.LazyAlgebraic'>)
```
The conversions indeed differ

```
sage: type(RLF.convert_map_from(AA))
<class 'sage.rings.real_lazy.LazyWrapperMorphism'>
sage: type(RLF.convert_map_from(K))
<class 'sage.rings.number_field.number_field_morphisms.NumberFieldEmbedding'>
```
And the conversion from the number field works as `a.polynomial()(K_gen_image)` which is less efficient than the `AA` version which directly wraps the element.

Secondly, the one can not assume that the `RealLazyField` element at hand is a `LazyWrapper` with an underlying `_value`.



---

archive/issue_comments_686051.json:
```json
{
    "body": "<a id='comment:4'></a>The underlying problem for the conversion is that the conversion to `RR` goes via `RLF`.\n\n```\nsage: RR.coerce_map_from(K)\nComposite map:\n  From: Number Field in a with defining polynomial x^2 - 2 with a = 1.414213562373095?\n  To:   Real Field with 53 bits of precision\n  Defn:   Generic morphism:\n          From: Number Field in a with defining polynomial x^2 - 2 with a = 1.414213562373095?\n          To:   Real Lazy Field\n          Defn: a -> 1.414213562373095?\n        then\n          Conversion via _mpfr_ method map:\n          From: Real Lazy Field\n          To:   Real Field with 53 bits of precision\n```\nThe code path in `LazyField._coerce_map_from_` (`sage/rings/real_lazy.pyx` lines 128-183) refuses to use wrapper in this situation.",
    "created_at": "2022-08-26T08:35:59Z",
    "issue": "https://github.com/sagemath/sagetest/issues/34438",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/34438#issuecomment-686051",
    "user": "https://github.com/videlec"
}
```

<a id='comment:4'></a>The underlying problem for the conversion is that the conversion to `RR` goes via `RLF`.

```
sage: RR.coerce_map_from(K)
Composite map:
  From: Number Field in a with defining polynomial x^2 - 2 with a = 1.414213562373095?
  To:   Real Field with 53 bits of precision
  Defn:   Generic morphism:
          From: Number Field in a with defining polynomial x^2 - 2 with a = 1.414213562373095?
          To:   Real Lazy Field
          Defn: a -> 1.414213562373095?
        then
          Conversion via _mpfr_ method map:
          From: Real Lazy Field
          To:   Real Field with 53 bits of precision
```
The code path in `LazyField._coerce_map_from_` (`sage/rings/real_lazy.pyx` lines 128-183) refuses to use wrapper in this situation.



---

archive/issue_comments_686052.json:
```json
{
    "body": "<a id='comment:5'></a>The trick is probably to implement the coercion from number fields to the real field. I'll give it a try.",
    "created_at": "2022-08-26T09:14:49Z",
    "issue": "https://github.com/sagemath/sagetest/issues/34438",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/34438#issuecomment-686052",
    "user": "https://github.com/saraedum"
}
```

<a id='comment:5'></a>The trick is probably to implement the coercion from number fields to the real field. I'll give it a try.



---

archive/issue_comments_686053.json:
```json
{
    "body": "<a id='comment:6'></a>Replying to [comment:5 saraedum]:\n> The trick is probably to implement the coercion from number fields to the real field. I'll give it a try.\n\n\nIdeally this should go via the `NumberFieldElement._mpfr_` method (as the `_arb_` coercion does). Though\n- it does not\n- the `_mpfr_` method sucks",
    "created_at": "2022-08-26T09:28:14Z",
    "issue": "https://github.com/sagemath/sagetest/issues/34438",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/34438#issuecomment-686053",
    "user": "https://github.com/videlec"
}
```

<a id='comment:6'></a>Replying to [comment:5 saraedum]:
> The trick is probably to implement the coercion from number fields to the real field. I'll give it a try.


Ideally this should go via the `NumberFieldElement._mpfr_` method (as the `_arb_` coercion does). Though
- it does not
- the `_mpfr_` method sucks



---

archive/issue_events_089522.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-09-19T18:58:47Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/34438",
    "milestone": "sage-9.8",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/34438#event-89522"
}
```
