# Issue 27897: sqrt(abs(1+I)^2 + 14) evaluates to sqrt(16) instead of 4

archive/issues_027660.json:
```json
{
    "body": "There is some weird undesirable \"holding\" going on:\n\n```\nsage: sqrt(abs(1+I)^2 + 14)\nsqrt(16)\n```\n\nFound in [Ask SageMath question #46698: Sagemath not evaluating complicated expression](https://ask.sagemath.org/question/46698/sagemath-not-evaluating-complicated-expression/).\n\nKeywords: sqrt,abs,complex,hold,holding\n\nAuthor: Dave Morris\n\nBranch: public/27897\n\nStatus: needs_work\n\nCommit: a3303105570ca4ad4fecb896cb19543029c3da00\n\nIssue created by migration from https://trac.sagemath.org/ticket/27897\n\n",
    "created_at": "2019-05-30T15:16:39Z",
    "labels": [
        "component: symbolics",
        "bug"
    ],
    "title": "sqrt(abs(1+I)^2 + 14) evaluates to sqrt(16) instead of 4",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/27897",
    "user": "https://github.com/rburing"
}
```
There is some weird undesirable "holding" going on:

```
sage: sqrt(abs(1+I)^2 + 14)
sqrt(16)
```

Found in [Ask SageMath question #46698: Sagemath not evaluating complicated expression](https://ask.sagemath.org/question/46698/sagemath-not-evaluating-complicated-expression/).

Keywords: sqrt,abs,complex,hold,holding

Author: Dave Morris

Branch: public/27897

Status: needs_work

Commit: a3303105570ca4ad4fecb896cb19543029c3da00

Issue created by migration from https://trac.sagemath.org/ticket/27897





---

archive/issue_comments_541284.json:
```json
{
    "body": "<a id='comment:1'></a>\nIt looks like there is some double wrapping happening here:\n\n```\nsage: (1+I).pyobject().parent()\nNumber Field in I with defining polynomial x^2 + 1\nsage: abs(1+I).pyobject().parent()\nSymbolic Ring\nsage: (abs(1+I)^2).pyobject().parent()\nSymbolic Ring\n```\nhere things seem to be still reasonable. However, this last result is \"double wrapped\":\n\n```\nsage: (abs(1+I)^2).pyobject().pyobject().parent()\nRational Field\n```\nand it looks like that's too deep for `sqrt` to see through. It doesn't happen for this case:\n\n```\nsage: (abs(sqrt(2))^2).pyobject().parent()\nInteger Ring\n```\n\n---\nthat could be a red herring, though:\n\n```\nsage: b=(1+I)*(1-I)+14\nsage: b.pyobject().parent() #this is appropriate\nNumber Field in I with defining polynomial x^2 + 1\nsage: sqrt(b)\nsqrt(16)\nsage: sqrt(b.pyobject())\n4\n```\nIt means that\n\n```\nsage: a=sqrt(abs((1+I))^2+14)\nsage: b=sqrt(norm(1+I)+14)\n```\nboth lead to unexpectedly \"held\" expressions, but with different structures:\n\n```\nsage: a.operands()[0].pyobject().parent()\nSymbolic Ring\nsage: a.operands()[0].pyobject().pyobject().parent()\nRational Field\nsage: b.operands()[0].pyobject().parent()\nNumber Field in I with defining polynomial x^2 + 1\n```\nwhere\n\n```\nsage: b.operands()[0].pyobject().sqrt()\n4\n```\nso perhaps both problems are solved if `sqrt` on an `SR` element would look a little deeper.",
    "created_at": "2019-05-30T16:50:34Z",
    "issue": "https://github.com/sagemath/sagetest/issues/27897",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/27897#issuecomment-541284",
    "user": "https://github.com/nbruin"
}
```

<a id='comment:1'></a>
It looks like there is some double wrapping happening here:

```
sage: (1+I).pyobject().parent()
Number Field in I with defining polynomial x^2 + 1
sage: abs(1+I).pyobject().parent()
Symbolic Ring
sage: (abs(1+I)^2).pyobject().parent()
Symbolic Ring
```
here things seem to be still reasonable. However, this last result is "double wrapped":

```
sage: (abs(1+I)^2).pyobject().pyobject().parent()
Rational Field
```
and it looks like that's too deep for `sqrt` to see through. It doesn't happen for this case:

```
sage: (abs(sqrt(2))^2).pyobject().parent()
Integer Ring
```

---
that could be a red herring, though:

```
sage: b=(1+I)*(1-I)+14
sage: b.pyobject().parent() #this is appropriate
Number Field in I with defining polynomial x^2 + 1
sage: sqrt(b)
sqrt(16)
sage: sqrt(b.pyobject())
4
```
It means that

```
sage: a=sqrt(abs((1+I))^2+14)
sage: b=sqrt(norm(1+I)+14)
```
both lead to unexpectedly "held" expressions, but with different structures:

```
sage: a.operands()[0].pyobject().parent()
Symbolic Ring
sage: a.operands()[0].pyobject().pyobject().parent()
Rational Field
sage: b.operands()[0].pyobject().parent()
Number Field in I with defining polynomial x^2 + 1
```
where

```
sage: b.operands()[0].pyobject().sqrt()
4
```
so perhaps both problems are solved if `sqrt` on an `SR` element would look a little deeper.



---

archive/issue_comments_541285.json:
```json
{
    "body": "<a id='comment:2'></a>\nAs the Sage-8.8 release milestone is pending, we should delete the sage-8.8 milestone for tickets that are not actively being worked on or that still require significant work to move forward.  If you feel that this ticket should be included in the next Sage release at the soonest please set its milestone to the next release milestone (sage-8.9).",
    "created_at": "2019-06-14T14:55:02Z",
    "issue": "https://github.com/sagemath/sagetest/issues/27897",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/27897#issuecomment-541285",
    "user": "https://github.com/embray"
}
```

<a id='comment:2'></a>
As the Sage-8.8 release milestone is pending, we should delete the sage-8.8 milestone for tickets that are not actively being worked on or that still require significant work to move forward.  If you feel that this ticket should be included in the next Sage release at the soonest please set its milestone to the next release milestone (sage-8.9).



---

archive/issue_comments_541286.json:
```json
{
    "body": "Changing branch from \"\" to \"public/27897\"",
    "created_at": "2021-01-24T01:19:15Z",
    "issue": "https://github.com/sagemath/sagetest/issues/27897",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/27897#issuecomment-541286",
    "user": "https://github.com/DaveWitteMorris"
}
```

Changing branch from "" to "public/27897"



---

archive/issue_comments_541287.json:
```json
{
    "body": "<a id='comment:4'></a>\nI think the problem is gone:\n\n```\nsage: sqrt(abs(1+I)^2 + 14)                                                  \n4\n```\nThis is with 9.3b6 on MacOS 10.15.7, but I get `sqrt(16)` with 9.2 on `CoCalc`, so something seems to have changed since then.\n\nThe PR adds a doctest. If the patchbots turn green, then I think we can close this ticket. \n\n---\nNew commits:\n|                                                                                                                                          |                             |\n|------------------------------------------------------------------------------------------------------------------------------------------|-----------------------------|\n|[357ba2f](https://github.com/sagemath/sagetrac-mirror/commit/357ba2ff7d46ac72cd9ff5968b4755f39554fabf)|`doctest trac 27897 sqrt(16)`|",
    "created_at": "2021-01-24T01:24:52Z",
    "issue": "https://github.com/sagemath/sagetest/issues/27897",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/27897#issuecomment-541287",
    "user": "https://github.com/DaveWitteMorris"
}
```

<a id='comment:4'></a>
I think the problem is gone:

```
sage: sqrt(abs(1+I)^2 + 14)                                                  
4
```
This is with 9.3b6 on MacOS 10.15.7, but I get `sqrt(16)` with 9.2 on `CoCalc`, so something seems to have changed since then.

The PR adds a doctest. If the patchbots turn green, then I think we can close this ticket. 

---
New commits:
|                                                                                                                                          |                             |
|------------------------------------------------------------------------------------------------------------------------------------------|-----------------------------|
|[357ba2f](https://github.com/sagemath/sagetrac-mirror/commit/357ba2ff7d46ac72cd9ff5968b4755f39554fabf)|`doctest trac 27897 sqrt(16)`|



---

archive/issue_comments_541288.json:
```json
{
    "body": "Changing commit from \"\" to \"357ba2ff7d46ac72cd9ff5968b4755f39554fabf\"",
    "created_at": "2021-01-24T01:24:52Z",
    "issue": "https://github.com/sagemath/sagetest/issues/27897",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/27897#issuecomment-541288",
    "user": "https://github.com/DaveWitteMorris"
}
```

Changing commit from "" to "357ba2ff7d46ac72cd9ff5968b4755f39554fabf"



---

archive/issue_comments_541289.json:
```json
{
    "body": "Changing author from \"\" to \"Dave Morris\"",
    "created_at": "2021-01-24T01:24:52Z",
    "issue": "https://github.com/sagemath/sagetest/issues/27897",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/27897#issuecomment-541289",
    "user": "https://github.com/DaveWitteMorris"
}
```

Changing author from "" to "Dave Morris"



---

archive/issue_comments_541290.json:
```json
{
    "body": "Changing status from new to needs_review.",
    "created_at": "2021-01-24T01:24:52Z",
    "issue": "https://github.com/sagemath/sagetest/issues/27897",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/27897#issuecomment-541290",
    "user": "https://github.com/DaveWitteMorris"
}
```

Changing status from new to needs_review.



---

archive/issue_comments_541291.json:
```json
{
    "body": "<a id='comment:5'></a>\nI don't have 9.3beta6 here, but I think the definition/parent of `I` has changed, which may well have hidden this bug instead of fixing it. Could you please check `sqrt(abs(1+SR(I))^2 + 14)`? The doctest would have to take this form (or similar) as well.",
    "created_at": "2021-01-24T11:02:06Z",
    "issue": "https://github.com/sagemath/sagetest/issues/27897",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/27897#issuecomment-541291",
    "user": "https://github.com/rburing"
}
```

<a id='comment:5'></a>
I don't have 9.3beta6 here, but I think the definition/parent of `I` has changed, which may well have hidden this bug instead of fixing it. Could you please check `sqrt(abs(1+SR(I))^2 + 14)`? The doctest would have to take this form (or similar) as well.



---

archive/issue_comments_541292.json:
```json
{
    "body": "Changing commit from \"357ba2ff7d46ac72cd9ff5968b4755f39554fabf\" to \"a3303105570ca4ad4fecb896cb19543029c3da00\"",
    "created_at": "2021-01-24T17:33:46Z",
    "issue": "https://github.com/sagemath/sagetest/issues/27897",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/27897#issuecomment-541292",
    "user": "https://trac.sagemath.org/admin/accounts/users/git"
}
```

Changing commit from "357ba2ff7d46ac72cd9ff5968b4755f39554fabf" to "a3303105570ca4ad4fecb896cb19543029c3da00"



---

archive/issue_comments_541293.json:
```json
{
    "body": "<a id='comment:6'></a>\nBranch pushed to git repo; I updated commit sha1. New commits:\n|                                                                                                                                           |                   |\n|-------------------------------------------------------------------------------------------------------------------------------------------|-------------------|\n|[a330310](https://github.com/sagemath/sagetrac-mirror/commit/a3303105570ca4ad4fecb896cb19543029c3da00)|`review correction`|",
    "created_at": "2021-01-24T17:33:46Z",
    "issue": "https://github.com/sagemath/sagetest/issues/27897",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/27897#issuecomment-541293",
    "user": "https://trac.sagemath.org/admin/accounts/users/git"
}
```

<a id='comment:6'></a>
Branch pushed to git repo; I updated commit sha1. New commits:
|                                                                                                                                           |                   |
|-------------------------------------------------------------------------------------------------------------------------------------------|-------------------|
|[a330310](https://github.com/sagemath/sagetrac-mirror/commit/a3303105570ca4ad4fecb896cb19543029c3da00)|`review correction`|



---

archive/issue_comments_541294.json:
```json
{
    "body": "<a id='comment:7'></a>\nYou're right -- thanks for catching this!  With 9.3b6, we still have:\n\n```\nsage: sqrt(abs(1 + SR.I())^2 + 14)\nsqrt(16)\n```\nTicket #18036 changed the parent of I to be a number field.",
    "created_at": "2021-01-24T17:35:12Z",
    "issue": "https://github.com/sagemath/sagetest/issues/27897",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/27897#issuecomment-541294",
    "user": "https://github.com/DaveWitteMorris"
}
```

<a id='comment:7'></a>
You're right -- thanks for catching this!  With 9.3b6, we still have:

```
sage: sqrt(abs(1 + SR.I())^2 + 14)
sqrt(16)
```
Ticket #18036 changed the parent of I to be a number field.



---

archive/issue_comments_541295.json:
```json
{
    "body": "Changing status from needs_review to needs_work.",
    "created_at": "2021-01-24T17:35:12Z",
    "issue": "https://github.com/sagemath/sagetest/issues/27897",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/27897#issuecomment-541295",
    "user": "https://github.com/DaveWitteMorris"
}
```

Changing status from needs_review to needs_work.
