# Issue 22027: Simplifying 0**x gives 0, with no assumptions on x

archive/issues_021790.json:
```json
{
    "body": "Check this:\n\n```python\nsage: simplify(0**x)\n0\n```\nbut\n\n```python\nsage: 0**0\n1\n```\n\n**Keywords:** simplify\n\n**Upstream:** Not yet reported upstream; Will do shortly.\n\nIssue created by migration from https://trac.sagemath.org/ticket/22027\n\n",
    "created_at": "2016-12-06T12:57:16Z",
    "labels": [
        "component: symbolics",
        "critical",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-7.5",
    "title": "Simplifying 0**x gives 0, with no assumptions on x",
    "type": "issue",
    "url": "https://github.com/sagemath/sage/issues/22027",
    "user": "https://github.com/pelegm"
}
```
Check this:

```python
sage: simplify(0**x)
0
```
but

```python
sage: 0**0
1
```

**Keywords:** simplify

**Upstream:** Not yet reported upstream; Will do shortly.

Issue created by migration from https://trac.sagemath.org/ticket/22027





---

archive/issue_comments_326953.json:
```json
{
    "body": "<a id='comment:1'></a>\nThat is a Maxima bug.",
    "created_at": "2017-01-14T08:08:54Z",
    "issue": "https://github.com/sagemath/sage/issues/22027",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/22027#issuecomment-326953",
    "user": "https://github.com/rwst"
}
```

<a id='comment:1'></a>
That is a Maxima bug.



---

archive/issue_comments_326954.json:
```json
{
    "body": "<a id='comment:2'></a>\nAre we ok with sage returning 1 for 0^0? This is the case in Python, but in Maxima is it undefined.\n\nIs maxima under active development? Should we report that issue there?\n\nNote that sympy handles this properly:\n\n```\nIn [6]: sympy.simplify(0**x)\nOut[6]: 0**x\n```",
    "created_at": "2018-06-29T14:32:14Z",
    "issue": "https://github.com/sagemath/sage/issues/22027",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/22027#issuecomment-326954",
    "user": "https://github.com/pelegm"
}
```

<a id='comment:2'></a>
Are we ok with sage returning 1 for 0^0? This is the case in Python, but in Maxima is it undefined.

Is maxima under active development? Should we report that issue there?

Note that sympy handles this properly:

```
In [6]: sympy.simplify(0**x)
Out[6]: 0**x
```



---

archive/issue_comments_326955.json:
```json
{
    "body": "<a id='comment:3'></a>\nSingular says `0^n = 0` (where `n` must be an integer):\n\n```\nCanonicalForm\npower ( const CanonicalForm & f, int n )\n{\n  ASSERT( n >= 0, \"illegal exponent\" );\n\n  if ( f.isZero() )\n    return CanonicalForm(0L);\n  ...\n```\nI would say this is clearly wrong: `x^0` needs to be `1` for all `x` if the exponent is an integer variable.",
    "created_at": "2021-02-26T03:18:59Z",
    "issue": "https://github.com/sagemath/sage/issues/22027",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/22027#issuecomment-326955",
    "user": "https://github.com/DaveWitteMorris"
}
```

<a id='comment:3'></a>
Singular says `0^n = 0` (where `n` must be an integer):

```
CanonicalForm
power ( const CanonicalForm & f, int n )
{
  ASSERT( n >= 0, "illegal exponent" );

  if ( f.isZero() )
    return CanonicalForm(0L);
  ...
```
I would say this is clearly wrong: `x^0` needs to be `1` for all `x` if the exponent is an integer variable.



---

archive/issue_comments_326956.json:
```json
{
    "body": "<a id='comment:4'></a>\n[Ask Sage question 61400](https://ask.sagemath.org/question/61400) makes me raise the priority of this one.\n\nOne should note that\n\n- Sympy does not give an explicit 1 and returns the sum unevaluated\n- Giac returns `undef`\n- Mathematica raises an error claiming that `0^0` is indeterminate\n\nFurthermore:\n\n```\nsage: sum(x^j/factorial(j),j,0,oo)\ne^x\nsage: sum(x^j/factorial(j),j,0,oo).limit(x=0)\n1\nsage: sum(x^j/factorial(j),j,0,oo).subs(x=0)\n1\n```\n\nBut, indeed:\n\n```\nsage: with assuming(j, \"integer\", j >= 0): 0^j\n0^j\nsage: with assuming(j, \"integer\", j >= 0): (0^j).simplify()\n0\n```\n\nSince `simplify` does its work by passing its argument to Maxima,\nand uses the returned value as a result, the ball is well in Maxima's camp...",
    "created_at": "2022-03-05T14:44:10Z",
    "issue": "https://github.com/sagemath/sage/issues/22027",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/22027#issuecomment-326956",
    "user": "https://github.com/EmmanuelCharpentier"
}
```

<a id='comment:4'></a>
[Ask Sage question 61400](https://ask.sagemath.org/question/61400) makes me raise the priority of this one.

One should note that

- Sympy does not give an explicit 1 and returns the sum unevaluated
- Giac returns `undef`
- Mathematica raises an error claiming that `0^0` is indeterminate

Furthermore:

```
sage: sum(x^j/factorial(j),j,0,oo)
e^x
sage: sum(x^j/factorial(j),j,0,oo).limit(x=0)
1
sage: sum(x^j/factorial(j),j,0,oo).subs(x=0)
1
```

But, indeed:

```
sage: with assuming(j, "integer", j >= 0): 0^j
0^j
sage: with assuming(j, "integer", j >= 0): (0^j).simplify()
0
```

Since `simplify` does its work by passing its argument to Maxima,
and uses the returned value as a result, the ball is well in Maxima's camp...



---

archive/issue_events_196903.json:
```json
{
    "actor": "https://github.com/EmmanuelCharpentier",
    "created_at": "2022-03-05T14:44:10Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/22027",
    "label": "critical",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/22027#event-196903"
}
```



---

archive/issue_comments_326957.json:
```json
{
    "body": "**Upstream:** Not yet reported upstream; Will do shortly.",
    "created_at": "2022-03-05T14:44:10Z",
    "issue": "https://github.com/sagemath/sage/issues/22027",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/22027#issuecomment-326957",
    "user": "https://github.com/EmmanuelCharpentier"
}
```

**Upstream:** Not yet reported upstream; Will do shortly.



---

archive/issue_comments_326958.json:
```json
{
    "body": "<a id='comment:5'></a>\nThe \"maxima-discuss\" mailing list had a thread last month\nabout zero to the zero:\n\n- https://sourceforge.net/p/maxima/mailman/message/37606840/\n\n(from there click \"View entire thread\").",
    "created_at": "2022-03-06T00:38:12Z",
    "issue": "https://github.com/sagemath/sage/issues/22027",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/22027#issuecomment-326958",
    "user": "https://github.com/slel"
}
```

<a id='comment:5'></a>
The "maxima-discuss" mailing list had a thread last month
about zero to the zero:

- https://sourceforge.net/p/maxima/mailman/message/37606840/

(from there click "View entire thread").
