# Issue 22075: it should not be possible to set an entry of a vector in a submodule

archive/issues_021838.json:
```json
{
    "body": "\n```python\nsage: V = VectorSpace(QQ, 3)\nsage: M = V.subspace([(1,0,0,),(0,1,0)])\nsage: v = M()\nsage: v\n(0, 0, 0)\nsage: v[2] = 2 # bug\nsage: v\n(0, 0, 2)\nsage: v.parent()\nVector space of degree 3 and dimension 2 over Rational Field\nBasis matrix:\n[1 0 0]\n[0 1 0]\nsage: v in M # bug consequence 1\nTrue\nsage: V(v)   # bug consequence 2\n(0, 0, 0)\n```\n\nSee also:\n- [this sage-devel thread from december 2016](https://groups.google.com/forum/#!topic/sage-devel/uzN-2NhrVGc)\n- [this sage-devel thread from may 2015](https://groups.google.com/forum/#!topic/sage-devel/rvs5E6AEXVc)\n\nKeywords: bug\n\nStatus: new\n\nIssue created by migration from https://trac.sagemath.org/ticket/22075\n\n",
    "created_at": "2016-12-19T08:56:40Z",
    "labels": [
        "component: algebra",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-7.5",
    "title": "it should not be possible to set an entry of a vector in a submodule",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/22075",
    "user": "https://github.com/videlec"
}
```

```python
sage: V = VectorSpace(QQ, 3)
sage: M = V.subspace([(1,0,0,),(0,1,0)])
sage: v = M()
sage: v
(0, 0, 0)
sage: v[2] = 2 # bug
sage: v
(0, 0, 2)
sage: v.parent()
Vector space of degree 3 and dimension 2 over Rational Field
Basis matrix:
[1 0 0]
[0 1 0]
sage: v in M # bug consequence 1
True
sage: V(v)   # bug consequence 2
(0, 0, 0)
```

See also:
- [this sage-devel thread from december 2016](https://groups.google.com/forum/#!topic/sage-devel/uzN-2NhrVGc)
- [this sage-devel thread from may 2015](https://groups.google.com/forum/#!topic/sage-devel/rvs5E6AEXVc)

Keywords: bug

Status: new

Issue created by migration from https://trac.sagemath.org/ticket/22075





---

archive/issue_comments_403017.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -18,3 +18,5 @@\n sage: V(v)   # bug consequence 2\n (0, 0, 0)\n ```\n+\n+See also [this sage-devel thread](https://groups.google.com/forum/#!topic/sage-devel/uzN-2NhrVGc)\n``````\n",
    "created_at": "2016-12-19T09:04:37Z",
    "issue": "https://github.com/sagemath/sagetest/issues/22075",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/22075#issuecomment-403017",
    "user": "https://github.com/videlec"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -18,3 +18,5 @@
 sage: V(v)   # bug consequence 2
 (0, 0, 0)
 ```
+
+See also [this sage-devel thread](https://groups.google.com/forum/#!topic/sage-devel/uzN-2NhrVGc)
``````




---

archive/issue_comments_403018.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -19,4 +19,6 @@\n (0, 0, 0)\n ```\n \n-See also [this sage-devel thread](https://groups.google.com/forum/#!topic/sage-devel/uzN-2NhrVGc)\n+See also:\n+- [this sage-devel thread from december 2016](https://groups.google.com/forum/#!topic/sage-devel/uzN-2NhrVGc)\n+- [this sage-devel thread from may 2015](https://groups.google.com/forum/#!topic/sage-devel/rvs5E6AEXVc)\n``````\n",
    "created_at": "2016-12-19T12:39:14Z",
    "issue": "https://github.com/sagemath/sagetest/issues/22075",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/22075#issuecomment-403018",
    "user": "https://github.com/videlec"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -19,4 +19,6 @@
 (0, 0, 0)
 ```
 
-See also [this sage-devel thread](https://groups.google.com/forum/#!topic/sage-devel/uzN-2NhrVGc)
+See also:
+- [this sage-devel thread from december 2016](https://groups.google.com/forum/#!topic/sage-devel/uzN-2NhrVGc)
+- [this sage-devel thread from may 2015](https://groups.google.com/forum/#!topic/sage-devel/rvs5E6AEXVc)
``````

