# Issue 22412: timeit("...") does not work inside a function

archive/issues_022175.json:
```json
{
    "assignees": [],
    "body": "Apparently, timeit('some expression') evaluates the expression in the\ncontext of the interpreter rather than the local context where timeit\nis being called, which can lead to unexpected results (some students\nof mine got trapped today).\n\nLet's take an example, where we time a non trivial factorization:\n\n```\n    sage: p = (1-x^100)\n    sage: timeit('factor(p)', seconds=True)\n    0.007231048583984375\n```\n\nNow, let's do the same inside a function:\n\n```\n    sage: def f(p):\n    ....:     return timeit('factor(p)', seconds=True)\n    sage: f(p)                    # That's normal\n    0.007200319290161133\n    sage: f(1)                    # OOPS, That should be instantaneous!\n    0.007200319290161133\n```\n\nI am not sure there is an easy fix, but at least this limitation needs\nto be documented.\n\n\n_Issue created by migration from https://trac.sagemath.org/ticket/22412_\n\n",
    "created_at": "2017-02-22T10:34:03Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/p3%20%E2%80%93%20major",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "timeit(\"...\") does not work inside a function",
    "type": "issue",
    "updated_at": "2022-12-29T01:38:39Z",
    "url": "https://github.com/sagemath/sage/issues/22412",
    "user": "https://github.com/nthiery"
}
```
Apparently, timeit('some expression') evaluates the expression in the
context of the interpreter rather than the local context where timeit
is being called, which can lead to unexpected results (some students
of mine got trapped today).

Let's take an example, where we time a non trivial factorization:

```
    sage: p = (1-x^100)
    sage: timeit('factor(p)', seconds=True)
    0.007231048583984375
```

Now, let's do the same inside a function:

```
    sage: def f(p):
    ....:     return timeit('factor(p)', seconds=True)
    sage: f(p)                    # That's normal
    0.007200319290161133
    sage: f(1)                    # OOPS, That should be instantaneous!
    0.007200319290161133
```

I am not sure there is an easy fix, but at least this limitation needs
to be documented.


_Issue created by migration from https://trac.sagemath.org/ticket/22412_





---

archive/issue_events_295393.json:
```json
{
    "actor": "https://github.com/nthiery",
    "created_at": "2017-02-22T10:34:03Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/22412",
    "milestone_number": null,
    "milestone_title": "sage-7.6",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/22412#event-295393"
}
```



---

archive/issue_events_295394.json:
```json
{
    "actor": "https://github.com/nthiery",
    "created_at": "2017-02-22T10:34:03Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/22412",
    "label": "https://github.com/sagemath/sage/labels/p3%20%E2%80%93%20major",
    "label_color": "ffbb00",
    "label_name": "p3 \u2013 major",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/22412#event-295394"
}
```



---

archive/issue_events_295395.json:
```json
{
    "actor": "https://github.com/nthiery",
    "created_at": "2017-02-22T10:34:03Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/22412",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "d73a4a",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/22412#event-295395"
}
```



---

archive/issue_comments_334078.json:
```json
{
    "body": "<a id='comment:1'>Comment 1:</a>\nNote that the following seems to work:\n\n```\nsage: def f(p):\n....:     return timeit('factor({})'.format(p), seconds=True)\nsage: p = (1-x^100)\nsage: f(p)\n0.013366518020629882\nsage: f(1)\n4.191055297851562e-05\n```\n\nI am not sure whether what you reported should be considered as a bug however (there is some local/global context issue but i am not sure about how Python should behave in such a case).",
    "created_at": "2017-02-26T13:22:54Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/22412",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/22412#issuecomment-334078",
    "user": "https://github.com/sagetrac-tmonteil"
}
```

<a id='comment:1'>Comment 1:</a>
Note that the following seems to work:

```
sage: def f(p):
....:     return timeit('factor({})'.format(p), seconds=True)
sage: p = (1-x^100)
sage: f(p)
0.013366518020629882
sage: f(1)
4.191055297851562e-05
```

I am not sure whether what you reported should be considered as a bug however (there is some local/global context issue but i am not sure about how Python should behave in such a case).



---

archive/issue_events_295396.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-12-29T01:38:39Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/22412",
    "milestone_number": null,
    "milestone_title": "sage-7.6",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/22412#event-295396"
}
```
