# Issue 22526: Change string representation of fractional ideals of number fields

archive/issues_022289.json:
```json
{
    "body": "Fractional ideals are elements (of a monoid) but currently they print as verbosely as if they were parents:\n\n```\nsage: F.<r> = NumberField(x^2-10)\nsage: F.ideal(3,r+1)\nFractional ideal (3, r + 1)\n```\n\nThe problem gets worse for ideals of ZZ:\n\n```\nsage: ZZ.ideal(3)\nPrincipal ideal (3) of Integer Ring\n```\n\nI propose that the ``_repr_`` method is changed so the two previous outputs read, for example:\n\n```\nsage: F.ideal(3,r+1)\n((3, r+1))\nsage: ZZ.ideal(3)\n((3))\n```\n\nAnother option would be\n\n```\nsage: F.ideal(3,r+1)\n(3, r+1)*Z_F\nsage: ZZ.ideal(3)\n(3)*ZZ\n```\nbut the first one seems informative enough. One can easily get all the other information from available methods of the ideal.\n\nCC:  @videlec @roed314 @loefflerd tmonteil simonking\n\nKeywords: ideals, number fields\n\nStatus: new\n\nIssue created by migration from https://trac.sagemath.org/ticket/22526\n\n",
    "created_at": "2017-03-06T12:17:15Z",
    "labels": [
        "component: number fields"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-7.6",
    "title": "Change string representation of fractional ideals of number fields",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/22526",
    "user": "https://github.com/mmasdeu"
}
```
Fractional ideals are elements (of a monoid) but currently they print as verbosely as if they were parents:

```
sage: F.<r> = NumberField(x^2-10)
sage: F.ideal(3,r+1)
Fractional ideal (3, r + 1)
```

The problem gets worse for ideals of ZZ:

```
sage: ZZ.ideal(3)
Principal ideal (3) of Integer Ring
```

I propose that the ``_repr_`` method is changed so the two previous outputs read, for example:

```
sage: F.ideal(3,r+1)
((3, r+1))
sage: ZZ.ideal(3)
((3))
```

Another option would be

```
sage: F.ideal(3,r+1)
(3, r+1)*Z_F
sage: ZZ.ideal(3)
(3)*ZZ
```
but the first one seems informative enough. One can easily get all the other information from available methods of the ideal.

CC:  @videlec @roed314 @loefflerd tmonteil simonking

Keywords: ideals, number fields

Status: new

Issue created by migration from https://trac.sagemath.org/ticket/22526





---

archive/issue_comments_329912.json:
```json
{
    "body": "<a id='comment:1'></a>I'm fine with changing the printing somehow.  The double parenthesis notation isn't standard for ideals, but I agree that just using single parenthesis probably isn't distinct enough from other expressions.  `Z_F` doesn't work since the element has no access to a variable name referring to the parent (in fact, there may be such multiple variables).  So, I'm in favor of the `((3, r+1))` notation unless someone has a better idea.",
    "created_at": "2017-03-16T11:15:05Z",
    "issue": "https://github.com/sagemath/sagetest/issues/22526",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/22526#issuecomment-329912",
    "user": "https://github.com/roed314"
}
```

<a id='comment:1'></a>I'm fine with changing the printing somehow.  The double parenthesis notation isn't standard for ideals, but I agree that just using single parenthesis probably isn't distinct enough from other expressions.  `Z_F` doesn't work since the element has no access to a variable name referring to the parent (in fact, there may be such multiple variables).  So, I'm in favor of the `((3, r+1))` notation unless someone has a better idea.
