# Issue 22676: Different results from definite integral methods

archive/issues_022439.json:
```json
{
    "assignees": [],
    "body": "<div id=\"comment:0\"></div>\n\n\n```\nsage: ((x^-5+2*x^(1/3))^(1/5)).integral(x,.2,.3)\n-3/64*(-1)^(1/5)*sqrt(2*sqrt(5) - 10)*log(sqrt(1.0....\n...\nsage: _.n()\n0.405689098012116 + 0.0000627092036312171*I\nsage: ((x^-5+2*x^(1/3))^(1/5)).nintegrate(x,.2,.3)\n(0.4055729987450207, 4.50276481372992e-15, 21, 0)\n```\nWolfram Alpha favors the latter result.\n\nComponent: **calculus**\n\n_Issue created by migration from https://trac.sagemath.org/ticket/22676_\n\n",
    "created_at": "2017-03-23T15:52:24Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/c%3A%20calculus",
        "https://github.com/sagemath/sage/labels/p%3A%20major%20/%203",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "Different results from definite integral methods",
    "type": "issue",
    "updated_at": "2022-12-29T01:39:18Z",
    "url": "https://github.com/sagemath/sage/issues/22676",
    "user": "https://github.com/rwst"
}
```
<div id="comment:0"></div>


```
sage: ((x^-5+2*x^(1/3))^(1/5)).integral(x,.2,.3)
-3/64*(-1)^(1/5)*sqrt(2*sqrt(5) - 10)*log(sqrt(1.0....
...
sage: _.n()
0.405689098012116 + 0.0000627092036312171*I
sage: ((x^-5+2*x^(1/3))^(1/5)).nintegrate(x,.2,.3)
(0.4055729987450207, 4.50276481372992e-15, 21, 0)
```
Wolfram Alpha favors the latter result.

Component: **calculus**

_Issue created by migration from https://trac.sagemath.org/ticket/22676_





---

archive/issue_events_313884.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2017-03-23T15:52:24Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/22676",
    "milestone_number": null,
    "milestone_title": "sage-8.0",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/22676#event-313884"
}
```



---

archive/issue_events_313885.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2017-03-23T15:52:24Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/22676",
    "label": "https://github.com/sagemath/sage/labels/c%3A%20calculus",
    "label_color": "0000ff",
    "label_name": "c: calculus",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/22676#event-313885"
}
```



---

archive/issue_events_313886.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2017-03-23T15:52:24Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/22676",
    "label": "https://github.com/sagemath/sage/labels/p%3A%20major%20/%203",
    "label_color": "ffbb00",
    "label_name": "p: major / 3",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/22676#event-313886"
}
```



---

archive/issue_events_313887.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2017-03-23T15:52:24Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/22676",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "d73a4a",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/22676#event-313887"
}
```



---

archive/issue_comments_337015.json:
```json
{
    "body": "<div id=\"comment:1\" align=\"right\">comment:1</div>\n\nNote that we also have:\n\n```\nsage: F = ((x^-5+2*x^(1/3))^(1/5)).integral(x)\nsage: (F(x=.3) - F(x=.2)).n()\n0.405572998744828 + 2.49245069028348e-14*I\nsage: numerical_integral(((x^-5+2*x^(1/3))^(1/5)), .2, .3)\n(0.40557299874502073, 4.502764813729917e-15)\n```",
    "created_at": "2017-03-23T16:55:16Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/22676",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/22676#issuecomment-337015",
    "user": "https://github.com/tscrim"
}
```

<div id="comment:1" align="right">comment:1</div>

Note that we also have:

```
sage: F = ((x^-5+2*x^(1/3))^(1/5)).integral(x)
sage: (F(x=.3) - F(x=.2)).n()
0.405572998744828 + 2.49245069028348e-14*I
sage: numerical_integral(((x^-5+2*x^(1/3))^(1/5)), .2, .3)
(0.40557299874502073, 4.502764813729917e-15)
```



---

archive/issue_events_313888.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-12-29T01:39:18Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/22676",
    "milestone_number": null,
    "milestone_title": "sage-8.0",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/22676#event-313888"
}
```
