# Issue 22676: Different results from definite integral methods

archive/issues_022439.json:
```json
{
    "assignees": [],
    "body": "\n```\nsage: ((x^-5+2*x^(1/3))^(1/5)).integral(x,.2,.3)\n-3/64*(-1)^(1/5)*sqrt(2*sqrt(5) - 10)*log(sqrt(1.0....\n...\nsage: _.n()\n0.405689098012116 + 0.0000627092036312171*I\nsage: ((x^-5+2*x^(1/3))^(1/5)).nintegrate(x,.2,.3)\n(0.4055729987450207, 4.50276481372992e-15, 21, 0)\n```\nWolfram Alpha favors the latter result.\n\n_Issue created by migration from https://trac.sagemath.org/ticket/22676_\n\n",
    "created_at": "2017-03-23T15:52:24Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20calculus",
        "https://github.com/sagemath/sage/labels/p3%20%E2%80%93%20major",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "Different results from definite integral methods",
    "type": "issue",
    "updated_at": "2022-12-29T01:39:18Z",
    "url": "https://github.com/sagemath/sage/issues/22676",
    "user": "https://github.com/rwst"
}
```

```
sage: ((x^-5+2*x^(1/3))^(1/5)).integral(x,.2,.3)
-3/64*(-1)^(1/5)*sqrt(2*sqrt(5) - 10)*log(sqrt(1.0....
...
sage: _.n()
0.405689098012116 + 0.0000627092036312171*I
sage: ((x^-5+2*x^(1/3))^(1/5)).nintegrate(x,.2,.3)
(0.4055729987450207, 4.50276481372992e-15, 21, 0)
```
Wolfram Alpha favors the latter result.

_Issue created by migration from https://trac.sagemath.org/ticket/22676_





---

archive/issue_events_287976.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2017-03-23T15:52:24Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/22676",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20calculus",
    "label_color": "0000ff",
    "label_name": "component: calculus",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/22676#event-287976"
}
```



---

archive/issue_events_287977.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2017-03-23T15:52:24Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/22676",
    "label": "https://github.com/sagemath/sage/labels/p3%20%E2%80%93%20major",
    "label_color": "ffbb00",
    "label_name": "p3 \u2013 major",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/22676#event-287977"
}
```



---

archive/issue_events_287978.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2017-03-23T15:52:24Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/22676",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "d73a4a",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/22676#event-287978"
}
```



---

archive/issue_comments_339718.json:
```json
{
    "body": "<a id='comment:1'>Comment 1:</a>\nNote that we also have:\n\n```\nsage: F = ((x^-5+2*x^(1/3))^(1/5)).integral(x)\nsage: (F(x=.3) - F(x=.2)).n()\n0.405572998744828 + 2.49245069028348e-14*I\nsage: numerical_integral(((x^-5+2*x^(1/3))^(1/5)), .2, .3)\n(0.40557299874502073, 4.502764813729917e-15)\n```",
    "created_at": "2017-03-23T16:55:16Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/22676",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/22676#issuecomment-339718",
    "user": "https://github.com/tscrim"
}
```

<a id='comment:1'>Comment 1:</a>
Note that we also have:

```
sage: F = ((x^-5+2*x^(1/3))^(1/5)).integral(x)
sage: (F(x=.3) - F(x=.2)).n()
0.405572998744828 + 2.49245069028348e-14*I
sage: numerical_integral(((x^-5+2*x^(1/3))^(1/5)), .2, .3)
(0.40557299874502073, 4.502764813729917e-15)
```



---

archive/issue_events_287979.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-12-29T01:39:18Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/22676",
    "milestone_number": null,
    "milestone_title": "sage-8.0",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/22676#event-287979"
}
```
