# Issue 22676: Different results from definite integral methods

archive/issues_022439.json:
```json
{
    "body": "```\nsage: ((x^-5+2*x^(1/3))^(1/5)).integral(x,.2,.3)\n-3/64*(-1)^(1/5)*sqrt(2*sqrt(5) - 10)*log(sqrt(1.0....\n...\nsage: _.n()\n0.405689098012116 + 0.0000627092036312171*I\nsage: ((x^-5+2*x^(1/3))^(1/5)).nintegrate(x,.2,.3)\n(0.4055729987450207, 4.50276481372992e-15, 21, 0)\n```\nWolfram Alpha favors the latter result.\n\nStatus: new\n\nIssue created by migration from https://trac.sagemath.org/ticket/22676\n\n",
    "created_at": "2017-03-23T15:52:24Z",
    "labels": [
        "component: calculus",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-8.0",
    "title": "Different results from definite integral methods",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/22676",
    "user": "https://github.com/rwst"
}
```
```
sage: ((x^-5+2*x^(1/3))^(1/5)).integral(x,.2,.3)
-3/64*(-1)^(1/5)*sqrt(2*sqrt(5) - 10)*log(sqrt(1.0....
...
sage: _.n()
0.405689098012116 + 0.0000627092036312171*I
sage: ((x^-5+2*x^(1/3))^(1/5)).nintegrate(x,.2,.3)
(0.4055729987450207, 4.50276481372992e-15, 21, 0)
```
Wolfram Alpha favors the latter result.

Status: new

Issue created by migration from https://trac.sagemath.org/ticket/22676





---

archive/issue_comments_422415.json:
```json
{
    "body": "<a id='comment:1'></a>Note that we also have:\n\n```\nsage: F = ((x^-5+2*x^(1/3))^(1/5)).integral(x)\nsage: (F(x=.3) - F(x=.2)).n()\n0.405572998744828 + 2.49245069028348e-14*I\nsage: numerical_integral(((x^-5+2*x^(1/3))^(1/5)), .2, .3)\n(0.40557299874502073, 4.502764813729917e-15)\n```",
    "created_at": "2017-03-23T16:55:16Z",
    "issue": "https://github.com/sagemath/sagetest/issues/22676",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/22676#issuecomment-422415",
    "user": "https://github.com/tscrim"
}
```

<a id='comment:1'></a>Note that we also have:

```
sage: F = ((x^-5+2*x^(1/3))^(1/5)).integral(x)
sage: (F(x=.3) - F(x=.2)).n()
0.405572998744828 + 2.49245069028348e-14*I
sage: numerical_integral(((x^-5+2*x^(1/3))^(1/5)), .2, .3)
(0.40557299874502073, 4.502764813729917e-15)
```
