# Issue 22722: R is not in Ideals(R)

archive/issues_022485.json:
```json
{
    "assignees": [],
    "body": "This was surprising to me:\n\n```\nsage: ZZ in Ideals(ZZ)\nFalse\n```\nShould be easy enough to fix as it is just a missed case in the custom `__contains__` method.\n\nComponent: **categories**\n\n_Issue created by migration from https://trac.sagemath.org/ticket/22722_\n\n",
    "created_at": "2017-03-30T16:58:29Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/c%3A%20categories",
        "https://github.com/sagemath/sage/labels/p%3A%203%20%E2%80%93%20major",
        "https://github.com/sagemath/sage/labels/enhancement"
    ],
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "R is not in Ideals(R)",
    "type": "issue",
    "updated_at": "2022-12-29T01:39:18Z",
    "url": "https://github.com/sagemath/sage/issues/22722",
    "user": "https://github.com/tscrim"
}
```
This was surprising to me:

```
sage: ZZ in Ideals(ZZ)
False
```
Should be easy enough to fix as it is just a missed case in the custom `__contains__` method.

Component: **categories**

_Issue created by migration from https://trac.sagemath.org/ticket/22722_





---

archive/issue_events_317233.json:
```json
{
    "actor": "https://github.com/tscrim",
    "created_at": "2017-03-30T16:58:29Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/22722",
    "milestone_number": null,
    "milestone_title": "sage-8.0",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/22722#event-317233"
}
```



---

archive/issue_events_317234.json:
```json
{
    "actor": "https://github.com/tscrim",
    "created_at": "2017-03-30T16:58:29Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/22722",
    "label": "https://github.com/sagemath/sage/labels/c%3A%20categories",
    "label_color": "0000ff",
    "label_name": "c: categories",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/22722#event-317234"
}
```



---

archive/issue_events_317235.json:
```json
{
    "actor": "https://github.com/tscrim",
    "created_at": "2017-03-30T16:58:29Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/22722",
    "label": "https://github.com/sagemath/sage/labels/p%3A%203%20%E2%80%93%20major",
    "label_color": "ffbb00",
    "label_name": "p: 3 \u2013 major",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/22722#event-317235"
}
```



---

archive/issue_events_317236.json:
```json
{
    "actor": "https://github.com/tscrim",
    "created_at": "2017-03-30T16:58:29Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/22722",
    "label": "https://github.com/sagemath/sage/labels/enhancement",
    "label_color": "696969",
    "label_name": "enhancement",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/22722#event-317236"
}
```



---

archive/issue_comments_338108.json:
```json
{
    "body": "<div id=\"comment:1\" align=\"right\">comment:1</div>\n\nThis is consistent with many other functions that do not treat a ring R as an ideal, for example\n\n```\nsage: ZZ.quotient_ring(ZZ)\n---------------------------------------------------------------------------\nTypeError                                 Traceback (most recent call last)\n...\nTypeError: I must be an ideal of ZZ or an integer\nsage: ZZ.quotient_ring(1*ZZ)\nRing of integers modulo 1\n```\n\nSo ZZ is not treated as an ideal, but 1*ZZ is.  And this is correctly implemented:\n\n```\nsage: (1*ZZ) in Ideals(ZZ)\nTrue\n```",
    "created_at": "2017-03-31T17:07:05Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/22722",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/22722#issuecomment-338108",
    "user": "https://github.com/sagetrac-msaaltink"
}
```

<div id="comment:1" align="right">comment:1</div>

This is consistent with many other functions that do not treat a ring R as an ideal, for example

```
sage: ZZ.quotient_ring(ZZ)
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)
...
TypeError: I must be an ideal of ZZ or an integer
sage: ZZ.quotient_ring(1*ZZ)
Ring of integers modulo 1
```

So ZZ is not treated as an ideal, but 1*ZZ is.  And this is correctly implemented:

```
sage: (1*ZZ) in Ideals(ZZ)
True
```



---

archive/issue_comments_338109.json:
```json
{
    "body": "<div id=\"comment:2\" align=\"right\">comment:2</div>\n\nHowever, that doesn't absolve the problem. I would say it is evidence that it is more systematic. I think I will start digging into this on the code side.\n\nI guess another question is should `1*ZZ == ZZ` and/or be `ZZ`?",
    "created_at": "2017-04-01T03:27:33Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/22722",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/22722#issuecomment-338109",
    "user": "https://github.com/tscrim"
}
```

<div id="comment:2" align="right">comment:2</div>

However, that doesn't absolve the problem. I would say it is evidence that it is more systematic. I think I will start digging into this on the code side.

I guess another question is should `1*ZZ == ZZ` and/or be `ZZ`?



---

archive/issue_comments_338110.json:
```json
{
    "body": "<div id=\"comment:3\" align=\"right\">comment:3</div>\n\nIt is indeed systematic and this sort of thing afflicts other categories, like monoids\n\n```\nsage: ZZ in Monoids()\nTrue\nsage: 1*ZZ in Monoids()\nFalse\n```\nsemigroups,\n\n```\nsage: ZZ in Semigroups()\nTrue\nsage: 2*ZZ in Semigroups()\nFalse\n```\nand rings:\n\n```\nsage: (1*ZZ) in Rings()\nFalse\nsage: (1*ZZ) in Rngs()\nFalse\n```\n\nOn the plus side, Sage knows that ideals are additive groups:\n\n```\nZZ.categories()[24]\nCategory of additive groups\nsage: AG = _\nsage: AG.axioms()\nfrozenset({'AdditiveAssociative', 'AdditiveInverse', 'AdditiveUnital'})\nsage: ZZ in AG\nTrue\nsage: (2*ZZ) in AG\nTrue\n```\n\nTo weigh in on your question, if you make ZZ known as an ideal of itself, then 1*ZZ == ZZ would make sense, and indeed they could be identical.",
    "created_at": "2017-04-01T18:42:18Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/22722",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/22722#issuecomment-338110",
    "user": "https://github.com/sagetrac-msaaltink"
}
```

<div id="comment:3" align="right">comment:3</div>

It is indeed systematic and this sort of thing afflicts other categories, like monoids

```
sage: ZZ in Monoids()
True
sage: 1*ZZ in Monoids()
False
```
semigroups,

```
sage: ZZ in Semigroups()
True
sage: 2*ZZ in Semigroups()
False
```
and rings:

```
sage: (1*ZZ) in Rings()
False
sage: (1*ZZ) in Rngs()
False
```

On the plus side, Sage knows that ideals are additive groups:

```
ZZ.categories()[24]
Category of additive groups
sage: AG = _
sage: AG.axioms()
frozenset({'AdditiveAssociative', 'AdditiveInverse', 'AdditiveUnital'})
sage: ZZ in AG
True
sage: (2*ZZ) in AG
True
```

To weigh in on your question, if you make ZZ known as an ideal of itself, then 1*ZZ == ZZ would make sense, and indeed they could be identical.



---

archive/issue_events_317237.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-12-29T01:39:18Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/22722",
    "milestone_number": null,
    "milestone_title": "sage-8.0",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/22722#event-317237"
}
```
