# Issue 22849: Heaviside in numerical resolutions

archive/issues_022612.json:
```json
{
    "body": "- numerical ode:\n\n```\nsage: y = var('y')\nsage: desolve_rk4(x,y,ics=[0,0],end_points=1,step=0.5) # solution is x^2/2\n[[0, 0], [0.5, 0.125], [1.0, 0.4999999999999999]]\nsage: desolve_rk4(x*unit_step(1+x),y,ics=[0,0],end_points=1,step=0.5) # OK\n[[0, 0], [0.5, 0.125], [1.0, 0.4999999999999999]]\nsage: desolve_rk4(x*heaviside(1+x),y,ics=[0,0],end_points=1,step=0.5) # ??\n[[0, 0]]\n```\n\n- integration: \n\n```\nsage:\u00a0integral(unit_step(x),\u00a0(x,\u00a00,\u00a01))\n1\nsage:\u00a0integral(heaviside(x),\u00a0(x,\u00a00,\u00a01)) # ??\nintegrate(heaviside(x),\u00a0x,\u00a00,\u00a01)\n```\n\n- custom numerical value at 0:\n\n```\nsage: heaviside(0)\nheaviside(0)\nsage: f(x) = heaviside(x, 1/2); f(0)  # new 2nd argument (?)\n1/2\n```\n\n**CC:**  @rwst @kcrisman @egourgoulhon @tscrim\n\n**Keywords:** heaviside, integrate\n\n**Status:** new\n\nIssue created by migration from https://trac.sagemath.org/ticket/22849\n\n",
    "created_at": "2017-04-20T21:56:06Z",
    "labels": [
        "component: symbolics",
        "enhancement"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-8.0",
    "title": "Heaviside in numerical resolutions",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/22849",
    "user": "https://github.com/mforets"
}
```
- numerical ode:

```
sage: y = var('y')
sage: desolve_rk4(x,y,ics=[0,0],end_points=1,step=0.5) # solution is x^2/2
[[0, 0], [0.5, 0.125], [1.0, 0.4999999999999999]]
sage: desolve_rk4(x*unit_step(1+x),y,ics=[0,0],end_points=1,step=0.5) # OK
[[0, 0], [0.5, 0.125], [1.0, 0.4999999999999999]]
sage: desolve_rk4(x*heaviside(1+x),y,ics=[0,0],end_points=1,step=0.5) # ??
[[0, 0]]
```

- integration: 

```
sage: integral(unit_step(x), (x, 0, 1))
1
sage: integral(heaviside(x), (x, 0, 1)) # ??
integrate(heaviside(x), x, 0, 1)
```

- custom numerical value at 0:

```
sage: heaviside(0)
heaviside(0)
sage: f(x) = heaviside(x, 1/2); f(0)  # new 2nd argument (?)
1/2
```

**CC:**  @rwst @kcrisman @egourgoulhon @tscrim

**Keywords:** heaviside, integrate

**Status:** new

Issue created by migration from https://trac.sagemath.org/ticket/22849





---

archive/issue_comments_407989.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -25,5 +25,5 @@\n sage: heaviside(0)\n heaviside(0)\n sage: f(x) = heaviside(x, 1/2); f(0)  # new 2nd argument (?)\n-1\n+1/2\n ```\n``````\n",
    "created_at": "2017-04-20T22:31:07Z",
    "issue": "https://github.com/sagemath/sagetest/issues/22849",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/22849#issuecomment-407989",
    "user": "https://github.com/mforets"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -25,5 +25,5 @@
 sage: heaviside(0)
 heaviside(0)
 sage: f(x) = heaviside(x, 1/2); f(0)  # new 2nd argument (?)
-1
+1/2
 ```
``````




---

archive/issue_comments_407990.json:
```json
{
    "body": "<a id='comment:3'></a>\n\n```\nsage: desolve_rk4(x*unit_step(1+x),y,ics=[0,0],end_points=1,step=0.5) # OK\n[[0, 0], [0.5, 0.125], [1.0, 0.4999999999999999]]\nsage: desolve_rk4(x*heaviside(1+x),y,ics=[0,0],end_points=1,step=0.5) # ??\n[[0, 0]]\n```\nThis is due to Maxima because with Maxima 5.38.1:\n\n```\n(%i3) rk(x*unit_step(x+1),y,0,[x,0,1,0.500000000000000]);\n(%o3)               [[0.0, 0.0], [0.5, 0.125], [1.0, 0.5]]\n(%i4) rk(x*hstep(x+1),y,0,[x,0,1,0.500000000000000]);\n(%o4)                            [[0.0, 0.0]]\n```",
    "created_at": "2017-04-21T05:52:01Z",
    "issue": "https://github.com/sagemath/sagetest/issues/22849",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/22849#issuecomment-407990",
    "user": "https://github.com/rwst"
}
```

<a id='comment:3'></a>

```
sage: desolve_rk4(x*unit_step(1+x),y,ics=[0,0],end_points=1,step=0.5) # OK
[[0, 0], [0.5, 0.125], [1.0, 0.4999999999999999]]
sage: desolve_rk4(x*heaviside(1+x),y,ics=[0,0],end_points=1,step=0.5) # ??
[[0, 0]]
```
This is due to Maxima because with Maxima 5.38.1:

```
(%i3) rk(x*unit_step(x+1),y,0,[x,0,1,0.500000000000000]);
(%o3)               [[0.0, 0.0], [0.5, 0.125], [1.0, 0.5]]
(%i4) rk(x*hstep(x+1),y,0,[x,0,1,0.500000000000000]);
(%o4)                            [[0.0, 0.0]]
```



---

archive/issue_comments_407991.json:
```json
{
    "body": "<a id='comment:4'></a>\nI cannot even find online documentation on `hstep`, nor a mention of the Heaviside function. I don't think we can rely on Maxima having implemented it, so we cannot provide DE or integral services with it.",
    "created_at": "2017-04-21T06:00:18Z",
    "issue": "https://github.com/sagemath/sagetest/issues/22849",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/22849#issuecomment-407991",
    "user": "https://github.com/rwst"
}
```

<a id='comment:4'></a>
I cannot even find online documentation on `hstep`, nor a mention of the Heaviside function. I don't think we can rely on Maxima having implemented it, so we cannot provide DE or integral services with it.



---

archive/issue_comments_407992.json:
```json
{
    "body": "<a id='comment:5'></a>\nThis is now #22850.",
    "created_at": "2017-04-21T06:14:48Z",
    "issue": "https://github.com/sagemath/sagetest/issues/22849",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/22849#issuecomment-407992",
    "user": "https://github.com/rwst"
}
```

<a id='comment:5'></a>
This is now #22850.
