# Issue 22873: No evaluation with gamma of ball/interval field arguments

archive/issues_022636.json:
```json
{
    "body": "Incomplete gamma doesn't do anything given ball arguments\n\n```\nsage: gamma(2, RBF(1/3))\ngamma(2, [0.3333333333333333 +/- 7.04e-17])\nsage: gamma(2., RBF(1/3))\ngamma(2.00000000000000, [0.3333333333333333 +/- 7.04e-17])\nsage: gamma(2, RIF(1/3))\ngamma(2, 0.3333333333333334?)\n```\n\n\nStatus: new\n\nIssue created by migration from https://trac.sagemath.org/ticket/22873\n\n",
    "created_at": "2017-04-26T07:20:01Z",
    "labels": [
        "component: symbolics",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-8.2",
    "title": "No evaluation with gamma of ball/interval field arguments",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/22873",
    "user": "https://github.com/rwst"
}
```
Incomplete gamma doesn't do anything given ball arguments

```
sage: gamma(2, RBF(1/3))
gamma(2, [0.3333333333333333 +/- 7.04e-17])
sage: gamma(2., RBF(1/3))
gamma(2.00000000000000, [0.3333333333333333 +/- 7.04e-17])
sage: gamma(2, RIF(1/3))
gamma(2, 0.3333333333333334?)
```


Status: new

Issue created by migration from https://trac.sagemath.org/ticket/22873





---

archive/issue_comments_336290.json:
```json
{
    "body": "Description changed:\n```diff\n--- \n+++ \n@@ -5,7 +5,10 @@\n gamma(2, [0.3333333333333333 +/- 7.04e-17])\n sage: gamma(2., RBF(1/3))\n gamma(2.00000000000000, [0.3333333333333333 +/- 7.04e-17])\n+sage: gamma(2, RIF(1/3))\n+gamma(2, 0.3333333333333334?)\n \\`\\`\\`\n+\n \n Comment: 1\n \n```\n",
    "created_at": "2017-12-21T07:29:45Z",
    "issue": "https://github.com/sagemath/sagetest/issues/22873",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/22873#issuecomment-336290",
    "user": "https://github.com/rwst"
}
```

Description changed:
```diff
--- 
+++ 
@@ -5,7 +5,10 @@
 gamma(2, [0.3333333333333333 +/- 7.04e-17])
 sage: gamma(2., RBF(1/3))
 gamma(2.00000000000000, [0.3333333333333333 +/- 7.04e-17])
+sage: gamma(2, RIF(1/3))
+gamma(2, 0.3333333333333334?)
 \`\`\`
+
 
 Comment: 1
 
```




---

archive/issue_comments_336291.json:
```json
{
    "body": "<a id='comment:2'></a>New commits:",
    "created_at": "2017-12-21T07:29:45Z",
    "issue": "https://github.com/sagemath/sagetest/issues/22873",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/22873#issuecomment-336291",
    "user": "https://github.com/rwst"
}
```

<a id='comment:2'></a>New commits:



---

archive/issue_events_059414.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2017-12-21T07:29:45Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/22873",
    "milestone": "sage-8.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/22873#event-59414"
}
```



---

archive/issue_comments_336292.json:
```json
{
    "body": "<a id='comment:3'></a>It's not use making a `GinacFunction` out of this so a Python solution should do.",
    "created_at": "2018-02-03T07:47:03Z",
    "issue": "https://github.com/sagemath/sagetest/issues/22873",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/22873#issuecomment-336292",
    "user": "https://github.com/rwst"
}
```

<a id='comment:3'></a>It's not use making a `GinacFunction` out of this so a Python solution should do.
