# Issue 22920: Maxima library interface is broken for symbolic sums

archive/issues_022683.json:
```json
{
    "body": "```sage\nsage: var(\"j,p\", domain=\"integer\")\n(j, p)\nsage: X=function(\"X\")\n```\nCompare :\n\n```sage\nsage: foo=sum(X(j),j,1,p);foo\nsum(X(j), j, 1, p)\nsage: bar=maxima(\"sum(X(j),j,1,p)\").sage();bar\nsum(X(j), j, 1, p)\nsage: bool(foo==bar)\nTrue\n```\nwith\n\n```sage\nsage: gee=X(j).maxima_methods().sum(j,1,p);gee\np*X(j)                   ## Nonsense...\nsage: bool(foo==gee)\nFalse\n```\n\nThe problem also exists with products, see #17502 and #17505.\n\nCC:  @rwst\n\nKeywords: symbolics\n\nStatus: new\n\nIssue created by migration from https://trac.sagemath.org/ticket/22920\n\n",
    "created_at": "2017-05-01T16:51:42Z",
    "labels": [
        "component: interfaces",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-8.0",
    "title": "Maxima library interface is broken for symbolic sums",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/22920",
    "user": "https://github.com/EmmanuelCharpentier"
}
```
```sage
sage: var("j,p", domain="integer")
(j, p)
sage: X=function("X")
```
Compare :

```sage
sage: foo=sum(X(j),j,1,p);foo
sum(X(j), j, 1, p)
sage: bar=maxima("sum(X(j),j,1,p)").sage();bar
sum(X(j), j, 1, p)
sage: bool(foo==bar)
True
```
with

```sage
sage: gee=X(j).maxima_methods().sum(j,1,p);gee
p*X(j)                   ## Nonsense...
sage: bool(foo==gee)
False
```

The problem also exists with products, see #17502 and #17505.

CC:  @rwst

Keywords: symbolics

Status: new

Issue created by migration from https://trac.sagemath.org/ticket/22920





---

archive/issue_comments_428154.json:
```json
{
    "body": "<a id='comment:2'></a>The product part is #17502.",
    "created_at": "2017-05-02T05:26:36Z",
    "issue": "https://github.com/sagemath/sagetest/issues/22920",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/22920#issuecomment-428154",
    "user": "https://github.com/rwst"
}
```

<a id='comment:2'></a>The product part is #17502.



---

archive/issue_comments_428155.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -22,12 +22,4 @@\n False\n ```\n \n-The problem also exists with products, but there is currently (Sage 8.0.beta4) no Sage function creating a symbolic product. Compare :\n-\n-```\n-sage: maxima(\"prod(X(j),j,1,p)\")\n-'product(X(j),j,1,p)\n-sage: X(j).maxima_methods().prod(j,1,p)\n-X(j)^p\n-```\n-#22914 aims at fixing the product \"problem\", which is larger (and maybe different).\n+The problem also exists with products, see #17502 and #17505.\n``````\n",
    "created_at": "2017-05-05T06:49:27Z",
    "issue": "https://github.com/sagemath/sagetest/issues/22920",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/22920#issuecomment-428155",
    "user": "https://github.com/rwst"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -22,12 +22,4 @@
 False
 ```
 
-The problem also exists with products, but there is currently (Sage 8.0.beta4) no Sage function creating a symbolic product. Compare :
-
-```
-sage: maxima("prod(X(j),j,1,p)")
-'product(X(j),j,1,p)
-sage: X(j).maxima_methods().prod(j,1,p)
-X(j)^p
-```
-#22914 aims at fixing the product "problem", which is larger (and maybe different).
+The problem also exists with products, see #17502 and #17505.
``````

