# Issue 18082: inconsistency with polynomial factor() in Poly vs LaurentPoly

archive/issues_017845.json:
```json
{
    "assignees": [],
    "body": "\n```\nsage: R.<x> = PolynomialRing(QQ)\nsage: (1/(1-x)).factor()\n(-1) * (x - 1)^-1\nsage: (1-x).factor()\n(-1) * (x - 1)\n\nsage: R.<x> = LaurentPolynomialRing(QQ)\nsage: (1/(1-x)).factor()\n(-1) * (x - 1)^-1\nsage: (1-x).factor()\n(-1) * (-1 + x)\n```\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/18082\n\n",
    "created_at": "2015-03-29T08:47:44Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20commutative%20algebra",
        "https://github.com/sagemath/sage/labels/minor",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-6.6",
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "inconsistency with polynomial factor() in Poly vs LaurentPoly",
    "type": "issue",
    "updated_at": "2015-10-11T06:41:15Z",
    "url": "https://github.com/sagemath/sage/issues/18082",
    "user": "https://github.com/rwst"
}
```

```
sage: R.<x> = PolynomialRing(QQ)
sage: (1/(1-x)).factor()
(-1) * (x - 1)^-1
sage: (1-x).factor()
(-1) * (x - 1)

sage: R.<x> = LaurentPolynomialRing(QQ)
sage: (1/(1-x)).factor()
(-1) * (x - 1)^-1
sage: (1-x).factor()
(-1) * (-1 + x)
```


Issue created by migration from https://trac.sagemath.org/ticket/18082





---

archive/issue_events_220996.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2015-03-29T08:47:44Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/18082",
    "milestone_number": null,
    "milestone_title": "sage-6.6",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18082#event-220996"
}
```



---

archive/issue_events_220997.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2015-03-29T08:47:44Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/18082",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20commutative%20algebra",
    "label_color": "08517b",
    "label_name": "component: commutative algebra",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18082#event-220997"
}
```



---

archive/issue_events_220998.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2015-03-29T08:47:44Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/18082",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "008080",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18082#event-220998"
}
```



---

archive/issue_events_220999.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2015-10-11T06:41:15Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/18082",
    "label": "https://github.com/sagemath/sage/labels/minor",
    "label_color": "ff0000",
    "label_name": "minor",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18082#event-220999"
}
```
