# Issue 18081: Expression.factor_list() result inconsistent

archive/issues_017844.json:
```json
{
    "body": "\n```\nsage: (1-2^(-s)).factor_list()\n[(2^s - 1, 1), (2^s, -1)]\nsage: (1/(1-2^(-s))).factor_list()\n[(2^s - 1, -1), (2, s)]\n```\nI would have expected the first expression to have `(2, -s)` or the second to have `(2^s, 1)`.\nAlso, this looks odd:\n\n```\nsage: (1/(1-x)).factor_list()\n[(x - 1, -1), (-1, 1)]\nsage: (1-x).factor_list()\n[(-x + 1, 1)]\n```\n\n\nStatus: new\n\nIssue created by migration from https://trac.sagemath.org/ticket/18081\n\n",
    "created_at": "2015-03-29T08:37:47Z",
    "labels": [
        "component: symbolics",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-6.6",
    "title": "Expression.factor_list() result inconsistent",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/18081",
    "user": "https://github.com/rwst"
}
```

```
sage: (1-2^(-s)).factor_list()
[(2^s - 1, 1), (2^s, -1)]
sage: (1/(1-2^(-s))).factor_list()
[(2^s - 1, -1), (2, s)]
```
I would have expected the first expression to have `(2, -s)` or the second to have `(2^s, 1)`.
Also, this looks odd:

```
sage: (1/(1-x)).factor_list()
[(x - 1, -1), (-1, 1)]
sage: (1-x).factor_list()
[(-x + 1, 1)]
```


Status: new

Issue created by migration from https://trac.sagemath.org/ticket/18081





---

archive/issue_comments_312160.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -6,3 +6,12 @@\n [(2^s - 1, -1), (2, s)]\n ```\n I would have expected the first expression to have `(2, -s)` or the second to have `(2^s, 1)`.\n+Also, this looks odd:\n+\n+```\n+sage: (1/(1-x)).factor_list()\n+[(x - 1, -1), (-1, 1)]\n+sage: (1-x).factor_list()\n+[(-x + 1, 1)]\n+```\n+\n``````\n",
    "created_at": "2015-03-29T08:40:32Z",
    "issue": "https://github.com/sagemath/sagetest/issues/18081",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/18081#issuecomment-312160",
    "user": "https://github.com/rwst"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -6,3 +6,12 @@
 [(2^s - 1, -1), (2, s)]
 ```
 I would have expected the first expression to have `(2, -s)` or the second to have `(2^s, 1)`.
+Also, this looks odd:
+
+```
+sage: (1/(1-x)).factor_list()
+[(x - 1, -1), (-1, 1)]
+sage: (1-x).factor_list()
+[(-x + 1, 1)]
+```
+
``````

