# Issue 18081: Expression.factor_list() result inconsistent

archive/issues_017844.json:
```json
{
    "assignees": [],
    "body": "\n```\nsage: (1-2^(-s)).factor_list()\n[(2^s - 1, 1), (2^s, -1)]\nsage: (1/(1-2^(-s))).factor_list()\n[(2^s - 1, -1), (2, s)]\n```\nI would have expected the first expression to have `(2, -s)` or the second to have `(2^s, 1)`.\nAlso, this looks odd:\n\n```\nsage: (1/(1-x)).factor_list()\n[(x - 1, -1), (-1, 1)]\nsage: (1-x).factor_list()\n[(-x + 1, 1)]\n```\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/18081\n\n",
    "created_at": "2015-03-29T08:37:47Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20symbolics",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-6.6",
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "Expression.factor_list() result inconsistent",
    "type": "issue",
    "updated_at": "2015-03-29T08:40:32Z",
    "url": "https://github.com/sagemath/sage/issues/18081",
    "user": "https://github.com/rwst"
}
```

```
sage: (1-2^(-s)).factor_list()
[(2^s - 1, 1), (2^s, -1)]
sage: (1/(1-2^(-s))).factor_list()
[(2^s - 1, -1), (2, s)]
```
I would have expected the first expression to have `(2, -s)` or the second to have `(2^s, 1)`.
Also, this looks odd:

```
sage: (1/(1-x)).factor_list()
[(x - 1, -1), (-1, 1)]
sage: (1-x).factor_list()
[(-x + 1, 1)]
```


Issue created by migration from https://trac.sagemath.org/ticket/18081





---

archive/issue_events_220993.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2015-03-29T08:37:47Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/18081",
    "milestone_number": null,
    "milestone_title": "sage-6.6",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18081#event-220993"
}
```



---

archive/issue_events_220994.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2015-03-29T08:37:47Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/18081",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20symbolics",
    "label_color": "08517b",
    "label_name": "component: symbolics",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18081#event-220994"
}
```



---

archive/issue_events_220995.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2015-03-29T08:37:47Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/18081",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "008080",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18081#event-220995"
}
```



---

archive/issue_comments_248979.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -6,3 +6,12 @@\n [(2^s - 1, -1), (2, s)]\n ```\n I would have expected the first expression to have `(2, -s)` or the second to have `(2^s, 1)`.\n+Also, this looks odd:\n+\n+```\n+sage: (1/(1-x)).factor_list()\n+[(x - 1, -1), (-1, 1)]\n+sage: (1-x).factor_list()\n+[(-x + 1, 1)]\n+```\n+\n``````\n",
    "created_at": "2015-03-29T08:40:32Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/18081",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/18081#issuecomment-248979",
    "user": "https://github.com/rwst"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -6,3 +6,12 @@
 [(2^s - 1, -1), (2, s)]
 ```
 I would have expected the first expression to have `(2, -s)` or the second to have `(2^s, 1)`.
+Also, this looks odd:
+
+```
+sage: (1/(1-x)).factor_list()
+[(x - 1, -1), (-1, 1)]
+sage: (1-x).factor_list()
+[(-x + 1, 1)]
+```
+
``````

