# Issue 18251: CombinatorialFreeModule: fix arithmetic/comparison with base ring zero

archive/issues_018014.json:
```json
{
    "body": "Currently we have the following in Sage:\n\n```\nsage: C = CombinatorialFreeModule(QQ, ['a','b'])\nsage: C(0) + ZZ(0)\n0\nsage: C(0) + QQ(0)\nTypeError: unsupported operand parent(s) for '+': 'Free module generated by {'a', 'b'} over Rational Field' and 'Rational Field'\n```\nand also\n\n```\nsage: C = CombinatorialFreeModule(QQ, ['a','b'])\nsage: C.zero() == ZZ(0)\nTrue\nsage: C.zero() == QQ(0)\nFalse\n```\n\nThe problem is that there is no coercion `QQ -> C`. The coercion model special-cases `ZZ(0)` but not other kinds of zero.\n\nAssignee: @tscrim\n\nCC:  @nthiery @darijgr @nbruin @robertwb @fchapoton @videlec\n\nKeywords: zero\n\nBranch: u/jdemeyer/combinatorialfreemodule_should_use_coercion_for_comparisons\n\nStatus: new\n\nDependencies: #21128\n\nCommit: 3aa0ccae4e5c42359636afd5b77a504388e26928\n\nIssue created by migration from https://trac.sagemath.org/ticket/18251\n\n",
    "created_at": "2015-04-19T18:00:05Z",
    "labels": [
        "component: coercion",
        "critical",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-7.4",
    "title": "CombinatorialFreeModule: fix arithmetic/comparison with base ring zero",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/18251",
    "user": "https://github.com/tscrim"
}
```
Currently we have the following in Sage:

```
sage: C = CombinatorialFreeModule(QQ, ['a','b'])
sage: C(0) + ZZ(0)
0
sage: C(0) + QQ(0)
TypeError: unsupported operand parent(s) for '+': 'Free module generated by {'a', 'b'} over Rational Field' and 'Rational Field'
```
and also

```
sage: C = CombinatorialFreeModule(QQ, ['a','b'])
sage: C.zero() == ZZ(0)
True
sage: C.zero() == QQ(0)
False
```

The problem is that there is no coercion `QQ -> C`. The coercion model special-cases `ZZ(0)` but not other kinds of zero.

Assignee: @tscrim

CC:  @nthiery @darijgr @nbruin @robertwb @fchapoton @videlec

Keywords: zero

Branch: u/jdemeyer/combinatorialfreemodule_should_use_coercion_for_comparisons

Status: new

Dependencies: #21128

Commit: 3aa0ccae4e5c42359636afd5b77a504388e26928

Issue created by migration from https://trac.sagemath.org/ticket/18251





---

archive/issue_events_051551.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2016-07-29T11:34:22Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/18251",
    "milestone": "sage-7.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/18251#event-51551"
}
```



---

archive/issue_comments_242097.json:
```json
{
    "body": "<a id='comment:6'></a>Part of the problem is that there is no coercion defined anyway:\n\n```\nsage: C = CombinatorialFreeModule(QQ, ['a','b'])\nsage: C.coerce(QQ(0))\nTypeError: no canonical coercion from Rational Field to Free module generated by {'a', 'b'} over Rational Field\n```\n\nThis makes sense, but it means that the problem is different from what I originally thought.",
    "created_at": "2016-07-29T14:31:05Z",
    "issue": "https://github.com/sagemath/sagetest/issues/18251",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/18251#issuecomment-242097",
    "user": "https://github.com/jdemeyer"
}
```

<a id='comment:6'></a>Part of the problem is that there is no coercion defined anyway:

```
sage: C = CombinatorialFreeModule(QQ, ['a','b'])
sage: C.coerce(QQ(0))
TypeError: no canonical coercion from Rational Field to Free module generated by {'a', 'b'} over Rational Field
```

This makes sense, but it means that the problem is different from what I originally thought.



---

archive/issue_comments_242098.json:
```json
{
    "body": "<a id='comment:8'></a>And the coercion model has an explicit special case for `ZZ(0)`.",
    "created_at": "2016-07-29T14:38:42Z",
    "issue": "https://github.com/sagemath/sagetest/issues/18251",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/18251#issuecomment-242098",
    "user": "https://github.com/jdemeyer"
}
```

<a id='comment:8'></a>And the coercion model has an explicit special case for `ZZ(0)`.



---

archive/issue_comments_242099.json:
```json
{
    "body": "<a id='comment:10'></a>I am going to attach my branch anyway, which does coercion but doesn't actually fix the problem.",
    "created_at": "2016-07-29T14:41:55Z",
    "issue": "https://github.com/sagemath/sagetest/issues/18251",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/18251#issuecomment-242099",
    "user": "https://github.com/jdemeyer"
}
```

<a id='comment:10'></a>I am going to attach my branch anyway, which does coercion but doesn't actually fix the problem.



---

archive/issue_comments_242100.json:
```json
{
    "body": "<a id='comment:12'></a>New commits:",
    "created_at": "2016-07-29T14:48:14Z",
    "issue": "https://github.com/sagemath/sagetest/issues/18251",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/18251#issuecomment-242100",
    "user": "https://github.com/jdemeyer"
}
```

<a id='comment:12'></a>New commits:



---

archive/issue_comments_242101.json:
```json
{
    "body": "<a id='comment:14'></a>The current behavior of CFM agrees with that of the usual modules:\n\n```sage\nsage: V = QQ^3\nsage: V.coerce(ZZ(0))\n(0, 0, 0)\nsage: V.coerce(QQ(0))\n---------------------------------------------------------------------------\nTypeError                                 Traceback (most recent call last)\n...\nTypeError: no canonical coercion from Rational Field to Vector space of dimension 3 over Rational Field\nsage: V.zero() == QQ(0)\nFalse\nsage: V.zero() == ZZ(0)\nTrue\n```\nI'm thinking a better and more general solution would be to special case the zero of the base ring or possibly just `QQ`.",
    "created_at": "2016-07-30T14:25:04Z",
    "issue": "https://github.com/sagemath/sagetest/issues/18251",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/18251#issuecomment-242101",
    "user": "https://github.com/tscrim"
}
```

<a id='comment:14'></a>The current behavior of CFM agrees with that of the usual modules:

```sage
sage: V = QQ^3
sage: V.coerce(ZZ(0))
(0, 0, 0)
sage: V.coerce(QQ(0))
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)
...
TypeError: no canonical coercion from Rational Field to Vector space of dimension 3 over Rational Field
sage: V.zero() == QQ(0)
False
sage: V.zero() == ZZ(0)
True
```
I'm thinking a better and more general solution would be to special case the zero of the base ring or possibly just `QQ`.
