# Issue 18319: coefficient fails to give help

archive/issues_018082.json:
```json
{
    "assignees": [],
    "body": "\n```\nsage: x.coefficient?\n...this works...\n\nsage: (x+1).coefficient?\nObject `coefficient` not found.\n\nsage: (x+1).n?\n...this works...\n```\n\nPrevious description:\n\nIn Sage 6.5:\n\n```\nsage: var(\"a\")\na\nsage: (a+1).coefficient?\nObject `coefficient` not found.\nsage: (a+1).coefficient(a)\n0\nsage: (a+1)\na + 1\nsage: (a+1).coefficient(a)\n1\n```\n\nCC:  @tscrim\n\nKeywords: **coefficient**\n\nComponent: **documentation**\n\n_Issue created by migration from https://trac.sagemath.org/ticket/18319_\n\n",
    "closed_at": "2017-07-07T10:41:46Z",
    "created_at": "2015-04-28T09:53:40Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/bug",
        "https://github.com/sagemath/sage/labels/c%3A%20documentation",
        "https://github.com/sagemath/sage/labels/invalid"
    ],
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "coefficient fails to give help",
    "type": "issue",
    "updated_at": "2017-07-07T10:41:46Z",
    "url": "https://github.com/sagemath/sage/issues/18319",
    "user": "https://github.com/mantepse"
}
```

```
sage: x.coefficient?
...this works...

sage: (x+1).coefficient?
Object `coefficient` not found.

sage: (x+1).n?
...this works...
```

Previous description:

In Sage 6.5:

```
sage: var("a")
a
sage: (a+1).coefficient?
Object `coefficient` not found.
sage: (a+1).coefficient(a)
0
sage: (a+1)
a + 1
sage: (a+1).coefficient(a)
1
```

CC:  @tscrim

Keywords: **coefficient**

Component: **documentation**

_Issue created by migration from https://trac.sagemath.org/ticket/18319_





---

archive/issue_events_260441.json:
```json
{
    "actor": "https://github.com/mantepse",
    "created_at": "2015-04-28T09:53:40Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "milestone_number": null,
    "milestone_title": "sage-6.7",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18319#event-260441"
}
```



---

archive/issue_events_260442.json:
```json
{
    "actor": "https://github.com/mantepse",
    "created_at": "2015-04-28T09:53:40Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "label": "https://github.com/sagemath/sage/labels/c%3A%20symbolics",
    "label_color": "0000ff",
    "label_name": "c: symbolics",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18319#event-260442"
}
```



---

archive/issue_events_260443.json:
```json
{
    "actor": "https://github.com/mantepse",
    "created_at": "2015-04-28T09:53:40Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "label": "https://github.com/sagemath/sage/labels/p%3A%203%20%E2%80%93%20major",
    "label_color": "ffbb00",
    "label_name": "p: 3 \u2013 major",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18319#event-260443"
}
```



---

archive/issue_events_260444.json:
```json
{
    "actor": "https://github.com/mantepse",
    "created_at": "2015-04-28T09:53:40Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "d73a4a",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18319#event-260444"
}
```



---

archive/issue_comments_251709.json:
```json
{
    "body": "<div id=\"comment:1\" align=\"right\">comment:1</div>\n\nNo similar weirdness with the current beta (6.7.\u03b23):\n\n```\nsage: var(\"a\")\na\nsage: (a+1).coefficient?\nObject `coefficient` not found.\nsage: (a+1).coefficient(a)\n1\nsage: (a+1)\na + 1\nsage: (a+1).coefficient(a)\n1\n```",
    "created_at": "2015-04-28T14:09:49Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/18319#issuecomment-251709",
    "user": "https://github.com/mezzarobba"
}
```

<div id="comment:1" align="right">comment:1</div>

No similar weirdness with the current beta (6.7.Î²3):

```
sage: var("a")
a
sage: (a+1).coefficient?
Object `coefficient` not found.
sage: (a+1).coefficient(a)
1
sage: (a+1)
a + 1
sage: (a+1).coefficient(a)
1
```



---

archive/issue_events_260445.json:
```json
{
    "actor": "https://github.com/mantepse",
    "created_at": "2015-04-28T16:13:50Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "milestone_number": null,
    "milestone_title": "sage-6.7",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18319#event-260445"
}
```



---

archive/issue_events_260446.json:
```json
{
    "actor": "https://github.com/mantepse",
    "created_at": "2015-04-28T16:13:50Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "label": "https://github.com/sagemath/sage/labels/p%3A%203%20%E2%80%93%20major",
    "label_color": "ffbb00",
    "label_name": "p: 3 \u2013 major",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18319#event-260446"
}
```



---

archive/issue_events_260447.json:
```json
{
    "actor": "https://github.com/mantepse",
    "created_at": "2015-04-28T16:13:50Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "label": "https://github.com/sagemath/sage/labels/invalid",
    "label_color": "a6a6a6",
    "label_name": "invalid",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18319#event-260447"
}
```



---

archive/issue_comments_251710.json:
```json
{
    "body": "<div id=\"comment:3\" align=\"right\">comment:3</div>\n\nGreat, thanks, and sorry for the noise!\n\nMartin",
    "created_at": "2015-04-28T16:14:11Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/18319#issuecomment-251710",
    "user": "https://github.com/mantepse"
}
```

<div id="comment:3" align="right">comment:3</div>

Great, thanks, and sorry for the noise!

Martin



---

archive/issue_comments_251711.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -1,3 +1,17 @@\n+\n+```\n+sage: x.coefficient?\n+...this works...\n+\n+sage: (x+1).coefficient?\n+Object `coefficient` not found.\n+\n+sage: (x+1).n?\n+...this works...\n+```\n+\n+Previous description:\n+\n In Sage 6.5:\n \n ```\n``````\n",
    "created_at": "2015-05-03T06:31:25Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/18319#issuecomment-251711",
    "user": "https://github.com/rwst"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -1,3 +1,17 @@
+
+```
+sage: x.coefficient?
+...this works...
+
+sage: (x+1).coefficient?
+Object `coefficient` not found.
+
+sage: (x+1).n?
+...this works...
+```
+
+Previous description:
+
 In Sage 6.5:
 
 ```
``````




---

archive/issue_comments_251712.json:
```json
{
    "body": "<div id=\"comment:4\" align=\"right\">comment:4</div>\n\nActually there is still the issue why you don't get the help with `?`:\n\n```\nsage: x.coefficient?\nsage: (x+1).coefficient?\nObject `coefficient` not found.\nsage: (x+1).n?\n...this works...\n```",
    "created_at": "2015-05-03T06:31:25Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/18319#issuecomment-251712",
    "user": "https://github.com/rwst"
}
```

<div id="comment:4" align="right">comment:4</div>

Actually there is still the issue why you don't get the help with `?`:

```
sage: x.coefficient?
sage: (x+1).coefficient?
Object `coefficient` not found.
sage: (x+1).n?
...this works...
```



---

archive/issue_events_260448.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2015-05-03T06:31:25Z",
    "event": "renamed",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "title_is": "coefficient fails to give help",
    "title_was": "coefficient in SR weirdness.",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18319#event-260448"
}
```



---

archive/issue_events_260449.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2015-05-03T06:31:25Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "label": "https://github.com/sagemath/sage/labels/c%3A%20symbolics",
    "label_color": "0000ff",
    "label_name": "c: symbolics",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18319#event-260449"
}
```



---

archive/issue_events_260450.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2015-05-03T06:31:25Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "label": "https://github.com/sagemath/sage/labels/c%3A%20documentation",
    "label_color": "0075ca",
    "label_name": "c: documentation",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18319#event-260450"
}
```



---

archive/issue_events_260451.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2015-05-03T06:31:25Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "milestone_number": null,
    "milestone_title": "sage-6.7",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18319#event-260451"
}
```



---

archive/issue_comments_251713.json:
```json
{
    "body": "<div id=\"comment:5\" align=\"right\">comment:5</div>\n\nIf anything I'm surprised that `(x+1).n?` works: typically `obj.foo?` only works reliably if `obj` is a variable, and either raises an error or returns nonsense otherwise. For instance:\n\n```\nsage: (x.variables()).n?\nSignature:      n(x, prec=None, digits=None, algorithm=None)\nDocstring:\n   Returns a numerical approximation of an object \"x\" with at least\n   \"prec\" bits (or decimal \"digits\") of precision.\n...\nsage: (x.variables()).n()\n...\nAttributeError: 'tuple' object has no attribute 'n'\n```",
    "created_at": "2015-05-03T07:11:55Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/18319#issuecomment-251713",
    "user": "https://github.com/mezzarobba"
}
```

<div id="comment:5" align="right">comment:5</div>

If anything I'm surprised that `(x+1).n?` works: typically `obj.foo?` only works reliably if `obj` is a variable, and either raises an error or returns nonsense otherwise. For instance:

```
sage: (x.variables()).n?
Signature:      n(x, prec=None, digits=None, algorithm=None)
Docstring:
   Returns a numerical approximation of an object "x" with at least
   "prec" bits (or decimal "digits") of precision.
...
sage: (x.variables()).n()
...
AttributeError: 'tuple' object has no attribute 'n'
```



---

archive/issue_comments_251714.json:
```json
{
    "body": "<div id=\"comment:6\" align=\"right\">comment:6</div>\n\nI propose to close this as invalid. Objections ?",
    "created_at": "2017-07-07T08:33:10Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/18319#issuecomment-251714",
    "user": "https://github.com/fchapoton"
}
```

<div id="comment:6" align="right">comment:6</div>

I propose to close this as invalid. Objections ?



---

archive/issue_events_260452.json:
```json
{
    "actor": "https://github.com/fchapoton",
    "created_at": "2017-07-07T08:33:10Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "milestone_number": null,
    "milestone_title": "sage-6.7",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18319#event-260452"
}
```



---

archive/issue_events_260453.json:
```json
{
    "actor": "https://github.com/fchapoton",
    "created_at": "2017-07-07T08:33:10Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "7fff00",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18319#event-260453"
}
```



---

archive/issue_comments_251715.json:
```json
{
    "body": "<div id=\"comment:7\" align=\"right\">comment:7</div>\n\nThe `?` parsing is done by IPython, Sage is not involved in this. So this isn't a Sage bug, which is sufficient reason to close this.",
    "created_at": "2017-07-07T10:37:25Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/18319#issuecomment-251715",
    "user": "https://github.com/jdemeyer"
}
```

<div id="comment:7" align="right">comment:7</div>

The `?` parsing is done by IPython, Sage is not involved in this. So this isn't a Sage bug, which is sufficient reason to close this.



---

archive/issue_events_260454.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2017-07-07T10:41:46Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "7fff00",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18319#event-260454"
}
```



---

archive/issue_events_260455.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2017-07-07T10:41:46Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18319#event-260455"
}
```



---

archive/issue_comments_251716.json:
```json
{
    "body": "<div id=\"comment:8\" align=\"right\">comment:8</div>\n\nSee https://github.com/ipython/ipython/issues/10694",
    "created_at": "2017-07-07T10:41:46Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/18319#issuecomment-251716",
    "user": "https://github.com/jdemeyer"
}
```

<div id="comment:8" align="right">comment:8</div>

See https://github.com/ipython/ipython/issues/10694
