# Issue 18319: coefficient fails to give help

archive/issues_018082.json:
```json
{
    "assignees": [],
    "body": "\n```\nsage: x.coefficient?\n...this works...\n\nsage: (x+1).coefficient?\nObject `coefficient` not found.\n\nsage: (x+1).n?\n...this works...\n```\n\nPrevious description:\n\nIn Sage 6.5:\n\n```\nsage: var(\"a\")\na\nsage: (a+1).coefficient?\nObject `coefficient` not found.\nsage: (a+1).coefficient(a)\n0\nsage: (a+1)\na + 1\nsage: (a+1).coefficient(a)\n1\n```\n\n**CC:**  @tscrim\n\n**Keywords:** coefficient\n\nIssue created by migration from https://trac.sagemath.org/ticket/18319\n\n",
    "closed_at": "2017-07-07T10:41:46Z",
    "created_at": "2015-04-28T09:53:40Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20documentation",
        "https://github.com/sagemath/sage/labels/bug",
        "https://github.com/sagemath/sage/labels/invalid"
    ],
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "coefficient fails to give help",
    "type": "issue",
    "updated_at": "2017-07-07T10:41:46Z",
    "url": "https://github.com/sagemath/sage/issues/18319",
    "user": "https://github.com/mantepse"
}
```

```
sage: x.coefficient?
...this works...

sage: (x+1).coefficient?
Object `coefficient` not found.

sage: (x+1).n?
...this works...
```

Previous description:

In Sage 6.5:

```
sage: var("a")
a
sage: (a+1).coefficient?
Object `coefficient` not found.
sage: (a+1).coefficient(a)
0
sage: (a+1)
a + 1
sage: (a+1).coefficient(a)
1
```

**CC:**  @tscrim

**Keywords:** coefficient

Issue created by migration from https://trac.sagemath.org/ticket/18319





---

archive/issue_events_223927.json:
```json
{
    "actor": "https://github.com/mantepse",
    "created_at": "2015-04-28T09:53:40Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20symbolics",
    "label_color": "08517b",
    "label_name": "component: symbolics",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18319#event-223927"
}
```



---

archive/issue_events_223928.json:
```json
{
    "actor": "https://github.com/mantepse",
    "created_at": "2015-04-28T09:53:40Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "008080",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18319#event-223928"
}
```



---

archive/issue_events_223929.json:
```json
{
    "actor": "https://github.com/mantepse",
    "created_at": "2015-04-28T09:53:40Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "label": "https://github.com/sagemath/sage/labels/invalid",
    "label_color": "008080",
    "label_name": "invalid",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18319#event-223929"
}
```



---

archive/issue_comments_254153.json:
```json
{
    "body": "<a id='comment:1'>**Comment 1:**</a>\nNo similar weirdness with the current beta (6.7.\u03b23):\n\n```\nsage: var(\"a\")\na\nsage: (a+1).coefficient?\nObject `coefficient` not found.\nsage: (a+1).coefficient(a)\n1\nsage: (a+1)\na + 1\nsage: (a+1).coefficient(a)\n1\n```",
    "created_at": "2015-04-28T14:09:49Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/18319#issuecomment-254153",
    "user": "https://github.com/mezzarobba"
}
```

<a id='comment:1'>**Comment 1:**</a>
No similar weirdness with the current beta (6.7.Î²3):

```
sage: var("a")
a
sage: (a+1).coefficient?
Object `coefficient` not found.
sage: (a+1).coefficient(a)
1
sage: (a+1)
a + 1
sage: (a+1).coefficient(a)
1
```



---

archive/issue_events_223930.json:
```json
{
    "actor": "https://github.com/mantepse",
    "created_at": "2015-04-28T16:13:50Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "milestone_number": null,
    "milestone_title": "sage-6.7",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18319#event-223930"
}
```



---

archive/issue_comments_254154.json:
```json
{
    "body": "<a id='comment:3'>**Comment 3:**</a>\nGreat, thanks, and sorry for the noise!\n\nMartin",
    "created_at": "2015-04-28T16:14:11Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/18319#issuecomment-254154",
    "user": "https://github.com/mantepse"
}
```

<a id='comment:3'>**Comment 3:**</a>
Great, thanks, and sorry for the noise!

Martin



---

archive/issue_comments_254155.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -1,3 +1,17 @@\n+\n+```\n+sage: x.coefficient?\n+...this works...\n+\n+sage: (x+1).coefficient?\n+Object `coefficient` not found.\n+\n+sage: (x+1).n?\n+...this works...\n+```\n+\n+Previous description:\n+\n In Sage 6.5:\n \n ```\n``````\n",
    "created_at": "2015-05-03T06:31:25Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/18319#issuecomment-254155",
    "user": "https://github.com/rwst"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -1,3 +1,17 @@
+
+```
+sage: x.coefficient?
+...this works...
+
+sage: (x+1).coefficient?
+Object `coefficient` not found.
+
+sage: (x+1).n?
+...this works...
+```
+
+Previous description:
+
 In Sage 6.5:
 
 ```
``````




---

archive/issue_comments_254156.json:
```json
{
    "body": "<a id='comment:4'>**Comment 4:**</a>\nActually there is still the issue why you don't get the help with `?`:\n\n```\nsage: x.coefficient?\nsage: (x+1).coefficient?\nObject `coefficient` not found.\nsage: (x+1).n?\n...this works...\n```",
    "created_at": "2015-05-03T06:31:25Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/18319#issuecomment-254156",
    "user": "https://github.com/rwst"
}
```

<a id='comment:4'>**Comment 4:**</a>
Actually there is still the issue why you don't get the help with `?`:

```
sage: x.coefficient?
sage: (x+1).coefficient?
Object `coefficient` not found.
sage: (x+1).n?
...this works...
```



---

archive/issue_events_223931.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2015-05-03T06:31:25Z",
    "event": "renamed",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "rename": {
        "from": "coefficient in SR weirdness.",
        "to": "coefficient fails to give help"
    },
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18319#event-223931"
}
```



---

archive/issue_events_223932.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2015-05-03T06:31:25Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20symbolics",
    "label_color": "08517b",
    "label_name": "component: symbolics",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18319#event-223932"
}
```



---

archive/issue_events_223933.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2015-05-03T06:31:25Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20documentation",
    "label_color": "08517b",
    "label_name": "component: documentation",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18319#event-223933"
}
```



---

archive/issue_events_223934.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2015-05-03T06:31:25Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "milestone_number": null,
    "milestone_title": "sage-6.7",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18319#event-223934"
}
```



---

archive/issue_comments_254157.json:
```json
{
    "body": "<a id='comment:5'>**Comment 5:**</a>\nIf anything I'm surprised that `(x+1).n?` works: typically `obj.foo?` only works reliably if `obj` is a variable, and either raises an error or returns nonsense otherwise. For instance:\n\n```\nsage: (x.variables()).n?\nSignature:      n(x, prec=None, digits=None, algorithm=None)\nDocstring:\n   Returns a numerical approximation of an object \"x\" with at least\n   \"prec\" bits (or decimal \"digits\") of precision.\n...\nsage: (x.variables()).n()\n...\nAttributeError: 'tuple' object has no attribute 'n'\n```",
    "created_at": "2015-05-03T07:11:55Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/18319#issuecomment-254157",
    "user": "https://github.com/mezzarobba"
}
```

<a id='comment:5'>**Comment 5:**</a>
If anything I'm surprised that `(x+1).n?` works: typically `obj.foo?` only works reliably if `obj` is a variable, and either raises an error or returns nonsense otherwise. For instance:

```
sage: (x.variables()).n?
Signature:      n(x, prec=None, digits=None, algorithm=None)
Docstring:
   Returns a numerical approximation of an object "x" with at least
   "prec" bits (or decimal "digits") of precision.
...
sage: (x.variables()).n()
...
AttributeError: 'tuple' object has no attribute 'n'
```



---

archive/issue_comments_254158.json:
```json
{
    "body": "<a id='comment:6'>**Comment 6:**</a>\nI propose to close this as invalid. Objections ?",
    "created_at": "2017-07-07T08:33:10Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/18319#issuecomment-254158",
    "user": "https://github.com/fchapoton"
}
```

<a id='comment:6'>**Comment 6:**</a>
I propose to close this as invalid. Objections ?



---

archive/issue_events_223935.json:
```json
{
    "actor": "https://github.com/fchapoton",
    "created_at": "2017-07-07T08:33:10Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "milestone_number": null,
    "milestone_title": "sage-6.7",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18319#event-223935"
}
```



---

archive/issue_events_223936.json:
```json
{
    "actor": "https://github.com/fchapoton",
    "created_at": "2017-07-07T08:33:10Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "008080",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18319#event-223936"
}
```



---

archive/issue_comments_254159.json:
```json
{
    "body": "<a id='comment:7'>**Comment 7:**</a>\nThe `?` parsing is done by IPython, Sage is not involved in this. So this isn't a Sage bug, which is sufficient reason to close this.",
    "created_at": "2017-07-07T10:37:25Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/18319#issuecomment-254159",
    "user": "https://github.com/jdemeyer"
}
```

<a id='comment:7'>**Comment 7:**</a>
The `?` parsing is done by IPython, Sage is not involved in this. So this isn't a Sage bug, which is sufficient reason to close this.



---

archive/issue_events_223937.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2017-07-07T10:41:46Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "008080",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18319#event-223937"
}
```



---

archive/issue_events_223938.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2017-07-07T10:41:46Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18319#event-223938"
}
```



---

archive/issue_comments_254160.json:
```json
{
    "body": "<a id='comment:8'>**Comment 8:**</a>\nSee https://github.com/ipython/ipython/issues/10694",
    "created_at": "2017-07-07T10:41:46Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/18319#issuecomment-254160",
    "user": "https://github.com/jdemeyer"
}
```

<a id='comment:8'>**Comment 8:**</a>
See https://github.com/ipython/ipython/issues/10694
