# Issue 18319: coefficient fails to give help

archive/issues_018082.json:
```json
{
    "body": "\n```\nsage: x.coefficient?\n...this works...\n\nsage: (x+1).coefficient?\nObject `coefficient` not found.\n\nsage: (x+1).n?\n...this works...\n```\n\nPrevious description:\n\nIn Sage 6.5:\n\n```\nsage: var(\"a\")\na\nsage: (a+1).coefficient?\nObject `coefficient` not found.\nsage: (a+1).coefficient(a)\n0\nsage: (a+1)\na + 1\nsage: (a+1).coefficient(a)\n1\n```\n\n**CC:**  @tscrim\n\n**Keywords:** coefficient\n\nIssue created by migration from https://trac.sagemath.org/ticket/18319\n\n",
    "closed_at": "2017-07-07T10:41:46Z",
    "created_at": "2015-04-28T09:53:40Z",
    "labels": [
        "component: documentation",
        "bug",
        "invalid"
    ],
    "title": "coefficient fails to give help",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/18319",
    "user": "https://github.com/mantepse"
}
```

```
sage: x.coefficient?
...this works...

sage: (x+1).coefficient?
Object `coefficient` not found.

sage: (x+1).n?
...this works...
```

Previous description:

In Sage 6.5:

```
sage: var("a")
a
sage: (a+1).coefficient?
Object `coefficient` not found.
sage: (a+1).coefficient(a)
0
sage: (a+1)
a + 1
sage: (a+1).coefficient(a)
1
```

**CC:**  @tscrim

**Keywords:** coefficient

Issue created by migration from https://trac.sagemath.org/ticket/18319





---

archive/issue_comments_255740.json:
```json
{
    "body": "<a id='comment:1'></a>\nNo similar weirdness with the current beta (6.7.\u03b23):\n\n```\nsage: var(\"a\")\na\nsage: (a+1).coefficient?\nObject `coefficient` not found.\nsage: (a+1).coefficient(a)\n1\nsage: (a+1)\na + 1\nsage: (a+1).coefficient(a)\n1\n```",
    "created_at": "2015-04-28T14:09:49Z",
    "issue": "https://github.com/sagemath/sagetest/issues/18319",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/18319#issuecomment-255740",
    "user": "https://github.com/mezzarobba"
}
```

<a id='comment:1'></a>
No similar weirdness with the current beta (6.7.Î²3):

```
sage: var("a")
a
sage: (a+1).coefficient?
Object `coefficient` not found.
sage: (a+1).coefficient(a)
1
sage: (a+1)
a + 1
sage: (a+1).coefficient(a)
1
```



---

archive/issue_events_167765.json:
```json
{
    "actor": "https://github.com/mantepse",
    "created_at": "2015-04-28T16:13:50Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/18319",
    "milestone": "sage-6.7",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/18319#event-167765"
}
```



---

archive/issue_events_167766.json:
```json
{
    "actor": "https://github.com/mantepse",
    "created_at": "2015-04-28T16:13:50Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sagetest/issues/18319",
    "label": "duplicate/invalid/wontfix",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/18319#event-167766"
}
```



---

archive/issue_comments_255741.json:
```json
{
    "body": "<a id='comment:3'></a>\nGreat, thanks, and sorry for the noise!\n\nMartin",
    "created_at": "2015-04-28T16:14:11Z",
    "issue": "https://github.com/sagemath/sagetest/issues/18319",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/18319#issuecomment-255741",
    "user": "https://github.com/mantepse"
}
```

<a id='comment:3'></a>
Great, thanks, and sorry for the noise!

Martin



---

archive/issue_comments_255742.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -1,3 +1,17 @@\n+\n+```\n+sage: x.coefficient?\n+...this works...\n+\n+sage: (x+1).coefficient?\n+Object `coefficient` not found.\n+\n+sage: (x+1).n?\n+...this works...\n+```\n+\n+Previous description:\n+\n In Sage 6.5:\n \n ```\n``````\n",
    "created_at": "2015-05-03T06:31:25Z",
    "issue": "https://github.com/sagemath/sagetest/issues/18319",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/18319#issuecomment-255742",
    "user": "https://github.com/rwst"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -1,3 +1,17 @@
+
+```
+sage: x.coefficient?
+...this works...
+
+sage: (x+1).coefficient?
+Object `coefficient` not found.
+
+sage: (x+1).n?
+...this works...
+```
+
+Previous description:
+
 In Sage 6.5:
 
 ```
``````




---

archive/issue_comments_255743.json:
```json
{
    "body": "<a id='comment:4'></a>\nActually there is still the issue why you don't get the help with `?`:\n\n```\nsage: x.coefficient?\nsage: (x+1).coefficient?\nObject `coefficient` not found.\nsage: (x+1).n?\n...this works...\n```",
    "created_at": "2015-05-03T06:31:25Z",
    "issue": "https://github.com/sagemath/sagetest/issues/18319",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/18319#issuecomment-255743",
    "user": "https://github.com/rwst"
}
```

<a id='comment:4'></a>
Actually there is still the issue why you don't get the help with `?`:

```
sage: x.coefficient?
sage: (x+1).coefficient?
Object `coefficient` not found.
sage: (x+1).n?
...this works...
```



---

archive/issue_events_167767.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2015-05-03T06:31:25Z",
    "event": "renamed",
    "issue": "https://github.com/sagemath/sagetest/issues/18319",
    "rename": {
        "from": "coefficient in SR weirdness.",
        "to": "coefficient fails to give help"
    },
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/18319#event-167767"
}
```



---

archive/issue_events_167768.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2015-05-03T06:31:25Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sagetest/issues/18319",
    "label": "component: symbolics",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/18319#event-167768"
}
```



---

archive/issue_events_167769.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2015-05-03T06:31:25Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sagetest/issues/18319",
    "label": "component: documentation",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/18319#event-167769"
}
```



---

archive/issue_events_167770.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2015-05-03T06:31:25Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/18319",
    "milestone": "sage-6.7",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/18319#event-167770"
}
```



---

archive/issue_events_167771.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2015-05-03T06:31:25Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sagetest/issues/18319",
    "label": "duplicate/invalid/wontfix",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/18319#event-167771"
}
```



---

archive/issue_comments_255744.json:
```json
{
    "body": "<a id='comment:5'></a>\nIf anything I'm surprised that `(x+1).n?` works: typically `obj.foo?` only works reliably if `obj` is a variable, and either raises an error or returns nonsense otherwise. For instance:\n\n```\nsage: (x.variables()).n?\nSignature:      n(x, prec=None, digits=None, algorithm=None)\nDocstring:\n   Returns a numerical approximation of an object \"x\" with at least\n   \"prec\" bits (or decimal \"digits\") of precision.\n...\nsage: (x.variables()).n()\n...\nAttributeError: 'tuple' object has no attribute 'n'\n```",
    "created_at": "2015-05-03T07:11:55Z",
    "issue": "https://github.com/sagemath/sagetest/issues/18319",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/18319#issuecomment-255744",
    "user": "https://github.com/mezzarobba"
}
```

<a id='comment:5'></a>
If anything I'm surprised that `(x+1).n?` works: typically `obj.foo?` only works reliably if `obj` is a variable, and either raises an error or returns nonsense otherwise. For instance:

```
sage: (x.variables()).n?
Signature:      n(x, prec=None, digits=None, algorithm=None)
Docstring:
   Returns a numerical approximation of an object "x" with at least
   "prec" bits (or decimal "digits") of precision.
...
sage: (x.variables()).n()
...
AttributeError: 'tuple' object has no attribute 'n'
```



---

archive/issue_comments_255745.json:
```json
{
    "body": "<a id='comment:6'></a>\nI propose to close this as invalid. Objections ?",
    "created_at": "2017-07-07T08:33:10Z",
    "issue": "https://github.com/sagemath/sagetest/issues/18319",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/18319#issuecomment-255745",
    "user": "https://github.com/fchapoton"
}
```

<a id='comment:6'></a>
I propose to close this as invalid. Objections ?



---

archive/issue_events_167772.json:
```json
{
    "actor": "https://github.com/fchapoton",
    "created_at": "2017-07-07T08:33:10Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/18319",
    "milestone": "sage-6.7",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/18319#event-167772"
}
```



---

archive/issue_events_167773.json:
```json
{
    "actor": "https://github.com/fchapoton",
    "created_at": "2017-07-07T08:33:10Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sagetest/issues/18319",
    "label": "duplicate/invalid/wontfix",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/18319#event-167773"
}
```



---

archive/issue_events_167774.json:
```json
{
    "actor": "https://github.com/fchapoton",
    "created_at": "2017-07-07T08:33:10Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sagetest/issues/18319",
    "label": "needs review",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/18319#event-167774"
}
```



---

archive/issue_comments_255746.json:
```json
{
    "body": "<a id='comment:7'></a>\nThe `?` parsing is done by IPython, Sage is not involved in this. So this isn't a Sage bug, which is sufficient reason to close this.",
    "created_at": "2017-07-07T10:37:25Z",
    "issue": "https://github.com/sagemath/sagetest/issues/18319",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/18319#issuecomment-255746",
    "user": "https://github.com/jdemeyer"
}
```

<a id='comment:7'></a>
The `?` parsing is done by IPython, Sage is not involved in this. So this isn't a Sage bug, which is sufficient reason to close this.



---

archive/issue_events_167775.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2017-07-07T10:41:46Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sagetest/issues/18319",
    "label": "needs review",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/18319#event-167775"
}
```



---

archive/issue_events_167776.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2017-07-07T10:41:46Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/18319",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/18319#event-167776"
}
```



---

archive/issue_comments_255747.json:
```json
{
    "body": "<a id='comment:8'></a>\nSee https://github.com/ipython/ipython/issues/10694",
    "created_at": "2017-07-07T10:41:46Z",
    "issue": "https://github.com/sagemath/sagetest/issues/18319",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/18319#issuecomment-255747",
    "user": "https://github.com/jdemeyer"
}
```

<a id='comment:8'></a>
See https://github.com/ipython/ipython/issues/10694
