# Issue 18319: coefficient fails to give help

archive/issues_018082.json:
```json
{
    "assignees": [],
    "body": "\n```\nsage: x.coefficient?\n...this works...\n\nsage: (x+1).coefficient?\nObject `coefficient` not found.\n\nsage: (x+1).n?\n...this works...\n```\n\nPrevious description:\n\nIn Sage 6.5:\n\n```\nsage: var(\"a\")\na\nsage: (a+1).coefficient?\nObject `coefficient` not found.\nsage: (a+1).coefficient(a)\n0\nsage: (a+1)\na + 1\nsage: (a+1).coefficient(a)\n1\n```\n\nCC:  @tscrim\n\nComponent: **documentation**\n\nKeywords: **coefficient**\n\n_Issue created by migration from https://trac.sagemath.org/ticket/18319_\n\n",
    "closed_at": "2017-07-07T10:41:46Z",
    "created_at": "2015-04-28T09:53:40Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/bug",
        "https://github.com/sagemath/sage/labels/c%3A%20documentation",
        "https://github.com/sagemath/sage/labels/invalid"
    ],
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "coefficient fails to give help",
    "type": "issue",
    "updated_at": "2017-07-07T10:41:46Z",
    "url": "https://github.com/sagemath/sage/issues/18319",
    "user": "https://github.com/mantepse"
}
```

```
sage: x.coefficient?
...this works...

sage: (x+1).coefficient?
Object `coefficient` not found.

sage: (x+1).n?
...this works...
```

Previous description:

In Sage 6.5:

```
sage: var("a")
a
sage: (a+1).coefficient?
Object `coefficient` not found.
sage: (a+1).coefficient(a)
0
sage: (a+1)
a + 1
sage: (a+1).coefficient(a)
1
```

CC:  @tscrim

Component: **documentation**

Keywords: **coefficient**

_Issue created by migration from https://trac.sagemath.org/ticket/18319_





---

archive/issue_events_258071.json:
```json
{
    "actor": "https://github.com/mantepse",
    "created_at": "2015-04-28T09:53:40Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "milestone_number": null,
    "milestone_title": "sage-6.7",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18319#event-258071"
}
```



---

archive/issue_events_258072.json:
```json
{
    "actor": "https://github.com/mantepse",
    "created_at": "2015-04-28T09:53:40Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "label": "https://github.com/sagemath/sage/labels/c%3A%20symbolics",
    "label_color": "0000ff",
    "label_name": "c: symbolics",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18319#event-258072"
}
```



---

archive/issue_events_258073.json:
```json
{
    "actor": "https://github.com/mantepse",
    "created_at": "2015-04-28T09:53:40Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "label": "https://github.com/sagemath/sage/labels/p%3A%20major%20/%203",
    "label_color": "ffbb00",
    "label_name": "p: major / 3",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18319#event-258073"
}
```



---

archive/issue_events_258074.json:
```json
{
    "actor": "https://github.com/mantepse",
    "created_at": "2015-04-28T09:53:40Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "d73a4a",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18319#event-258074"
}
```



---

archive/issue_comments_251635.json:
```json
{
    "body": "<div id=\"comment:1\" align=\"right\">comment:1</div>\n\nNo similar weirdness with the current beta (6.7.\u03b23):\n\n```\nsage: var(\"a\")\na\nsage: (a+1).coefficient?\nObject `coefficient` not found.\nsage: (a+1).coefficient(a)\n1\nsage: (a+1)\na + 1\nsage: (a+1).coefficient(a)\n1\n```",
    "created_at": "2015-04-28T14:09:49Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/18319#issuecomment-251635",
    "user": "https://github.com/mezzarobba"
}
```

<div id="comment:1" align="right">comment:1</div>

No similar weirdness with the current beta (6.7.Î²3):

```
sage: var("a")
a
sage: (a+1).coefficient?
Object `coefficient` not found.
sage: (a+1).coefficient(a)
1
sage: (a+1)
a + 1
sage: (a+1).coefficient(a)
1
```



---

archive/issue_events_258075.json:
```json
{
    "actor": "https://github.com/mantepse",
    "created_at": "2015-04-28T16:13:50Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "milestone_number": null,
    "milestone_title": "sage-6.7",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18319#event-258075"
}
```



---

archive/issue_comments_251636.json:
```json
{
    "body": "<div id=\"comment:3\" align=\"right\">comment:3</div>\n\nGreat, thanks, and sorry for the noise!\n\nMartin",
    "created_at": "2015-04-28T16:14:11Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/18319#issuecomment-251636",
    "user": "https://github.com/mantepse"
}
```

<div id="comment:3" align="right">comment:3</div>

Great, thanks, and sorry for the noise!

Martin



---

archive/issue_comments_251637.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -1,3 +1,17 @@\n+\n+```\n+sage: x.coefficient?\n+...this works...\n+\n+sage: (x+1).coefficient?\n+Object `coefficient` not found.\n+\n+sage: (x+1).n?\n+...this works...\n+```\n+\n+Previous description:\n+\n In Sage 6.5:\n \n ```\n``````\n",
    "created_at": "2015-05-03T06:31:25Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/18319#issuecomment-251637",
    "user": "https://github.com/rwst"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -1,3 +1,17 @@
+
+```
+sage: x.coefficient?
+...this works...
+
+sage: (x+1).coefficient?
+Object `coefficient` not found.
+
+sage: (x+1).n?
+...this works...
+```
+
+Previous description:
+
 In Sage 6.5:
 
 ```
``````




---

archive/issue_comments_251638.json:
```json
{
    "body": "<div id=\"comment:4\" align=\"right\">comment:4</div>\n\nActually there is still the issue why you don't get the help with `?`:\n\n```\nsage: x.coefficient?\nsage: (x+1).coefficient?\nObject `coefficient` not found.\nsage: (x+1).n?\n...this works...\n```",
    "created_at": "2015-05-03T06:31:25Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/18319#issuecomment-251638",
    "user": "https://github.com/rwst"
}
```

<div id="comment:4" align="right">comment:4</div>

Actually there is still the issue why you don't get the help with `?`:

```
sage: x.coefficient?
sage: (x+1).coefficient?
Object `coefficient` not found.
sage: (x+1).n?
...this works...
```



---

archive/issue_events_258076.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2015-05-03T06:31:25Z",
    "event": "renamed",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "title_is": "coefficient fails to give help",
    "title_was": "coefficient in SR weirdness.",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18319#event-258076"
}
```



---

archive/issue_events_258077.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2015-05-03T06:31:25Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "label": "https://github.com/sagemath/sage/labels/c%3A%20symbolics",
    "label_color": "0000ff",
    "label_name": "c: symbolics",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18319#event-258077"
}
```



---

archive/issue_events_258078.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2015-05-03T06:31:25Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "label": "https://github.com/sagemath/sage/labels/c%3A%20documentation",
    "label_color": "0075ca",
    "label_name": "c: documentation",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18319#event-258078"
}
```



---

archive/issue_events_258079.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2015-05-03T06:31:25Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "milestone_number": null,
    "milestone_title": "sage-6.7",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18319#event-258079"
}
```



---

archive/issue_comments_251639.json:
```json
{
    "body": "<div id=\"comment:5\" align=\"right\">comment:5</div>\n\nIf anything I'm surprised that `(x+1).n?` works: typically `obj.foo?` only works reliably if `obj` is a variable, and either raises an error or returns nonsense otherwise. For instance:\n\n```\nsage: (x.variables()).n?\nSignature:      n(x, prec=None, digits=None, algorithm=None)\nDocstring:\n   Returns a numerical approximation of an object \"x\" with at least\n   \"prec\" bits (or decimal \"digits\") of precision.\n...\nsage: (x.variables()).n()\n...\nAttributeError: 'tuple' object has no attribute 'n'\n```",
    "created_at": "2015-05-03T07:11:55Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/18319#issuecomment-251639",
    "user": "https://github.com/mezzarobba"
}
```

<div id="comment:5" align="right">comment:5</div>

If anything I'm surprised that `(x+1).n?` works: typically `obj.foo?` only works reliably if `obj` is a variable, and either raises an error or returns nonsense otherwise. For instance:

```
sage: (x.variables()).n?
Signature:      n(x, prec=None, digits=None, algorithm=None)
Docstring:
   Returns a numerical approximation of an object "x" with at least
   "prec" bits (or decimal "digits") of precision.
...
sage: (x.variables()).n()
...
AttributeError: 'tuple' object has no attribute 'n'
```



---

archive/issue_comments_251640.json:
```json
{
    "body": "<div id=\"comment:6\" align=\"right\">comment:6</div>\n\nI propose to close this as invalid. Objections ?",
    "created_at": "2017-07-07T08:33:10Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/18319#issuecomment-251640",
    "user": "https://github.com/fchapoton"
}
```

<div id="comment:6" align="right">comment:6</div>

I propose to close this as invalid. Objections ?



---

archive/issue_events_258080.json:
```json
{
    "actor": "https://github.com/fchapoton",
    "created_at": "2017-07-07T08:33:10Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "milestone_number": null,
    "milestone_title": "sage-6.7",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18319#event-258080"
}
```



---

archive/issue_events_258081.json:
```json
{
    "actor": "https://github.com/fchapoton",
    "created_at": "2017-07-07T08:33:10Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "7fff00",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18319#event-258081"
}
```



---

archive/issue_comments_251641.json:
```json
{
    "body": "<div id=\"comment:7\" align=\"right\">comment:7</div>\n\nThe `?` parsing is done by IPython, Sage is not involved in this. So this isn't a Sage bug, which is sufficient reason to close this.",
    "created_at": "2017-07-07T10:37:25Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/18319#issuecomment-251641",
    "user": "https://github.com/jdemeyer"
}
```

<div id="comment:7" align="right">comment:7</div>

The `?` parsing is done by IPython, Sage is not involved in this. So this isn't a Sage bug, which is sufficient reason to close this.



---

archive/issue_events_258082.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2017-07-07T10:41:46Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "7fff00",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18319#event-258082"
}
```



---

archive/issue_events_258083.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2017-07-07T10:41:46Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/18319#event-258083"
}
```



---

archive/issue_comments_251642.json:
```json
{
    "body": "<div id=\"comment:8\" align=\"right\">comment:8</div>\n\nSee https://github.com/ipython/ipython/issues/10694",
    "created_at": "2017-07-07T10:41:46Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/18319",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/18319#issuecomment-251642",
    "user": "https://github.com/jdemeyer"
}
```

<div id="comment:8" align="right">comment:8</div>

See https://github.com/ipython/ipython/issues/10694
