# Issue 18462: hash of finitely presented group element

archive/issues_018225.json:
```json
{
    "body": "Two equal elements of a finitely presented group does not have equal hash. For example:\n\n```\nsage: G=groups.presentation.KleinFour()\nsage: a,b=G.generators()\nsage: a^3 == a\nTrue\nsage: hash(a^3)\n1453079729248098375\nsage: hash(a)\n12416037344\n```\n\nConsequently, cayley_graph of finitely presented group is broken:\n\n```\nsage: groups.presentation.KleinFour().cayley_graph()                                                                                    \nDigraph on 14 vertices\n```\n\nOne would expect a graph with 4 vertices only.\n\n**CC:**  @nathanncohen\n\n**Status:** new\n\nIssue created by migration from https://trac.sagemath.org/ticket/18462\n\n",
    "created_at": "2015-05-20T19:31:57Z",
    "labels": [
        "component: group theory",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-6.8",
    "title": "hash of finitely presented group element",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/18462",
    "user": "https://github.com/kalvotom"
}
```
Two equal elements of a finitely presented group does not have equal hash. For example:

```
sage: G=groups.presentation.KleinFour()
sage: a,b=G.generators()
sage: a^3 == a
True
sage: hash(a^3)
1453079729248098375
sage: hash(a)
12416037344
```

Consequently, cayley_graph of finitely presented group is broken:

```
sage: groups.presentation.KleinFour().cayley_graph()                                                                                    
Digraph on 14 vertices
```

One would expect a graph with 4 vertices only.

**CC:**  @nathanncohen

**Status:** new

Issue created by migration from https://trac.sagemath.org/ticket/18462





---

archive/issue_comments_325994.json:
```json
{
    "body": "<a id='comment:2'></a>\nYour problem does not come from `cayley_graph` but from the presentation group itself:\n\n```\nsage: g=groups.presentation.KleinFour()\nsage: a,b=g.generators()\nsage: a**2 == a**4\nTrue\nsage: hash(a**2) == hash(a**4)\nFalse\n```\n\nExample:\n\n```\nsage: {a**2:2,a**4:5}\n{a^4: 5, a^2: 2}\n```",
    "created_at": "2015-05-20T20:18:27Z",
    "issue": "https://github.com/sagemath/sagetest/issues/18462",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/18462#issuecomment-325994",
    "user": "https://github.com/nathanncohen"
}
```

<a id='comment:2'></a>
Your problem does not come from `cayley_graph` but from the presentation group itself:

```
sage: g=groups.presentation.KleinFour()
sage: a,b=g.generators()
sage: a**2 == a**4
True
sage: hash(a**2) == hash(a**4)
False
```

Example:

```
sage: {a**2:2,a**4:5}
{a^4: 5, a^2: 2}
```



---

archive/issue_comments_325995.json:
```json
{
    "body": "<a id='comment:3'></a>\nAs I do not know how to fix this problem, I advise you to open a new ticket with a more exact title or to ask on sage-devel. Otherwise, it is likely that none of those who know how to fix that will notice.\n\nNathann",
    "created_at": "2015-05-20T20:22:24Z",
    "issue": "https://github.com/sagemath/sagetest/issues/18462",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/18462#issuecomment-325995",
    "user": "https://github.com/nathanncohen"
}
```

<a id='comment:3'></a>
As I do not know how to fix this problem, I advise you to open a new ticket with a more exact title or to ask on sage-devel. Otherwise, it is likely that none of those who know how to fix that will notice.

Nathann



---

archive/issue_comments_325996.json:
```json
{
    "body": "<a id='comment:4'></a>\nYes, it indeed comes from the group itself. Somehow the rules obeyed by the group elements are not taken into account (automatically) and `cayley_graph` then creates new vertices.\n\nOne can get the unique representation of the group element in the following way:\n\n```\nsage: G=groups.presentation.KleinFour()\nsage: a,b=G.generators()\nsage: rs=G.rewriting_system()\nsage: rs.make_confluent()\nsage: rs.reduce(a^(-1))\na\nsage: a^(-1)\na^-1\n```\n\nOne way to fix this in `cayley_graph` would be to simplify/reduce the products of group elements before adding them to the graph.\n\nTom\u00e1\u0161",
    "created_at": "2015-05-22T07:19:03Z",
    "issue": "https://github.com/sagemath/sagetest/issues/18462",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/18462#issuecomment-325996",
    "user": "https://github.com/kalvotom"
}
```

<a id='comment:4'></a>
Yes, it indeed comes from the group itself. Somehow the rules obeyed by the group elements are not taken into account (automatically) and `cayley_graph` then creates new vertices.

One can get the unique representation of the group element in the following way:

```
sage: G=groups.presentation.KleinFour()
sage: a,b=G.generators()
sage: rs=G.rewriting_system()
sage: rs.make_confluent()
sage: rs.reduce(a^(-1))
a
sage: a^(-1)
a^-1
```

One way to fix this in `cayley_graph` would be to simplify/reduce the products of group elements before adding them to the graph.

Tomáš



---

archive/issue_comments_325997.json:
```json
{
    "body": "<a id='comment:5'></a>\n> One way to fix this in `cayley_graph` would be to simplify/reduce the products of group elements before adding them to the graph.\n\n\nThat would be a way to fix your code, but if we did that we would knowingly *not* fix the real bug, i.e. the hashing problem. The code of `cayley_graph` does nto seem wrong to me: the problem is with the group elements which do not respect a standard.\n\nYou should write to sage-devel about this: not about the `cayley_graph` problem, but about the hashing problem. \"Two equal elements should always have the same hash\", and this is not satisfied here.\n\nNathann",
    "created_at": "2015-05-22T17:00:03Z",
    "issue": "https://github.com/sagemath/sagetest/issues/18462",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/18462#issuecomment-325997",
    "user": "https://github.com/nathanncohen"
}
```

<a id='comment:5'></a>
> One way to fix this in `cayley_graph` would be to simplify/reduce the products of group elements before adding them to the graph.


That would be a way to fix your code, but if we did that we would knowingly *not* fix the real bug, i.e. the hashing problem. The code of `cayley_graph` does nto seem wrong to me: the problem is with the group elements which do not respect a standard.

You should write to sage-devel about this: not about the `cayley_graph` problem, but about the hashing problem. "Two equal elements should always have the same hash", and this is not satisfied here.

Nathann



---

archive/issue_comments_325998.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -1,15 +1,21 @@\n-It looks like the cayley_graph of finitely presented group is broken in Sage 6.7.\n+Two equal elements of a finitely presented group does not have equal hash. For example:\n \n-For example, cayley_graph of Klein group returns a graph with 14 vertices:\n+```\n+sage: G=groups.presentation.KleinFour()\n+sage: a,b=G.generators()\n+sage: a^3 == a\n+True\n+sage: hash(a^3)\n+1453079729248098375\n+sage: hash(a)\n+12416037344\n+```\n+\n+Consequently, cayley_graph of finitely presented group is broken:\n \n ```\n sage: groups.presentation.KleinFour().cayley_graph()                                                                                    \n Digraph on 14 vertices\n ```\n \n-On the other hand in Sage 6.6 one gets the correct graph with 4 vertices:\n-\n-```\n-sage: groups.presentation.KleinFour().cayley_graph()\n-Launched png viewer for Digraph on 4 vertices\n-```\n+One would expect a graph with 4 vertices only.\n``````\n",
    "created_at": "2015-05-27T14:48:55Z",
    "issue": "https://github.com/sagemath/sagetest/issues/18462",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/18462#issuecomment-325998",
    "user": "https://github.com/kalvotom"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -1,15 +1,21 @@
-It looks like the cayley_graph of finitely presented group is broken in Sage 6.7.
+Two equal elements of a finitely presented group does not have equal hash. For example:
 
-For example, cayley_graph of Klein group returns a graph with 14 vertices:
+```
+sage: G=groups.presentation.KleinFour()
+sage: a,b=G.generators()
+sage: a^3 == a
+True
+sage: hash(a^3)
+1453079729248098375
+sage: hash(a)
+12416037344
+```
+
+Consequently, cayley_graph of finitely presented group is broken:
 
 ```
 sage: groups.presentation.KleinFour().cayley_graph()                                                                                    
 Digraph on 14 vertices
 ```
 
-On the other hand in Sage 6.6 one gets the correct graph with 4 vertices:
-
-```
-sage: groups.presentation.KleinFour().cayley_graph()
-Launched png viewer for Digraph on 4 vertices
-```
+One would expect a graph with 4 vertices only.
``````




---

archive/issue_events_059089.json:
```json
{
    "event": "renamed",
    "issue": "https://github.com/sagemath/sagetest/issues/18462",
    "rename": {
        "from": "cayley_graph of finitely presented group",
        "to": "hash of finitely presented group element"
    },
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/18462#event-59089"
}
```



---

archive/issue_comments_325999.json:
```json
{
    "body": "<a id='comment:7'></a>\n@ncohen: I see. Vincent pointed me to ticket #16059, which seems to solve a similar problem for a different group. I will try to figure this out.",
    "created_at": "2015-05-27T14:56:42Z",
    "issue": "https://github.com/sagemath/sagetest/issues/18462",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/18462#issuecomment-325999",
    "user": "https://github.com/kalvotom"
}
```

<a id='comment:7'></a>
@ncohen: I see. Vincent pointed me to ticket #16059, which seems to solve a similar problem for a different group. I will try to figure this out.
