# Issue 18614: Abelian variety constructor needs sanity checks

archive/issues_018377.json:
```json
{
    "body": "Sage can create abelian varieties attached to modular symbol spaces. Sadly, the output is often mathematically nonsensical, because the construction only makes sense when the weight is 2 but this is not checked in the constructor:\n\n```\nsage: AbelianVariety(ModularSymbols(23, 6).cuspidal_submodule())\nAbelian subvariety of dimension 9 of J0(23)\nsage: J0(23).dimension()\n2\n```\n\nThere are other related bugs: even for weight 2, the construction only makes sense when the modular symbol space is defined over QQ, but the constructor accepts arbitrary modular symbol spaces, resulting in objects so badly broken that they can't even represent themselves as strings:\n\n```\nsage: chi = DirichletGroup(33).1^2\nsage: M = ModularSymbols(chi).cuspidal_submodule()\nsage: M1, M2 = M.decomposition()\nsage: A = AbelianVariety(M1)\nsage: A\n<repr(<sage.modular.abvar.abvar.ModularAbelianVariety_modsym_with_category at 0x7fcf67a3b368>) failed: NotImplementedError>\n```\n\nMoreover, the handling of \"base ring\" is totally misleading:\n\n```\nsage: M = ModularSymbols(23, 2, base_ring=QQbar).cuspidal_submodule()\nsage: A=AbelianVariety(M); A\nAbelian variety J0(23) over Algebraic Field of dimension 2\nsage: A.base_ring()\nAlgebraic Field\n```\nThis suggests that A is the base-extension to QQbar of the Q-variety J0(23); but it's not -- base-extending the abelian variety as a variety has nothing to do with base-extending the defining modular symbols space!\n\nWilliam: I'm ccing you on this ticket because you were the last person to do actual mathematical work on abelian varieties in Sage (in 2010) -- everything more recent in the git logs is just general Sage-wide bug-fixing.\n\nCC:  @williamstein\n\nKeywords: abelian varieties\n\nStatus: new\n\nIssue created by migration from https://trac.sagemath.org/ticket/18614\n\n",
    "created_at": "2015-06-05T10:30:37Z",
    "labels": [
        "component: modular forms",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-6.8",
    "title": "Abelian variety constructor needs sanity checks",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/18614",
    "user": "https://github.com/loefflerd"
}
```
Sage can create abelian varieties attached to modular symbol spaces. Sadly, the output is often mathematically nonsensical, because the construction only makes sense when the weight is 2 but this is not checked in the constructor:

```
sage: AbelianVariety(ModularSymbols(23, 6).cuspidal_submodule())
Abelian subvariety of dimension 9 of J0(23)
sage: J0(23).dimension()
2
```

There are other related bugs: even for weight 2, the construction only makes sense when the modular symbol space is defined over QQ, but the constructor accepts arbitrary modular symbol spaces, resulting in objects so badly broken that they can't even represent themselves as strings:

```
sage: chi = DirichletGroup(33).1^2
sage: M = ModularSymbols(chi).cuspidal_submodule()
sage: M1, M2 = M.decomposition()
sage: A = AbelianVariety(M1)
sage: A
<repr(<sage.modular.abvar.abvar.ModularAbelianVariety_modsym_with_category at 0x7fcf67a3b368>) failed: NotImplementedError>
```

Moreover, the handling of "base ring" is totally misleading:

```
sage: M = ModularSymbols(23, 2, base_ring=QQbar).cuspidal_submodule()
sage: A=AbelianVariety(M); A
Abelian variety J0(23) over Algebraic Field of dimension 2
sage: A.base_ring()
Algebraic Field
```
This suggests that A is the base-extension to QQbar of the Q-variety J0(23); but it's not -- base-extending the abelian variety as a variety has nothing to do with base-extending the defining modular symbols space!

William: I'm ccing you on this ticket because you were the last person to do actual mathematical work on abelian varieties in Sage (in 2010) -- everything more recent in the git logs is just general Sage-wide bug-fixing.

CC:  @williamstein

Keywords: abelian varieties

Status: new

Issue created by migration from https://trac.sagemath.org/ticket/18614





---

archive/issue_comments_265541.json:
```json
{
    "body": "Changing type from PLEASE CHANGE to defect.",
    "created_at": "2015-06-05T10:30:54Z",
    "issue": "https://github.com/sagemath/sagetest/issues/18614",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/18614#issuecomment-265541",
    "user": "https://github.com/loefflerd"
}
```

Changing type from PLEASE CHANGE to defect.



---

archive/issue_comments_265542.json:
```json
{
    "body": "<a id='comment:2'></a>> the construction only makes sense when the weight is 2\n\n\nMathematically, the construction makes sense for any weight, with the caveat that when the weight is > 2 the abelian variety is likely not defined over a number field (it's defined over RR or CC).  Shimura even wrote a paper about doing this with Delta back in the 60's...  There are also some more examples in my ph.d. thesis. \n\n>  the construction only makes sense when the modular symbol space is defined over QQ\n\n\nAgain, at least mathematically the construction makes sense in more generality than over QQ.\n\nI'm not claiming anything about the code in Sage making sense beyond \"over QQ\" and weight 2, though I definitely always planned for it to do so.",
    "created_at": "2015-06-05T17:18:38Z",
    "issue": "https://github.com/sagemath/sagetest/issues/18614",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/18614#issuecomment-265542",
    "user": "https://github.com/williamstein"
}
```

<a id='comment:2'></a>> the construction only makes sense when the weight is 2


Mathematically, the construction makes sense for any weight, with the caveat that when the weight is > 2 the abelian variety is likely not defined over a number field (it's defined over RR or CC).  Shimura even wrote a paper about doing this with Delta back in the 60's...  There are also some more examples in my ph.d. thesis. 

>  the construction only makes sense when the modular symbol space is defined over QQ


Again, at least mathematically the construction makes sense in more generality than over QQ.

I'm not claiming anything about the code in Sage making sense beyond "over QQ" and weight 2, though I definitely always planned for it to do so.
