# Issue 18865: Can't make ring homomorphism from ring of integers to a residue field

archive/issues_018628.json:
```json
{
    "body": "It doesn't seem possible to create a ring homomorphism from an order in a number field to a residue field of the number field. For instance:\n\n```\nsage: K.<a> = NumberField(x^2-2)\nsage: OK = K.ring_of_integers()\nsage: P = K.primes_above(3)[0]\nsage: kappa = P.residue_field()\nsage: abar = kappa.gen()\nsage: im = [g.polynomial().change_ring(ZZ)(abar) for g in OK.gens()]\nsage: iota = OK.hom(im)\n```\nraises \"TypeError: images do not define a valid homomorphism\".\n\nNow, if instead you pass \"check=False\" to OK.hom, you of course get an iota, but you are unable to evaluate it:\n\n```\nsage: iota = OK.hom(im, check=False)\nsage: iota(K.gen())\n```\nThis raises \"TypeError: unsupported operand parent(s) for '*': 'Rational Field' and 'Residue field in abar of Fractional ideal (3)'\". I tried being clever and doing:\n\n```\nsage: iota(OK(K.gen()))\n```\nbut got the same error. Tracing it back, when sage tries to evaluate iota at an element a, it calls a._im_gens_(kappa, im) and this is totally wrong for this homset. Rather it is meant for homomorphisms between number fields. Basically, it looks like we need a function _im_gens_ for OrderElement types. It should take the element a written out in the basis given by OK.gens() and replace the basis elements with the element in im.\n\n**Keywords:** Ring of integers, homset, residue field\n\n**Status:** new\n\nIssue created by migration from https://trac.sagemath.org/ticket/18865\n\n",
    "created_at": "2015-07-08T01:31:24Z",
    "labels": [
        "component: number fields",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-6.8",
    "title": "Can't make ring homomorphism from ring of integers to a residue field",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/18865",
    "user": "https://github.com/rharron"
}
```
It doesn't seem possible to create a ring homomorphism from an order in a number field to a residue field of the number field. For instance:

```
sage: K.<a> = NumberField(x^2-2)
sage: OK = K.ring_of_integers()
sage: P = K.primes_above(3)[0]
sage: kappa = P.residue_field()
sage: abar = kappa.gen()
sage: im = [g.polynomial().change_ring(ZZ)(abar) for g in OK.gens()]
sage: iota = OK.hom(im)
```
raises "TypeError: images do not define a valid homomorphism".

Now, if instead you pass "check=False" to OK.hom, you of course get an iota, but you are unable to evaluate it:

```
sage: iota = OK.hom(im, check=False)
sage: iota(K.gen())
```
This raises "TypeError: unsupported operand parent(s) for '*': 'Rational Field' and 'Residue field in abar of Fractional ideal (3)'". I tried being clever and doing:

```
sage: iota(OK(K.gen()))
```
but got the same error. Tracing it back, when sage tries to evaluate iota at an element a, it calls a._im_gens_(kappa, im) and this is totally wrong for this homset. Rather it is meant for homomorphisms between number fields. Basically, it looks like we need a function _im_gens_ for OrderElement types. It should take the element a written out in the basis given by OK.gens() and replace the basis elements with the element in im.

**Keywords:** Ring of integers, homset, residue field

**Status:** new

Issue created by migration from https://trac.sagemath.org/ticket/18865





---

archive/issue_comments_319168.json:
```json
{
    "body": "<a id='comment:1'></a>\nActually, the following works:\n\n```\niota = OK.hom(kappa)\niota(K.gen(0))\niota(OK.gen(0))\n```\n\nBut you can't define the morphism explicitly.",
    "created_at": "2022-02-01T20:17:53Z",
    "issue": "https://github.com/sagemath/sagetest/issues/18865",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/18865#issuecomment-319168",
    "user": "https://github.com/saraedum"
}
```

<a id='comment:1'></a>
Actually, the following works:

```
iota = OK.hom(kappa)
iota(K.gen(0))
iota(OK.gen(0))
```

But you can't define the morphism explicitly.
