# Issue 30182: Family: support slices

archive/issues_029945.json:
```json
{
    "body": "\n```\nsage: F = Family([0, 1, 4, 9])\nsage: F[2]\n4\nsage: F[2:]\n(4, 9)\n```\nThis happens to work because it is passed on to `list.__item__`.\nBut:\n\n```\nsage: F = Family({0:0, 2:4, 3:9})       # note 1 is missing\nsage: F[2]\n4\nsage: F[2:]\nTypeError: unhashable type: 'slice'     # currently\n```\n\nIn this ticket, we add slice support to `Family`.\n\n```\nsage: F[2:]\nTypeError: unhashable type: 'slice'     # currently\n(4, 9)                                  # with this ticket\nsage: F[0:1]\n(0,)                                    # with this ticket\nsage: F[0:3]\nIndexError: 1 not in family             # with this ticket\n```\n\n\nAs an extension, we will give elements of `CombinatorialFreeModule` convenient slice accessors like those available for `FreeModule` and `FiniteRankFreeModule`.\n\n```\nsage: F = FreeModule(QQ, 6)\nsage: F.basis()[2:4]\n[\n(0, 0, 1, 0, 0, 0),\n(0, 0, 0, 1, 0, 0)\n]\nsage: v = F.basis()[2] + F.basis()[3]\nsage: v\n(0, 0, 1, 1, 0, 0)\nsage: v[2:4]\n(1, 1)\nsage: type(_)\n<class 'sage.modules.vector_rational_dense.Vector_rational_dense'>\n\nsage: F = FiniteRankFreeModule(QQ, 3)\nsage: e = F.basis('e')\nsage: F = FiniteRankFreeModule(QQ, 5)\nsage: e = F.basis('e')\nsage: e[2:4]\n(Element e_2 of the 5-dimensional vector space over the Rational Field,\n Element e_3 of the 5-dimensional vector space over the Rational Field)\nsage: v = e[2] + e[3]\nsage: v\nElement e_2+e_3 of the 5-dimensional vector space over the Rational Field\nsage: v[e, 2:4]\n[1, 1]\nsage: type(_)\n<class 'list'>\n\nsage: F = CombinatorialFreeModule(QQ, [2, 3, 5])\nsage: F.basis()[2:4]\nTypeError: unhashable type: 'slice'     # currently\n[B[2], B[3]]                            # with this ticket\nsage: v = F.basis()[2] + F.basis()[3]\nsage: v\nB[2] + B[3]\nsage: v[2]\n1\nsage: v[2:4]\nTypeError: unhashable type: 'slice'    # currently\n(1, 1)                                 # with this ticket\n```\n\n\n---\n\nRandom references:\n- https://numpy.org/doc/stable/reference/arrays.indexing.html\n\n\n\n\n**CC:**  @tscrim @nthiery @mwageringel\n\n**Dependencies:** #29991\n\nIssue created by migration from https://trac.sagemath.org/ticket/30182\n\n",
    "created_at": "2020-07-20T19:33:32Z",
    "labels": [
        "component: combinatorics",
        "enhancement"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-9.8",
    "title": "Family: support slices",
    "type": "issue",
    "url": "https://github.com/sagemath/sage/issues/30182",
    "user": "https://github.com/mkoeppe"
}
```

```
sage: F = Family([0, 1, 4, 9])
sage: F[2]
4
sage: F[2:]
(4, 9)
```
This happens to work because it is passed on to `list.__item__`.
But:

```
sage: F = Family({0:0, 2:4, 3:9})       # note 1 is missing
sage: F[2]
4
sage: F[2:]
TypeError: unhashable type: 'slice'     # currently
```

In this ticket, we add slice support to `Family`.

```
sage: F[2:]
TypeError: unhashable type: 'slice'     # currently
(4, 9)                                  # with this ticket
sage: F[0:1]
(0,)                                    # with this ticket
sage: F[0:3]
IndexError: 1 not in family             # with this ticket
```


As an extension, we will give elements of `CombinatorialFreeModule` convenient slice accessors like those available for `FreeModule` and `FiniteRankFreeModule`.

```
sage: F = FreeModule(QQ, 6)
sage: F.basis()[2:4]
[
(0, 0, 1, 0, 0, 0),
(0, 0, 0, 1, 0, 0)
]
sage: v = F.basis()[2] + F.basis()[3]
sage: v
(0, 0, 1, 1, 0, 0)
sage: v[2:4]
(1, 1)
sage: type(_)
<class 'sage.modules.vector_rational_dense.Vector_rational_dense'>

sage: F = FiniteRankFreeModule(QQ, 3)
sage: e = F.basis('e')
sage: F = FiniteRankFreeModule(QQ, 5)
sage: e = F.basis('e')
sage: e[2:4]
(Element e_2 of the 5-dimensional vector space over the Rational Field,
 Element e_3 of the 5-dimensional vector space over the Rational Field)
sage: v = e[2] + e[3]
sage: v
Element e_2+e_3 of the 5-dimensional vector space over the Rational Field
sage: v[e, 2:4]
[1, 1]
sage: type(_)
<class 'list'>

sage: F = CombinatorialFreeModule(QQ, [2, 3, 5])
sage: F.basis()[2:4]
TypeError: unhashable type: 'slice'     # currently
[B[2], B[3]]                            # with this ticket
sage: v = F.basis()[2] + F.basis()[3]
sage: v
B[2] + B[3]
sage: v[2]
1
sage: v[2:4]
TypeError: unhashable type: 'slice'    # currently
(1, 1)                                 # with this ticket
```


---

Random references:
- https://numpy.org/doc/stable/reference/arrays.indexing.html




**CC:**  @tscrim @nthiery @mwageringel

**Dependencies:** #29991

Issue created by migration from https://trac.sagemath.org/ticket/30182





---

archive/issue_comments_480832.json:
```json
{
    "body": "<a id='comment:1'></a>\n+1\n\nI have been looking for this functionality, too, recently.",
    "created_at": "2020-07-20T19:46:34Z",
    "issue": "https://github.com/sagemath/sage/issues/30182",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/30182#issuecomment-480832",
    "user": "https://github.com/mwageringel"
}
```

<a id='comment:1'></a>
+1

I have been looking for this functionality, too, recently.



---

archive/issue_comments_480833.json:
```json
{
    "body": "<a id='comment:2'></a>\nIt's a natural feature to wish. Yet one difficulty is what semantic do we want for `F[i:j]`, given that `F[i]` does not return the i-th element, but the element indexed by i?. Should this be the i-th to j-1-th element of the family? Or all elements with index k such that i<=k<j? In the latter case, for which order?",
    "created_at": "2020-07-20T19:58:59Z",
    "issue": "https://github.com/sagemath/sage/issues/30182",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/30182#issuecomment-480833",
    "user": "https://github.com/nthiery"
}
```

<a id='comment:2'></a>
It's a natural feature to wish. Yet one difficulty is what semantic do we want for `F[i:j]`, given that `F[i]` does not return the i-th element, but the element indexed by i?. Should this be the i-th to j-1-th element of the family? Or all elements with index k such that i<=k<j? In the latter case, for which order?



---

archive/issue_comments_480834.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -10,10 +10,18 @@\n But:\n \n ```\n-sage: F = Family({0:0, 1:1, 2:4, 3:9})\n+sage: F = Family({0:0, 2:4, 3:9})\n sage: F[2]\n 4\n sage: F[2:]\n TypeError: unhashable type: 'slice'\n ```\n+With added support for slices:\n \n+```\n+sage: F[2:]\n+(4, 9)\n+sage: F[0:3]\n+IndexError: 1 not in family\n+```\n+\n``````\n",
    "created_at": "2020-07-20T20:10:33Z",
    "issue": "https://github.com/sagemath/sage/issues/30182",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/30182#issuecomment-480834",
    "user": "https://github.com/mkoeppe"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -10,10 +10,18 @@
 But:
 
 ```
-sage: F = Family({0:0, 1:1, 2:4, 3:9})
+sage: F = Family({0:0, 2:4, 3:9})
 sage: F[2]
 4
 sage: F[2:]
 TypeError: unhashable type: 'slice'
 ```
+With added support for slices:
 
+```
+sage: F[2:]
+(4, 9)
+sage: F[0:3]
+IndexError: 1 not in family
+```
+
``````




---

archive/issue_comments_480835.json:
```json
{
    "body": "<a id='comment:3'></a>\nThanks. I have clarified the ticket description",
    "created_at": "2020-07-20T20:10:33Z",
    "issue": "https://github.com/sagemath/sage/issues/30182",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/30182#issuecomment-480835",
    "user": "https://github.com/mkoeppe"
}
```

<a id='comment:3'></a>
Thanks. I have clarified the ticket description



---

archive/issue_comments_480836.json:
```json
{
    "body": "<a id='comment:4'></a>\nHi Matthias,\n\nCan you clarify the semantic you have in mind? I am not sure why the first should fail when the second one would not?",
    "created_at": "2020-07-20T20:28:05Z",
    "issue": "https://github.com/sagemath/sage/issues/30182",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/30182#issuecomment-480836",
    "user": "https://github.com/nthiery"
}
```

<a id='comment:4'></a>
Hi Matthias,

Can you clarify the semantic you have in mind? I am not sure why the first should fail when the second one would not?



---

archive/issue_comments_480837.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -10,18 +10,15 @@\n But:\n \n ```\n-sage: F = Family({0:0, 2:4, 3:9})\n+sage: F = Family({0:0, 2:4, 3:9})       # note 1 is missing\n sage: F[2]\n 4\n sage: F[2:]\n-TypeError: unhashable type: 'slice'\n-```\n-With added support for slices:\n-\n-```\n-sage: F[2:]\n-(4, 9)\n+TypeError: unhashable type: 'slice'     # currently\n+(4, 9)                                  # with this ticket\n+sage: F[0:1]\n+(0,)                                    # with this ticket\n sage: F[0:3]\n-IndexError: 1 not in family\n+IndexError: 1 not in family             # with this ticket\n ```\n \n``````\n",
    "created_at": "2020-07-20T20:33:54Z",
    "issue": "https://github.com/sagemath/sage/issues/30182",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/30182#issuecomment-480837",
    "user": "https://github.com/mkoeppe"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -10,18 +10,15 @@
 But:
 
 ```
-sage: F = Family({0:0, 2:4, 3:9})
+sage: F = Family({0:0, 2:4, 3:9})       # note 1 is missing
 sage: F[2]
 4
 sage: F[2:]
-TypeError: unhashable type: 'slice'
-```
-With added support for slices:
-
-```
-sage: F[2:]
-(4, 9)
+TypeError: unhashable type: 'slice'     # currently
+(4, 9)                                  # with this ticket
+sage: F[0:1]
+(0,)                                    # with this ticket
 sage: F[0:3]
-IndexError: 1 not in family
+IndexError: 1 not in family             # with this ticket
 ```
 
``````




---

archive/issue_comments_480838.json:
```json
{
    "body": "<a id='comment:5'></a>\nEdited the description to clarify",
    "created_at": "2020-07-20T20:33:54Z",
    "issue": "https://github.com/sagemath/sage/issues/30182",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/30182#issuecomment-480838",
    "user": "https://github.com/mkoeppe"
}
```

<a id='comment:5'></a>
Edited the description to clarify



---

archive/issue_comments_480839.json:
```json
{
    "body": "<a id='comment:6'></a>\nReplying to [nthiery](#comment%3A2):\n> what semantic do we want for F[i:j], ...\n> Should this be ... all elements with index k such that i<=k<j? In the latter case, for which order?\n\n\nYes, raising an `IndexError` if an element indexed by k is not present. In the order of increasing indices.",
    "created_at": "2020-07-20T20:36:49Z",
    "issue": "https://github.com/sagemath/sage/issues/30182",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/30182#issuecomment-480839",
    "user": "https://github.com/mkoeppe"
}
```

<a id='comment:6'></a>
Replying to [nthiery](#comment%3A2):
> what semantic do we want for F[i:j], ...
> Should this be ... all elements with index k such that i<=k<j? In the latter case, for which order?


Yes, raising an `IndexError` if an element indexed by k is not present. In the order of increasing indices.



---

archive/issue_comments_480840.json:
```json
{
    "body": "<a id='comment:7'></a>\nOk. That's consistent indeed.",
    "created_at": "2020-07-20T20:40:44Z",
    "issue": "https://github.com/sagemath/sage/issues/30182",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/30182#issuecomment-480840",
    "user": "https://github.com/nthiery"
}
```

<a id='comment:7'></a>
Ok. That's consistent indeed.



---

archive/issue_comments_480841.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -22,3 +22,42 @@\n IndexError: 1 not in family             # with this ticket\n ```\n \n+\n+This will give elements of `CombinatorialFreeModule` convenient slice accessors like those available for `FreeModule` and `FiniteRankFreeModule`.\n+\n+```\n+sage: F = FreeModule(QQ, 6)\n+sage: v = F.basis()[2] + F.basis()[3]\n+sage: v\n+(0, 0, 1, 1, 0, 0)\n+sage: v[2:4]\n+(1, 1)\n+sage: type(_)\n+<class 'sage.modules.vector_rational_dense.Vector_rational_dense'>\n+\n+sage: F = FiniteRankFreeModule(QQ, 3)\n+sage: e = F.basis('e')\n+sage: F = FiniteRankFreeModule(QQ, 5)\n+sage: e = F.basis('e')\n+sage: v = e[2] + e[3]\n+sage: v\n+Element e_2+e_3 of the 5-dimensional vector space over the Rational Field\n+sage: v[e, 2:4]\n+[1, 1]\n+sage: type(_)\n+<class 'list'>\n+\n+sage: F = CombinatorialFreeModule(QQ, [2, 3, 5])\n+sage: v = F.basis()[2] + F.basis()[3]\n+sage: v\n+B[2] + B[3]\n+sage: v[2]\n+1\n+sage: v[2:4]\n+TypeError: unhashable type: 'slice'    # currently\n+(1, 1)                                 # with this ticket\n+```\n+\n+\n+\n+\n``````\n",
    "created_at": "2020-07-20T20:48:58Z",
    "issue": "https://github.com/sagemath/sage/issues/30182",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/30182#issuecomment-480841",
    "user": "https://github.com/mkoeppe"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -22,3 +22,42 @@
 IndexError: 1 not in family             # with this ticket
 ```
 
+
+This will give elements of `CombinatorialFreeModule` convenient slice accessors like those available for `FreeModule` and `FiniteRankFreeModule`.
+
+```
+sage: F = FreeModule(QQ, 6)
+sage: v = F.basis()[2] + F.basis()[3]
+sage: v
+(0, 0, 1, 1, 0, 0)
+sage: v[2:4]
+(1, 1)
+sage: type(_)
+<class 'sage.modules.vector_rational_dense.Vector_rational_dense'>
+
+sage: F = FiniteRankFreeModule(QQ, 3)
+sage: e = F.basis('e')
+sage: F = FiniteRankFreeModule(QQ, 5)
+sage: e = F.basis('e')
+sage: v = e[2] + e[3]
+sage: v
+Element e_2+e_3 of the 5-dimensional vector space over the Rational Field
+sage: v[e, 2:4]
+[1, 1]
+sage: type(_)
+<class 'list'>
+
+sage: F = CombinatorialFreeModule(QQ, [2, 3, 5])
+sage: v = F.basis()[2] + F.basis()[3]
+sage: v
+B[2] + B[3]
+sage: v[2]
+1
+sage: v[2:4]
+TypeError: unhashable type: 'slice'    # currently
+(1, 1)                                 # with this ticket
+```
+
+
+
+
``````




---

archive/issue_comments_480842.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -13,6 +13,13 @@\n sage: F = Family({0:0, 2:4, 3:9})       # note 1 is missing\n sage: F[2]\n 4\n+sage: F[2:]\n+TypeError: unhashable type: 'slice'     # currently\n+```\n+\n+In this ticket, we add slice support to `Family`.\n+\n+```\n sage: F[2:]\n TypeError: unhashable type: 'slice'     # currently\n (4, 9)                                  # with this ticket\n``````\n",
    "created_at": "2020-07-20T20:51:20Z",
    "issue": "https://github.com/sagemath/sage/issues/30182",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/30182#issuecomment-480842",
    "user": "https://github.com/mkoeppe"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -13,6 +13,13 @@
 sage: F = Family({0:0, 2:4, 3:9})       # note 1 is missing
 sage: F[2]
 4
+sage: F[2:]
+TypeError: unhashable type: 'slice'     # currently
+```
+
+In this ticket, we add slice support to `Family`.
+
+```
 sage: F[2:]
 TypeError: unhashable type: 'slice'     # currently
 (4, 9)                                  # with this ticket
``````




---

archive/issue_comments_480843.json:
```json
{
    "body": "<a id='comment:10'></a>\nI am not sure about half-open slices. For example, what is the expected result of this?\n\n```\nsage: F = Family({0:0, 2:4, 3:9, 10:10})\nsage: F[2:]\n```\n\nI would probably expect an error, as the keys `4..9` are missing, but it is not possible to obtain this information efficiently from the dictionary.",
    "created_at": "2020-07-20T20:54:29Z",
    "issue": "https://github.com/sagemath/sage/issues/30182",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/30182#issuecomment-480843",
    "user": "https://github.com/mwageringel"
}
```

<a id='comment:10'></a>
I am not sure about half-open slices. For example, what is the expected result of this?

```
sage: F = Family({0:0, 2:4, 3:9, 10:10})
sage: F[2:]
```

I would probably expect an error, as the keys `4..9` are missing, but it is not possible to obtain this information efficiently from the dictionary.



---

archive/issue_comments_480844.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -30,10 +30,15 @@\n ```\n \n \n-This will give elements of `CombinatorialFreeModule` convenient slice accessors like those available for `FreeModule` and `FiniteRankFreeModule`.\n+As an extension, we will give elements of `CombinatorialFreeModule` convenient slice accessors like those available for `FreeModule` and `FiniteRankFreeModule`.\n \n ```\n sage: F = FreeModule(QQ, 6)\n+sage: F.basis()[2:4]\n+[\n+(0, 0, 1, 0, 0, 0),\n+(0, 0, 0, 1, 0, 0)\n+]\n sage: v = F.basis()[2] + F.basis()[3]\n sage: v\n (0, 0, 1, 1, 0, 0)\n@@ -46,6 +51,9 @@\n sage: e = F.basis('e')\n sage: F = FiniteRankFreeModule(QQ, 5)\n sage: e = F.basis('e')\n+sage: e[2:4]\n+(Element e_2 of the 5-dimensional vector space over the Rational Field,\n+ Element e_3 of the 5-dimensional vector space over the Rational Field)\n sage: v = e[2] + e[3]\n sage: v\n Element e_2+e_3 of the 5-dimensional vector space over the Rational Field\n@@ -55,6 +63,9 @@\n <class 'list'>\n \n sage: F = CombinatorialFreeModule(QQ, [2, 3, 5])\n+sage: F.basis()[2:4]\n+TypeError: unhashable type: 'slice'     # currently\n+[B[2], B[3]]                            # with this ticket\n sage: v = F.basis()[2] + F.basis()[3]\n sage: v\n B[2] + B[3]\n``````\n",
    "created_at": "2020-07-20T20:58:41Z",
    "issue": "https://github.com/sagemath/sage/issues/30182",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/30182#issuecomment-480844",
    "user": "https://github.com/mkoeppe"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -30,10 +30,15 @@
 ```
 
 
-This will give elements of `CombinatorialFreeModule` convenient slice accessors like those available for `FreeModule` and `FiniteRankFreeModule`.
+As an extension, we will give elements of `CombinatorialFreeModule` convenient slice accessors like those available for `FreeModule` and `FiniteRankFreeModule`.
 
 ```
 sage: F = FreeModule(QQ, 6)
+sage: F.basis()[2:4]
+[
+(0, 0, 1, 0, 0, 0),
+(0, 0, 0, 1, 0, 0)
+]
 sage: v = F.basis()[2] + F.basis()[3]
 sage: v
 (0, 0, 1, 1, 0, 0)
@@ -46,6 +51,9 @@
 sage: e = F.basis('e')
 sage: F = FiniteRankFreeModule(QQ, 5)
 sage: e = F.basis('e')
+sage: e[2:4]
+(Element e_2 of the 5-dimensional vector space over the Rational Field,
+ Element e_3 of the 5-dimensional vector space over the Rational Field)
 sage: v = e[2] + e[3]
 sage: v
 Element e_2+e_3 of the 5-dimensional vector space over the Rational Field
@@ -55,6 +63,9 @@
 <class 'list'>
 
 sage: F = CombinatorialFreeModule(QQ, [2, 3, 5])
+sage: F.basis()[2:4]
+TypeError: unhashable type: 'slice'     # currently
+[B[2], B[3]]                            # with this ticket
 sage: v = F.basis()[2] + F.basis()[3]
 sage: v
 B[2] + B[3]
``````




---

archive/issue_comments_480845.json:
```json
{
    "body": "<a id='comment:12'></a>\nReplying to [gh-mwageringel](#comment%3A10):\n> I am not sure about half-open slices. For example, what is the expected result of this?\n> \n> ```\n> sage: F = Family({0:0, 2:4, 3:9, 10:10})\n> sage: F[2:]\n> ```\n> \n> I would probably expect an error, as the keys `4..9` are missing, but it is not possible to obtain this information efficiently from the dictionary.\n\n\nThis is certainly a point that needs clarification.",
    "created_at": "2020-07-20T21:03:45Z",
    "issue": "https://github.com/sagemath/sage/issues/30182",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/30182#issuecomment-480845",
    "user": "https://github.com/mkoeppe"
}
```

<a id='comment:12'></a>
Replying to [gh-mwageringel](#comment%3A10):
> I am not sure about half-open slices. For example, what is the expected result of this?
> 
> ```
> sage: F = Family({0:0, 2:4, 3:9, 10:10})
> sage: F[2:]
> ```
> 
> I would probably expect an error, as the keys `4..9` are missing, but it is not possible to obtain this information efficiently from the dictionary.


This is certainly a point that needs clarification.



---

archive/issue_comments_480846.json:
```json
{
    "body": "<a id='comment:13'></a>\nI don't expect that to be an error, but instead return `[4, 9, 10]` or maybe `Family({2:4, 3:9, 10:10})`.\n\nWhat you are essentially asking for is a slice of a `dict`. However, I don't think this makes a lot of sense.\n\nAlso, what do you do when the keys are not (and cannot be) ordered?\n\nI think this is fine when the `Family` object is list-like, but in general, I doubt it is possible to get something consistent.",
    "created_at": "2020-07-24T01:29:51Z",
    "issue": "https://github.com/sagemath/sage/issues/30182",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/30182#issuecomment-480846",
    "user": "https://github.com/tscrim"
}
```

<a id='comment:13'></a>
I don't expect that to be an error, but instead return `[4, 9, 10]` or maybe `Family({2:4, 3:9, 10:10})`.

What you are essentially asking for is a slice of a `dict`. However, I don't think this makes a lot of sense.

Also, what do you do when the keys are not (and cannot be) ordered?

I think this is fine when the `Family` object is list-like, but in general, I doubt it is possible to get something consistent.



---

archive/issue_comments_480847.json:
```json
{
    "body": "<a id='comment:14'></a>\nMy take is that `Family` is trying to abstract the difference between lists and hashes etc. away.  But currently the slicing behavior of lists leaks through to `__item__`.  It would be fine to just make the first example in the ticket description an error too.\n\nBut I think slicing *is* very useful, and the specification that we have worked out so far on the ticket seems consistent. We could just make unbounded ranges an error - bounded ranges would still be good enough.",
    "created_at": "2020-07-24T01:43:18Z",
    "issue": "https://github.com/sagemath/sage/issues/30182",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/30182#issuecomment-480847",
    "user": "https://github.com/mkoeppe"
}
```

<a id='comment:14'></a>
My take is that `Family` is trying to abstract the difference between lists and hashes etc. away.  But currently the slicing behavior of lists leaks through to `__item__`.  It would be fine to just make the first example in the ticket description an error too.

But I think slicing *is* very useful, and the specification that we have worked out so far on the ticket seems consistent. We could just make unbounded ranges an error - bounded ranges would still be good enough.



---

archive/issue_comments_480848.json:
```json
{
    "body": "<a id='comment:15'></a>\nI agree that slicing is useful.\n\nEven with bounded ranges, there still is a problem when the keys are not comparable (say, indexed by complex numbers). If they form a poset, then the natural thing would be the interval between them, but the next question is how do you check you got everything? For finite posets, this isn't a problem, but a `Family` can be indexed by an infinite set. Do you want to just disallow slices when the set is infinite? Or perhaps just non-enumerated sets, where you don't have a `rank` function?",
    "created_at": "2020-07-24T02:14:48Z",
    "issue": "https://github.com/sagemath/sage/issues/30182",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/30182#issuecomment-480848",
    "user": "https://github.com/tscrim"
}
```

<a id='comment:15'></a>
I agree that slicing is useful.

Even with bounded ranges, there still is a problem when the keys are not comparable (say, indexed by complex numbers). If they form a poset, then the natural thing would be the interval between them, but the next question is how do you check you got everything? For finite posets, this isn't a problem, but a `Family` can be indexed by an infinite set. Do you want to just disallow slices when the set is infinite? Or perhaps just non-enumerated sets, where you don't have a `rank` function?



---

archive/issue_comments_480849.json:
```json
{
    "body": "<a id='comment:16'></a>\nI am not sure about the interpretation of slice(a, b) as intervals. That is not really compatible with the idea that it is an error if an element is missing.\n\nRather I'd make the assumption that the index set is totally ordered and define slice(a,b) == slice(a, b, 1) and slice(a, b, step) == [ a, a+step, ... ]",
    "created_at": "2020-07-24T02:22:26Z",
    "issue": "https://github.com/sagemath/sage/issues/30182",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/30182#issuecomment-480849",
    "user": "https://github.com/mkoeppe"
}
```

<a id='comment:16'></a>
I am not sure about the interpretation of slice(a, b) as intervals. That is not really compatible with the idea that it is an error if an element is missing.

Rather I'd make the assumption that the index set is totally ordered and define slice(a,b) == slice(a, b, 1) and slice(a, b, step) == [ a, a+step, ... ]



---

archive/issue_comments_480850.json:
```json
{
    "body": "<a id='comment:17'></a>\nThen what does \"totally ordered\" and \"missing\" mean here? The set `[0, 2, 3, 10]` is totally ordered, and there are 4! number of orderings possible to. What about if I do `[0, 2/3, 3/10, 5]` as my keys?",
    "created_at": "2020-07-24T02:48:54Z",
    "issue": "https://github.com/sagemath/sage/issues/30182",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/30182#issuecomment-480850",
    "user": "https://github.com/tscrim"
}
```

<a id='comment:17'></a>
Then what does "totally ordered" and "missing" mean here? The set `[0, 2, 3, 10]` is totally ordered, and there are 4! number of orderings possible to. What about if I do `[0, 2/3, 3/10, 5]` as my keys?



---

archive/issue_comments_480851.json:
```json
{
    "body": "**Dependencies:** #29991",
    "created_at": "2020-07-24T16:54:56Z",
    "issue": "https://github.com/sagemath/sage/issues/30182",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/30182#issuecomment-480851",
    "user": "https://github.com/mkoeppe"
}
```

**Dependencies:** #29991



---

archive/issue_comments_480852.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -77,5 +77,10 @@\n ```\n \n \n+---\n+\n+Random references:\n+- https://numpy.org/doc/stable/reference/arrays.indexing.html\n \n \n+\n``````\n",
    "created_at": "2020-07-24T16:58:12Z",
    "issue": "https://github.com/sagemath/sage/issues/30182",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/30182#issuecomment-480852",
    "user": "https://github.com/mkoeppe"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -77,5 +77,10 @@
 ```
 
 
+---
+
+Random references:
+- https://numpy.org/doc/stable/reference/arrays.indexing.html
 
 
+
``````




---

archive/issue_comments_480853.json:
```json
{
    "body": "<a id='comment:20'></a>\nReplying to [tscrim](#comment%3A13):\n> I don't expect that to be an error, but instead return `[4, 9, 10]` or maybe `Family({2:4, 3:9, 10:10})`.\n\n\nIndeed, it might be better if it does not raise an error, especially if the example from the description is an intended use case in which a slice is used to restrict the support of an element in `CombinatorialFreeModule`.\n\nThis is also consistent with ordinary use of slices, as the following does not throw an error either:\n\n```\nsage: [0,1,2][0:10]\n[0, 1, 2]\n```\n\n> Also, what do you do when the keys are not (and cannot be) ordered?\n\n\nI think it is fine to focus on the case in which the keys are integers for now.",
    "created_at": "2020-07-24T18:16:24Z",
    "issue": "https://github.com/sagemath/sage/issues/30182",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/30182#issuecomment-480853",
    "user": "https://github.com/mwageringel"
}
```

<a id='comment:20'></a>
Replying to [tscrim](#comment%3A13):
> I don't expect that to be an error, but instead return `[4, 9, 10]` or maybe `Family({2:4, 3:9, 10:10})`.


Indeed, it might be better if it does not raise an error, especially if the example from the description is an intended use case in which a slice is used to restrict the support of an element in `CombinatorialFreeModule`.

This is also consistent with ordinary use of slices, as the following does not throw an error either:

```
sage: [0,1,2][0:10]
[0, 1, 2]
```

> Also, what do you do when the keys are not (and cannot be) ordered?


I think it is fine to focus on the case in which the keys are integers for now.



---

archive/issue_comments_480854.json:
```json
{
    "body": "<a id='comment:21'></a>\nReplying to [gh-mwageringel](#comment%3A20):\n> Replying to [tscrim](#comment%3A13):\n> > I don't expect that to be an error, but instead return `[4, 9, 10]` or maybe `Family({2:4, 3:9, 10:10})`.\n\n> \n> Indeed, it might be better if it does not raise an error, especially if the example from the description is an intended use case in which a slice is used to restrict the support of an element in `CombinatorialFreeModule`.\n> \n> This is also consistent with ordinary use of slices, as the following does not throw an error either\n\n\nGood point. This variant is fine with me.  Let's change the ticket description",
    "created_at": "2020-07-24T18:38:01Z",
    "issue": "https://github.com/sagemath/sage/issues/30182",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/30182#issuecomment-480854",
    "user": "https://github.com/mkoeppe"
}
```

<a id='comment:21'></a>
Replying to [gh-mwageringel](#comment%3A20):
> Replying to [tscrim](#comment%3A13):
> > I don't expect that to be an error, but instead return `[4, 9, 10]` or maybe `Family({2:4, 3:9, 10:10})`.

> 
> Indeed, it might be better if it does not raise an error, especially if the example from the description is an intended use case in which a slice is used to restrict the support of an element in `CombinatorialFreeModule`.
> 
> This is also consistent with ordinary use of slices, as the following does not throw an error either


Good point. This variant is fine with me.  Let's change the ticket description



---

archive/issue_events_269647.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2020-08-13T17:11:30Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/30182",
    "milestone": "sage-9.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30182#event-269647"
}
```



---

archive/issue_events_269648.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2020-08-13T17:11:30Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/30182",
    "milestone": "sage-9.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30182#event-269648"
}
```



---

archive/issue_comments_480855.json:
```json
{
    "body": "<a id='comment:23'></a>\nSetting new milestone based on a cursory review of ticket status, priority, and last modification date.",
    "created_at": "2021-02-13T20:51:01Z",
    "issue": "https://github.com/sagemath/sage/issues/30182",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/30182#issuecomment-480855",
    "user": "https://github.com/mkoeppe"
}
```

<a id='comment:23'></a>
Setting new milestone based on a cursory review of ticket status, priority, and last modification date.



---

archive/issue_events_269649.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2021-02-13T20:51:01Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/30182",
    "milestone": "sage-9.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30182#event-269649"
}
```



---

archive/issue_events_269650.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2021-02-13T20:51:01Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/30182",
    "milestone": "sage-9.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30182#event-269650"
}
```



---

archive/issue_events_269651.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2021-07-19T01:43:17Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/30182",
    "milestone": "sage-9.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30182#event-269651"
}
```



---

archive/issue_events_269652.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2021-07-19T01:43:17Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/30182",
    "milestone": "sage-9.5",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30182#event-269652"
}
```



---

archive/issue_events_269653.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2021-12-14T02:04:49Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/30182",
    "milestone": "sage-9.5",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30182#event-269653"
}
```



---

archive/issue_events_269654.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2021-12-14T02:04:49Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/30182",
    "milestone": "sage-9.6",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30182#event-269654"
}
```



---

archive/issue_events_269655.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-03-05T00:06:20Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/30182",
    "milestone": "sage-9.6",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30182#event-269655"
}
```



---

archive/issue_events_269656.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-03-05T00:06:20Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/30182",
    "milestone": "sage-9.7",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30182#event-269656"
}
```



---

archive/issue_events_269657.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-08-31T02:51:13Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/30182",
    "milestone": "sage-9.7",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30182#event-269657"
}
```



---

archive/issue_events_269658.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-08-31T02:51:13Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/30182",
    "milestone": "sage-9.8",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30182#event-269658"
}
```
