# Issue 30326: latex correctly typesets held integrals, but (incorrectly) evaluate held integrals subexpressions.

archive/issues_030089.json:
```json
{
    "assignees": [],
    "body": "<div id=\"comment:0\"></div>\n\nConsider :\n\n```\nsage: C=2*pi\nsage: f(x)=1/(1+x^2)\nsage: C=pi\nsage: Ex=f(x).integrate(x,-oo,oo,hold=True)\nsage: Ex\nintegrate(1/(x^2 + 1), x, -Infinity, +Infinity)\nsage: latex(Ex)\n\\int_{-\\infty}^{+\\infty} \\frac{1}{x^{2} + 1}\\,{d x}\n```\n\nCorrect. But :\n\n```\nsage: latex(Ex/C)\n\\frac{\\pi}{\\pi}\n```\n\nAaaarghhh... The held integral subexpression has been evaluated (= unheld) during the `latex` processing ; furthermor, this affects only this subexpression processing, no further simplification takes place.\n\nThis seems to be specific to integrals ; I haven't been able to reproduce the problem  with `sum` :\n\n```\nsage: var(\"a, b\")\n(a, b)\nsage: var(\"j, m\", domain=\"integer\")\n(j, m)\nsage: Ex=sum(binomial(m,j)*a^j*b^(m-j),j,0,m,hold=True)\nsage: Ex.subs(m==3)\nsum(a^j*b^(-j + 3)*binomial(3, j), j, 0, 3)\nsage: Ex.subs(m==3).unhold()\na^3 + 3*a^2*b + 3*a*b^2 + b^3\nsage: latex(Ex.subs(m==3))\n{\\sum_{j=0}^{3} a^{j} b^{-j + 3} {3 \\choose j}}\n```\n\nCorrect.\n\n```\nsage: latex(Ex.subs(m==3)/C)\n\\frac{{\\sum_{j=0}^{3} a^{j} b^{-j + 3} {3 \\choose j}}}{\\pi}\n```\n\nAlso correct.\n\nThis is annoying when one wants to illustrate difficulties with an expression involving a problematic, impossible or (worse) never-returning integral : one cannot use `latex` to illustrate the problem without isolating the problematic subexpression.\n\nThis occurrence may become more frequent with the increase in use of the Jupyter notebook, often featuring a `%display typeset` early in the notebook, where this problem could stall the notebook.\n\nComponent: **symbolics**\n\nKeywords: **latex integral**\n\n_Issue created by migration from https://trac.sagemath.org/ticket/30326_\n\n",
    "created_at": "2020-08-10T09:11:26Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/c%3A%20symbolics",
        "https://github.com/sagemath/sage/labels/p%3A%20major%20/%203",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-9.8",
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "latex correctly typesets held integrals, but (incorrectly) evaluate held integrals subexpressions.",
    "type": "issue",
    "updated_at": "2022-09-19T18:58:47Z",
    "url": "https://github.com/sagemath/sage/issues/30326",
    "user": "https://github.com/EmmanuelCharpentier"
}
```
<div id="comment:0"></div>

Consider :

```
sage: C=2*pi
sage: f(x)=1/(1+x^2)
sage: C=pi
sage: Ex=f(x).integrate(x,-oo,oo,hold=True)
sage: Ex
integrate(1/(x^2 + 1), x, -Infinity, +Infinity)
sage: latex(Ex)
\int_{-\infty}^{+\infty} \frac{1}{x^{2} + 1}\,{d x}
```

Correct. But :

```
sage: latex(Ex/C)
\frac{\pi}{\pi}
```

Aaaarghhh... The held integral subexpression has been evaluated (= unheld) during the `latex` processing ; furthermor, this affects only this subexpression processing, no further simplification takes place.

This seems to be specific to integrals ; I haven't been able to reproduce the problem  with `sum` :

```
sage: var("a, b")
(a, b)
sage: var("j, m", domain="integer")
(j, m)
sage: Ex=sum(binomial(m,j)*a^j*b^(m-j),j,0,m,hold=True)
sage: Ex.subs(m==3)
sum(a^j*b^(-j + 3)*binomial(3, j), j, 0, 3)
sage: Ex.subs(m==3).unhold()
a^3 + 3*a^2*b + 3*a*b^2 + b^3
sage: latex(Ex.subs(m==3))
{\sum_{j=0}^{3} a^{j} b^{-j + 3} {3 \choose j}}
```

Correct.

```
sage: latex(Ex.subs(m==3)/C)
\frac{{\sum_{j=0}^{3} a^{j} b^{-j + 3} {3 \choose j}}}{\pi}
```

Also correct.

This is annoying when one wants to illustrate difficulties with an expression involving a problematic, impossible or (worse) never-returning integral : one cannot use `latex` to illustrate the problem without isolating the problematic subexpression.

This occurrence may become more frequent with the increase in use of the Jupyter notebook, often featuring a `%display typeset` early in the notebook, where this problem could stall the notebook.

Component: **symbolics**

Keywords: **latex integral**

_Issue created by migration from https://trac.sagemath.org/ticket/30326_





---

archive/issue_events_414696.json:
```json
{
    "actor": "https://github.com/EmmanuelCharpentier",
    "created_at": "2020-08-10T09:11:26Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/30326",
    "milestone_number": null,
    "milestone_title": "sage-9.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30326#event-414696"
}
```



---

archive/issue_events_414697.json:
```json
{
    "actor": "https://github.com/EmmanuelCharpentier",
    "created_at": "2020-08-10T09:11:26Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/30326",
    "label": "https://github.com/sagemath/sage/labels/c%3A%20symbolics",
    "label_color": "0000ff",
    "label_name": "c: symbolics",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30326#event-414697"
}
```



---

archive/issue_events_414698.json:
```json
{
    "actor": "https://github.com/EmmanuelCharpentier",
    "created_at": "2020-08-10T09:11:26Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/30326",
    "label": "https://github.com/sagemath/sage/labels/p%3A%20major%20/%203",
    "label_color": "ffbb00",
    "label_name": "p: major / 3",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30326#event-414698"
}
```



---

archive/issue_events_414699.json:
```json
{
    "actor": "https://github.com/EmmanuelCharpentier",
    "created_at": "2020-08-10T09:11:26Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/30326",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "d73a4a",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30326#event-414699"
}
```



---

archive/issue_comments_481297.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -1,7 +1,6 @@\n Consider :\n \n ```\n-sage: f(x)=cos(x)\n sage: C=2*pi\n sage: f(x)=1/(1+x^2)\n sage: C=pi\n``````\n",
    "created_at": "2020-08-10T09:25:33Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/30326",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/30326#issuecomment-481297",
    "user": "https://github.com/EmmanuelCharpentier"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -1,7 +1,6 @@
 Consider :
 
 ```
-sage: f(x)=cos(x)
 sage: C=2*pi
 sage: f(x)=1/(1+x^2)
 sage: C=pi
``````




---

archive/issue_comments_481298.json:
```json
{
    "body": "<div id=\"comment:2\" align=\"right\">comment:2</div>\n\nA partial workaround is to pass the offending expression to `sympy`, whose `latex` doesn't have this bug (but doesn't correctly translates all Sage's bells and whistles) :\n\n```\nsage: f(x)=1/(1+x^2)\nsage: C=pi\nsage: Ex=integrate(f(x),x,-oo,oo,hold=True) ; Ex\nintegrate(1/(x^2 + 1), x, -Infinity, +Infinity)\nsage: latex(Ex/C)\n\\frac{\\pi}{\\pi}\nsage: import sympy\nsage: latex(sympy.sympify(Ex/C))\n\\text{\\texttt{Integral(1/(x**2{ }+{ }1),{ }(x,{ }{-}oo,{ }oo))/pi}}\n```\n\n(Note that `oo` isn't either `sympified` as expected or typeset as `\\infty`...)",
    "created_at": "2020-08-10T09:35:22Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/30326",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/30326#issuecomment-481298",
    "user": "https://github.com/EmmanuelCharpentier"
}
```

<div id="comment:2" align="right">comment:2</div>

A partial workaround is to pass the offending expression to `sympy`, whose `latex` doesn't have this bug (but doesn't correctly translates all Sage's bells and whistles) :

```
sage: f(x)=1/(1+x^2)
sage: C=pi
sage: Ex=integrate(f(x),x,-oo,oo,hold=True) ; Ex
integrate(1/(x^2 + 1), x, -Infinity, +Infinity)
sage: latex(Ex/C)
\frac{\pi}{\pi}
sage: import sympy
sage: latex(sympy.sympify(Ex/C))
\text{\texttt{Integral(1/(x**2{ }+{ }1),{ }(x,{ }{-}oo,{ }oo))/pi}}
```

(Note that `oo` isn't either `sympified` as expected or typeset as `\infty`...)



---

archive/issue_events_414700.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2020-10-24T20:15:01Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/30326",
    "milestone_number": null,
    "milestone_title": "sage-9.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30326#event-414700"
}
```



---

archive/issue_events_414701.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2020-10-24T20:15:01Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/30326",
    "milestone_number": null,
    "milestone_title": "sage-9.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30326#event-414701"
}
```



---

archive/issue_events_414702.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2021-05-10T17:42:09Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/30326",
    "milestone_number": null,
    "milestone_title": "sage-9.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30326#event-414702"
}
```



---

archive/issue_events_414703.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2021-05-10T17:42:09Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/30326",
    "milestone_number": null,
    "milestone_title": "sage-9.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30326#event-414703"
}
```



---

archive/issue_comments_481299.json:
```json
{
    "body": "<div id=\"comment:4\" align=\"right\">comment:4</div>\n\nMoving to 9.4, as 9.3 has been released.",
    "created_at": "2021-05-10T17:42:09Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/30326",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/30326#issuecomment-481299",
    "user": "https://github.com/mkoeppe"
}
```

<div id="comment:4" align="right">comment:4</div>

Moving to 9.4, as 9.3 has been released.



---

archive/issue_events_414704.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2021-08-22T20:35:10Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/30326",
    "milestone_number": null,
    "milestone_title": "sage-9.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30326#event-414704"
}
```



---

archive/issue_events_414705.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2021-08-22T20:35:10Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/30326",
    "milestone_number": null,
    "milestone_title": "sage-9.5",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30326#event-414705"
}
```



---

archive/issue_events_414706.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2021-12-18T20:12:32Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/30326",
    "milestone_number": null,
    "milestone_title": "sage-9.5",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30326#event-414706"
}
```



---

archive/issue_events_414707.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2021-12-18T20:12:32Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/30326",
    "milestone_number": null,
    "milestone_title": "sage-9.6",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30326#event-414707"
}
```



---

archive/issue_comments_481300.json:
```json
{
    "body": "<div id=\"comment:7\" align=\"right\">comment:7</div>\n\nThis seems to work in 9.6.rc3, needs a doctest\n\n```\nsage: f = integral(x, x, 0, 1, hold=True)\nsage: latex(f)\n\\int_{0}^{1} x\\,{d x}\n```",
    "created_at": "2022-04-30T08:49:33Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/30326",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/30326#issuecomment-481300",
    "user": "https://github.com/fchapoton"
}
```

<div id="comment:7" align="right">comment:7</div>

This seems to work in 9.6.rc3, needs a doctest

```
sage: f = integral(x, x, 0, 1, hold=True)
sage: latex(f)
\int_{0}^{1} x\,{d x}
```



---

archive/issue_comments_481301.json:
```json
{
    "body": "<div id=\"comment:8\" align=\"right\">comment:8</div>\n\nNo, I think we still have the problem (in 9.6.rc3):\n\n```\nsage: f = integral(x, x, 0, 1, hold=True)\nsage: latex(f)  # this is correct (at least since 9.2)\n\\int_{0}^{1} x\\,{d x}\nsage: latex(f / pi)  # this is still not correct\n\\frac{\\frac{1}{2}}{\\pi}\n```",
    "created_at": "2022-05-01T07:55:55Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/30326",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/30326#issuecomment-481301",
    "user": "https://github.com/DaveWitteMorris"
}
```

<div id="comment:8" align="right">comment:8</div>

No, I think we still have the problem (in 9.6.rc3):

```
sage: f = integral(x, x, 0, 1, hold=True)
sage: latex(f)  # this is correct (at least since 9.2)
\int_{0}^{1} x\,{d x}
sage: latex(f / pi)  # this is still not correct
\frac{\frac{1}{2}}{\pi}
```



---

archive/issue_events_414708.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-05-03T15:17:06Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/30326",
    "milestone_number": null,
    "milestone_title": "sage-9.6",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30326#event-414708"
}
```



---

archive/issue_events_414709.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-05-03T15:17:06Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/30326",
    "milestone_number": null,
    "milestone_title": "sage-9.7",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30326#event-414709"
}
```



---

archive/issue_events_414710.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-09-19T18:58:47Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/30326",
    "milestone_number": null,
    "milestone_title": "sage-9.7",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30326#event-414710"
}
```



---

archive/issue_events_414711.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-09-19T18:58:47Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/30326",
    "milestone_number": null,
    "milestone_title": "sage-9.8",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30326#event-414711"
}
```
