# Issue 30326: latex correctly typesets held integrals, but (incorrectly) evaluate held integrals subexpressions.

archive/issues_030089.json:
```json
{
    "body": "Consider :\n\n```\nsage: C=2*pi\nsage: f(x)=1/(1+x^2)\nsage: C=pi\nsage: Ex=f(x).integrate(x,-oo,oo,hold=True)\nsage: Ex\nintegrate(1/(x^2 + 1), x, -Infinity, +Infinity)\nsage: latex(Ex)\n\\int_{-\\infty}^{+\\infty} \\frac{1}{x^{2} + 1}\\,{d x}\n```\n\nCorrect. But :\n\n```\nsage: latex(Ex/C)\n\\frac{\\pi}{\\pi}\n```\n\nAaaarghhh... The held integral subexpression has been evaluated (= unheld) during the `latex` processing ; furthermor, this affects only this subexpression processing, no further simplification takes place.\n\nThis seems to be specific to integrals ; I haven't been able to reproduce the problem  with `sum` :\n\n```\nsage: var(\"a, b\")\n(a, b)\nsage: var(\"j, m\", domain=\"integer\")\n(j, m)\nsage: Ex=sum(binomial(m,j)*a^j*b^(m-j),j,0,m,hold=True)\nsage: Ex.subs(m==3)\nsum(a^j*b^(-j + 3)*binomial(3, j), j, 0, 3)\nsage: Ex.subs(m==3).unhold()\na^3 + 3*a^2*b + 3*a*b^2 + b^3\nsage: latex(Ex.subs(m==3))\n{\\sum_{j=0}^{3} a^{j} b^{-j + 3} {3 \\choose j}}\n```\n\nCorrect.\n\n```\nsage: latex(Ex.subs(m==3)/C)\n\\frac{{\\sum_{j=0}^{3} a^{j} b^{-j + 3} {3 \\choose j}}}{\\pi}\n```\n\nAlso correct.\n\nThis is annoying when one wants to illustrate difficulties with an expression involving a problematic, impossible or (worse) never-returning integral : one cannot use `latex` to illustrate the problem without isolating the problematic subexpression.\n\nThis occurrence may become more frequent with the increase in use of the Jupyter notebook, often featuring a `%display typeset` early in the notebook, where this problem could stall the notebook.\n\n**Keywords:** latex integral\n\n**Status:** new\n\nIssue created by migration from https://trac.sagemath.org/ticket/30326\n\n",
    "created_at": "2020-08-10T09:11:26Z",
    "labels": [
        "component: symbolics",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-9.8",
    "title": "latex correctly typesets held integrals, but (incorrectly) evaluate held integrals subexpressions.",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/30326",
    "user": "https://github.com/EmmanuelCharpentier"
}
```
Consider :

```
sage: C=2*pi
sage: f(x)=1/(1+x^2)
sage: C=pi
sage: Ex=f(x).integrate(x,-oo,oo,hold=True)
sage: Ex
integrate(1/(x^2 + 1), x, -Infinity, +Infinity)
sage: latex(Ex)
\int_{-\infty}^{+\infty} \frac{1}{x^{2} + 1}\,{d x}
```

Correct. But :

```
sage: latex(Ex/C)
\frac{\pi}{\pi}
```

Aaaarghhh... The held integral subexpression has been evaluated (= unheld) during the `latex` processing ; furthermor, this affects only this subexpression processing, no further simplification takes place.

This seems to be specific to integrals ; I haven't been able to reproduce the problem  with `sum` :

```
sage: var("a, b")
(a, b)
sage: var("j, m", domain="integer")
(j, m)
sage: Ex=sum(binomial(m,j)*a^j*b^(m-j),j,0,m,hold=True)
sage: Ex.subs(m==3)
sum(a^j*b^(-j + 3)*binomial(3, j), j, 0, 3)
sage: Ex.subs(m==3).unhold()
a^3 + 3*a^2*b + 3*a*b^2 + b^3
sage: latex(Ex.subs(m==3))
{\sum_{j=0}^{3} a^{j} b^{-j + 3} {3 \choose j}}
```

Correct.

```
sage: latex(Ex.subs(m==3)/C)
\frac{{\sum_{j=0}^{3} a^{j} b^{-j + 3} {3 \choose j}}}{\pi}
```

Also correct.

This is annoying when one wants to illustrate difficulties with an expression involving a problematic, impossible or (worse) never-returning integral : one cannot use `latex` to illustrate the problem without isolating the problematic subexpression.

This occurrence may become more frequent with the increase in use of the Jupyter notebook, often featuring a `%display typeset` early in the notebook, where this problem could stall the notebook.

**Keywords:** latex integral

**Status:** new

Issue created by migration from https://trac.sagemath.org/ticket/30326





---

archive/issue_comments_597801.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -1,7 +1,6 @@\n Consider :\n \n ```\n-sage: f(x)=cos(x)\n sage: C=2*pi\n sage: f(x)=1/(1+x^2)\n sage: C=pi\n``````\n",
    "created_at": "2020-08-10T09:25:33Z",
    "issue": "https://github.com/sagemath/sagetest/issues/30326",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/30326#issuecomment-597801",
    "user": "https://github.com/EmmanuelCharpentier"
}
```


**Description changed:**
``````diff
--- 
+++ 
@@ -1,7 +1,6 @@
 Consider :
 
 ```
-sage: f(x)=cos(x)
 sage: C=2*pi
 sage: f(x)=1/(1+x^2)
 sage: C=pi
``````




---

archive/issue_comments_597802.json:
```json
{
    "body": "<a id='comment:2'></a>\nA partial workaround is to pass the offending expression to `sympy`, whose `latex` doesn't have this bug (but doesn't correctly translates all Sage's bells and whistles) :\n\n```\nsage: f(x)=1/(1+x^2)\nsage: C=pi\nsage: Ex=integrate(f(x),x,-oo,oo,hold=True) ; Ex\nintegrate(1/(x^2 + 1), x, -Infinity, +Infinity)\nsage: latex(Ex/C)\n\\frac{\\pi}{\\pi}\nsage: import sympy\nsage: latex(sympy.sympify(Ex/C))\n\\text{\\texttt{Integral(1/(x**2{ }+{ }1),{ }(x,{ }{-}oo,{ }oo))/pi}}\n```\n\n(Note that `oo` isn't either `sympified` as expected or typeset as `\\infty`...)",
    "created_at": "2020-08-10T09:35:22Z",
    "issue": "https://github.com/sagemath/sagetest/issues/30326",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/30326#issuecomment-597802",
    "user": "https://github.com/EmmanuelCharpentier"
}
```


<a id='comment:2'></a>
A partial workaround is to pass the offending expression to `sympy`, whose `latex` doesn't have this bug (but doesn't correctly translates all Sage's bells and whistles) :

```
sage: f(x)=1/(1+x^2)
sage: C=pi
sage: Ex=integrate(f(x),x,-oo,oo,hold=True) ; Ex
integrate(1/(x^2 + 1), x, -Infinity, +Infinity)
sage: latex(Ex/C)
\frac{\pi}{\pi}
sage: import sympy
sage: latex(sympy.sympify(Ex/C))
\text{\texttt{Integral(1/(x**2{ }+{ }1),{ }(x,{ }{-}oo,{ }oo))/pi}}
```

(Note that `oo` isn't either `sympified` as expected or typeset as `\infty`...)



---

archive/issue_events_088534.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2020-10-24T20:15:01Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/30326",
    "milestone": "sage-9.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/30326#event-88534"
}
```




---

archive/issue_events_088535.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2021-05-10T17:42:09Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/30326",
    "milestone": "sage-9.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/30326#event-88535"
}
```




---

archive/issue_events_088536.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2021-05-10T17:42:09Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/30326",
    "milestone": "sage-9.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/30326#event-88536"
}
```




---

archive/issue_comments_597803.json:
```json
{
    "body": "<a id='comment:4'></a>\nMoving to 9.4, as 9.3 has been released.",
    "created_at": "2021-05-10T17:42:09Z",
    "issue": "https://github.com/sagemath/sagetest/issues/30326",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/30326#issuecomment-597803",
    "user": "https://github.com/mkoeppe"
}
```


<a id='comment:4'></a>
Moving to 9.4, as 9.3 has been released.



---

archive/issue_events_088537.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2021-08-22T20:35:10Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/30326",
    "milestone": "sage-9.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/30326#event-88537"
}
```




---

archive/issue_events_088538.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2021-08-22T20:35:10Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/30326",
    "milestone": "sage-9.5",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/30326#event-88538"
}
```




---

archive/issue_events_088539.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2021-12-18T20:12:32Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/30326",
    "milestone": "sage-9.5",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/30326#event-88539"
}
```




---

archive/issue_events_088540.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2021-12-18T20:12:32Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/30326",
    "milestone": "sage-9.6",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/30326#event-88540"
}
```




---

archive/issue_comments_597804.json:
```json
{
    "body": "<a id='comment:7'></a>\nThis seems to work in 9.6.rc3, needs a doctest\n\n```\nsage: f = integral(x, x, 0, 1, hold=True)\nsage: latex(f)\n\\int_{0}^{1} x\\,{d x}\n```",
    "created_at": "2022-04-30T08:49:33Z",
    "issue": "https://github.com/sagemath/sagetest/issues/30326",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/30326#issuecomment-597804",
    "user": "https://github.com/fchapoton"
}
```


<a id='comment:7'></a>
This seems to work in 9.6.rc3, needs a doctest

```
sage: f = integral(x, x, 0, 1, hold=True)
sage: latex(f)
\int_{0}^{1} x\,{d x}
```



---

archive/issue_comments_597805.json:
```json
{
    "body": "<a id='comment:8'></a>\nNo, I think we still have the problem (in 9.6.rc3):\n\n```\nsage: f = integral(x, x, 0, 1, hold=True)\nsage: latex(f)  # this is correct (at least since 9.2)\n\\int_{0}^{1} x\\,{d x}\nsage: latex(f / pi)  # this is still not correct\n\\frac{\\frac{1}{2}}{\\pi}\n```",
    "created_at": "2022-05-01T07:55:55Z",
    "issue": "https://github.com/sagemath/sagetest/issues/30326",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/30326#issuecomment-597805",
    "user": "https://github.com/DaveWitteMorris"
}
```


<a id='comment:8'></a>
No, I think we still have the problem (in 9.6.rc3):

```
sage: f = integral(x, x, 0, 1, hold=True)
sage: latex(f)  # this is correct (at least since 9.2)
\int_{0}^{1} x\,{d x}
sage: latex(f / pi)  # this is still not correct
\frac{\frac{1}{2}}{\pi}
```



---

archive/issue_events_088541.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-05-03T15:17:06Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/30326",
    "milestone": "sage-9.6",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/30326#event-88541"
}
```




---

archive/issue_events_088542.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-05-03T15:17:06Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/30326",
    "milestone": "sage-9.7",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/30326#event-88542"
}
```




---

archive/issue_events_088543.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-09-19T18:58:47Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/30326",
    "milestone": "sage-9.7",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/30326#event-88543"
}
```




---

archive/issue_events_088544.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-09-19T18:58:47Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/30326",
    "milestone": "sage-9.8",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/30326#event-88544"
}
```

