# Issue 30420: Wrong Coercion of Elements in Padic-Extension Fields

archive/issues_030183.json:
```json
{
    "assignees": [],
    "body": "Below are attempts to coerce elements from a field T (a padic eisenstein extension field) into a field D, where D is similar to T, except that its precision is higher.\n\nSome of these attempts produced wrong results.\n\n\nThe 2 examples below vary in the initial precision of the fields. However in both cases, the precision of D is twice the precision of T.\n\nExample 1:\n\n```\nsage: T.<a> = Qp(31, 3).extension(x^3 - 31)\nsage: D.<b> = Qp(31, 6).extension(x^3 - 31)\n# Trying to coerce different elements from T to D:\nsage: D(29 + O(a^9)) # works\n29 + O(b^9)\nsage: D(29*a^27 + O(a^36)) # wrong result\n29*b^27 + 18*b^33 + O(b^36)\nsage: D(29*a^-27 + 3*a^-24 + 16*a^-23 + 28*a^-22 + 11*a^-21 + 22*a^-20 + 25*a^-19 + O(a^-18)) # wrong result\nO(b^-18)\nsage: D(29*a^-27 + 3*a^-24 + 16*a^-23 + 28*a^-22 + 11*a^-21 + 22*a^-20 + 25*a^-19) # wrong result\nO(b^-18)\n```\n\nExample 2:\n\n```\nsage: T.<a> = Qp(31, 20).extension(x^3 - 31)\nsage: D.<b> = Qp(31, 40).extension(x^3 - 31)\n# Trying to coerce different elements from T to D:\nsage: D(29 + O(a^9)) # works\n29 + O(b^9)\nsage: D(29*a^27 + O(a^36)) # works\n29*b^27 + O(b^36)\nsage: D(29*a^-27 + 3*a^-24 + 16*a^-23 + 28*a^-22 + 11*a^-21 + 22*a^-20 + 25*a^-19 + O(a^-18)) # wrong result\nO(b^-18)\nsage: D(29*a^-27 + 3*a^-24 + 16*a^-23 + 28*a^-22 + 11*a^-21 + 22*a^-20 + 25*a^-19) # wrong result\n29*b^27 + 3*b^30 + 16*b^31 + 28*b^32 + O(b^33)\n```\n\n\n**Keywords:** coercion, precision\n\nIssue created by migration from https://trac.sagemath.org/ticket/30420\n\n",
    "closed_at": "2020-10-01T08:19:39Z",
    "created_at": "2020-08-23T15:21:54Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20padics",
        "https://github.com/sagemath/sage/labels/bug",
        "https://github.com/sagemath/sage/labels/duplicate"
    ],
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "Wrong Coercion of Elements in Padic-Extension Fields",
    "type": "issue",
    "updated_at": "2020-10-01T08:19:39Z",
    "url": "https://github.com/sagemath/sage/issues/30420",
    "user": "https://github.com/n-vi"
}
```
Below are attempts to coerce elements from a field T (a padic eisenstein extension field) into a field D, where D is similar to T, except that its precision is higher.

Some of these attempts produced wrong results.


The 2 examples below vary in the initial precision of the fields. However in both cases, the precision of D is twice the precision of T.

Example 1:

```
sage: T.<a> = Qp(31, 3).extension(x^3 - 31)
sage: D.<b> = Qp(31, 6).extension(x^3 - 31)
# Trying to coerce different elements from T to D:
sage: D(29 + O(a^9)) # works
29 + O(b^9)
sage: D(29*a^27 + O(a^36)) # wrong result
29*b^27 + 18*b^33 + O(b^36)
sage: D(29*a^-27 + 3*a^-24 + 16*a^-23 + 28*a^-22 + 11*a^-21 + 22*a^-20 + 25*a^-19 + O(a^-18)) # wrong result
O(b^-18)
sage: D(29*a^-27 + 3*a^-24 + 16*a^-23 + 28*a^-22 + 11*a^-21 + 22*a^-20 + 25*a^-19) # wrong result
O(b^-18)
```

Example 2:

```
sage: T.<a> = Qp(31, 20).extension(x^3 - 31)
sage: D.<b> = Qp(31, 40).extension(x^3 - 31)
# Trying to coerce different elements from T to D:
sage: D(29 + O(a^9)) # works
29 + O(b^9)
sage: D(29*a^27 + O(a^36)) # works
29*b^27 + O(b^36)
sage: D(29*a^-27 + 3*a^-24 + 16*a^-23 + 28*a^-22 + 11*a^-21 + 22*a^-20 + 25*a^-19 + O(a^-18)) # wrong result
O(b^-18)
sage: D(29*a^-27 + 3*a^-24 + 16*a^-23 + 28*a^-22 + 11*a^-21 + 22*a^-20 + 25*a^-19) # wrong result
29*b^27 + 3*b^30 + 16*b^31 + 28*b^32 + O(b^33)
```


**Keywords:** coercion, precision

Issue created by migration from https://trac.sagemath.org/ticket/30420





---

archive/issue_events_368386.json:
```json
{
    "actor": "https://github.com/n-vi",
    "created_at": "2020-08-23T15:21:54Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/30420",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20padics",
    "label_color": "08517b",
    "label_name": "component: padics",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30420#event-368386"
}
```



---

archive/issue_events_368387.json:
```json
{
    "actor": "https://github.com/n-vi",
    "created_at": "2020-08-23T15:21:54Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/30420",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "008080",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30420#event-368387"
}
```



---

archive/issue_events_368388.json:
```json
{
    "actor": "https://github.com/n-vi",
    "created_at": "2020-08-23T15:21:54Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/30420",
    "label": "https://github.com/sagemath/sage/labels/invalid",
    "label_color": "008080",
    "label_name": "invalid",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30420#event-368388"
}
```



---

archive/issue_comments_487206.json:
```json
{
    "body": "<a id='comment:1'>**Comment 1:**</a>\nWhen using the most updated version of sage (including #29925, #29926 which might be relevant), and  implementing the yet-unreviewed ticket #29927, the only one of the above examples which remains problematic is:\n\n```\nsage: T.<a> = Qp(31, 3).extension(x^3 - 31)\nsage: D.<b> = Qp(31, 6).extension(x^3 - 31)\nsage: D(29*a^27 + O(a^36))\n29*b^27 + 18*b^33 + O(b^36)\n```\nBut this results from the problem in _polynomial_list() which is described in #29932. \nIndeed:\n\n```\nsage: T.<a> = Qp(31, 3).extension(x^3 - 31)\nsage: T((29*a^27 + O(a^36))._polynomial_list())\n29*a^27 + 18*a^33 + O(a^36)\n```",
    "created_at": "2020-08-26T13:13:07Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/30420",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/30420#issuecomment-487206",
    "user": "https://github.com/n-vi"
}
```

<a id='comment:1'>**Comment 1:**</a>
When using the most updated version of sage (including #29925, #29926 which might be relevant), and  implementing the yet-unreviewed ticket #29927, the only one of the above examples which remains problematic is:

```
sage: T.<a> = Qp(31, 3).extension(x^3 - 31)
sage: D.<b> = Qp(31, 6).extension(x^3 - 31)
sage: D(29*a^27 + O(a^36))
29*b^27 + 18*b^33 + O(b^36)
```
But this results from the problem in _polynomial_list() which is described in #29932. 
Indeed:

```
sage: T.<a> = Qp(31, 3).extension(x^3 - 31)
sage: T((29*a^27 + O(a^36))._polynomial_list())
29*a^27 + 18*a^33 + O(a^36)
```



---

archive/issue_events_368389.json:
```json
{
    "actor": "https://github.com/n-vi",
    "created_at": "2020-08-26T13:13:07Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/30420",
    "milestone_number": null,
    "milestone_title": "sage-9.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30420#event-368389"
}
```



---

archive/issue_events_368390.json:
```json
{
    "actor": "https://github.com/n-vi",
    "created_at": "2020-08-26T13:13:07Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/30420",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "008080",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30420#event-368390"
}
```



---

archive/issue_events_368391.json:
```json
{
    "actor": "https://github.com/saraedum",
    "created_at": "2020-09-17T23:32:14Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/30420",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "008080",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30420#event-368391"
}
```



---

archive/issue_events_368392.json:
```json
{
    "actor": "https://github.com/saraedum",
    "created_at": "2020-09-17T23:32:14Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/30420",
    "label": "https://github.com/sagemath/sage/labels/positive%20review",
    "label_color": "008080",
    "label_name": "positive review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30420#event-368392"
}
```



---

archive/issue_events_368393.json:
```json
{
    "actor": "https://github.com/fchapoton",
    "created_at": "2020-10-01T08:19:39Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/30420",
    "label": "https://github.com/sagemath/sage/labels/positive%20review",
    "label_color": "008080",
    "label_name": "positive review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30420#event-368393"
}
```



---

archive/issue_events_368394.json:
```json
{
    "actor": "https://github.com/fchapoton",
    "created_at": "2020-10-01T08:19:39Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/30420",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30420#event-368394"
}
```



---

archive/issue_events_368395.json:
```json
{
    "actor": "https://github.com/fchapoton",
    "created_at": "2020-10-01T08:19:39Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/30420",
    "label": "https://github.com/sagemath/sage/labels/duplicate",
    "label_color": "008080",
    "label_name": "duplicate",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30420#event-368395"
}
```
