# Issue 30783: Sage thinks that I^(2/3) = -1

archive/issues_030546.json:
```json
{
    "body": "Revert #25218.\n\nRationale: #25218 makes `a^(p/q)` where a is a number field element attempt to return a solution to `a^p = x^q` in the number field. This makes powering inconsistent with coercions, since number fields often (and, in the case of quadratic fields, automatically) come with a complex embedding and complex numbers of various kinds use the principal branch of the power function.\n\nAmong other confusing behaviors, we have\n\n```\nsage: I^(2/3)\nI^(2/3)\nsage: QQbar(I^(2/3))\n0.500000000000000? + 0.866025403784439?*I\nsage: QQbar(I)^(2/3)\n0.500000000000000? + 0.866025403784439?*I\n```\nbut\n\n```\nsage: I.pyobject()^(2/3)\n-1\n```\nand\n\n```\nsage: QQi.<i> = QuadraticField(-1)\nsage: i^(2/3)\n-1\n```\nbut\n\n```\nsage: QQbar(i)^(2/3)\n0.500000000000000? + 0.866025403784439?*I\n```\nas well as\n\n```\nsage: CC((i^(1/6))^2)\n0.866025403784439 + 0.500000000000000*I\nsage: CC((i^(1/3)))\n-1.00000000000000*I\nsage: i^(1/3)*CC(i)^(1/3)\n0.500000000000000 - 0.866025403784439*I\n```\n\nCC:  @brentbaccala\n\nBranch/Commit: 080778741065560bdce8be7a4c207e97ab0163d4\n\nReviewer: S\u00e9bastien Labb\u00e9\n\nAuthor: Marc Mezzarobba\n\nResolution: fixed\n\nIssue created by migration from https://trac.sagemath.org/ticket/30783\n\n",
    "closed_at": "2020-11-01T00:42:26Z",
    "created_at": "2020-10-17T16:39:16Z",
    "labels": [
        "component: basic arithmetic",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-9.3",
    "title": "Sage thinks that I^(2/3) = -1",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/30783",
    "user": "https://github.com/mezzarobba"
}
```
Revert #25218.

Rationale: #25218 makes `a^(p/q)` where a is a number field element attempt to return a solution to `a^p = x^q` in the number field. This makes powering inconsistent with coercions, since number fields often (and, in the case of quadratic fields, automatically) come with a complex embedding and complex numbers of various kinds use the principal branch of the power function.

Among other confusing behaviors, we have

```
sage: I^(2/3)
I^(2/3)
sage: QQbar(I^(2/3))
0.500000000000000? + 0.866025403784439?*I
sage: QQbar(I)^(2/3)
0.500000000000000? + 0.866025403784439?*I
```
but

```
sage: I.pyobject()^(2/3)
-1
```
and

```
sage: QQi.<i> = QuadraticField(-1)
sage: i^(2/3)
-1
```
but

```
sage: QQbar(i)^(2/3)
0.500000000000000? + 0.866025403784439?*I
```
as well as

```
sage: CC((i^(1/6))^2)
0.866025403784439 + 0.500000000000000*I
sage: CC((i^(1/3)))
-1.00000000000000*I
sage: i^(1/3)*CC(i)^(1/3)
0.500000000000000 - 0.866025403784439*I
```

CC:  @brentbaccala

Branch/Commit: 080778741065560bdce8be7a4c207e97ab0163d4

Reviewer: Sébastien Labbé

Author: Marc Mezzarobba

Resolution: fixed

Issue created by migration from https://trac.sagemath.org/ticket/30783





---

archive/issue_comments_465355.json:
```json
{
    "body": "<a id='comment:1'></a>Hi Marc, could you please provide more details about this ticket ? Currently (9.2.rc2), we have:\n\n```\nsage: I^(2/3)                                                                                                                                                                                                \nI^(2/3)\nsage: _.n()                                                                                                                                                                                                  \n0.500000000000000 + 0.866025403784439*I\n```",
    "created_at": "2020-10-17T21:42:06Z",
    "issue": "https://github.com/sagemath/sagetest/issues/30783",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/30783#issuecomment-465355",
    "user": "https://trac.sagemath.org/admin/accounts/users/tmonteil"
}
```

<a id='comment:1'></a>Hi Marc, could you please provide more details about this ticket ? Currently (9.2.rc2), we have:

```
sage: I^(2/3)                                                                                                                                                                                                
I^(2/3)
sage: _.n()                                                                                                                                                                                                  
0.500000000000000 + 0.866025403784439*I
```



---

archive/issue_comments_465356.json:
```json
{
    "body": "<a id='comment:2'></a>Sorry, I didn't have time yesterday. This happens for i \u2208 \u211a[i], not i \u2208 SR (see the linked ticket). But note that #18036 aims to make the glbal symbol i refer to the generator of \u211a[i]. (In fact, I am currently trying again to make that change, and that's how I discovered the issue.)",
    "created_at": "2020-10-18T07:08:24Z",
    "issue": "https://github.com/sagemath/sagetest/issues/30783",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/30783#issuecomment-465356",
    "user": "https://github.com/mezzarobba"
}
```

<a id='comment:2'></a>Sorry, I didn't have time yesterday. This happens for i ∈ ℚ[i], not i ∈ SR (see the linked ticket). But note that #18036 aims to make the glbal symbol i refer to the generator of ℚ[i]. (In fact, I am currently trying again to make that change, and that's how I discovered the issue.)



---

archive/issue_comments_465357.json:
```json
{
    "body": "<a id='comment:3'></a>Oups, I made a mistake while reviewing #25218. Feel free to fix that to the correct thing.",
    "created_at": "2020-10-18T17:53:56Z",
    "issue": "https://github.com/sagemath/sagetest/issues/30783",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/30783#issuecomment-465357",
    "user": "https://github.com/seblabbe"
}
```

<a id='comment:3'></a>Oups, I made a mistake while reviewing #25218. Feel free to fix that to the correct thing.



---

archive/issue_comments_465358.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -1,4 +1,46 @@\n Revert #25218.\n+\n+Rationale: #25218 makes `a^(p/q)` where a is a number field element attempt to return a solution to `a^p = x^q` in the number field. This makes powering inconsistent with coercions, since number fields often (and, in the case of quadratic fields, automatically) come with a complex embedding and complex numbers of various kinds use the principal branch of the power function.\n+\n+Among other confusing behaviors, we have\n+\n+```\n+sage: I^(2/3)\n+I^(2/3)\n+sage: QQbar(I^(2/3))\n+0.500000000000000? + 0.866025403784439?*I\n+sage: QQbar(I)^(2/3)\n+0.500000000000000? + 0.866025403784439?*I\n+```\n+but\n+\n+```\n+sage: I.pyobject()^(2/3)\n+-1\n+```\n+and\n+\n+```\n+sage: QQi.<i> = QuadraticField(-1)\n+sage: i^(2/3)\n+-1\n+```\n+but\n+\n+```\n+sage: QQbar(i)^(2/3)\n+0.500000000000000? + 0.866025403784439?*I\n+```\n+as well as\n+\n+```\n+sage: CC((i^(1/6))^2)\n+0.866025403784439 + 0.500000000000000*I\n+sage: CC((i^(1/3)))\n+-1.00000000000000*I\n+sage: i^(1/3)*CC(i)^(1/3)\n+0.500000000000000 - 0.866025403784439*I\n+```\n \n Comment: 1\n \n``````\n",
    "created_at": "2020-10-19T07:37:41Z",
    "issue": "https://github.com/sagemath/sagetest/issues/30783",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/30783#issuecomment-465358",
    "user": "https://github.com/mezzarobba"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -1,4 +1,46 @@
 Revert #25218.
+
+Rationale: #25218 makes `a^(p/q)` where a is a number field element attempt to return a solution to `a^p = x^q` in the number field. This makes powering inconsistent with coercions, since number fields often (and, in the case of quadratic fields, automatically) come with a complex embedding and complex numbers of various kinds use the principal branch of the power function.
+
+Among other confusing behaviors, we have
+
+```
+sage: I^(2/3)
+I^(2/3)
+sage: QQbar(I^(2/3))
+0.500000000000000? + 0.866025403784439?*I
+sage: QQbar(I)^(2/3)
+0.500000000000000? + 0.866025403784439?*I
+```
+but
+
+```
+sage: I.pyobject()^(2/3)
+-1
+```
+and
+
+```
+sage: QQi.<i> = QuadraticField(-1)
+sage: i^(2/3)
+-1
+```
+but
+
+```
+sage: QQbar(i)^(2/3)
+0.500000000000000? + 0.866025403784439?*I
+```
+as well as
+
+```
+sage: CC((i^(1/6))^2)
+0.866025403784439 + 0.500000000000000*I
+sage: CC((i^(1/3)))
+-1.00000000000000*I
+sage: i^(1/3)*CC(i)^(1/3)
+0.500000000000000 - 0.866025403784439*I
+```
 
 Comment: 1
 
``````




---

archive/issue_comments_465359.json:
```json
{
    "body": "<a id='comment:4'></a>New commits:",
    "created_at": "2020-10-19T07:37:41Z",
    "issue": "https://github.com/sagemath/sagetest/issues/30783",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/30783#issuecomment-465359",
    "user": "https://github.com/mezzarobba"
}
```

<a id='comment:4'></a>New commits:



---

archive/issue_comments_465360.json:
```json
{
    "body": "Changing status from new to needs_review.",
    "created_at": "2020-10-19T07:37:41Z",
    "issue": "https://github.com/sagemath/sagetest/issues/30783",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/30783#issuecomment-465360",
    "user": "https://github.com/mezzarobba"
}
```

Changing status from new to needs_review.



---

archive/issue_comments_465361.json:
```json
{
    "body": "<a id='comment:5'></a>I confirm with the branch I get this:\n\n```\nsage: QQi.<i> = QuadraticField(-1)                                                                   \nsage: i^(2/3)                                                                                        \nI^(2/3)                                                 \nsage: n(_)                                                                                           \n0.500000000000000 + 0.866025403784439*I\n```\n\nBot is green (except for startup time which I think we can ignore because this ticket does not change anything regarding to that).",
    "created_at": "2020-10-22T09:28:07Z",
    "issue": "https://github.com/sagemath/sagetest/issues/30783",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/30783#issuecomment-465361",
    "user": "https://github.com/seblabbe"
}
```

<a id='comment:5'></a>I confirm with the branch I get this:

```
sage: QQi.<i> = QuadraticField(-1)                                                                   
sage: i^(2/3)                                                                                        
I^(2/3)                                                 
sage: n(_)                                                                                           
0.500000000000000 + 0.866025403784439*I
```

Bot is green (except for startup time which I think we can ignore because this ticket does not change anything regarding to that).



---

archive/issue_comments_465362.json:
```json
{
    "body": "Changing status from needs_review to positive_review.",
    "created_at": "2020-10-22T09:28:07Z",
    "issue": "https://github.com/sagemath/sagetest/issues/30783",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/30783#issuecomment-465362",
    "user": "https://github.com/seblabbe"
}
```

Changing status from needs_review to positive_review.



---

archive/issue_events_080269.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2020-10-24T20:15:01Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/30783",
    "milestone": "sage-9.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/30783#event-80269"
}
```



---

archive/issue_events_080270.json:
```json
{
    "actor": "https://github.com/vbraun",
    "created_at": "2020-11-01T00:42:26Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/30783",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/30783#event-80270"
}
```



---

archive/issue_comments_465363.json:
```json
{
    "body": "Resolution: fixed",
    "created_at": "2020-11-01T00:42:26Z",
    "issue": "https://github.com/sagemath/sagetest/issues/30783",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/30783#issuecomment-465363",
    "user": "https://github.com/vbraun"
}
```

Resolution: fixed
