# Issue 30816: Maxima does not know that 1 > 0

archive/issues_030579.json:
```json
{
    "body": "When computing this integral, Maxima asks whether 1 is zero or nonzero:\n\n```\nsage: var('x1,x2,y')\nsage: assume(x1 > 0, x2 > 0, cos(y) != 0)\nsage: f = sqrt(x1^2 - 2*x1*x2*cos(y) + x2^2)\nsage: f.integrate(x1, algorithm='maxima')\n...\nValueError: Computation failed since Maxima requested additional constraints; using the 'assume' command before evaluation *may* help (example of legal syntax\n is 'assume(1>0)', see `assume?` for more details)\nIs 1 zero or nonzero?\n```\n\nAttempting to add this as an assumption fails:\n\n```\nsage: assume(SR(1) > SR(0))\n...\nValueError: Assumption is redundant\n```\n\nSee also this upstream bug https://sourceforge.net/p/maxima/bugs/3218/ and this thread on [sage-support](https://groups.google.com/forum/#!topic/sage-support/pcuvw1IW-D0).\n\n\n**Keywords:** maxima, integral\n\nIssue created by migration from https://trac.sagemath.org/ticket/30816\n\n",
    "created_at": "2020-10-23T18:27:24Z",
    "labels": [
        "component: symbolics",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-9.8",
    "title": "Maxima does not know that 1 > 0",
    "type": "issue",
    "url": "https://github.com/sagemath/sage/issues/30816",
    "user": "https://github.com/mwageringel"
}
```
When computing this integral, Maxima asks whether 1 is zero or nonzero:

```
sage: var('x1,x2,y')
sage: assume(x1 > 0, x2 > 0, cos(y) != 0)
sage: f = sqrt(x1^2 - 2*x1*x2*cos(y) + x2^2)
sage: f.integrate(x1, algorithm='maxima')
...
ValueError: Computation failed since Maxima requested additional constraints; using the 'assume' command before evaluation *may* help (example of legal syntax
 is 'assume(1>0)', see `assume?` for more details)
Is 1 zero or nonzero?
```

Attempting to add this as an assumption fails:

```
sage: assume(SR(1) > SR(0))
...
ValueError: Assumption is redundant
```

See also this upstream bug https://sourceforge.net/p/maxima/bugs/3218/ and this thread on [sage-support](https://groups.google.com/forum/#!topic/sage-support/pcuvw1IW-D0).


**Keywords:** maxima, integral

Issue created by migration from https://trac.sagemath.org/ticket/30816





---

archive/issue_comments_495928.json:
```json
{
    "body": "<a id='comment:1'></a>\nI get a slightly different behavior, but still buggy. Working w/ Maxima 5.44.0 on macOS.\n\nWith `domain: real` (default), I get \"Is 1 zero or nonzero?\" for the question, and if I respond `nz`, then I get a result (I didn't check it):\n\n\n```\n(-(x2^2*cos(y)^2*log(2*sqrt((-2*x1*x2*cos(y))+x2^2+x1^2)-2*x2*cos(y)+2*x1))/2)\n +(x2^2*log(2*sqrt((-2*x1*x2*cos(y))+x2^2+x1^2)-2*x2*cos(y)+2*x1))/2\n -(x2*cos(y)*sqrt((-2*x1*x2*cos(y))+x2^2+x1^2))/2\n +(x1*sqrt((-2*x1*x2*cos(y))+x2^2+x1^2))/2\n```\n\n\nWith `domain: complex`, I get the same question and same result.\n\nNot sure where the question is coming from. I will try to investigate a little.",
    "created_at": "2020-11-14T16:27:43Z",
    "issue": "https://github.com/sagemath/sage/issues/30816",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/30816#issuecomment-495928",
    "user": "https://trac.sagemath.org/admin/accounts/users/robert_dodier"
}
```

<a id='comment:1'></a>
I get a slightly different behavior, but still buggy. Working w/ Maxima 5.44.0 on macOS.

With `domain: real` (default), I get "Is 1 zero or nonzero?" for the question, and if I respond `nz`, then I get a result (I didn't check it):


```
(-(x2^2*cos(y)^2*log(2*sqrt((-2*x1*x2*cos(y))+x2^2+x1^2)-2*x2*cos(y)+2*x1))/2)
 +(x2^2*log(2*sqrt((-2*x1*x2*cos(y))+x2^2+x1^2)-2*x2*cos(y)+2*x1))/2
 -(x2*cos(y)*sqrt((-2*x1*x2*cos(y))+x2^2+x1^2))/2
 +(x1*sqrt((-2*x1*x2*cos(y))+x2^2+x1^2))/2
```


With `domain: complex`, I get the same question and same result.

Not sure where the question is coming from. I will try to investigate a little.



---

archive/issue_comments_495929.json:
```json
{
    "body": "<a id='comment:2'></a>\n`trace(?asksign1)` and then trying it again shows the expression which confuses asksign is `4*x2<sup>2*cos(y)</sup>2-4*x2^2`. In a fresh session, I get the buggy behavior with just\n\n```\n(%i1) asksign (4*x2^2*cos(y)^2-4*x2^2);\nIs x2 zero or nonzero?\n\nnz;\n(%o1)                                 pos\n(%i2) assume(x2 > 0);\n(%o2)                              [x2 > 0]\n(%i3) asksign (4*x2^2*cos(y)^2-4*x2^2);\nIs 1 zero or nonzero?\n\nnz;\n(%o3)                                 pos\n(%i4) asksign(4*x*cos(y)-4*x);\nIs x positive, negative or zero?\n\np;\n(%o4)                                 pos\n(%i5) assume(x>0);\n(%o5)                               [x > 0]\n(%i6) asksign(4*x*cos(y)-4*x);\nIs 1 zero or nonzero?\n\nnz;\n(%o6)                                 pos\n(%i7) asksign(x*cos(y)-x);\nIs 1 zero or nonzero?\n\nnz;\n(%o7)                                 pos\n```\nThat's the simplest example I found. The presence of `cos(y)` seems important; without it I don't see the bug:\n\n```\n(%i8) asksign(x*y-x);\nIs y - 1 positive, negative or zero?\n\np;\n(%o8)                                 pos\n(%i9) asksign(x*foo(y) - x);\nIs foo(y) - 1 positive, negative or zero?\n\np;\n(%o9)                                 pos\n```\nJust to be clear, `assume(x > 0)` is enough; assumptions on other variables, and the setting of `domain`, and the presence of `integrate` aren't required.",
    "created_at": "2020-11-14T16:40:30Z",
    "issue": "https://github.com/sagemath/sage/issues/30816",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/30816#issuecomment-495929",
    "user": "https://trac.sagemath.org/admin/accounts/users/robert_dodier"
}
```

<a id='comment:2'></a>
`trace(?asksign1)` and then trying it again shows the expression which confuses asksign is `4*x2<sup>2*cos(y)</sup>2-4*x2^2`. In a fresh session, I get the buggy behavior with just

```
(%i1) asksign (4*x2^2*cos(y)^2-4*x2^2);
Is x2 zero or nonzero?

nz;
(%o1)                                 pos
(%i2) assume(x2 > 0);
(%o2)                              [x2 > 0]
(%i3) asksign (4*x2^2*cos(y)^2-4*x2^2);
Is 1 zero or nonzero?

nz;
(%o3)                                 pos
(%i4) asksign(4*x*cos(y)-4*x);
Is x positive, negative or zero?

p;
(%o4)                                 pos
(%i5) assume(x>0);
(%o5)                               [x > 0]
(%i6) asksign(4*x*cos(y)-4*x);
Is 1 zero or nonzero?

nz;
(%o6)                                 pos
(%i7) asksign(x*cos(y)-x);
Is 1 zero or nonzero?

nz;
(%o7)                                 pos
```
That's the simplest example I found. The presence of `cos(y)` seems important; without it I don't see the bug:

```
(%i8) asksign(x*y-x);
Is y - 1 positive, negative or zero?

p;
(%o8)                                 pos
(%i9) asksign(x*foo(y) - x);
Is foo(y) - 1 positive, negative or zero?

p;
(%o9)                                 pos
```
Just to be clear, `assume(x > 0)` is enough; assumptions on other variables, and the setting of `domain`, and the presence of `integrate` aren't required.



---

archive/issue_comments_495930.json:
```json
{
    "body": "<a id='comment:3'></a>\nI've opened https://sourceforge.net/p/maxima/bugs/3677/ to track this bug.",
    "created_at": "2020-11-15T06:00:56Z",
    "issue": "https://github.com/sagemath/sage/issues/30816",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/30816#issuecomment-495930",
    "user": "https://trac.sagemath.org/admin/accounts/users/robert_dodier"
}
```

<a id='comment:3'></a>
I've opened https://sourceforge.net/p/maxima/bugs/3677/ to track this bug.



---

archive/issue_comments_495931.json:
```json
{
    "body": "<a id='comment:4'></a>\nSage development has entered the release candidate phase for 9.3. Setting a new milestone for this ticket based on a cursory review of ticket status, priority, and last modification date.",
    "created_at": "2021-03-27T02:13:38Z",
    "issue": "https://github.com/sagemath/sage/issues/30816",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/30816#issuecomment-495931",
    "user": "https://github.com/mkoeppe"
}
```

<a id='comment:4'></a>
Sage development has entered the release candidate phase for 9.3. Setting a new milestone for this ticket based on a cursory review of ticket status, priority, and last modification date.



---

archive/issue_events_276303.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2021-03-27T02:13:38Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/30816",
    "milestone": "sage-9.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30816#event-276303"
}
```



---

archive/issue_events_276304.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2021-03-27T02:13:38Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/30816",
    "milestone": "sage-9.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30816#event-276304"
}
```



---

archive/issue_events_276305.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2021-08-22T20:35:10Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/30816",
    "milestone": "sage-9.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30816#event-276305"
}
```



---

archive/issue_events_276306.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2021-08-22T20:35:10Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/30816",
    "milestone": "sage-9.5",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30816#event-276306"
}
```



---

archive/issue_events_276307.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2021-12-18T20:12:32Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/30816",
    "milestone": "sage-9.5",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30816#event-276307"
}
```



---

archive/issue_events_276308.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2021-12-18T20:12:32Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/30816",
    "milestone": "sage-9.6",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30816#event-276308"
}
```



---

archive/issue_events_276309.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-05-03T15:17:06Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/30816",
    "milestone": "sage-9.6",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30816#event-276309"
}
```



---

archive/issue_events_276310.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-05-03T15:17:06Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/30816",
    "milestone": "sage-9.7",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30816#event-276310"
}
```



---

archive/issue_events_276311.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-09-19T18:58:47Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/30816",
    "milestone": "sage-9.7",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30816#event-276311"
}
```



---

archive/issue_events_276312.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-09-19T18:58:47Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/30816",
    "milestone": "sage-9.8",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/30816#event-276312"
}
```
