# Issue 30938: Fix comparison of automorphisms of Eisenstein extensions

archive/issues_030701.json:
```json
{
    "body": "In SageMath 9.3.beta1:\n\n```\nsage: R.<x> = QQ[]\n....: K = Qp(19)\n....: L.<b> = K.extension(x^2 - 19)\n....: a = L.hom([b], codomain=L)\n....: id = L.Hom(L).identity()\n....: a == id\nTraceback (most recent call last):\n...\nTypeError: 'NoneType' object is not iterable\nDuring handling of the above exception, another exception occurred:\n...\nAttributeError: 'NoneType' object has no attribute 'list'\nDuring handling of the above exception, another exception occurred:\n...\nTypeError: cannot convert x to a p-adic element\nDuring handling of the above exception, another exception occurred:\n...\nTypeError: None fails to convert into the map's domain 19-adic Eisenstein Extension Field in b defined by x^2 - 19, but a `pushforward` method is not properly implemented\n```\n\n\nCC:  @jdemeyer @tscrim @roed314\n\nAuthor: Peter Bruin\n\nBranch: u/pbruin/30938-padic_element_from_None\n\nStatus: needs_info\n\nCommit: 64063cf55c50f1a99bd74df8ede0cead04376fee\n\nIssue created by migration from https://trac.sagemath.org/ticket/30938\n\n",
    "created_at": "2020-11-19T09:30:26Z",
    "labels": [
        "component: padics",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-9.8",
    "title": "Fix comparison of automorphisms of Eisenstein extensions",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/30938",
    "user": "https://github.com/pjbruin"
}
```
In SageMath 9.3.beta1:

```
sage: R.<x> = QQ[]
....: K = Qp(19)
....: L.<b> = K.extension(x^2 - 19)
....: a = L.hom([b], codomain=L)
....: id = L.Hom(L).identity()
....: a == id
Traceback (most recent call last):
...
TypeError: 'NoneType' object is not iterable
During handling of the above exception, another exception occurred:
...
AttributeError: 'NoneType' object has no attribute 'list'
During handling of the above exception, another exception occurred:
...
TypeError: cannot convert x to a p-adic element
During handling of the above exception, another exception occurred:
...
TypeError: None fails to convert into the map's domain 19-adic Eisenstein Extension Field in b defined by x^2 - 19, but a `pushforward` method is not properly implemented
```


CC:  @jdemeyer @tscrim @roed314

Author: Peter Bruin

Branch: u/pbruin/30938-padic_element_from_None

Status: needs_info

Commit: 64063cf55c50f1a99bd74df8ede0cead04376fee

Issue created by migration from https://trac.sagemath.org/ticket/30938





---

archive/issue_comments_438405.json:
```json
{
    "body": "Changing status from new to needs_review.",
    "created_at": "2020-11-20T13:07:51Z",
    "issue": "https://github.com/sagemath/sagetest/issues/30938",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/30938#issuecomment-438405",
    "user": "https://github.com/pjbruin"
}
```

Changing status from new to needs_review.



---

archive/issue_comments_438406.json:
```json
{
    "body": "<a id='comment:1'></a>The attached branch fixes this by implementing conversion of `None` to an element of `L`, which already works for most rings.  There are other solutions, but those seem more complicated.",
    "created_at": "2020-11-20T13:07:51Z",
    "issue": "https://github.com/sagemath/sagetest/issues/30938",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/30938#issuecomment-438406",
    "user": "https://github.com/pjbruin"
}
```

<a id='comment:1'></a>The attached branch fixes this by implementing conversion of `None` to an element of `L`, which already works for most rings.  There are other solutions, but those seem more complicated.



---

archive/issue_comments_438407.json:
```json
{
    "body": "<a id='comment:2'></a>It seems comparison of ring morphisms with the identity morphism might be a wider problem. See #29632 for a similar issue.",
    "created_at": "2021-02-17T19:51:39Z",
    "issue": "https://github.com/sagemath/sagetest/issues/30938",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/30938#issuecomment-438407",
    "user": "https://github.com/mwageringel"
}
```

<a id='comment:2'></a>It seems comparison of ring morphisms with the identity morphism might be a wider problem. See #29632 for a similar issue.



---

archive/issue_comments_438408.json:
```json
{
    "body": "<a id='comment:3'></a>The `None` in the error comes from the generic implementation of `_richcmp_` in `sage.categories.morphism` which performs a computation like this\n\n```\nsage: L.gen(0)._lmul_(K.gen(0)) is None\nTrue\n```\n\nwhich looks like `_lmul_` is not implemented. It seems that the implementation of the `_richcmp_` method assumes that the result is\n\n```\nsage: L.gen(0) * K.gen(0)\nb^3 + O(b^43)\n```\n\nso treating `None` as zero here will not correctly resolve this problem.\n\nAnother issue with the implementation of `_richcmp_` is that the `<ModuleElement>e`, on which `_lmul_` is called, might be zero if the last generator is 0. For example in this case:\n\n```\nsage: K.<a> = QuadraticField(-1)\nsage: R.<x,y> = K['x,y'].quotient('y')\nsage: id = R.Hom(R).identity()\nsage: f = R.hom(R.gens(), R, base_map=K.hom([-a], K))\nsage: f == id  # should be False\nTrue\n```\nAs `e=y` is zero, also `y * a` is zero, so that comparing the images `f(y * a)` and `id(y * a)` is not meaningful.\n(Currently, this example fails because `_lmul_` returns `None`, though, and therefore also fails for the quotient by `x`.)\n\nSo at least the implementation should pick a module element `e` that is non-zero, but I am not sure if that is already a sufficient condition for checking equality.",
    "created_at": "2021-02-23T20:14:31Z",
    "issue": "https://github.com/sagemath/sagetest/issues/30938",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/30938#issuecomment-438408",
    "user": "https://github.com/mwageringel"
}
```

<a id='comment:3'></a>The `None` in the error comes from the generic implementation of `_richcmp_` in `sage.categories.morphism` which performs a computation like this

```
sage: L.gen(0)._lmul_(K.gen(0)) is None
True
```

which looks like `_lmul_` is not implemented. It seems that the implementation of the `_richcmp_` method assumes that the result is

```
sage: L.gen(0) * K.gen(0)
b^3 + O(b^43)
```

so treating `None` as zero here will not correctly resolve this problem.

Another issue with the implementation of `_richcmp_` is that the `<ModuleElement>e`, on which `_lmul_` is called, might be zero if the last generator is 0. For example in this case:

```
sage: K.<a> = QuadraticField(-1)
sage: R.<x,y> = K['x,y'].quotient('y')
sage: id = R.Hom(R).identity()
sage: f = R.hom(R.gens(), R, base_map=K.hom([-a], K))
sage: f == id  # should be False
True
```
As `e=y` is zero, also `y * a` is zero, so that comparing the images `f(y * a)` and `id(y * a)` is not meaningful.
(Currently, this example fails because `_lmul_` returns `None`, though, and therefore also fails for the quotient by `x`.)

So at least the implementation should pick a module element `e` that is non-zero, but I am not sure if that is already a sufficient condition for checking equality.



---

archive/issue_comments_438409.json:
```json
{
    "body": "Changing status from needs_review to needs_info.",
    "created_at": "2021-02-23T20:14:31Z",
    "issue": "https://github.com/sagemath/sagetest/issues/30938",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/30938#issuecomment-438409",
    "user": "https://github.com/mwageringel"
}
```

Changing status from needs_review to needs_info.



---

archive/issue_comments_438410.json:
```json
{
    "body": "<a id='comment:4'></a>This `_richcmp_()` method was totally rewritten in #24281; adding the author and reviewer of that ticket in CC.",
    "created_at": "2021-02-24T21:48:09Z",
    "issue": "https://github.com/sagemath/sagetest/issues/30938",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/30938#issuecomment-438410",
    "user": "https://github.com/pjbruin"
}
```

<a id='comment:4'></a>This `_richcmp_()` method was totally rewritten in #24281; adding the author and reviewer of that ticket in CC.



---

archive/issue_comments_438411.json:
```json
{
    "body": "<a id='comment:5'></a>Replying to [comment:2 gh-mwageringel]:\n> It seems comparison of ring morphisms with the identity morphism might be a wider problem. See #29632 for a similar issue.\n\nPossibly also related: #28617",
    "created_at": "2021-03-31T14:12:38Z",
    "issue": "https://github.com/sagemath/sagetest/issues/30938",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/30938#issuecomment-438411",
    "user": "https://github.com/pjbruin"
}
```

<a id='comment:5'></a>Replying to [comment:2 gh-mwageringel]:
> It seems comparison of ring morphisms with the identity morphism might be a wider problem. See #29632 for a similar issue.

Possibly also related: #28617



---

archive/issue_comments_438412.json:
```json
{
    "body": "<a id='comment:6'></a>Replying to [comment:3 gh-mwageringel]:\n> The `None` in the error comes from the generic implementation of `_richcmp_` in `sage.categories.morphism` which performs a computation like this\n> \n> \n> ```\n> sage: L.gen(0)._lmul_(K.gen(0)) is None\n> True\n> ```\n> \n> which looks like `_lmul_` is not implemented. It seems that the implementation of the `_richcmp_` method assumes that the result is\n> \n> \n> ```\n> sage: L.gen(0) * K.gen(0)\n> b^3 + O(b^43)\n> ```\n> \n> so treating `None` as zero here will not correctly resolve this problem.\n\n\nRight. Implementing scalar multiplication via `_lmul_` for the ring elements will solve the problem.",
    "created_at": "2021-05-04T03:32:54Z",
    "issue": "https://github.com/sagemath/sagetest/issues/30938",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/30938#issuecomment-438412",
    "user": "https://github.com/kwankyu"
}
```

<a id='comment:6'></a>Replying to [comment:3 gh-mwageringel]:
> The `None` in the error comes from the generic implementation of `_richcmp_` in `sage.categories.morphism` which performs a computation like this
> 
> 
> ```
> sage: L.gen(0)._lmul_(K.gen(0)) is None
> True
> ```
> 
> which looks like `_lmul_` is not implemented. It seems that the implementation of the `_richcmp_` method assumes that the result is
> 
> 
> ```
> sage: L.gen(0) * K.gen(0)
> b^3 + O(b^43)
> ```
> 
> so treating `None` as zero here will not correctly resolve this problem.


Right. Implementing scalar multiplication via `_lmul_` for the ring elements will solve the problem.



---

archive/issue_comments_438413.json:
```json
{
    "body": "<a id='comment:7'></a>Now the patch for #28617 also fixes the problem of this ticket.",
    "created_at": "2021-05-04T04:55:39Z",
    "issue": "https://github.com/sagemath/sagetest/issues/30938",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/30938#issuecomment-438413",
    "user": "https://github.com/kwankyu"
}
```

<a id='comment:7'></a>Now the patch for #28617 also fixes the problem of this ticket.



---

archive/issue_comments_438414.json:
```json
{
    "body": "<a id='comment:8'></a>Replying to [comment:7 klee]:\n> Now the patch for #28617 also fixes the problem of this ticket.\n\nWith the patch from #28617 it no longer raises an error, but the answer is wrong:\n\n```\nsage: R.<x> = QQ[]\n....: K = Qp(19)\n....: L.<b> = K.extension(x^2 - 19)\n....: a = L.hom([b], codomain=L)\n....: id = L.Hom(L).identity()\n....: a == id\nFalse\n```\nThe result should be `True`.",
    "created_at": "2021-05-06T10:51:50Z",
    "issue": "https://github.com/sagemath/sagetest/issues/30938",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/30938#issuecomment-438414",
    "user": "https://github.com/pjbruin"
}
```

<a id='comment:8'></a>Replying to [comment:7 klee]:
> Now the patch for #28617 also fixes the problem of this ticket.

With the patch from #28617 it no longer raises an error, but the answer is wrong:

```
sage: R.<x> = QQ[]
....: K = Qp(19)
....: L.<b> = K.extension(x^2 - 19)
....: a = L.hom([b], codomain=L)
....: id = L.Hom(L).identity()
....: a == id
False
```
The result should be `True`.



---

archive/issue_comments_438415.json:
```json
{
    "body": "<a id='comment:9'></a>Does `a` behave correctly?\n\n```\nsage: a(K.gen(0)) == K.gen(0)\nFalse\nsage: a(K.gen(0)) == L(K.gen(0))\nFalse\nsage: K.gen()\n19 + O(19^21)\nsage: L(K.gen(0))\nb^2 + O(b^42)\nsage: a(K.gen(0))\nb^2 + 18*b^40 + O(b^42)\n```",
    "created_at": "2021-05-06T11:52:09Z",
    "issue": "https://github.com/sagemath/sagetest/issues/30938",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/30938#issuecomment-438415",
    "user": "https://github.com/kwankyu"
}
```

<a id='comment:9'></a>Does `a` behave correctly?

```
sage: a(K.gen(0)) == K.gen(0)
False
sage: a(K.gen(0)) == L(K.gen(0))
False
sage: K.gen()
19 + O(19^21)
sage: L(K.gen(0))
b^2 + O(b^42)
sage: a(K.gen(0))
b^2 + 18*b^40 + O(b^42)
```



---

archive/issue_comments_438416.json:
```json
{
    "body": "<a id='comment:10'></a>This is funny.  The output of `L(K.gen(0))` is correct (since `19 = b^2` in `L`), but the output of `a(K.gen(0))` has a wrong term `18*b^40`...\nSame for `a(b^2)` (but not for `a(b)`):\n\n```\nsage: b\nb + O(b^41)\nsage: a(b)\nb + O(b^41)\nsage: b^2\nb^2 + O(b^42)\nsage: a(b^2)\nb^2 + 18*b^40 + O(b^42)\n```",
    "created_at": "2021-05-07T07:00:00Z",
    "issue": "https://github.com/sagemath/sagetest/issues/30938",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/30938#issuecomment-438416",
    "user": "https://github.com/pjbruin"
}
```

<a id='comment:10'></a>This is funny.  The output of `L(K.gen(0))` is correct (since `19 = b^2` in `L`), but the output of `a(K.gen(0))` has a wrong term `18*b^40`...
Same for `a(b^2)` (but not for `a(b)`):

```
sage: b
b + O(b^41)
sage: a(b)
b + O(b^41)
sage: b^2
b^2 + O(b^42)
sage: a(b^2)
b^2 + 18*b^40 + O(b^42)
```



---

archive/issue_comments_438417.json:
```json
{
    "body": "<a id='comment:11'></a>This looks suspicious (the term `18*19^20` should probably not be there):\n\n```\nsage: c = b^2\nsage: c._polynomial_list()\n[19 + 18*19^20 + O(19^21)]\n```\nAnd this:\n\n```\nsage: f, k = c._ntl_rep_abs(); f\n[676619522235827247480400837]\nsage: K(ZZ(f[0]))\n19 + 18*19^20 + O(19^21)\n```",
    "created_at": "2021-05-07T09:31:18Z",
    "issue": "https://github.com/sagemath/sagetest/issues/30938",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/30938#issuecomment-438417",
    "user": "https://github.com/pjbruin"
}
```

<a id='comment:11'></a>This looks suspicious (the term `18*19^20` should probably not be there):

```
sage: c = b^2
sage: c._polynomial_list()
[19 + 18*19^20 + O(19^21)]
```
And this:

```
sage: f, k = c._ntl_rep_abs(); f
[676619522235827247480400837]
sage: K(ZZ(f[0]))
19 + 18*19^20 + O(19^21)
```



---

archive/issue_comments_438418.json:
```json
{
    "body": "<a id='comment:12'></a>Relevant input for the above example:\n\n```\nsage: K = Qp(19)\nsage: R.<x> = K[]\nsage: L.<b> = K.extension(x^2 - 19)\nsage: c = b^2\nsage: f, k = c._ntl_rep_abs(); f\n[676619522235827247480400837]\nsage: K(ZZ(f[0]))\n19 + 18*19^20 + O(19^21)\n```\nMaybe David Roe (CC) can say something about this?",
    "created_at": "2021-05-08T18:29:11Z",
    "issue": "https://github.com/sagemath/sagetest/issues/30938",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/30938#issuecomment-438418",
    "user": "https://github.com/pjbruin"
}
```

<a id='comment:12'></a>Relevant input for the above example:

```
sage: K = Qp(19)
sage: R.<x> = K[]
sage: L.<b> = K.extension(x^2 - 19)
sage: c = b^2
sage: f, k = c._ntl_rep_abs(); f
[676619522235827247480400837]
sage: K(ZZ(f[0]))
19 + 18*19^20 + O(19^21)
```
Maybe David Roe (CC) can say something about this?



---

archive/issue_comments_438419.json:
```json
{
    "body": "<a id='comment:13'></a>Moving to 9.4, as 9.3 has been released.",
    "created_at": "2021-05-10T17:42:09Z",
    "issue": "https://github.com/sagemath/sagetest/issues/30938",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/30938#issuecomment-438419",
    "user": "https://github.com/mkoeppe"
}
```

<a id='comment:13'></a>Moving to 9.4, as 9.3 has been released.



---

archive/issue_events_080793.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2021-05-10T17:42:09Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/30938",
    "milestone": "sage-9.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/30938#event-80793"
}
```



---

archive/issue_comments_438420.json:
```json
{
    "body": "<a id='comment:14'></a>Setting a new milestone for this ticket based on a cursory review.",
    "created_at": "2021-07-19T00:44:56Z",
    "issue": "https://github.com/sagemath/sagetest/issues/30938",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/30938#issuecomment-438420",
    "user": "https://github.com/mkoeppe"
}
```

<a id='comment:14'></a>Setting a new milestone for this ticket based on a cursory review.



---

archive/issue_events_080794.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2021-07-19T00:44:56Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/30938",
    "milestone": "sage-9.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/30938#event-80794"
}
```



---

archive/issue_events_080795.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2021-07-19T00:44:56Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/30938",
    "milestone": "sage-9.5",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/30938#event-80795"
}
```



---

archive/issue_events_080796.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2021-12-18T19:53:12Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/30938",
    "milestone": "sage-9.5",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/30938#event-80796"
}
```



---

archive/issue_events_080797.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2021-12-18T19:53:12Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/30938",
    "milestone": "sage-9.6",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/30938#event-80797"
}
```



---

archive/issue_comments_438421.json:
```json
{
    "body": "<a id='comment:15'></a>Stalled in `needs_review` or `needs_info`; likely won't make it into Sage 9.5.",
    "created_at": "2021-12-18T19:53:12Z",
    "issue": "https://github.com/sagemath/sagetest/issues/30938",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/30938#issuecomment-438421",
    "user": "https://github.com/mkoeppe"
}
```

<a id='comment:15'></a>Stalled in `needs_review` or `needs_info`; likely won't make it into Sage 9.5.



---

archive/issue_events_080798.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-04-11T17:19:39Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/30938",
    "milestone": "sage-9.6",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/30938#event-80798"
}
```



---

archive/issue_events_080799.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-04-11T17:19:39Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/30938",
    "milestone": "sage-9.7",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/30938#event-80799"
}
```



---

archive/issue_events_080800.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-09-19T18:58:47Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/30938",
    "milestone": "sage-9.7",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/30938#event-80800"
}
```



---

archive/issue_events_080801.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-09-19T18:58:47Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/30938",
    "milestone": "sage-9.8",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/30938#event-80801"
}
```
