# Issue 12073: MatrixGroup() or order() incorrect for G_2(F_3)

archive/issues_011901.json:
```json
{
    "assignees": [],
    "body": "If I use the generators for the exceptional group G_2(F_3) in its natural 7-dimensional representation over F_3 in the MatrixGroup constructor, the order of the group returned is 8491392 (twice what it should be). However, if I use the same generators through the gap console within sage, I get the correct size.\n\n```\nK=GF(3)\nsage: gens=[matrix(K,7,[\n....: [0,2,0,0,0,0,0],\n....: [2,0,0,0,0,0,0],\n....: [0,0,0,2,0,0,0],\n....: [0,0,2,0,0,0,0],\n....: [0,0,0,0,0,2,0],\n....: [0,0,0,0,2,0,0],\n....: [2,2,2,2,1,1,1]]),\n....: matrix(K,7,[\n....: [2,0,0,0,0,0,0],\n....: [0,0,2,0,0,0,0],\n....: [1,1,1,0,0,0,0],\n....: [0,0,0,0,2,0,0],\n....: [1,0,0,1,1,0,0],\n....: [0,0,0,0,0,0,2],\n....: [1,0,0,0,0,1,1]])]\nsage: M = MatrixGroup(gens); M.order()\n8491392\nsage: M.gap().Size()\n8491392\nsage: M.gap().Order()\n8491392\nsage: gap.Group([gap(gens[0]),gap(gens[1])]).Order()\n8491392\n```\n\n\n```\ngap> m1:= [\n> [0,2,0,0,0,0,0],\n> [2,0,0,0,0,0,0],\n> [0,0,0,2,0,0,0],\n> [0,0,2,0,0,0,0],\n> [0,0,0,0,0,2,0],\n> [0,0,0,0,2,0,0],\n> [2,2,2,2,1,1,1]\n> ]*Z(3);\ngap> m2:= [\n> [2,0,0,0,0,0,0],\n> [0,0,2,0,0,0,0],\n> [1,1,1,0,0,0,0],\n> [0,0,0,0,2,0,0],\n> [1,0,0,1,1,0,0],\n> [0,0,0,0,0,0,2],\n> [1,0,0,0,0,1,1]\n> ]*Z(3);\ngap> Order(Group( m1, m2 ));\n4245696\n```\n\n\nAssignee: **@wdjoyner**\n\nKeywords: **MatrixGroup, GAP, order**\n\nReviewer: **Travis Scrimshaw**\n\n_Issue created by migration from https://trac.sagemath.org/ticket/12073_\n\n",
    "closed_at": "2017-07-13T07:54:31Z",
    "created_at": "2011-11-23T07:18:45Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/bug",
        "https://github.com/sagemath/sage/labels/component%3A%20group%20theory",
        "https://github.com/sagemath/sage/labels/wontfix"
    ],
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "MatrixGroup() or order() incorrect for G_2(F_3)",
    "type": "issue",
    "updated_at": "2017-07-13T07:54:31Z",
    "url": "https://github.com/sagemath/sage/issues/12073",
    "user": "https://github.com/rharron"
}
```
If I use the generators for the exceptional group G_2(F_3) in its natural 7-dimensional representation over F_3 in the MatrixGroup constructor, the order of the group returned is 8491392 (twice what it should be). However, if I use the same generators through the gap console within sage, I get the correct size.

```
K=GF(3)
sage: gens=[matrix(K,7,[
....: [0,2,0,0,0,0,0],
....: [2,0,0,0,0,0,0],
....: [0,0,0,2,0,0,0],
....: [0,0,2,0,0,0,0],
....: [0,0,0,0,0,2,0],
....: [0,0,0,0,2,0,0],
....: [2,2,2,2,1,1,1]]),
....: matrix(K,7,[
....: [2,0,0,0,0,0,0],
....: [0,0,2,0,0,0,0],
....: [1,1,1,0,0,0,0],
....: [0,0,0,0,2,0,0],
....: [1,0,0,1,1,0,0],
....: [0,0,0,0,0,0,2],
....: [1,0,0,0,0,1,1]])]
sage: M = MatrixGroup(gens); M.order()
8491392
sage: M.gap().Size()
8491392
sage: M.gap().Order()
8491392
sage: gap.Group([gap(gens[0]),gap(gens[1])]).Order()
8491392
```


```
gap> m1:= [
> [0,2,0,0,0,0,0],
> [2,0,0,0,0,0,0],
> [0,0,0,2,0,0,0],
> [0,0,2,0,0,0,0],
> [0,0,0,0,0,2,0],
> [0,0,0,0,2,0,0],
> [2,2,2,2,1,1,1]
> ]*Z(3);
gap> m2:= [
> [2,0,0,0,0,0,0],
> [0,0,2,0,0,0,0],
> [1,1,1,0,0,0,0],
> [0,0,0,0,2,0,0],
> [1,0,0,1,1,0,0],
> [0,0,0,0,0,0,2],
> [1,0,0,0,0,1,1]
> ]*Z(3);
gap> Order(Group( m1, m2 ));
4245696
```


Assignee: **@wdjoyner**

Keywords: **MatrixGroup, GAP, order**

Reviewer: **Travis Scrimshaw**

_Issue created by migration from https://trac.sagemath.org/ticket/12073_





---

archive/issue_events_149526.json:
```json
{
    "actor": "https://github.com/rharron",
    "created_at": "2011-11-23T07:18:45Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "milestone_number": null,
    "milestone_title": "sage-5.11",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12073#event-149526"
}
```



---

archive/issue_events_149527.json:
```json
{
    "actor": "https://github.com/rharron",
    "created_at": "2011-11-23T07:18:45Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20group%20theory",
    "label_color": "0000ff",
    "label_name": "component: group theory",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12073#event-149527"
}
```



---

archive/issue_events_149528.json:
```json
{
    "actor": "https://github.com/rharron",
    "created_at": "2011-11-23T07:18:45Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "label": "https://github.com/sagemath/sage/labels/p3%20%E2%80%93%20major",
    "label_color": "ffbb00",
    "label_name": "p3 \u2013 major",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12073#event-149528"
}
```



---

archive/issue_events_149529.json:
```json
{
    "actor": "https://github.com/rharron",
    "created_at": "2011-11-23T07:18:45Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "d73a4a",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12073#event-149529"
}
```



---

archive/issue_events_149530.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2013-08-13T15:35:53Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "milestone_number": null,
    "milestone_title": "sage-5.11",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12073#event-149530"
}
```



---

archive/issue_events_149531.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2013-08-13T15:35:53Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "milestone_number": null,
    "milestone_title": "sage-5.12",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12073#event-149531"
}
```



---

archive/issue_events_149532.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-01-30T21:20:52Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "milestone_number": null,
    "milestone_title": "sage-6.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12073#event-149532"
}
```



---

archive/issue_events_149533.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-01-30T21:20:52Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "milestone_number": null,
    "milestone_title": "sage-6.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12073#event-149533"
}
```



---

archive/issue_events_149534.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-05-06T15:20:58Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "milestone_number": null,
    "milestone_title": "sage-6.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12073#event-149534"
}
```



---

archive/issue_events_149535.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-05-06T15:20:58Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "milestone_number": null,
    "milestone_title": "sage-6.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12073#event-149535"
}
```



---

archive/issue_events_149536.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-08-10T16:51:03Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "milestone_number": null,
    "milestone_title": "sage-6.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12073#event-149536"
}
```



---

archive/issue_events_149537.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-08-10T16:51:03Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "milestone_number": null,
    "milestone_title": "sage-6.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12073#event-149537"
}
```



---

archive/issue_comments_130819.json:
```json
{
    "body": "Stopgaps: **todo**",
    "created_at": "2015-08-25T16:26:16Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12073#issuecomment-130819",
    "user": "https://github.com/sagetrac-jakobkroeker"
}
```

Stopgaps: **todo**



---

archive/issue_comments_130820.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -18,7 +18,9 @@\n ....: [1,0,0,1,1,0,0],\n ....: [0,0,0,0,0,0,2],\n ....: [1,0,0,0,0,1,1]])]\n-sage: MatrixGroup(gens).order()\n+sage: M = MatrixGroup(gens); M.order()\n+8491392\n+sage: M.gap().Size()\n 8491392\n ```\n \n``````\n",
    "created_at": "2017-06-02T12:30:38Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12073#issuecomment-130820",
    "user": "https://github.com/fchapoton"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -18,7 +18,9 @@
 ....: [1,0,0,1,1,0,0],
 ....: [0,0,0,0,0,0,2],
 ....: [1,0,0,0,0,1,1]])]
-sage: MatrixGroup(gens).order()
+sage: M = MatrixGroup(gens); M.order()
+8491392
+sage: M.gap().Size()
 8491392
 ```
 
``````




---

archive/issue_comments_130821.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -21,6 +21,8 @@\n sage: M = MatrixGroup(gens); M.order()\n 8491392\n sage: M.gap().Size()\n+8491392\n+sage: M.gap().Order()\n 8491392\n ```\n \n``````\n",
    "created_at": "2017-06-02T12:31:16Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12073#issuecomment-130821",
    "user": "https://github.com/fchapoton"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -21,6 +21,8 @@
 sage: M = MatrixGroup(gens); M.order()
 8491392
 sage: M.gap().Size()
+8491392
+sage: M.gap().Order()
 8491392
 ```
 
``````




---

archive/issue_comments_130822.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -23,6 +23,8 @@\n sage: M.gap().Size()\n 8491392\n sage: M.gap().Order()\n+8491392\n+sage: gap.Group([gap(gens[0]),gap(gens[1])]).Order()\n 8491392\n ```\n \n``````\n",
    "created_at": "2017-06-02T12:33:11Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12073#issuecomment-130822",
    "user": "https://github.com/fchapoton"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -23,6 +23,8 @@
 sage: M.gap().Size()
 8491392
 sage: M.gap().Order()
+8491392
+sage: gap.Group([gap(gens[0]),gap(gens[1])]).Order()
 8491392
 ```
 
``````




---

archive/issue_comments_130823.json:
```json
{
    "body": "<div id=\"comment:9\" align=\"right\">Comment 9</div>\n\nCompare\n\n```\nsage: L = [gap(GF(3)(i)) for i in range(3)]; L\n[0*Z(3), Z(3)^0, Z(3)]\n```\nand\n\n```\ngap> [0, 1, 2]*Z(3);\n[ 0*Z(3), Z(3), Z(3)^0 ]\n```",
    "created_at": "2017-06-02T12:39:55Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12073#issuecomment-130823",
    "user": "https://github.com/fchapoton"
}
```

<div id="comment:9" align="right">Comment 9</div>

Compare

```
sage: L = [gap(GF(3)(i)) for i in range(3)]; L
[0*Z(3), Z(3)^0, Z(3)]
```
and

```
gap> [0, 1, 2]*Z(3);
[ 0*Z(3), Z(3), Z(3)^0 ]
```



---

archive/issue_comments_130824.json:
```json
{
    "body": "<div id=\"comment:10\" align=\"right\">Comment 10</div>\n\nsame problems for other finite fields of prime order\n\n```\nsage: p=5; L = [gap(GF(p)(i)) for i in range(p)]; L\n[0*Z(5), Z(5)^0, Z(5), Z(5)^3, Z(5)^2]\n```\nversus\n\n```\ngap> p:=5; [0..p-1]*Z(p);\n5\n[ 0*Z(5), Z(5), Z(5)^2, Z(5)^0, Z(5)^3 ]\n```\n**EDIT**\nNote also that \n\n```\ngap> One(ZmodnZ(5));\nZ(5)^0\ngap> One(Z(5));\nZ(5)^0\ngap> One(GF(5));\nZ(5)^0\n```\nSo our conversion seems to be consistent with gap..",
    "created_at": "2017-06-02T12:43:38Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12073#issuecomment-130824",
    "user": "https://github.com/fchapoton"
}
```

<div id="comment:10" align="right">Comment 10</div>

same problems for other finite fields of prime order

```
sage: p=5; L = [gap(GF(p)(i)) for i in range(p)]; L
[0*Z(5), Z(5)^0, Z(5), Z(5)^3, Z(5)^2]
```
versus

```
gap> p:=5; [0..p-1]*Z(p);
5
[ 0*Z(5), Z(5), Z(5)^2, Z(5)^0, Z(5)^3 ]
```
**EDIT**
Note also that 

```
gap> One(ZmodnZ(5));
Z(5)^0
gap> One(Z(5));
Z(5)^0
gap> One(GF(5));
Z(5)^0
```
So our conversion seems to be consistent with gap..



---

archive/issue_comments_130825.json:
```json
{
    "body": "<div id=\"comment:11\" align=\"right\">Comment 11</div>\n\nThis boils down to\n\n```\ngap> 1*Z(5);\nZ(5)\ngap> One(Z(5));\nZ(5)^0\n```\nwhich is indeed not very-good looking.",
    "created_at": "2017-06-02T13:07:11Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12073#issuecomment-130825",
    "user": "https://github.com/fchapoton"
}
```

<div id="comment:11" align="right">Comment 11</div>

This boils down to

```
gap> 1*Z(5);
Z(5)
gap> One(Z(5));
Z(5)^0
```
which is indeed not very-good looking.



---

archive/issue_events_149538.json:
```json
{
    "actor": "https://github.com/fchapoton",
    "created_at": "2017-06-02T13:39:14Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "7fff00",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12073#event-149538"
}
```



---

archive/issue_comments_130826.json:
```json
{
    "body": "<div id=\"comment:12\" align=\"right\">Comment 12</div>\n\nok, so this must come from a confusion: in Gap, Z(5) is not the one of the finite field, but a generator of the group of invertible elements. This means that your matrices are not the correct ones, I think.\n\nI propose to close this as invalid.",
    "created_at": "2017-06-02T13:39:14Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12073#issuecomment-130826",
    "user": "https://github.com/fchapoton"
}
```

<div id="comment:12" align="right">Comment 12</div>

ok, so this must come from a confusion: in Gap, Z(5) is not the one of the finite field, but a generator of the group of invertible elements. This means that your matrices are not the correct ones, I think.

I propose to close this as invalid.



---

archive/issue_events_149539.json:
```json
{
    "actor": "https://github.com/fchapoton",
    "created_at": "2017-06-02T13:39:14Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "milestone_number": null,
    "milestone_title": "sage-6.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12073#event-149539"
}
```



---

archive/issue_events_149540.json:
```json
{
    "actor": "https://github.com/fchapoton",
    "created_at": "2017-06-02T13:39:14Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "label": "https://github.com/sagemath/sage/labels/p3%20%E2%80%93%20major",
    "label_color": "ffbb00",
    "label_name": "p3 \u2013 major",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12073#event-149540"
}
```



---

archive/issue_events_149541.json:
```json
{
    "actor": "https://github.com/fchapoton",
    "created_at": "2017-06-02T13:39:14Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "label": "https://github.com/sagemath/sage/labels/invalid",
    "label_color": "a6a6a6",
    "label_name": "invalid",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12073#event-149541"
}
```



---

archive/issue_comments_130827.json:
```json
{
    "body": "Changed stopgaps from **todo** to none",
    "created_at": "2017-06-02T13:39:14Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12073#issuecomment-130827",
    "user": "https://github.com/fchapoton"
}
```

Changed stopgaps from **todo** to none



---

archive/issue_comments_130828.json:
```json
{
    "body": "<div id=\"comment:13\" align=\"right\">Comment 13</div>\n\nConfirmed:\n\n```\ngap> One(GF(5));\nZ(5)^0\n```\nand replacing by the above yields:\n\n```\ngap> Order(Group( m1, m2 ));\n8491392\n```\n\n\nFrom the [GAP manual](https://www.gap-system.org/Manuals/doc/ref/chap59.html):\n\n> The root returned by `Z` is a generator of the multiplicative group of the finite field with p<sup>d</sup> elements, which is cyclic.",
    "created_at": "2017-06-05T08:49:00Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12073#issuecomment-130828",
    "user": "https://github.com/tscrim"
}
```

<div id="comment:13" align="right">Comment 13</div>

Confirmed:

```
gap> One(GF(5));
Z(5)^0
```
and replacing by the above yields:

```
gap> Order(Group( m1, m2 ));
8491392
```


From the [GAP manual](https://www.gap-system.org/Manuals/doc/ref/chap59.html):

> The root returned by `Z` is a generator of the multiplicative group of the finite field with p<sup>d</sup> elements, which is cyclic.



---

archive/issue_comments_130829.json:
```json
{
    "body": "Reviewer: **Travis Scrimshaw**",
    "created_at": "2017-06-05T08:49:00Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12073#issuecomment-130829",
    "user": "https://github.com/tscrim"
}
```

Reviewer: **Travis Scrimshaw**



---

archive/issue_events_149542.json:
```json
{
    "actor": "https://github.com/tscrim",
    "created_at": "2017-06-05T08:49:00Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "7fff00",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12073#event-149542"
}
```



---

archive/issue_events_149543.json:
```json
{
    "actor": "https://github.com/tscrim",
    "created_at": "2017-06-05T08:49:00Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "label": "https://github.com/sagemath/sage/labels/positive%20review",
    "label_color": "dfffc0",
    "label_name": "positive review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12073#event-149543"
}
```



---

archive/issue_events_149544.json:
```json
{
    "actor": "https://github.com/embray",
    "created_at": "2017-07-13T07:54:31Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "label": "https://github.com/sagemath/sage/labels/positive%20review",
    "label_color": "dfffc0",
    "label_name": "positive review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12073#event-149544"
}
```



---

archive/issue_events_149545.json:
```json
{
    "actor": "https://github.com/embray",
    "created_at": "2017-07-13T07:54:31Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12073#event-149545"
}
```



---

archive/issue_events_149546.json:
```json
{
    "actor": "https://github.com/embray",
    "created_at": "2017-07-13T07:54:31Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "label": "https://github.com/sagemath/sage/labels/wontfix",
    "label_color": "a6a6a6",
    "label_name": "wontfix",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12073#event-149546"
}
```



---

archive/issue_comments_130830.json:
```json
{
    "body": "<div id=\"comment:14\" align=\"right\">Comment 14</div>\n\nClosing tickets in the sage-duplicate/invalid/wontfix module with positive_review (i.e. someone has confirmed they should be closed).",
    "created_at": "2017-07-13T07:54:31Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12073#issuecomment-130830",
    "user": "https://github.com/embray"
}
```

<div id="comment:14" align="right">Comment 14</div>

Closing tickets in the sage-duplicate/invalid/wontfix module with positive_review (i.e. someone has confirmed they should be closed).
