# Issue 12073: MatrixGroup() or order() incorrect for G_2(F_3)

archive/issues_011901.json:
```json
{
    "body": "If I use the generators for the exceptional group G_2(F_3) in its natural 7-dimensional representation over F_3 in the MatrixGroup constructor, the order of the group returned is 8491392 (twice what it should be). However, if I use the same generators through the gap console within sage, I get the correct size.\n\n```\nK=GF(3)\nsage: gens=[matrix(K,7,[\n....: [0,2,0,0,0,0,0],\n....: [2,0,0,0,0,0,0],\n....: [0,0,0,2,0,0,0],\n....: [0,0,2,0,0,0,0],\n....: [0,0,0,0,0,2,0],\n....: [0,0,0,0,2,0,0],\n....: [2,2,2,2,1,1,1]]),\n....: matrix(K,7,[\n....: [2,0,0,0,0,0,0],\n....: [0,0,2,0,0,0,0],\n....: [1,1,1,0,0,0,0],\n....: [0,0,0,0,2,0,0],\n....: [1,0,0,1,1,0,0],\n....: [0,0,0,0,0,0,2],\n....: [1,0,0,0,0,1,1]])]\nsage: M = MatrixGroup(gens); M.order()\n8491392\nsage: M.gap().Size()\n8491392\nsage: M.gap().Order()\n8491392\nsage: gap.Group([gap(gens[0]),gap(gens[1])]).Order()\n8491392\n```\n\n\n```\ngap> m1:= [\n> [0,2,0,0,0,0,0],\n> [2,0,0,0,0,0,0],\n> [0,0,0,2,0,0,0],\n> [0,0,2,0,0,0,0],\n> [0,0,0,0,0,2,0],\n> [0,0,0,0,2,0,0],\n> [2,2,2,2,1,1,1]\n> ]*Z(3);\ngap> m2:= [\n> [2,0,0,0,0,0,0],\n> [0,0,2,0,0,0,0],\n> [1,1,1,0,0,0,0],\n> [0,0,0,0,2,0,0],\n> [1,0,0,1,1,0,0],\n> [0,0,0,0,0,0,2],\n> [1,0,0,0,0,1,1]\n> ]*Z(3);\ngap> Order(Group( m1, m2 ));\n4245696\n```\n\n\n**Assignee:** joyner\n\n**Keywords:** MatrixGroup, GAP, order\n\n**Reviewer:** Travis Scrimshaw\n\nIssue created by migration from https://trac.sagemath.org/ticket/12073\n\n",
    "closed_at": "2017-07-13T07:54:31Z",
    "created_at": "2011-11-23T07:18:45Z",
    "labels": [
        "component: group theory",
        "bug",
        "wontfix"
    ],
    "title": "MatrixGroup() or order() incorrect for G_2(F_3)",
    "type": "issue",
    "url": "https://github.com/sagemath/sage/issues/12073",
    "user": "https://github.com/rharron"
}
```
If I use the generators for the exceptional group G_2(F_3) in its natural 7-dimensional representation over F_3 in the MatrixGroup constructor, the order of the group returned is 8491392 (twice what it should be). However, if I use the same generators through the gap console within sage, I get the correct size.

```
K=GF(3)
sage: gens=[matrix(K,7,[
....: [0,2,0,0,0,0,0],
....: [2,0,0,0,0,0,0],
....: [0,0,0,2,0,0,0],
....: [0,0,2,0,0,0,0],
....: [0,0,0,0,0,2,0],
....: [0,0,0,0,2,0,0],
....: [2,2,2,2,1,1,1]]),
....: matrix(K,7,[
....: [2,0,0,0,0,0,0],
....: [0,0,2,0,0,0,0],
....: [1,1,1,0,0,0,0],
....: [0,0,0,0,2,0,0],
....: [1,0,0,1,1,0,0],
....: [0,0,0,0,0,0,2],
....: [1,0,0,0,0,1,1]])]
sage: M = MatrixGroup(gens); M.order()
8491392
sage: M.gap().Size()
8491392
sage: M.gap().Order()
8491392
sage: gap.Group([gap(gens[0]),gap(gens[1])]).Order()
8491392
```


```
gap> m1:= [
> [0,2,0,0,0,0,0],
> [2,0,0,0,0,0,0],
> [0,0,0,2,0,0,0],
> [0,0,2,0,0,0,0],
> [0,0,0,0,0,2,0],
> [0,0,0,0,2,0,0],
> [2,2,2,2,1,1,1]
> ]*Z(3);
gap> m2:= [
> [2,0,0,0,0,0,0],
> [0,0,2,0,0,0,0],
> [1,1,1,0,0,0,0],
> [0,0,0,0,2,0,0],
> [1,0,0,1,1,0,0],
> [0,0,0,0,0,0,2],
> [1,0,0,0,0,1,1]
> ]*Z(3);
gap> Order(Group( m1, m2 ));
4245696
```


**Assignee:** joyner

**Keywords:** MatrixGroup, GAP, order

**Reviewer:** Travis Scrimshaw

Issue created by migration from https://trac.sagemath.org/ticket/12073





---

archive/issue_events_097837.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2013-08-13T15:35:53Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "milestone": "sage-5.11",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12073#event-97837"
}
```



---

archive/issue_events_097838.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2013-08-13T15:35:53Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "milestone": "sage-5.12",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12073#event-97838"
}
```



---

archive/issue_events_097839.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-01-30T21:20:52Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "milestone": "sage-6.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12073#event-97839"
}
```



---

archive/issue_events_097840.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-01-30T21:20:52Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "milestone": "sage-6.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12073#event-97840"
}
```



---

archive/issue_events_097841.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-05-06T15:20:58Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "milestone": "sage-6.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12073#event-97841"
}
```



---

archive/issue_events_097842.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-05-06T15:20:58Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "milestone": "sage-6.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12073#event-97842"
}
```



---

archive/issue_events_097843.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-08-10T16:51:03Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "milestone": "sage-6.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12073#event-97843"
}
```



---

archive/issue_events_097844.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-08-10T16:51:03Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "milestone": "sage-6.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12073#event-97844"
}
```



---

archive/issue_comments_130771.json:
```json
{
    "body": "**Stopgaps:** todo",
    "created_at": "2015-08-25T16:26:16Z",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12073#issuecomment-130771",
    "user": "https://trac.sagemath.org/admin/accounts/users/jakobkroeker"
}
```

**Stopgaps:** todo



---

archive/issue_comments_130772.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -18,7 +18,9 @@\n ....: [1,0,0,1,1,0,0],\n ....: [0,0,0,0,0,0,2],\n ....: [1,0,0,0,0,1,1]])]\n-sage: MatrixGroup(gens).order()\n+sage: M = MatrixGroup(gens); M.order()\n+8491392\n+sage: M.gap().Size()\n 8491392\n ```\n \n``````\n",
    "created_at": "2017-06-02T12:30:38Z",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12073#issuecomment-130772",
    "user": "https://github.com/fchapoton"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -18,7 +18,9 @@
 ....: [1,0,0,1,1,0,0],
 ....: [0,0,0,0,0,0,2],
 ....: [1,0,0,0,0,1,1]])]
-sage: MatrixGroup(gens).order()
+sage: M = MatrixGroup(gens); M.order()
+8491392
+sage: M.gap().Size()
 8491392
 ```
 
``````




---

archive/issue_comments_130773.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -21,6 +21,8 @@\n sage: M = MatrixGroup(gens); M.order()\n 8491392\n sage: M.gap().Size()\n+8491392\n+sage: M.gap().Order()\n 8491392\n ```\n \n``````\n",
    "created_at": "2017-06-02T12:31:16Z",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12073#issuecomment-130773",
    "user": "https://github.com/fchapoton"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -21,6 +21,8 @@
 sage: M = MatrixGroup(gens); M.order()
 8491392
 sage: M.gap().Size()
+8491392
+sage: M.gap().Order()
 8491392
 ```
 
``````




---

archive/issue_comments_130774.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -23,6 +23,8 @@\n sage: M.gap().Size()\n 8491392\n sage: M.gap().Order()\n+8491392\n+sage: gap.Group([gap(gens[0]),gap(gens[1])]).Order()\n 8491392\n ```\n \n``````\n",
    "created_at": "2017-06-02T12:33:11Z",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12073#issuecomment-130774",
    "user": "https://github.com/fchapoton"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -23,6 +23,8 @@
 sage: M.gap().Size()
 8491392
 sage: M.gap().Order()
+8491392
+sage: gap.Group([gap(gens[0]),gap(gens[1])]).Order()
 8491392
 ```
 
``````




---

archive/issue_comments_130775.json:
```json
{
    "body": "<a id='comment:9'></a>\nCompare\n\n```\nsage: L = [gap(GF(3)(i)) for i in range(3)]; L\n[0*Z(3), Z(3)^0, Z(3)]\n```\nand\n\n```\ngap> [0, 1, 2]*Z(3);\n[ 0*Z(3), Z(3), Z(3)^0 ]\n```",
    "created_at": "2017-06-02T12:39:55Z",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12073#issuecomment-130775",
    "user": "https://github.com/fchapoton"
}
```

<a id='comment:9'></a>
Compare

```
sage: L = [gap(GF(3)(i)) for i in range(3)]; L
[0*Z(3), Z(3)^0, Z(3)]
```
and

```
gap> [0, 1, 2]*Z(3);
[ 0*Z(3), Z(3), Z(3)^0 ]
```



---

archive/issue_comments_130776.json:
```json
{
    "body": "<a id='comment:10'></a>\nsame problems for other finite fields of prime order\n\n```\nsage: p=5; L = [gap(GF(p)(i)) for i in range(p)]; L\n[0*Z(5), Z(5)^0, Z(5), Z(5)^3, Z(5)^2]\n```\nversus\n\n```\ngap> p:=5; [0..p-1]*Z(p);\n5\n[ 0*Z(5), Z(5), Z(5)^2, Z(5)^0, Z(5)^3 ]\n```\n**EDIT**\nNote also that \n\n```\ngap> One(ZmodnZ(5));\nZ(5)^0\ngap> One(Z(5));\nZ(5)^0\ngap> One(GF(5));\nZ(5)^0\n```\nSo our conversion seems to be consistent with gap..",
    "created_at": "2017-06-02T12:43:38Z",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12073#issuecomment-130776",
    "user": "https://github.com/fchapoton"
}
```

<a id='comment:10'></a>
same problems for other finite fields of prime order

```
sage: p=5; L = [gap(GF(p)(i)) for i in range(p)]; L
[0*Z(5), Z(5)^0, Z(5), Z(5)^3, Z(5)^2]
```
versus

```
gap> p:=5; [0..p-1]*Z(p);
5
[ 0*Z(5), Z(5), Z(5)^2, Z(5)^0, Z(5)^3 ]
```
**EDIT**
Note also that 

```
gap> One(ZmodnZ(5));
Z(5)^0
gap> One(Z(5));
Z(5)^0
gap> One(GF(5));
Z(5)^0
```
So our conversion seems to be consistent with gap..



---

archive/issue_comments_130777.json:
```json
{
    "body": "<a id='comment:11'></a>\nThis boils down to\n\n```\ngap> 1*Z(5);\nZ(5)\ngap> One(Z(5));\nZ(5)^0\n```\nwhich is indeed not very-good looking.",
    "created_at": "2017-06-02T13:07:11Z",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12073#issuecomment-130777",
    "user": "https://github.com/fchapoton"
}
```

<a id='comment:11'></a>
This boils down to

```
gap> 1*Z(5);
Z(5)
gap> One(Z(5));
Z(5)^0
```
which is indeed not very-good looking.



---

archive/issue_events_097845.json:
```json
{
    "actor": "https://github.com/fchapoton",
    "created_at": "2017-06-02T13:39:14Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "label": "needs review",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12073#event-97845"
}
```



---

archive/issue_comments_130778.json:
```json
{
    "body": "<a id='comment:12'></a>\nok, so this must come from a confusion: in Gap, Z(5) is not the one of the finite field, but a generator of the group of invertible elements. This means that your matrices are not the correct ones, I think.\n\nI propose to close this as invalid.",
    "created_at": "2017-06-02T13:39:14Z",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12073#issuecomment-130778",
    "user": "https://github.com/fchapoton"
}
```

<a id='comment:12'></a>
ok, so this must come from a confusion: in Gap, Z(5) is not the one of the finite field, but a generator of the group of invertible elements. This means that your matrices are not the correct ones, I think.

I propose to close this as invalid.



---

archive/issue_events_097846.json:
```json
{
    "actor": "https://github.com/fchapoton",
    "created_at": "2017-06-02T13:39:14Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "milestone": "sage-6.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12073#event-97846"
}
```



---

archive/issue_comments_130779.json:
```json
{
    "body": "**Changing stopgaps** from \"todo\" to \"\".",
    "created_at": "2017-06-02T13:39:14Z",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12073#issuecomment-130779",
    "user": "https://github.com/fchapoton"
}
```

**Changing stopgaps** from "todo" to "".



---

archive/issue_comments_130780.json:
```json
{
    "body": "<a id='comment:13'></a>\nConfirmed:\n\n```\ngap> One(GF(5));\nZ(5)^0\n```\nand replacing by the above yields:\n\n```\ngap> Order(Group( m1, m2 ));\n8491392\n```\n\n\nFrom the [GAP manual](https://www.gap-system.org/Manuals/doc/ref/chap59.html):\n\n> The root returned by `Z` is a generator of the multiplicative group of the finite field with p<sup>d</sup> elements, which is cyclic.\n",
    "created_at": "2017-06-05T08:49:00Z",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12073#issuecomment-130780",
    "user": "https://github.com/tscrim"
}
```

<a id='comment:13'></a>
Confirmed:

```
gap> One(GF(5));
Z(5)^0
```
and replacing by the above yields:

```
gap> Order(Group( m1, m2 ));
8491392
```


From the [GAP manual](https://www.gap-system.org/Manuals/doc/ref/chap59.html):

> The root returned by `Z` is a generator of the multiplicative group of the finite field with p<sup>d</sup> elements, which is cyclic.




---

archive/issue_comments_130781.json:
```json
{
    "body": "**Reviewer:** Travis Scrimshaw",
    "created_at": "2017-06-05T08:49:00Z",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12073#issuecomment-130781",
    "user": "https://github.com/tscrim"
}
```

**Reviewer:** Travis Scrimshaw



---

archive/issue_events_097847.json:
```json
{
    "actor": "https://github.com/tscrim",
    "created_at": "2017-06-05T08:49:00Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "label": "needs review",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12073#event-97847"
}
```



---

archive/issue_events_097848.json:
```json
{
    "actor": "https://github.com/tscrim",
    "created_at": "2017-06-05T08:49:00Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "label": "positive review",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12073#event-97848"
}
```



---

archive/issue_events_097849.json:
```json
{
    "actor": "https://github.com/embray",
    "created_at": "2017-07-13T07:54:31Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "label": "positive review",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12073#event-97849"
}
```



---

archive/issue_events_097850.json:
```json
{
    "actor": "https://github.com/embray",
    "created_at": "2017-07-13T07:54:31Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12073#event-97850"
}
```



---

archive/issue_events_097851.json:
```json
{
    "actor": "https://github.com/embray",
    "created_at": "2017-07-13T07:54:31Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "label": "wontfix",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12073#event-97851"
}
```



---

archive/issue_comments_130782.json:
```json
{
    "body": "<a id='comment:14'></a>\nClosing tickets in the sage-duplicate/invalid/wontfix module with positive_review (i.e. someone has confirmed they should be closed).",
    "created_at": "2017-07-13T07:54:31Z",
    "issue": "https://github.com/sagemath/sage/issues/12073",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12073#issuecomment-130782",
    "user": "https://github.com/embray"
}
```

<a id='comment:14'></a>
Closing tickets in the sage-duplicate/invalid/wontfix module with positive_review (i.e. someone has confirmed they should be closed).
