# Issue 12145: Ugly result for exponential integral

archive/issues_011973.json:
```json
{
    "body": "As reported in this sage-support thread:\n\nhttp://groups.google.com/group/sage-support/browse_thread/thread/793c2bdb3db1f02c\n\nWe expect,\n\n```\nsage: integral( x / (exp(x) - 1) , (x,0,oo))\npi^2/6\n```\n\nbut get,\n\n```\nsage: integral( x / (exp(x) - 1) , (x,0,oo))\n-1/6*pi^2 + limit(-1/2*x^2 + x*log(-e^x + 1) + polylog(2, e^x), x, +Infinity)\n```\n\nThe above might not be incorrect, but it is not very useful either.\n\n**Assignee:** @burcin\n\n**CC:**  @kcrisman\n\n**Status:** new\n\nIssue created by migration from https://trac.sagemath.org/ticket/12145\n\n",
    "created_at": "2011-12-12T00:01:43Z",
    "labels": [
        "component: calculus",
        "minor",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-6.4",
    "title": "Ugly result for exponential integral",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/12145",
    "user": "https://github.com/orlitzky"
}
```
As reported in this sage-support thread:

http://groups.google.com/group/sage-support/browse_thread/thread/793c2bdb3db1f02c

We expect,

```
sage: integral( x / (exp(x) - 1) , (x,0,oo))
pi^2/6
```

but get,

```
sage: integral( x / (exp(x) - 1) , (x,0,oo))
-1/6*pi^2 + limit(-1/2*x^2 + x*log(-e^x + 1) + polylog(2, e^x), x, +Infinity)
```

The above might not be incorrect, but it is not very useful either.

**Assignee:** @burcin

**CC:**  @kcrisman

**Status:** new

Issue created by migration from https://trac.sagemath.org/ticket/12145





---

archive/issue_comments_174897.json:
```json
{
    "body": "<a id='comment:2'></a>\nSame result from Maxima 5.27:\n\n```\n(%i1) display2d: false;\n\n(%o1) false\n(%i2) f: x/(%e^x - 1);\n\n(%o2) x/(%e^x-1)\n(%i3) integrate(f, x, 0, inf);\n\n(%o3) 'limit(li[2](%e^x)+x*log(1-%e^x)-x^2/2,x,inf,minus)-%pi^2/6\n```",
    "created_at": "2012-04-15T15:28:11Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12145",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12145#issuecomment-174897",
    "user": "https://github.com/orlitzky"
}
```

<a id='comment:2'></a>
Same result from Maxima 5.27:

```
(%i1) display2d: false;

(%o1) false
(%i2) f: x/(%e^x - 1);

(%o2) x/(%e^x-1)
(%i3) integrate(f, x, 0, inf);

(%o3) 'limit(li[2](%e^x)+x*log(1-%e^x)-x^2/2,x,inf,minus)-%pi^2/6
```



---

archive/issue_events_038023.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2013-08-13T15:35:53Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/12145",
    "milestone": "sage-5.12",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/12145#event-38023"
}
```



---

archive/issue_events_038024.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-01-30T21:20:52Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/12145",
    "milestone": "sage-5.12",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/12145#event-38024"
}
```



---

archive/issue_events_038025.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-01-30T21:20:52Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/12145",
    "milestone": "sage-6.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/12145#event-38025"
}
```



---

archive/issue_events_038026.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-05-06T15:20:58Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/12145",
    "milestone": "sage-6.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/12145#event-38026"
}
```



---

archive/issue_events_038027.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-05-06T15:20:58Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/12145",
    "milestone": "sage-6.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/12145#event-38027"
}
```



---

archive/issue_events_038028.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-08-10T16:51:03Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/12145",
    "milestone": "sage-6.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/12145#event-38028"
}
```



---

archive/issue_events_038029.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-08-10T16:51:03Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/12145",
    "milestone": "sage-6.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/12145#event-38029"
}
```



---

archive/issue_comments_174898.json:
```json
{
    "body": "<a id='comment:7'></a>\nmore tests:\n\n```\nsage: giac('integrate(x / (exp(x) - 1), x, 0, inf)')\npi^2/6\nsage: integrate(x / (exp(x) - 1), x, 0, oo, algorithm='sympy')\nintegrate(x/(e^x - 1), x, 0, +Infinity)\n```\n\ni think this is another reason to make more user friendly the functionality that is offered through giac; stay tuned at the [giac interface wiki](https://trac.sagemath.org/wiki/symbolics#Giacinterface).",
    "created_at": "2017-04-09T10:03:20Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12145",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12145#issuecomment-174898",
    "user": "https://github.com/mforets"
}
```

<a id='comment:7'></a>
more tests:

```
sage: giac('integrate(x / (exp(x) - 1), x, 0, inf)')
pi^2/6
sage: integrate(x / (exp(x) - 1), x, 0, oo, algorithm='sympy')
integrate(x/(e^x - 1), x, 0, +Infinity)
```

i think this is another reason to make more user friendly the functionality that is offered through giac; stay tuned at the [giac interface wiki](https://trac.sagemath.org/wiki/symbolics#Giacinterface).
