# Issue 12226: rational exponent for finite words

archive/issues_012054.json:
```json
{
    "assignees": [
        "https://github.com/staroste"
    ],
    "body": "<div id=\"comment:0\"></div>\n\nUpgrade exponent of a FiniteWord_class to calculate rational exponents.\n\nNow:\n\n```\nsage: Word('1231').exponent()\n1\n```\n\nExpected:\n\n```\nsage: Word('1231').exponent()\n4/3\n```\n\nThe goal\n\n```\nsage: Word('1231').exponent()\n4/3\nsage: Word('1231').exponent(integer=True)\n1\n```\n\n\nAlso, upgrade (deprecate, review, and/or change name) the method primitive() to be in accordance with the terminology used in literature (the word is usually called the period instead of the primitive)\n\n```\nsage: Word('1231').exponent()\n4/3\nsage: Word('1231').period()\nword: 123\n```\n\nUpgrade influenced methods (primitive_length(), ...).\n\nCC:  @videlec @seblabbe\n\nComponent: **combinatorics**\n\n_Issue created by migration from https://trac.sagemath.org/ticket/12226_\n\n",
    "created_at": "2011-12-23T10:57:52Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/c%3A%20combinatorics",
        "https://github.com/sagemath/sage/labels/p%3A%20minor%20/%204",
        "https://github.com/sagemath/sage/labels/enhancement"
    ],
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "rational exponent for finite words",
    "type": "issue",
    "updated_at": "2022-12-29T01:28:25Z",
    "url": "https://github.com/sagemath/sage/issues/12226",
    "user": "https://github.com/staroste"
}
```
<div id="comment:0"></div>

Upgrade exponent of a FiniteWord_class to calculate rational exponents.

Now:

```
sage: Word('1231').exponent()
1
```

Expected:

```
sage: Word('1231').exponent()
4/3
```

The goal

```
sage: Word('1231').exponent()
4/3
sage: Word('1231').exponent(integer=True)
1
```


Also, upgrade (deprecate, review, and/or change name) the method primitive() to be in accordance with the terminology used in literature (the word is usually called the period instead of the primitive)

```
sage: Word('1231').exponent()
4/3
sage: Word('1231').period()
word: 123
```

Upgrade influenced methods (primitive_length(), ...).

CC:  @videlec @seblabbe

Component: **combinatorics**

_Issue created by migration from https://trac.sagemath.org/ticket/12226_





---

archive/issue_events_164646.json:
```json
{
    "actor": "https://github.com/staroste",
    "created_at": "2011-12-23T10:57:52Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/12226",
    "milestone_number": null,
    "milestone_title": "sage-5.11",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12226#event-164646"
}
```



---

archive/issue_events_164647.json:
```json
{
    "actor": "https://github.com/staroste",
    "created_at": "2011-12-23T10:57:52Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/12226",
    "label": "https://github.com/sagemath/sage/labels/c%3A%20combinatorics",
    "label_color": "0000ff",
    "label_name": "c: combinatorics",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12226#event-164647"
}
```



---

archive/issue_events_164648.json:
```json
{
    "actor": "https://github.com/staroste",
    "created_at": "2011-12-23T10:57:52Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/12226",
    "label": "https://github.com/sagemath/sage/labels/p%3A%20minor%20/%204",
    "label_color": "ffe799",
    "label_name": "p: minor / 4",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12226#event-164648"
}
```



---

archive/issue_events_164649.json:
```json
{
    "actor": "https://github.com/staroste",
    "created_at": "2011-12-23T10:57:52Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/12226",
    "label": "https://github.com/sagemath/sage/labels/enhancement",
    "label_color": "696969",
    "label_name": "enhancement",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12226#event-164649"
}
```



---

archive/issue_events_164650.json:
```json
{
    "actor": "https://github.com/sagetrac-sage-combinat",
    "created_at": "2011-12-23T10:57:52Z",
    "event": "assigned",
    "issue": "https://github.com/sagemath/sage/issues/12226",
    "subject": "https://github.com/staroste",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12226#event-164650"
}
```



---

archive/issue_events_164651.json:
```json
{
    "actor": "https://github.com/staroste",
    "created_at": "2011-12-23T10:58:41Z",
    "event": "renamed",
    "issue": "https://github.com/sagemath/sage/issues/12226",
    "title_is": "rational exponent for finite words",
    "title_was": "rational a finite word",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12226#event-164651"
}
```



---

archive/issue_events_164652.json:
```json
{
    "actor": "https://github.com/sagetrac-sage-combinat",
    "created_at": "2011-12-23T10:58:41Z",
    "event": "unassigned",
    "issue": "https://github.com/sagemath/sage/issues/12226",
    "subject": "https://github.com/staroste",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12226#event-164652"
}
```



---

archive/issue_events_164653.json:
```json
{
    "actor": "https://github.com/staroste",
    "created_at": "2011-12-23T10:58:41Z",
    "event": "assigned",
    "issue": "https://github.com/sagemath/sage/issues/12226",
    "subject": "https://github.com/staroste",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12226#event-164653"
}
```



---

archive/issue_comments_132268.json:
```json
{
    "body": "<div id=\"comment:2\" align=\"right\">comment:2</div>\n\nShould not period be an integer?\n\n... I already had the idea of making `period` an alias of `minimal_period`:\n\n```\nsage: Word('1231').minimal_period()\n3\n```\n\nWhat do you think?",
    "created_at": "2012-01-09T16:41:19Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/12226",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12226#issuecomment-132268",
    "user": "https://github.com/seblabbe"
}
```

<div id="comment:2" align="right">comment:2</div>

Should not period be an integer?

... I already had the idea of making `period` an alias of `minimal_period`:

```
sage: Word('1231').minimal_period()
3
```

What do you think?



---

archive/issue_comments_132269.json:
```json
{
    "body": "<div id=\"comment:3\" align=\"right\">comment:3</div>\n\nReplying to [@seblabbe](#comment%3A2):\n> Should not period be an integer?\n\nYou are right, I found both versions in the literature (integer in Lothaire, word for instance in http://www.springerlink.com/content/t59071u33573168v/ )\n\nWhen hearing period without context, I think an integer is expected. Although a word is definitely more useful in papers and you have the integer by taking just the length of the word.\n\nIs something like that stupid?\n\n```\nsage: Word('1231').period(word=True)\nword: 123\nsage: Word('1231').period()\n3\n```\n\n\n\n> What do you think?\n\nI think an alias is not necessary. There is no other period, and anyone looking for that notion will use \"period\" anyway.",
    "created_at": "2012-01-09T20:58:29Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/12226",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12226#issuecomment-132269",
    "user": "https://github.com/staroste"
}
```

<div id="comment:3" align="right">comment:3</div>

Replying to [@seblabbe](#comment%3A2):
> Should not period be an integer?

You are right, I found both versions in the literature (integer in Lothaire, word for instance in http://www.springerlink.com/content/t59071u33573168v/ )

When hearing period without context, I think an integer is expected. Although a word is definitely more useful in papers and you have the integer by taking just the length of the word.

Is something like that stupid?

```
sage: Word('1231').period(word=True)
word: 123
sage: Word('1231').period()
3
```



> What do you think?

I think an alias is not necessary. There is no other period, and anyone looking for that notion will use "period" anyway.



---

archive/issue_comments_132270.json:
```json
{
    "body": "<div id=\"comment:4\" align=\"right\">comment:4</div>\n\n> I think an alias is not necessary. There is no other period, and anyone looking for that notion will use \"period\" anyway.\n\nIf 3 is a period, than 6, 9, 12 are period as well. But I agree that 3 is *the* period. \n\nI would rather suggest the following :\n\n```\nsage: Word('1231').period_word()\nword: 123\nsage: Word('1231').period()\n3\n```",
    "created_at": "2012-01-10T19:42:02Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/12226",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12226#issuecomment-132270",
    "user": "https://github.com/seblabbe"
}
```

<div id="comment:4" align="right">comment:4</div>

> I think an alias is not necessary. There is no other period, and anyone looking for that notion will use "period" anyway.

If 3 is a period, than 6, 9, 12 are period as well. But I agree that 3 is *the* period. 

I would rather suggest the following :

```
sage: Word('1231').period_word()
word: 123
sage: Word('1231').period()
3
```



---

archive/issue_comments_132271.json:
```json
{
    "body": "> The goal\n> \n> ```\n> sage: Word('1231').exponent()\n> 4/3\n> sage: Word('1231').exponent(integer=True)\n> 1\n> ```\n\nI would prefer the argument to speak about the use or not of the fraction :\n\n```\nsage: Word('1231').exponent() # default\n1\nsage: Word('1231').exponent(allow_fraction=True)\n4/3\n```\n\nor \n\n```\nsage: Word('1231').exponent(allow_fraction=False)\n1\nsage: Word('1231').exponent() # default\n4/3\n```",
    "created_at": "2012-01-10T19:46:35Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/12226",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12226#issuecomment-132271",
    "user": "https://github.com/seblabbe"
}
```

> The goal
> 
> ```
> sage: Word('1231').exponent()
> 4/3
> sage: Word('1231').exponent(integer=True)
> 1
> ```

I would prefer the argument to speak about the use or not of the fraction :

```
sage: Word('1231').exponent() # default
1
sage: Word('1231').exponent(allow_fraction=True)
4/3
```

or 

```
sage: Word('1231').exponent(allow_fraction=False)
1
sage: Word('1231').exponent() # default
4/3
```



---

archive/issue_events_164654.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2013-08-13T15:35:53Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/12226",
    "milestone_number": null,
    "milestone_title": "sage-5.11",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12226#event-164654"
}
```



---

archive/issue_events_164655.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2013-08-13T15:35:53Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/12226",
    "milestone_number": null,
    "milestone_title": "sage-5.12",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12226#event-164655"
}
```



---

archive/issue_events_164656.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-01-30T21:20:52Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/12226",
    "milestone_number": null,
    "milestone_title": "sage-6.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12226#event-164656"
}
```



---

archive/issue_events_164657.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-01-30T21:20:52Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/12226",
    "milestone_number": null,
    "milestone_title": "sage-6.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12226#event-164657"
}
```



---

archive/issue_events_164658.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-05-06T15:20:58Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/12226",
    "milestone_number": null,
    "milestone_title": "sage-6.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12226#event-164658"
}
```



---

archive/issue_events_164659.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-05-06T15:20:58Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/12226",
    "milestone_number": null,
    "milestone_title": "sage-6.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12226#event-164659"
}
```



---

archive/issue_events_164660.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-08-10T16:51:03Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/12226",
    "milestone_number": null,
    "milestone_title": "sage-6.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12226#event-164660"
}
```



---

archive/issue_events_164661.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-08-10T16:51:03Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/12226",
    "milestone_number": null,
    "milestone_title": "sage-6.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12226#event-164661"
}
```



---

archive/issue_events_164662.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-12-29T01:28:25Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/12226",
    "milestone_number": null,
    "milestone_title": "sage-6.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12226#event-164662"
}
```
