# Issue 12226: rational exponent for finite words

archive/issues_012054.json:
```json
{
    "assignees": [],
    "body": "Upgrade exponent of a FiniteWord_class to calculate rational exponents.\n\nNow:\n\n```\nsage: Word('1231').exponent()\n1\n```\n\nExpected:\n\n```\nsage: Word('1231').exponent()\n4/3\n```\n\nThe goal\n\n```\nsage: Word('1231').exponent()\n4/3\nsage: Word('1231').exponent(integer=True)\n1\n```\n\n\nAlso, upgrade (deprecate, review, and/or change name) the method primitive() to be in accordance with the terminology used in literature (the word is usually called the period instead of the primitive)\n\n```\nsage: Word('1231').exponent()\n4/3\nsage: Word('1231').period()\nword: 123\n```\n\nUpgrade influenced methods (primitive_length(), ...).\n\n**Assignee:** @staroste\n\n**CC:**  @videlec @seblabbe\n\nIssue created by migration from https://trac.sagemath.org/ticket/12226\n\n",
    "created_at": "2011-12-23T10:57:52Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20combinatorics",
        "https://github.com/sagemath/sage/labels/minor",
        "https://github.com/sagemath/sage/labels/enhancement"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-6.4",
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "rational exponent for finite words",
    "type": "issue",
    "updated_at": "2014-08-10T16:51:03Z",
    "url": "https://github.com/sagemath/sage/issues/12226",
    "user": "https://github.com/staroste"
}
```
Upgrade exponent of a FiniteWord_class to calculate rational exponents.

Now:

```
sage: Word('1231').exponent()
1
```

Expected:

```
sage: Word('1231').exponent()
4/3
```

The goal

```
sage: Word('1231').exponent()
4/3
sage: Word('1231').exponent(integer=True)
1
```


Also, upgrade (deprecate, review, and/or change name) the method primitive() to be in accordance with the terminology used in literature (the word is usually called the period instead of the primitive)

```
sage: Word('1231').exponent()
4/3
sage: Word('1231').period()
word: 123
```

Upgrade influenced methods (primitive_length(), ...).

**Assignee:** @staroste

**CC:**  @videlec @seblabbe

Issue created by migration from https://trac.sagemath.org/ticket/12226





---

archive/issue_events_140415.json:
```json
{
    "actor": "https://github.com/staroste",
    "created_at": "2011-12-23T10:57:52Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/12226",
    "milestone_number": null,
    "milestone_title": "sage-6.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12226#event-140415"
}
```



---

archive/issue_events_140416.json:
```json
{
    "actor": "https://github.com/staroste",
    "created_at": "2011-12-23T10:57:52Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/12226",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20combinatorics",
    "label_color": "08517b",
    "label_name": "component: combinatorics",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12226#event-140416"
}
```



---

archive/issue_events_140417.json:
```json
{
    "actor": "https://github.com/staroste",
    "created_at": "2011-12-23T10:57:52Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/12226",
    "label": "https://github.com/sagemath/sage/labels/minor",
    "label_color": "ff0000",
    "label_name": "minor",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12226#event-140417"
}
```



---

archive/issue_events_140418.json:
```json
{
    "actor": "https://github.com/staroste",
    "created_at": "2011-12-23T10:57:52Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/12226",
    "label": "https://github.com/sagemath/sage/labels/enhancement",
    "label_color": "008080",
    "label_name": "enhancement",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12226#event-140418"
}
```



---

archive/issue_events_140419.json:
```json
{
    "actor": "https://github.com/staroste",
    "created_at": "2011-12-23T10:58:41Z",
    "event": "renamed",
    "issue": "https://github.com/sagemath/sage/issues/12226",
    "rename": {
        "from": "rational a finite word",
        "to": "rational exponent for finite words"
    },
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12226#event-140419"
}
```



---

archive/issue_comments_134511.json:
```json
{
    "body": "**Changing assignee** from sage-combinat to @staroste.",
    "created_at": "2011-12-23T10:58:41Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/12226",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12226#issuecomment-134511",
    "user": "https://github.com/staroste"
}
```

**Changing assignee** from sage-combinat to @staroste.



---

archive/issue_comments_134512.json:
```json
{
    "body": "<a id='comment:2'></a>\nShould not period be an integer?\n\n... I already had the idea of making `period` an alias of `minimal_period`:\n\n```\nsage: Word('1231').minimal_period()\n3\n```\n\nWhat do you think?",
    "created_at": "2012-01-09T16:41:19Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/12226",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12226#issuecomment-134512",
    "user": "https://github.com/seblabbe"
}
```

<a id='comment:2'></a>
Should not period be an integer?

... I already had the idea of making `period` an alias of `minimal_period`:

```
sage: Word('1231').minimal_period()
3
```

What do you think?



---

archive/issue_comments_134513.json:
```json
{
    "body": "<a id='comment:3'></a>\nReplying to [@seblabbe](#comment%3A2):\n> Should not period be an integer?\n\nYou are right, I found both versions in the literature (integer in Lothaire, word for instance in http://www.springerlink.com/content/t59071u33573168v/ )\n\nWhen hearing period without context, I think an integer is expected. Although a word is definitely more useful in papers and you have the integer by taking just the length of the word.\n\nIs something like that stupid?\n\n```\nsage: Word('1231').period(word=True)\nword: 123\nsage: Word('1231').period()\n3\n```\n\n\n\n> What do you think?\n\nI think an alias is not necessary. There is no other period, and anyone looking for that notion will use \"period\" anyway.",
    "created_at": "2012-01-09T20:58:29Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/12226",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12226#issuecomment-134513",
    "user": "https://github.com/staroste"
}
```

<a id='comment:3'></a>
Replying to [@seblabbe](#comment%3A2):
> Should not period be an integer?

You are right, I found both versions in the literature (integer in Lothaire, word for instance in http://www.springerlink.com/content/t59071u33573168v/ )

When hearing period without context, I think an integer is expected. Although a word is definitely more useful in papers and you have the integer by taking just the length of the word.

Is something like that stupid?

```
sage: Word('1231').period(word=True)
word: 123
sage: Word('1231').period()
3
```



> What do you think?

I think an alias is not necessary. There is no other period, and anyone looking for that notion will use "period" anyway.



---

archive/issue_comments_134514.json:
```json
{
    "body": "<a id='comment:4'></a>\n> I think an alias is not necessary. There is no other period, and anyone looking for that notion will use \"period\" anyway.\n\nIf 3 is a period, than 6, 9, 12 are period as well. But I agree that 3 is *the* period. \n\nI would rather suggest the following :\n\n```\nsage: Word('1231').period_word()\nword: 123\nsage: Word('1231').period()\n3\n```",
    "created_at": "2012-01-10T19:42:02Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/12226",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12226#issuecomment-134514",
    "user": "https://github.com/seblabbe"
}
```

<a id='comment:4'></a>
> I think an alias is not necessary. There is no other period, and anyone looking for that notion will use "period" anyway.

If 3 is a period, than 6, 9, 12 are period as well. But I agree that 3 is *the* period. 

I would rather suggest the following :

```
sage: Word('1231').period_word()
word: 123
sage: Word('1231').period()
3
```



---

archive/issue_comments_134515.json:
```json
{
    "body": "> The goal\n> \n> ```\n> sage: Word('1231').exponent()\n> 4/3\n> sage: Word('1231').exponent(integer=True)\n> 1\n> ```\n\nI would prefer the argument to speak about the use or not of the fraction :\n\n```\nsage: Word('1231').exponent() # default\n1\nsage: Word('1231').exponent(allow_fraction=True)\n4/3\n```\n\nor \n\n```\nsage: Word('1231').exponent(allow_fraction=False)\n1\nsage: Word('1231').exponent() # default\n4/3\n```",
    "created_at": "2012-01-10T19:46:35Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/12226",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12226#issuecomment-134515",
    "user": "https://github.com/seblabbe"
}
```

> The goal
> 
> ```
> sage: Word('1231').exponent()
> 4/3
> sage: Word('1231').exponent(integer=True)
> 1
> ```

I would prefer the argument to speak about the use or not of the fraction :

```
sage: Word('1231').exponent() # default
1
sage: Word('1231').exponent(allow_fraction=True)
4/3
```

or 

```
sage: Word('1231').exponent(allow_fraction=False)
1
sage: Word('1231').exponent() # default
4/3
```



---

archive/issue_events_140420.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2013-08-13T15:35:53Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/12226",
    "milestone_number": null,
    "milestone_title": "sage-5.11",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12226#event-140420"
}
```



---

archive/issue_events_140421.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2013-08-13T15:35:53Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/12226",
    "milestone_number": null,
    "milestone_title": "sage-5.12",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12226#event-140421"
}
```



---

archive/issue_events_140422.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-01-30T21:20:52Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/12226",
    "milestone_number": null,
    "milestone_title": "sage-6.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12226#event-140422"
}
```



---

archive/issue_events_140423.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-01-30T21:20:52Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/12226",
    "milestone_number": null,
    "milestone_title": "sage-6.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12226#event-140423"
}
```



---

archive/issue_events_140424.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-05-06T15:20:58Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/12226",
    "milestone_number": null,
    "milestone_title": "sage-6.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12226#event-140424"
}
```



---

archive/issue_events_140425.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-05-06T15:20:58Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/12226",
    "milestone_number": null,
    "milestone_title": "sage-6.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12226#event-140425"
}
```



---

archive/issue_events_140426.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-08-10T16:51:03Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/12226",
    "milestone_number": null,
    "milestone_title": "sage-6.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12226#event-140426"
}
```



---

archive/issue_events_140427.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-08-10T16:51:03Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/12226",
    "milestone_number": null,
    "milestone_title": "sage-6.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12226#event-140427"
}
```
