# Issue 12226: rational exponent for finite words

archive/issues_012054.json:
```json
{
    "body": "Upgrade exponent of a FiniteWord_class to calculate rational exponents.\n\nNow:\n\n```\nsage: Word('1231').exponent()\n1\n```\n\nExpected:\n\n```\nsage: Word('1231').exponent()\n4/3\n```\n\nThe goal\n\n```\nsage: Word('1231').exponent()\n4/3\nsage: Word('1231').exponent(integer=True)\n1\n```\n\n\nAlso, upgrade (deprecate, review, and/or change name) the method primitive() to be in accordance with the terminology used in literature (the word is usually called the period instead of the primitive)\n\n```\nsage: Word('1231').exponent()\n4/3\nsage: Word('1231').period()\nword: 123\n```\n\nUpgrade influenced methods (primitive_length(), ...).\n\n**Assignee:** @staroste\n\n**CC:**  @videlec @seblabbe\n\n**Status:** new\n\nIssue created by migration from https://trac.sagemath.org/ticket/12226\n\n",
    "created_at": "2011-12-23T10:57:52Z",
    "labels": [
        "component: combinatorics",
        "minor",
        "enhancement"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-6.4",
    "title": "rational exponent for finite words",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/12226",
    "user": "https://github.com/staroste"
}
```
Upgrade exponent of a FiniteWord_class to calculate rational exponents.

Now:

```
sage: Word('1231').exponent()
1
```

Expected:

```
sage: Word('1231').exponent()
4/3
```

The goal

```
sage: Word('1231').exponent()
4/3
sage: Word('1231').exponent(integer=True)
1
```


Also, upgrade (deprecate, review, and/or change name) the method primitive() to be in accordance with the terminology used in literature (the word is usually called the period instead of the primitive)

```
sage: Word('1231').exponent()
4/3
sage: Word('1231').period()
word: 123
```

Upgrade influenced methods (primitive_length(), ...).

**Assignee:** @staroste

**CC:**  @videlec @seblabbe

**Status:** new

Issue created by migration from https://trac.sagemath.org/ticket/12226





---

archive/issue_events_038573.json:
```json
{
    "event": "renamed",
    "issue": "https://github.com/sagemath/sagetest/issues/12226",
    "rename": {
        "from": "rational a finite word",
        "to": "rational exponent for finite words"
    },
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/12226#event-38573"
}
```



---

archive/issue_comments_165291.json:
```json
{
    "body": "**Changing assignee** from sage-combinat to @staroste.",
    "created_at": "2011-12-23T10:58:41Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12226",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12226#issuecomment-165291",
    "user": "https://github.com/staroste"
}
```

**Changing assignee** from sage-combinat to @staroste.



---

archive/issue_comments_165292.json:
```json
{
    "body": "<a id='comment:2'></a>\nShould not period be an integer?\n\n... I already had the idea of making `period` an alias of `minimal_period`:\n\n```\nsage: Word('1231').minimal_period()\n3\n```\n\nWhat do you think?",
    "created_at": "2012-01-09T16:41:19Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12226",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12226#issuecomment-165292",
    "user": "https://github.com/seblabbe"
}
```

<a id='comment:2'></a>
Should not period be an integer?

... I already had the idea of making `period` an alias of `minimal_period`:

```
sage: Word('1231').minimal_period()
3
```

What do you think?



---

archive/issue_comments_165293.json:
```json
{
    "body": "<a id='comment:3'></a>\nReplying to [slabbe](#comment%3A2):\n> Should not period be an integer?\n\n\nYou are right, I found both versions in the literature (integer in Lothaire, word for instance in http://www.springerlink.com/content/t59071u33573168v/ )\n\nWhen hearing period without context, I think an integer is expected. Although a word is definitely more useful in papers and you have the integer by taking just the length of the word.\n\nIs something like that stupid?\n\n```\nsage: Word('1231').period(word=True)\nword: 123\nsage: Word('1231').period()\n3\n```\n\n\n\n> What do you think?\n\n\nI think an alias is not necessary. There is no other period, and anyone looking for that notion will use \"period\" anyway.",
    "created_at": "2012-01-09T20:58:29Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12226",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12226#issuecomment-165293",
    "user": "https://github.com/staroste"
}
```

<a id='comment:3'></a>
Replying to [slabbe](#comment%3A2):
> Should not period be an integer?


You are right, I found both versions in the literature (integer in Lothaire, word for instance in http://www.springerlink.com/content/t59071u33573168v/ )

When hearing period without context, I think an integer is expected. Although a word is definitely more useful in papers and you have the integer by taking just the length of the word.

Is something like that stupid?

```
sage: Word('1231').period(word=True)
word: 123
sage: Word('1231').period()
3
```



> What do you think?


I think an alias is not necessary. There is no other period, and anyone looking for that notion will use "period" anyway.



---

archive/issue_comments_165294.json:
```json
{
    "body": "<a id='comment:4'></a>\n> I think an alias is not necessary. There is no other period, and anyone looking for that notion will use \"period\" anyway.\n\n\nIf 3 is a period, than 6, 9, 12 are period as well. But I agree that 3 is *the* period. \n\nI would rather suggest the following :\n\n```\nsage: Word('1231').period_word()\nword: 123\nsage: Word('1231').period()\n3\n```",
    "created_at": "2012-01-10T19:42:02Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12226",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12226#issuecomment-165294",
    "user": "https://github.com/seblabbe"
}
```

<a id='comment:4'></a>
> I think an alias is not necessary. There is no other period, and anyone looking for that notion will use "period" anyway.


If 3 is a period, than 6, 9, 12 are period as well. But I agree that 3 is *the* period. 

I would rather suggest the following :

```
sage: Word('1231').period_word()
word: 123
sage: Word('1231').period()
3
```



---

archive/issue_comments_165295.json:
```json
{
    "body": "> The goal\n> \n> ```\n> sage: Word('1231').exponent()\n> 4/3\n> sage: Word('1231').exponent(integer=True)\n> 1\n> ```\n\n\nI would prefer the argument to speak about the use or not of the fraction :\n\n```\nsage: Word('1231').exponent() # default\n1\nsage: Word('1231').exponent(allow_fraction=True)\n4/3\n```\n\nor \n\n```\nsage: Word('1231').exponent(allow_fraction=False)\n1\nsage: Word('1231').exponent() # default\n4/3\n```",
    "created_at": "2012-01-10T19:46:35Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12226",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12226#issuecomment-165295",
    "user": "https://github.com/seblabbe"
}
```

> The goal
> 
> ```
> sage: Word('1231').exponent()
> 4/3
> sage: Word('1231').exponent(integer=True)
> 1
> ```


I would prefer the argument to speak about the use or not of the fraction :

```
sage: Word('1231').exponent() # default
1
sage: Word('1231').exponent(allow_fraction=True)
4/3
```

or 

```
sage: Word('1231').exponent(allow_fraction=False)
1
sage: Word('1231').exponent() # default
4/3
```



---

archive/issue_events_038574.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2013-08-13T15:35:53Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/12226",
    "milestone": "sage-5.12",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/12226#event-38574"
}
```



---

archive/issue_events_038575.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-01-30T21:20:52Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/12226",
    "milestone": "sage-5.12",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/12226#event-38575"
}
```



---

archive/issue_events_038576.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-01-30T21:20:52Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/12226",
    "milestone": "sage-6.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/12226#event-38576"
}
```



---

archive/issue_events_038577.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-05-06T15:20:58Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/12226",
    "milestone": "sage-6.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/12226#event-38577"
}
```



---

archive/issue_events_038578.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-05-06T15:20:58Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/12226",
    "milestone": "sage-6.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/12226#event-38578"
}
```



---

archive/issue_events_038579.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-08-10T16:51:03Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/12226",
    "milestone": "sage-6.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/12226#event-38579"
}
```



---

archive/issue_events_038580.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-08-10T16:51:03Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/12226",
    "milestone": "sage-6.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/12226#event-38580"
}
```
