# Issue 12241: exp, log, derivative of multivariate power series

archive/issues_012069.json:
```json
{
    "body": "This ticket implements exp, log, and derivative of multivariate power series:\n\n```\nsage: T.<a,b> = PowerSeriesRing(ZZ,2)\nsage: f = a + b + a^2*b\nsage: f = a + b + a^2*b + T.O(4)\nsage: f.derivative(a)\n1 + 2*a*b + O(a, b)^3\nsage: exp(f)\n1 + a + b + 1/2*a^2 + a*b + 1/2*b^2 + 1/6*a^3 + 3/2*a^2*b + 1/2*a*b^2 + 1/6*b^3 + O(a, b)^4\nsage: log(1+f)\na + b - 1/2*a^2 - a*b - 1/2*b^2 + 1/3*a^3 + 2*a^2*b + a*b^2 + 1/3*b^3 + O(a, b)^4\n```\n\nAssignee: @malb\n\nCC:  @nilesjohnson\n\nKeywords: multivariate power series\n\nResolution: fixed\n\nAuthor: Volker Braun\n\nReviewer: Niles Johnson\n\nMerged: sage-5.0.beta6\n\nIssue created by migration from https://trac.sagemath.org/ticket/12241\n\n",
    "closed_at": "2012-02-27T11:22:13Z",
    "created_at": "2011-12-31T13:10:18Z",
    "labels": [
        "component: commutative algebra"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-5.0",
    "title": "exp, log, derivative of multivariate power series",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/12241",
    "user": "https://github.com/vbraun"
}
```
This ticket implements exp, log, and derivative of multivariate power series:

```
sage: T.<a,b> = PowerSeriesRing(ZZ,2)
sage: f = a + b + a^2*b
sage: f = a + b + a^2*b + T.O(4)
sage: f.derivative(a)
1 + 2*a*b + O(a, b)^3
sage: exp(f)
1 + a + b + 1/2*a^2 + a*b + 1/2*b^2 + 1/6*a^3 + 3/2*a^2*b + 1/2*a*b^2 + 1/6*b^3 + O(a, b)^4
sage: log(1+f)
a + b - 1/2*a^2 - a*b - 1/2*b^2 + 1/3*a^3 + 2*a^2*b + a*b^2 + 1/3*b^3 + O(a, b)^4
```

Assignee: @malb

CC:  @nilesjohnson

Keywords: multivariate power series

Resolution: fixed

Author: Volker Braun

Reviewer: Niles Johnson

Merged: sage-5.0.beta6

Issue created by migration from https://trac.sagemath.org/ticket/12241





---

archive/issue_comments_169525.json:
```json
{
    "body": "Changing keywords from \"\" to \"multivariate power series\".",
    "created_at": "2011-12-31T13:15:56Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12241",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12241#issuecomment-169525",
    "user": "https://github.com/vbraun"
}
```

Changing keywords from "" to "multivariate power series".



---

archive/issue_comments_169526.json:
```json
{
    "body": "Changing status from new to needs_review.",
    "created_at": "2011-12-31T13:15:56Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12241",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12241#issuecomment-169526",
    "user": "https://github.com/vbraun"
}
```

Changing status from new to needs_review.



---

archive/issue_comments_169527.json:
```json
{
    "body": "<a id='comment:2'></a>\nFixed bug where valuation >= 2 was exponentiated with the wrong precision.",
    "created_at": "2012-01-27T06:22:32Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12241",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12241#issuecomment-169527",
    "user": "https://github.com/vbraun"
}
```

<a id='comment:2'></a>
Fixed bug where valuation >= 2 was exponentiated with the wrong precision.



---

archive/issue_comments_169528.json:
```json
{
    "body": "Changing reviewer from \"\" to \"Niles Johnson\"",
    "created_at": "2012-01-27T14:31:13Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12241",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12241#issuecomment-169528",
    "user": "https://github.com/nilesjohnson"
}
```

Changing reviewer from "" to "Niles Johnson"



---

archive/issue_comments_169529.json:
```json
{
    "body": "Changing work_issues from \"\" to \"efficiency\"",
    "created_at": "2012-01-27T14:31:13Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12241",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12241#issuecomment-169529",
    "user": "https://github.com/nilesjohnson"
}
```

Changing work_issues from "" to "efficiency"



---

archive/issue_comments_169530.json:
```json
{
    "body": "<a id='comment:3'></a>\nThis is good -- thanks for working on it!  Here are some comments:\n\n\n## derivative\n\nLooks great!\n\n\n## pow\n* I think the default behavior should be same as repeated multiplication by self -- is there a good reason not to do this?\n\n* Also, when precision is much larger than valuation, `pow` is slower than repeated multiplication anyway:\n\n```\nsage: R.<a,b,c> = PowerSeriesRing(ZZ)\nsage: f = a+R.random_element(100)\nsage: f\na - a^23*c^11 + a^29*b^8*c^55 + 2*a^36*b^54*c^6 + O(a, b, c)^100\nsage: %timeit f^10\n5 loops, best of 3: 95.8 ms per loop\nsage: %timeit f.pow(10)\n5 loops, best of 3: 215 ms per loop\n```\nI think this should be addressed by rewriting `pow` to use `_bg_value`, as has been done with `_mul_`.\n\n\n* Unexpected behavior when requesting larger precision from `pow`:\n\n```\nsage: f = a*R.random_element(); f\n2*a^3*b - 7*a^3*b^4*c^3 - 3*a^6*b^6 - 109*a^3*b^3*c^6 - 2*a*b^9*c^2 + O(a, b, c)^13\nsage: f^2\n4*a^6*b^2 - 28*a^6*b^5*c^3 - 12*a^9*b^7 - 436*a^6*b^4*c^6 - 8*a^4*b^10*c^2 + O(a, b, c)^17\nsage: f.pow(2,prec=17)\n4*a^6*b^2 + O(a, b, c)^13\n```\n\n## exp / log\n\n* The warning about constant coefficients is confusing and vague.  I would prefer something more straightforward like:  \"If `f` has constant coefficient `c`, and `exp(c)` is transcendental, then `exp(f)` would have to be a power series over the Symbolic Ring.  These are not yet implemented and therefore such cases raise an error:\"\n\n* Another workaround for this limitation is to change base ring to one which is closed under exponentiation, such as RR or CC:\n\n```\nsage: R.<a,b,c> = PowerSeriesRing(ZZ)\nsage: f = 2+R.random_element()\nsage: exp(f)\n . . .\nTypeError: unsupported operand parent(s) for '*': 'Symbolic Ring' and 'Multivariate Power Series Ring in a, b, c over Rational Field'\nsage: S = R.change_ring(CC)\nsage: f = S(f)\nsage: exp(f)\n7.38905609893065 + (-7.38905609893065)*a*b^3*c + (-22.1671682967919)*a^6*b^2*c + (-7.38905609893065)*a^5*b^2*c^2 + (-7.38905609893065)*b^2*c^7 + 3.69452804946533*a^2*b^6*c^2 + (-7.38905609893065)*a*b^10 + O(a, b, c)^12\n```\n\n\n* For elements with infinite precision, consider using `default_prec` if no precision is specified:\n\n```\nsage: R.<a,b,c> = PowerSeriesRing(ZZ)\nsage: R.default_prec()\n12\n```\n\n\n* The implementation seems unnecessarily slow, because of repeated calls to `pow`:  For precision `n`, calling `pow` for each term will require a total of something like `n^2` multiplications of the input with itself.  But these functions should require only `n`.  Here is a suggested alternate implementation for `log`:\n\n```\ndef fast_log(f):\n    prec = f.prec()\n    x = 1-f\n    r = 1\n    logx = 0\n    for i in range(1,prec):\n        r = r*x + R.O(prec)\n        log += r/i\n    return -logx\n```\n\n```\nsage: f = 1+R.random_element(30); f\n1 - 6*a^5*b^2*c^7 + a^14*b^13 + O(a, b, c)^30\nsage: %timeit log(f)\n5 loops, best of 3: 224 ms per loop\nsage: %timeit fast_log(f)\n25 loops, best of 3: 26.4 ms per loop\nsage: fast_log(f) == log(f)\nTrue\n```\n\nAnd this might be faster if you use `_bg_value` to do the multiplication here too.",
    "created_at": "2012-01-27T14:31:13Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12241",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12241#issuecomment-169530",
    "user": "https://github.com/nilesjohnson"
}
```

<a id='comment:3'></a>
This is good -- thanks for working on it!  Here are some comments:


## derivative

Looks great!


## pow
* I think the default behavior should be same as repeated multiplication by self -- is there a good reason not to do this?

* Also, when precision is much larger than valuation, `pow` is slower than repeated multiplication anyway:

```
sage: R.<a,b,c> = PowerSeriesRing(ZZ)
sage: f = a+R.random_element(100)
sage: f
a - a^23*c^11 + a^29*b^8*c^55 + 2*a^36*b^54*c^6 + O(a, b, c)^100
sage: %timeit f^10
5 loops, best of 3: 95.8 ms per loop
sage: %timeit f.pow(10)
5 loops, best of 3: 215 ms per loop
```
I think this should be addressed by rewriting `pow` to use `_bg_value`, as has been done with `_mul_`.


* Unexpected behavior when requesting larger precision from `pow`:

```
sage: f = a*R.random_element(); f
2*a^3*b - 7*a^3*b^4*c^3 - 3*a^6*b^6 - 109*a^3*b^3*c^6 - 2*a*b^9*c^2 + O(a, b, c)^13
sage: f^2
4*a^6*b^2 - 28*a^6*b^5*c^3 - 12*a^9*b^7 - 436*a^6*b^4*c^6 - 8*a^4*b^10*c^2 + O(a, b, c)^17
sage: f.pow(2,prec=17)
4*a^6*b^2 + O(a, b, c)^13
```

## exp / log

* The warning about constant coefficients is confusing and vague.  I would prefer something more straightforward like:  "If `f` has constant coefficient `c`, and `exp(c)` is transcendental, then `exp(f)` would have to be a power series over the Symbolic Ring.  These are not yet implemented and therefore such cases raise an error:"

* Another workaround for this limitation is to change base ring to one which is closed under exponentiation, such as RR or CC:

```
sage: R.<a,b,c> = PowerSeriesRing(ZZ)
sage: f = 2+R.random_element()
sage: exp(f)
 . . .
TypeError: unsupported operand parent(s) for '*': 'Symbolic Ring' and 'Multivariate Power Series Ring in a, b, c over Rational Field'
sage: S = R.change_ring(CC)
sage: f = S(f)
sage: exp(f)
7.38905609893065 + (-7.38905609893065)*a*b^3*c + (-22.1671682967919)*a^6*b^2*c + (-7.38905609893065)*a^5*b^2*c^2 + (-7.38905609893065)*b^2*c^7 + 3.69452804946533*a^2*b^6*c^2 + (-7.38905609893065)*a*b^10 + O(a, b, c)^12
```


* For elements with infinite precision, consider using `default_prec` if no precision is specified:

```
sage: R.<a,b,c> = PowerSeriesRing(ZZ)
sage: R.default_prec()
12
```


* The implementation seems unnecessarily slow, because of repeated calls to `pow`:  For precision `n`, calling `pow` for each term will require a total of something like `n^2` multiplications of the input with itself.  But these functions should require only `n`.  Here is a suggested alternate implementation for `log`:

```
def fast_log(f):
    prec = f.prec()
    x = 1-f
    r = 1
    logx = 0
    for i in range(1,prec):
        r = r*x + R.O(prec)
        log += r/i
    return -logx
```

```
sage: f = 1+R.random_element(30); f
1 - 6*a^5*b^2*c^7 + a^14*b^13 + O(a, b, c)^30
sage: %timeit log(f)
5 loops, best of 3: 224 ms per loop
sage: %timeit fast_log(f)
25 loops, best of 3: 26.4 ms per loop
sage: fast_log(f) == log(f)
True
```

And this might be faster if you use `_bg_value` to do the multiplication here too.



---

archive/issue_comments_169531.json:
```json
{
    "body": "Changing status from needs_review to needs_work.",
    "created_at": "2012-01-27T14:31:13Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12241",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12241#issuecomment-169531",
    "user": "https://github.com/nilesjohnson"
}
```

Changing status from needs_review to needs_work.



---

archive/issue_comments_169532.json:
```json
{
    "body": "Changing status from needs_work to needs_review.",
    "created_at": "2012-02-20T02:52:16Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12241",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12241#issuecomment-169532",
    "user": "https://github.com/vbraun"
}
```

Changing status from needs_work to needs_review.



---

archive/issue_comments_169533.json:
```json
{
    "body": "<a id='comment:4'></a>\nI've removed the `pow()` method and sped up log/exp:\n\n```\nsage: R.<a,b,c> = PowerSeriesRing(ZZ)\nsage: f = 1+R.random_element(30); f\n1 - a^8*b^2*c^3 + 2*a*b^6*c^8 - 3*a^2*b^16*c - 17*a^13*b^3*c^8 + 2*a^2*b^8*c^15 + O(a, b, c)^30\nsage: %timeit log(f)\n125 loops, best of 3: 3.6 ms per loop\n```",
    "created_at": "2012-02-20T02:52:16Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12241",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12241#issuecomment-169533",
    "user": "https://github.com/vbraun"
}
```

<a id='comment:4'></a>
I've removed the `pow()` method and sped up log/exp:

```
sage: R.<a,b,c> = PowerSeriesRing(ZZ)
sage: f = 1+R.random_element(30); f
1 - a^8*b^2*c^3 + 2*a*b^6*c^8 - 3*a^2*b^16*c - 17*a^13*b^3*c^8 + 2*a^2*b^8*c^15 + O(a, b, c)^30
sage: %timeit log(f)
125 loops, best of 3: 3.6 ms per loop
```



---

archive/issue_comments_169534.json:
```json
{
    "body": "Updated patch",
    "created_at": "2012-02-20T02:52:33Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12241",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12241#issuecomment-169534",
    "user": "https://github.com/vbraun"
}
```

Updated patch



---

archive/issue_comments_169535.json:
```json
{
    "body": "Changing work_issues from \"efficiency\" to \"\"",
    "created_at": "2012-02-22T19:19:23Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12241",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12241#issuecomment-169535",
    "user": "https://github.com/nilesjohnson"
}
```

Changing work_issues from "efficiency" to ""



---

archive/issue_comments_169536.json:
```json
{
    "body": "<a id='comment:5'></a>\nAttachment [trac_12241_more_multivariate_powerseries.patch](tarball://root/attachments/some-uuid/ticket12241/trac_12241_more_multivariate_powerseries.patch) by @nilesjohnson created at 2012-02-22 19:19:23\n\nLooks good, passes all tests, positive review!",
    "created_at": "2012-02-22T19:19:23Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12241",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12241#issuecomment-169536",
    "user": "https://github.com/nilesjohnson"
}
```

<a id='comment:5'></a>
Attachment [trac_12241_more_multivariate_powerseries.patch](tarball://root/attachments/some-uuid/ticket12241/trac_12241_more_multivariate_powerseries.patch) by @nilesjohnson created at 2012-02-22 19:19:23

Looks good, passes all tests, positive review!



---

archive/issue_comments_169537.json:
```json
{
    "body": "Changing status from needs_review to positive_review.",
    "created_at": "2012-02-22T19:19:23Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12241",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12241#issuecomment-169537",
    "user": "https://github.com/nilesjohnson"
}
```

Changing status from needs_review to positive_review.



---

archive/issue_comments_169538.json:
```json
{
    "body": "Changing merged from \"\" to \"sage-5.0.beta6\"",
    "created_at": "2012-02-27T11:22:13Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12241",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12241#issuecomment-169538",
    "user": "https://github.com/jdemeyer"
}
```

Changing merged from "" to "sage-5.0.beta6"



---

archive/issue_events_046127.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2012-02-27T11:22:13Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/12241",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/12241#event-46127"
}
```



---

archive/issue_comments_169539.json:
```json
{
    "body": "Resolution: fixed",
    "created_at": "2012-02-27T11:22:13Z",
    "issue": "https://github.com/sagemath/sagetest/issues/12241",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/12241#issuecomment-169539",
    "user": "https://github.com/jdemeyer"
}
```

Resolution: fixed
