# Issue 12241: exp, log, derivative of multivariate power series

archive/issues_012069.json:
```json
{
    "assignees": [
        "https://github.com/malb"
    ],
    "body": "This ticket implements exp, log, and derivative of multivariate power series:\n\n```\nsage: T.<a,b> = PowerSeriesRing(ZZ,2)\nsage: f = a + b + a^2*b\nsage: f = a + b + a^2*b + T.O(4)\nsage: f.derivative(a)\n1 + 2*a*b + O(a, b)^3\nsage: exp(f)\n1 + a + b + 1/2*a^2 + a*b + 1/2*b^2 + 1/6*a^3 + 3/2*a^2*b + 1/2*a*b^2 + 1/6*b^3 + O(a, b)^4\nsage: log(1+f)\na + b - 1/2*a^2 - a*b - 1/2*b^2 + 1/3*a^3 + 2*a^2*b + a*b^2 + 1/3*b^3 + O(a, b)^4\n```\n\nCC:  @nilesjohnson\n\nComponent: **commutative algebra**\n\nKeywords: **multivariate power series**\n\nAuthor: **Volker Braun**\n\nReviewer: **Niles Johnson**\n\nMerged: **sage-5.0.beta6**\n\n_Issue created by migration from https://trac.sagemath.org/ticket/12241_\n\n",
    "closed_at": "2012-02-27T11:22:13Z",
    "created_at": "2011-12-31T13:10:18Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/c%3A%20commutative%20algebra",
        "https://github.com/sagemath/sage/labels/p%3A%20major%20/%203",
        "https://github.com/sagemath/sage/labels/enhancement"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-5.0",
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "exp, log, derivative of multivariate power series",
    "type": "issue",
    "updated_at": "2012-02-27T11:22:13Z",
    "url": "https://github.com/sagemath/sage/issues/12241",
    "user": "https://github.com/vbraun"
}
```
This ticket implements exp, log, and derivative of multivariate power series:

```
sage: T.<a,b> = PowerSeriesRing(ZZ,2)
sage: f = a + b + a^2*b
sage: f = a + b + a^2*b + T.O(4)
sage: f.derivative(a)
1 + 2*a*b + O(a, b)^3
sage: exp(f)
1 + a + b + 1/2*a^2 + a*b + 1/2*b^2 + 1/6*a^3 + 3/2*a^2*b + 1/2*a*b^2 + 1/6*b^3 + O(a, b)^4
sage: log(1+f)
a + b - 1/2*a^2 - a*b - 1/2*b^2 + 1/3*a^3 + 2*a^2*b + a*b^2 + 1/3*b^3 + O(a, b)^4
```

CC:  @nilesjohnson

Component: **commutative algebra**

Keywords: **multivariate power series**

Author: **Volker Braun**

Reviewer: **Niles Johnson**

Merged: **sage-5.0.beta6**

_Issue created by migration from https://trac.sagemath.org/ticket/12241_





---

archive/issue_events_164921.json:
```json
{
    "actor": "https://github.com/vbraun",
    "created_at": "2011-12-31T13:10:18Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/12241",
    "milestone_number": null,
    "milestone_title": "sage-5.0",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12241#event-164921"
}
```



---

archive/issue_events_164922.json:
```json
{
    "actor": "https://github.com/vbraun",
    "created_at": "2011-12-31T13:10:18Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/12241",
    "label": "https://github.com/sagemath/sage/labels/c%3A%20commutative%20algebra",
    "label_color": "0000ff",
    "label_name": "c: commutative algebra",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12241#event-164922"
}
```



---

archive/issue_events_164923.json:
```json
{
    "actor": "https://github.com/vbraun",
    "created_at": "2011-12-31T13:10:18Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/12241",
    "label": "https://github.com/sagemath/sage/labels/p%3A%20major%20/%203",
    "label_color": "ffbb00",
    "label_name": "p: major / 3",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12241#event-164923"
}
```



---

archive/issue_events_164924.json:
```json
{
    "actor": "https://github.com/vbraun",
    "created_at": "2011-12-31T13:10:18Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/12241",
    "label": "https://github.com/sagemath/sage/labels/enhancement",
    "label_color": "696969",
    "label_name": "enhancement",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12241#event-164924"
}
```



---

archive/issue_events_164925.json:
```json
{
    "actor": "https://github.com/malb",
    "created_at": "2011-12-31T13:10:18Z",
    "event": "assigned",
    "issue": "https://github.com/sagemath/sage/issues/12241",
    "subject": "https://github.com/vbraun",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12241#event-164925"
}
```



---

archive/issue_comments_132431.json:
```json
{
    "body": "Changed keywords from none to **multivariate power series**",
    "created_at": "2011-12-31T13:15:56Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/12241",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12241#issuecomment-132431",
    "user": "https://github.com/vbraun"
}
```

Changed keywords from none to **multivariate power series**



---

archive/issue_events_164926.json:
```json
{
    "actor": "https://github.com/vbraun",
    "created_at": "2011-12-31T13:15:56Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/12241",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "7fff00",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12241#event-164926"
}
```



---

archive/issue_comments_132432.json:
```json
{
    "body": "<div id=\"comment:2\" align=\"right\">comment:2</div>\n\nFixed bug where valuation >= 2 was exponentiated with the wrong precision.",
    "created_at": "2012-01-27T06:22:32Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/12241",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12241#issuecomment-132432",
    "user": "https://github.com/vbraun"
}
```

<div id="comment:2" align="right">comment:2</div>

Fixed bug where valuation >= 2 was exponentiated with the wrong precision.



---

archive/issue_comments_132433.json:
```json
{
    "body": "Reviewer: **Niles Johnson**",
    "created_at": "2012-01-27T14:31:13Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/12241",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12241#issuecomment-132433",
    "user": "https://github.com/nilesjohnson"
}
```

Reviewer: **Niles Johnson**



---

archive/issue_comments_132434.json:
```json
{
    "body": "Work Issues: **efficiency**",
    "created_at": "2012-01-27T14:31:13Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/12241",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12241#issuecomment-132434",
    "user": "https://github.com/nilesjohnson"
}
```

Work Issues: **efficiency**



---

archive/issue_comments_132435.json:
```json
{
    "body": "<div id=\"comment:3\" align=\"right\">comment:3</div>\n\nThis is good -- thanks for working on it!  Here are some comments:\n\n\n## derivative\n\nLooks great!\n\n\n## pow\n* I think the default behavior should be same as repeated multiplication by self -- is there a good reason not to do this?\n\n* Also, when precision is much larger than valuation, `pow` is slower than repeated multiplication anyway:\n\n```\nsage: R.<a,b,c> = PowerSeriesRing(ZZ)\nsage: f = a+R.random_element(100)\nsage: f\na - a^23*c^11 + a^29*b^8*c^55 + 2*a^36*b^54*c^6 + O(a, b, c)^100\nsage: %timeit f^10\n5 loops, best of 3: 95.8 ms per loop\nsage: %timeit f.pow(10)\n5 loops, best of 3: 215 ms per loop\n```\nI think this should be addressed by rewriting `pow` to use `_bg_value`, as has been done with `_mul_`.\n\n\n* Unexpected behavior when requesting larger precision from `pow`:\n\n```\nsage: f = a*R.random_element(); f\n2*a^3*b - 7*a^3*b^4*c^3 - 3*a^6*b^6 - 109*a^3*b^3*c^6 - 2*a*b^9*c^2 + O(a, b, c)^13\nsage: f^2\n4*a^6*b^2 - 28*a^6*b^5*c^3 - 12*a^9*b^7 - 436*a^6*b^4*c^6 - 8*a^4*b^10*c^2 + O(a, b, c)^17\nsage: f.pow(2,prec=17)\n4*a^6*b^2 + O(a, b, c)^13\n```\n\n## exp / log\n\n* The warning about constant coefficients is confusing and vague.  I would prefer something more straightforward like:  \"If `f` has constant coefficient `c`, and `exp(c)` is transcendental, then `exp(f)` would have to be a power series over the Symbolic Ring.  These are not yet implemented and therefore such cases raise an error:\"\n\n* Another workaround for this limitation is to change base ring to one which is closed under exponentiation, such as RR or CC:\n\n```\nsage: R.<a,b,c> = PowerSeriesRing(ZZ)\nsage: f = 2+R.random_element()\nsage: exp(f)\n . . .\nTypeError: unsupported operand parent(s) for '*': 'Symbolic Ring' and 'Multivariate Power Series Ring in a, b, c over Rational Field'\nsage: S = R.change_ring(CC)\nsage: f = S(f)\nsage: exp(f)\n7.38905609893065 + (-7.38905609893065)*a*b^3*c + (-22.1671682967919)*a^6*b^2*c + (-7.38905609893065)*a^5*b^2*c^2 + (-7.38905609893065)*b^2*c^7 + 3.69452804946533*a^2*b^6*c^2 + (-7.38905609893065)*a*b^10 + O(a, b, c)^12\n```\n\n\n* For elements with infinite precision, consider using `default_prec` if no precision is specified:\n\n```\nsage: R.<a,b,c> = PowerSeriesRing(ZZ)\nsage: R.default_prec()\n12\n```\n\n\n* The implementation seems unnecessarily slow, because of repeated calls to `pow`:  For precision `n`, calling `pow` for each term will require a total of something like `n^2` multiplications of the input with itself.  But these functions should require only `n`.  Here is a suggested alternate implementation for `log`:\n\n```\ndef fast_log(f):\n    prec = f.prec()\n    x = 1-f\n    r = 1\n    logx = 0\n    for i in range(1,prec):\n        r = r*x + R.O(prec)\n        log += r/i\n    return -logx\n```\n\n```\nsage: f = 1+R.random_element(30); f\n1 - 6*a^5*b^2*c^7 + a^14*b^13 + O(a, b, c)^30\nsage: %timeit log(f)\n5 loops, best of 3: 224 ms per loop\nsage: %timeit fast_log(f)\n25 loops, best of 3: 26.4 ms per loop\nsage: fast_log(f) == log(f)\nTrue\n```\n\nAnd this might be faster if you use `_bg_value` to do the multiplication here too.",
    "created_at": "2012-01-27T14:31:13Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/12241",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12241#issuecomment-132435",
    "user": "https://github.com/nilesjohnson"
}
```

<div id="comment:3" align="right">comment:3</div>

This is good -- thanks for working on it!  Here are some comments:


## derivative

Looks great!


## pow
* I think the default behavior should be same as repeated multiplication by self -- is there a good reason not to do this?

* Also, when precision is much larger than valuation, `pow` is slower than repeated multiplication anyway:

```
sage: R.<a,b,c> = PowerSeriesRing(ZZ)
sage: f = a+R.random_element(100)
sage: f
a - a^23*c^11 + a^29*b^8*c^55 + 2*a^36*b^54*c^6 + O(a, b, c)^100
sage: %timeit f^10
5 loops, best of 3: 95.8 ms per loop
sage: %timeit f.pow(10)
5 loops, best of 3: 215 ms per loop
```
I think this should be addressed by rewriting `pow` to use `_bg_value`, as has been done with `_mul_`.


* Unexpected behavior when requesting larger precision from `pow`:

```
sage: f = a*R.random_element(); f
2*a^3*b - 7*a^3*b^4*c^3 - 3*a^6*b^6 - 109*a^3*b^3*c^6 - 2*a*b^9*c^2 + O(a, b, c)^13
sage: f^2
4*a^6*b^2 - 28*a^6*b^5*c^3 - 12*a^9*b^7 - 436*a^6*b^4*c^6 - 8*a^4*b^10*c^2 + O(a, b, c)^17
sage: f.pow(2,prec=17)
4*a^6*b^2 + O(a, b, c)^13
```

## exp / log

* The warning about constant coefficients is confusing and vague.  I would prefer something more straightforward like:  "If `f` has constant coefficient `c`, and `exp(c)` is transcendental, then `exp(f)` would have to be a power series over the Symbolic Ring.  These are not yet implemented and therefore such cases raise an error:"

* Another workaround for this limitation is to change base ring to one which is closed under exponentiation, such as RR or CC:

```
sage: R.<a,b,c> = PowerSeriesRing(ZZ)
sage: f = 2+R.random_element()
sage: exp(f)
 . . .
TypeError: unsupported operand parent(s) for '*': 'Symbolic Ring' and 'Multivariate Power Series Ring in a, b, c over Rational Field'
sage: S = R.change_ring(CC)
sage: f = S(f)
sage: exp(f)
7.38905609893065 + (-7.38905609893065)*a*b^3*c + (-22.1671682967919)*a^6*b^2*c + (-7.38905609893065)*a^5*b^2*c^2 + (-7.38905609893065)*b^2*c^7 + 3.69452804946533*a^2*b^6*c^2 + (-7.38905609893065)*a*b^10 + O(a, b, c)^12
```


* For elements with infinite precision, consider using `default_prec` if no precision is specified:

```
sage: R.<a,b,c> = PowerSeriesRing(ZZ)
sage: R.default_prec()
12
```


* The implementation seems unnecessarily slow, because of repeated calls to `pow`:  For precision `n`, calling `pow` for each term will require a total of something like `n^2` multiplications of the input with itself.  But these functions should require only `n`.  Here is a suggested alternate implementation for `log`:

```
def fast_log(f):
    prec = f.prec()
    x = 1-f
    r = 1
    logx = 0
    for i in range(1,prec):
        r = r*x + R.O(prec)
        log += r/i
    return -logx
```

```
sage: f = 1+R.random_element(30); f
1 - 6*a^5*b^2*c^7 + a^14*b^13 + O(a, b, c)^30
sage: %timeit log(f)
5 loops, best of 3: 224 ms per loop
sage: %timeit fast_log(f)
25 loops, best of 3: 26.4 ms per loop
sage: fast_log(f) == log(f)
True
```

And this might be faster if you use `_bg_value` to do the multiplication here too.



---

archive/issue_events_164927.json:
```json
{
    "actor": "https://github.com/nilesjohnson",
    "created_at": "2012-01-27T14:31:13Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/12241",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "7fff00",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12241#event-164927"
}
```



---

archive/issue_events_164928.json:
```json
{
    "actor": "https://github.com/nilesjohnson",
    "created_at": "2012-01-27T14:31:13Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/12241",
    "label": "https://github.com/sagemath/sage/labels/needs%20work",
    "label_color": "ffff00",
    "label_name": "needs work",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12241#event-164928"
}
```



---

archive/issue_events_164929.json:
```json
{
    "actor": "https://github.com/vbraun",
    "created_at": "2012-02-20T02:52:16Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/12241",
    "label": "https://github.com/sagemath/sage/labels/needs%20work",
    "label_color": "ffff00",
    "label_name": "needs work",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12241#event-164929"
}
```



---

archive/issue_events_164930.json:
```json
{
    "actor": "https://github.com/vbraun",
    "created_at": "2012-02-20T02:52:16Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/12241",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "7fff00",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12241#event-164930"
}
```



---

archive/issue_comments_132436.json:
```json
{
    "body": "<div id=\"comment:4\" align=\"right\">comment:4</div>\n\nI've removed the `pow()` method and sped up log/exp:\n\n```\nsage: R.<a,b,c> = PowerSeriesRing(ZZ)\nsage: f = 1+R.random_element(30); f\n1 - a^8*b^2*c^3 + 2*a*b^6*c^8 - 3*a^2*b^16*c - 17*a^13*b^3*c^8 + 2*a^2*b^8*c^15 + O(a, b, c)^30\nsage: %timeit log(f)\n125 loops, best of 3: 3.6 ms per loop\n```",
    "created_at": "2012-02-20T02:52:16Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/12241",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12241#issuecomment-132436",
    "user": "https://github.com/vbraun"
}
```

<div id="comment:4" align="right">comment:4</div>

I've removed the `pow()` method and sped up log/exp:

```
sage: R.<a,b,c> = PowerSeriesRing(ZZ)
sage: f = 1+R.random_element(30); f
1 - a^8*b^2*c^3 + 2*a*b^6*c^8 - 3*a^2*b^16*c - 17*a^13*b^3*c^8 + 2*a^2*b^8*c^15 + O(a, b, c)^30
sage: %timeit log(f)
125 loops, best of 3: 3.6 ms per loop
```



---

archive/issue_comments_132437.json:
```json
{
    "body": "Updated patch",
    "created_at": "2012-02-20T02:52:33Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/12241",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12241#issuecomment-132437",
    "user": "https://github.com/vbraun"
}
```

Updated patch



---

archive/issue_comments_132438.json:
```json
{
    "body": "Changed work issues from **efficiency** to none",
    "created_at": "2012-02-22T19:19:23Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/12241",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12241#issuecomment-132438",
    "user": "https://github.com/nilesjohnson"
}
```

Changed work issues from **efficiency** to none



---

archive/issue_comments_132439.json:
```json
{
    "body": "<div id=\"comment:5\" align=\"right\">comment:5</div>\n\nAttachment: **[trac_12241_more_multivariate_powerseries.patch.gz](https://github.com/sagemath/sage/files/ticket12241/trac_12241_more_multivariate_powerseries.patch.gz)**\n\nLooks good, passes all tests, positive review!",
    "created_at": "2012-02-22T19:19:23Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/12241",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12241#issuecomment-132439",
    "user": "https://github.com/nilesjohnson"
}
```

<div id="comment:5" align="right">comment:5</div>

Attachment: **[trac_12241_more_multivariate_powerseries.patch.gz](https://github.com/sagemath/sage/files/ticket12241/trac_12241_more_multivariate_powerseries.patch.gz)**

Looks good, passes all tests, positive review!



---

archive/issue_events_164931.json:
```json
{
    "actor": "https://github.com/nilesjohnson",
    "created_at": "2012-02-22T19:19:23Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/12241",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "7fff00",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12241#event-164931"
}
```



---

archive/issue_events_164932.json:
```json
{
    "actor": "https://github.com/nilesjohnson",
    "created_at": "2012-02-22T19:19:23Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/12241",
    "label": "https://github.com/sagemath/sage/labels/positive%20review",
    "label_color": "dfffc0",
    "label_name": "positive review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12241#event-164932"
}
```



---

archive/issue_comments_132440.json:
```json
{
    "body": "Merged: **sage-5.0.beta6**",
    "created_at": "2012-02-27T11:22:13Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/12241",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12241#issuecomment-132440",
    "user": "https://github.com/jdemeyer"
}
```

Merged: **sage-5.0.beta6**



---

archive/issue_events_164933.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2012-02-27T11:22:13Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/12241",
    "label": "https://github.com/sagemath/sage/labels/positive%20review",
    "label_color": "dfffc0",
    "label_name": "positive review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12241#event-164933"
}
```



---

archive/issue_events_164934.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2012-02-27T11:22:13Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/12241",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12241#event-164934"
}
```
