# Issue 12302: Partial evaluation bug for callable vector functions

archive/issues_012130.json:
```json
{
    "assignees": [],
    "body": "For callable (scalar) functions, taking sections (partial evaluation) of functions works perfectly fine; that is to say the following code works perfectly as expected:\n\n```\nsage: f(x,y,z) = x*y*z; f\n(x, y, z) |--> x*y*z\nsage: g(x, z) = f(y=1); g\n(x, z) |--> x*z\n```\n\nMove up to callable vector functions and taking sections breaks however:\n\n```\nsage: v(x, y) = [x+y, x-y]; v\n(x, y) |--> (x + y, x - y)\nsage: v(x,0)\n(x, x)\nsage: w(x) = v(y=0)\nTypeError\n```\n\n**This is because *all* evaluation, even if partial, of a callable vector function returns a Vector_symbolic_dense.** The relevant function _ `_call_` _() is defined in free_module_element.pyx.\n\nThe fix, of course, is to make the code intelligent enough to know that an evaluation is only partial -- one hopes that ``type(vx)`` would return 'sage.modules.vector_callable_symbolic_dense.Vector_callable_symbolic_dense'> rather than 'sage.modules.vector_symbolic_dense.Vector_symbolic_dense'>\n\n```\nsage: v(x, y) = [x+y, x-y]\nsage: type(v)\n<class 'sage.modules.vector_callable_symbolic_dense.Vector_callable_symbolic_dense'>\nsage: vx = v(y=0); vx\n(x,x)\nsage: type(vx)\n<class 'sage.modules.vector_symbolic_dense.Vector_symbolic_dense'>\n```\n\n**Work-around**\n\nThis isn't *so* bad since we can still do:\n\n```\nsage: v(x, y) = [x+y, x-y]\nsage: vx = v(y=0)\n```\n\nNow, if every entry still has a variable everything, including positional rather than named arguments, works. \n\n```\nsage: v(x, y) = [x+y, x-y]\nsage: vx = v(y=0)\nsage: vx(x=1)\n(1, 1)\nsage: vx(1) #deprecated, but works fine\n```\n\nHowever, things break if taking a section kills off all variables in any component we try to use positional arguments:\n\n```\nsage: v(x, y) = [x+y, x-y]\nsage: vy = v(y=x)\nsage: vy\n(2*x, 0)\nsage: vx\n(x, x)\nsage: vy(x=1) #named arguments still work\n(2, 0)\nsage: vy(1) #positional arguments don't\nValueError\n```\n\n**Assignee:** gbe\n\n**CC:**  @jasongrout\n\n**Keywords:** sd35.5\n\nIssue created by migration from https://trac.sagemath.org/ticket/12302\n\n",
    "created_at": "2012-01-12T19:44:46Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20symbolics",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-6.4",
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "Partial evaluation bug for callable vector functions",
    "type": "issue",
    "updated_at": "2014-08-10T16:51:03Z",
    "url": "https://github.com/sagemath/sage/issues/12302",
    "user": "https://github.com/sagetrac-gbe"
}
```
For callable (scalar) functions, taking sections (partial evaluation) of functions works perfectly fine; that is to say the following code works perfectly as expected:

```
sage: f(x,y,z) = x*y*z; f
(x, y, z) |--> x*y*z
sage: g(x, z) = f(y=1); g
(x, z) |--> x*z
```

Move up to callable vector functions and taking sections breaks however:

```
sage: v(x, y) = [x+y, x-y]; v
(x, y) |--> (x + y, x - y)
sage: v(x,0)
(x, x)
sage: w(x) = v(y=0)
TypeError
```

**This is because *all* evaluation, even if partial, of a callable vector function returns a Vector_symbolic_dense.** The relevant function _ `_call_` _() is defined in free_module_element.pyx.

The fix, of course, is to make the code intelligent enough to know that an evaluation is only partial -- one hopes that ``type(vx)`` would return 'sage.modules.vector_callable_symbolic_dense.Vector_callable_symbolic_dense'> rather than 'sage.modules.vector_symbolic_dense.Vector_symbolic_dense'>

```
sage: v(x, y) = [x+y, x-y]
sage: type(v)
<class 'sage.modules.vector_callable_symbolic_dense.Vector_callable_symbolic_dense'>
sage: vx = v(y=0); vx
(x,x)
sage: type(vx)
<class 'sage.modules.vector_symbolic_dense.Vector_symbolic_dense'>
```

**Work-around**

This isn't *so* bad since we can still do:

```
sage: v(x, y) = [x+y, x-y]
sage: vx = v(y=0)
```

Now, if every entry still has a variable everything, including positional rather than named arguments, works. 

```
sage: v(x, y) = [x+y, x-y]
sage: vx = v(y=0)
sage: vx(x=1)
(1, 1)
sage: vx(1) #deprecated, but works fine
```

However, things break if taking a section kills off all variables in any component we try to use positional arguments:

```
sage: v(x, y) = [x+y, x-y]
sage: vy = v(y=x)
sage: vy
(2*x, 0)
sage: vx
(x, x)
sage: vy(x=1) #named arguments still work
(2, 0)
sage: vy(1) #positional arguments don't
ValueError
```

**Assignee:** gbe

**CC:**  @jasongrout

**Keywords:** sd35.5

Issue created by migration from https://trac.sagemath.org/ticket/12302





---

archive/issue_events_141481.json:
```json
{
    "actor": "https://github.com/sagetrac-gbe",
    "created_at": "2012-01-12T19:44:46Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/12302",
    "milestone_number": null,
    "milestone_title": "sage-6.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12302#event-141481"
}
```



---

archive/issue_events_141482.json:
```json
{
    "actor": "https://github.com/sagetrac-gbe",
    "created_at": "2012-01-12T19:44:46Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/12302",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20symbolics",
    "label_color": "08517b",
    "label_name": "component: symbolics",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12302#event-141482"
}
```



---

archive/issue_events_141483.json:
```json
{
    "actor": "https://github.com/sagetrac-gbe",
    "created_at": "2012-01-12T19:44:46Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/12302",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "008080",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12302#event-141483"
}
```



---

archive/issue_comments_135619.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -41,7 +41,7 @@\n sage: vx = v(y=0)\n ```\n \n-Now, if every entry still has a variable everything, including positional rather than named arguments work. \n+Now, if every entry still has a variable everything, including positional rather than named arguments, works. \n \n ```\n sage: v(x, y) = [x+y, x-y]\n``````\n",
    "created_at": "2012-01-12T21:13:37Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/12302",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12302#issuecomment-135619",
    "user": "https://github.com/sagetrac-gbe"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -41,7 +41,7 @@
 sage: vx = v(y=0)
 ```
 
-Now, if every entry still has a variable everything, including positional rather than named arguments work. 
+Now, if every entry still has a variable everything, including positional rather than named arguments, works. 
 
 ```
 sage: v(x, y) = [x+y, x-y]
``````




---

archive/issue_comments_135620.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -18,7 +18,7 @@\n TypeError\n ```\n \n-**This is because *all* evaluation, even if partial, of a callable vector function returns a Vector_symbolic_dense.**\n+**This is because *all* evaluation, even if partial, of a callable vector function returns a Vector_symbolic_dense.** The relevant function _ `_call_` _() is defined in free_module_element.pyx.\n \n The fix, of course, is to make the code intelligent enough to know that an evaluation is only partial -- one hopes that ``type(vx)`` would return 'sage.modules.vector_callable_symbolic_dense.Vector_callable_symbolic_dense'> rather than 'sage.modules.vector_symbolic_dense.Vector_symbolic_dense'>\n \n``````\n",
    "created_at": "2012-01-12T21:19:23Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/12302",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12302#issuecomment-135620",
    "user": "https://github.com/sagetrac-gbe"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -18,7 +18,7 @@
 TypeError
 ```
 
-**This is because *all* evaluation, even if partial, of a callable vector function returns a Vector_symbolic_dense.**
+**This is because *all* evaluation, even if partial, of a callable vector function returns a Vector_symbolic_dense.** The relevant function _ `_call_` _() is defined in free_module_element.pyx.
 
 The fix, of course, is to make the code intelligent enough to know that an evaluation is only partial -- one hopes that ``type(vx)`` would return 'sage.modules.vector_callable_symbolic_dense.Vector_callable_symbolic_dense'> rather than 'sage.modules.vector_symbolic_dense.Vector_symbolic_dense'>
 
``````




---

archive/issue_events_141484.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2013-08-13T15:35:53Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/12302",
    "milestone_number": null,
    "milestone_title": "sage-5.11",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12302#event-141484"
}
```



---

archive/issue_events_141485.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2013-08-13T15:35:53Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/12302",
    "milestone_number": null,
    "milestone_title": "sage-5.12",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12302#event-141485"
}
```



---

archive/issue_events_141486.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-01-30T21:20:52Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/12302",
    "milestone_number": null,
    "milestone_title": "sage-6.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12302#event-141486"
}
```



---

archive/issue_events_141487.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-01-30T21:20:52Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/12302",
    "milestone_number": null,
    "milestone_title": "sage-6.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12302#event-141487"
}
```



---

archive/issue_events_141488.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-05-06T15:20:58Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/12302",
    "milestone_number": null,
    "milestone_title": "sage-6.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12302#event-141488"
}
```



---

archive/issue_events_141489.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-05-06T15:20:58Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/12302",
    "milestone_number": null,
    "milestone_title": "sage-6.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12302#event-141489"
}
```



---

archive/issue_events_141490.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-08-10T16:51:03Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/12302",
    "milestone_number": null,
    "milestone_title": "sage-6.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12302#event-141490"
}
```



---

archive/issue_events_141491.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-08-10T16:51:03Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/12302",
    "milestone_number": null,
    "milestone_title": "sage-6.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12302#event-141491"
}
```
