# Issue 12302: Partial evaluation bug for callable vector functions

archive/issues_012130.json:
```json
{
    "assignees": [
        "https://github.com/sagetrac-gbe"
    ],
    "body": "For callable (scalar) functions, taking sections (partial evaluation) of functions works perfectly fine; that is to say the following code works perfectly as expected:\n\n```\nsage: f(x,y,z) = x*y*z; f\n(x, y, z) |--> x*y*z\nsage: g(x, z) = f(y=1); g\n(x, z) |--> x*z\n```\n\nMove up to callable vector functions and taking sections breaks however:\n\n```\nsage: v(x, y) = [x+y, x-y]; v\n(x, y) |--> (x + y, x - y)\nsage: v(x,0)\n(x, x)\nsage: w(x) = v(y=0)\nTypeError\n```\n\n**This is because *all* evaluation, even if partial, of a callable vector function returns a Vector_symbolic_dense.** The relevant function _ `_call_` _() is defined in free_module_element.pyx.\n\nThe fix, of course, is to make the code intelligent enough to know that an evaluation is only partial -- one hopes that ``type(vx)`` would return 'sage.modules.vector_callable_symbolic_dense.Vector_callable_symbolic_dense'> rather than 'sage.modules.vector_symbolic_dense.Vector_symbolic_dense'>\n\n```\nsage: v(x, y) = [x+y, x-y]\nsage: type(v)\n<class 'sage.modules.vector_callable_symbolic_dense.Vector_callable_symbolic_dense'>\nsage: vx = v(y=0); vx\n(x,x)\nsage: type(vx)\n<class 'sage.modules.vector_symbolic_dense.Vector_symbolic_dense'>\n```\n\n**Work-around**\n\nThis isn't *so* bad since we can still do:\n\n```\nsage: v(x, y) = [x+y, x-y]\nsage: vx = v(y=0)\n```\n\nNow, if every entry still has a variable everything, including positional rather than named arguments, works. \n\n```\nsage: v(x, y) = [x+y, x-y]\nsage: vx = v(y=0)\nsage: vx(x=1)\n(1, 1)\nsage: vx(1) #deprecated, but works fine\n```\n\nHowever, things break if taking a section kills off all variables in any component we try to use positional arguments:\n\n```\nsage: v(x, y) = [x+y, x-y]\nsage: vy = v(y=x)\nsage: vy\n(2*x, 0)\nsage: vx\n(x, x)\nsage: vy(x=1) #named arguments still work\n(2, 0)\nsage: vy(1) #positional arguments don't\nValueError\n```\n\nCC:  @jasongrout\n\nKeywords: **sd35.5**\n\nComponent: **symbolics**\n\n_Issue created by migration from https://trac.sagemath.org/ticket/12302_\n\n",
    "created_at": "2012-01-12T19:44:46Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/c%3A%20symbolics",
        "https://github.com/sagemath/sage/labels/p%3A%203%20%E2%80%93%20major",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "Partial evaluation bug for callable vector functions",
    "type": "issue",
    "updated_at": "2022-12-29T01:28:25Z",
    "url": "https://github.com/sagemath/sage/issues/12302",
    "user": "https://github.com/sagetrac-gbe"
}
```
For callable (scalar) functions, taking sections (partial evaluation) of functions works perfectly fine; that is to say the following code works perfectly as expected:

```
sage: f(x,y,z) = x*y*z; f
(x, y, z) |--> x*y*z
sage: g(x, z) = f(y=1); g
(x, z) |--> x*z
```

Move up to callable vector functions and taking sections breaks however:

```
sage: v(x, y) = [x+y, x-y]; v
(x, y) |--> (x + y, x - y)
sage: v(x,0)
(x, x)
sage: w(x) = v(y=0)
TypeError
```

**This is because *all* evaluation, even if partial, of a callable vector function returns a Vector_symbolic_dense.** The relevant function _ `_call_` _() is defined in free_module_element.pyx.

The fix, of course, is to make the code intelligent enough to know that an evaluation is only partial -- one hopes that ``type(vx)`` would return 'sage.modules.vector_callable_symbolic_dense.Vector_callable_symbolic_dense'> rather than 'sage.modules.vector_symbolic_dense.Vector_symbolic_dense'>

```
sage: v(x, y) = [x+y, x-y]
sage: type(v)
<class 'sage.modules.vector_callable_symbolic_dense.Vector_callable_symbolic_dense'>
sage: vx = v(y=0); vx
(x,x)
sage: type(vx)
<class 'sage.modules.vector_symbolic_dense.Vector_symbolic_dense'>
```

**Work-around**

This isn't *so* bad since we can still do:

```
sage: v(x, y) = [x+y, x-y]
sage: vx = v(y=0)
```

Now, if every entry still has a variable everything, including positional rather than named arguments, works. 

```
sage: v(x, y) = [x+y, x-y]
sage: vx = v(y=0)
sage: vx(x=1)
(1, 1)
sage: vx(1) #deprecated, but works fine
```

However, things break if taking a section kills off all variables in any component we try to use positional arguments:

```
sage: v(x, y) = [x+y, x-y]
sage: vy = v(y=x)
sage: vy
(2*x, 0)
sage: vx
(x, x)
sage: vy(x=1) #named arguments still work
(2, 0)
sage: vy(1) #positional arguments don't
ValueError
```

CC:  @jasongrout

Keywords: **sd35.5**

Component: **symbolics**

_Issue created by migration from https://trac.sagemath.org/ticket/12302_





---

archive/issue_events_167555.json:
```json
{
    "actor": "https://github.com/sagetrac-gbe",
    "created_at": "2012-01-12T19:44:46Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/12302",
    "milestone_number": null,
    "milestone_title": "sage-5.11",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12302#event-167555"
}
```



---

archive/issue_events_167556.json:
```json
{
    "actor": "https://github.com/sagetrac-gbe",
    "created_at": "2012-01-12T19:44:46Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/12302",
    "label": "https://github.com/sagemath/sage/labels/c%3A%20symbolics",
    "label_color": "0000ff",
    "label_name": "c: symbolics",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12302#event-167556"
}
```



---

archive/issue_events_167557.json:
```json
{
    "actor": "https://github.com/sagetrac-gbe",
    "created_at": "2012-01-12T19:44:46Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/12302",
    "label": "https://github.com/sagemath/sage/labels/p%3A%203%20%E2%80%93%20major",
    "label_color": "ffbb00",
    "label_name": "p: 3 \u2013 major",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12302#event-167557"
}
```



---

archive/issue_events_167558.json:
```json
{
    "actor": "https://github.com/sagetrac-gbe",
    "created_at": "2012-01-12T19:44:46Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/12302",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "d73a4a",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12302#event-167558"
}
```



---

archive/issue_events_167559.json:
```json
{
    "actor": "https://github.com/sagetrac-gbe",
    "created_at": "2012-01-12T19:44:46Z",
    "event": "assigned",
    "issue": "https://github.com/sagemath/sage/issues/12302",
    "subject": "https://github.com/sagetrac-gbe",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12302#event-167559"
}
```



---

archive/issue_comments_133413.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -41,7 +41,7 @@\n sage: vx = v(y=0)\n ```\n \n-Now, if every entry still has a variable everything, including positional rather than named arguments work. \n+Now, if every entry still has a variable everything, including positional rather than named arguments, works. \n \n ```\n sage: v(x, y) = [x+y, x-y]\n``````\n",
    "created_at": "2012-01-12T21:13:37Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/12302",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12302#issuecomment-133413",
    "user": "https://github.com/sagetrac-gbe"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -41,7 +41,7 @@
 sage: vx = v(y=0)
 ```
 
-Now, if every entry still has a variable everything, including positional rather than named arguments work. 
+Now, if every entry still has a variable everything, including positional rather than named arguments, works. 
 
 ```
 sage: v(x, y) = [x+y, x-y]
``````




---

archive/issue_comments_133414.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -18,7 +18,7 @@\n TypeError\n ```\n \n-**This is because *all* evaluation, even if partial, of a callable vector function returns a Vector_symbolic_dense.**\n+**This is because *all* evaluation, even if partial, of a callable vector function returns a Vector_symbolic_dense.** The relevant function _ `_call_` _() is defined in free_module_element.pyx.\n \n The fix, of course, is to make the code intelligent enough to know that an evaluation is only partial -- one hopes that ``type(vx)`` would return 'sage.modules.vector_callable_symbolic_dense.Vector_callable_symbolic_dense'> rather than 'sage.modules.vector_symbolic_dense.Vector_symbolic_dense'>\n \n``````\n",
    "created_at": "2012-01-12T21:19:23Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/12302",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/12302#issuecomment-133414",
    "user": "https://github.com/sagetrac-gbe"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -18,7 +18,7 @@
 TypeError
 ```
 
-**This is because *all* evaluation, even if partial, of a callable vector function returns a Vector_symbolic_dense.**
+**This is because *all* evaluation, even if partial, of a callable vector function returns a Vector_symbolic_dense.** The relevant function _ `_call_` _() is defined in free_module_element.pyx.
 
 The fix, of course, is to make the code intelligent enough to know that an evaluation is only partial -- one hopes that ``type(vx)`` would return 'sage.modules.vector_callable_symbolic_dense.Vector_callable_symbolic_dense'> rather than 'sage.modules.vector_symbolic_dense.Vector_symbolic_dense'>
 
``````




---

archive/issue_events_167560.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2013-08-13T15:35:53Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/12302",
    "milestone_number": null,
    "milestone_title": "sage-5.11",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12302#event-167560"
}
```



---

archive/issue_events_167561.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2013-08-13T15:35:53Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/12302",
    "milestone_number": null,
    "milestone_title": "sage-5.12",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12302#event-167561"
}
```



---

archive/issue_events_167562.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-01-30T21:20:52Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/12302",
    "milestone_number": null,
    "milestone_title": "sage-6.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12302#event-167562"
}
```



---

archive/issue_events_167563.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-01-30T21:20:52Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/12302",
    "milestone_number": null,
    "milestone_title": "sage-6.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12302#event-167563"
}
```



---

archive/issue_events_167564.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-05-06T15:20:58Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/12302",
    "milestone_number": null,
    "milestone_title": "sage-6.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12302#event-167564"
}
```



---

archive/issue_events_167565.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-05-06T15:20:58Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/12302",
    "milestone_number": null,
    "milestone_title": "sage-6.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12302#event-167565"
}
```



---

archive/issue_events_167566.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-08-10T16:51:03Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/12302",
    "milestone_number": null,
    "milestone_title": "sage-6.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12302#event-167566"
}
```



---

archive/issue_events_167567.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-08-10T16:51:03Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/12302",
    "milestone_number": null,
    "milestone_title": "sage-6.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12302#event-167567"
}
```



---

archive/issue_events_167568.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-12-29T01:28:25Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/12302",
    "milestone_number": null,
    "milestone_title": "sage-6.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/12302#event-167568"
}
```
