# Issue 7712: error with polynomial with interval coefficients

archive/issues_007712.json:
```json
{
    "assignees": [],
    "body": "Consider the following example:\n\n```\nsage: P.<y,z> = PolynomialRing(RealIntervalField(2))\nsage: Q.<x> = PolynomialRing(P)\nsage: C = (y-x)^3\nsage: C(y/2)\n0\n```\nI do not understand why the result is 0. In fact there are two\nerrors:\n(i) the result is a polynomial of degree 3 in y, thus y<sup>3</sup> should appear\n(ii) the result should \"contain\" the exact result which is 0.125*y<sup>3</sup>, thus it should be c*y<sup>3</sup> where c is an interval containing\n0.125. Compare the following with a precision of 10 bits:\n\n```\nsage: P.<y,z> = PolynomialRing(RealIntervalField(10))\nsage: Q.<x> = PolynomialRing(P)\nsage: C = (y-x)^3\nsage: C(y/2)\n0.12500?*y^3\n```\n\nDepends on #13760\n\n**Assignee:** @aghitza\n\n**CC:**  kohel\n\n**Reviewer:** Travis Scrimshaw\n\nIssue created by migration from https://trac.sagemath.org/ticket/7712\n\n",
    "closed_at": "2012-12-21T22:49:33Z",
    "created_at": "2009-12-16T13:01:54Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20basic%20arithmetic",
        "https://github.com/sagemath/sage/labels/bug",
        "https://github.com/sagemath/sage/labels/duplicate"
    ],
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "error with polynomial with interval coefficients",
    "type": "issue",
    "updated_at": "2012-12-21T22:49:33Z",
    "url": "https://github.com/sagemath/sage/issues/7712",
    "user": "https://github.com/zimmermann6"
}
```
Consider the following example:

```
sage: P.<y,z> = PolynomialRing(RealIntervalField(2))
sage: Q.<x> = PolynomialRing(P)
sage: C = (y-x)^3
sage: C(y/2)
0
```
I do not understand why the result is 0. In fact there are two
errors:
(i) the result is a polynomial of degree 3 in y, thus y<sup>3</sup> should appear
(ii) the result should "contain" the exact result which is 0.125*y<sup>3</sup>, thus it should be c*y<sup>3</sup> where c is an interval containing
0.125. Compare the following with a precision of 10 bits:

```
sage: P.<y,z> = PolynomialRing(RealIntervalField(10))
sage: Q.<x> = PolynomialRing(P)
sage: C = (y-x)^3
sage: C(y/2)
0.12500?*y^3
```

Depends on #13760

**Assignee:** @aghitza

**CC:**  kohel

**Reviewer:** Travis Scrimshaw

Issue created by migration from https://trac.sagemath.org/ticket/7712





---

archive/issue_comments_059495.json:
```json
{
    "body": "<a id='comment:1'></a>\nIt seems it just a printing issue:\n\n```\nsage: r = C(y/2)\nsage: r\n0\nsage: r.monomials()\n[y^3]\nsage: r.monomial_coefficient(y^3).str(style='brackets')\n'[-0.00 .. 0.25]'\n```",
    "created_at": "2009-12-16T14:09:01Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/7712",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/7712#issuecomment-59495",
    "user": "https://github.com/sagetrac-ylchapuy"
}
```

<a id='comment:1'></a>
It seems it just a printing issue:

```
sage: r = C(y/2)
sage: r
0
sage: r.monomials()
[y^3]
sage: r.monomial_coefficient(y^3).str(style='brackets')
'[-0.00 .. 0.25]'
```



---

archive/issue_comments_059496.json:
```json
{
    "body": "<a id='comment:2'></a>\nIndeed:\n\n```\nsage: R=RealIntervalField(2)\nsage: r=R(-0.00,0.25)\nsage: r.str(style='brackets')\n'[-0.00 .. 0.25]'\nsage: r\n1.?\nsage: r*x\n0\n```\nI thus changed the summary.",
    "created_at": "2009-12-16T14:18:36Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/7712",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/7712#issuecomment-59496",
    "user": "https://github.com/zimmermann6"
}
```

<a id='comment:2'></a>
Indeed:

```
sage: R=RealIntervalField(2)
sage: r=R(-0.00,0.25)
sage: r.str(style='brackets')
'[-0.00 .. 0.25]'
sage: r
1.?
sage: r*x
0
```
I thus changed the summary.



---

archive/issue_events_053013.json:
```json
{
    "actor": "https://github.com/zimmermann6",
    "created_at": "2009-12-16T14:18:36Z",
    "event": "renamed",
    "issue": "https://github.com/sagemath/sage/issues/7712",
    "rename": {
        "from": "error in polynomial substitution with interval coefficients",
        "to": "error in printing interval coefficients (together with variables)"
    },
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/7712#event-53013"
}
```



---

archive/issue_comments_059497.json:
```json
{
    "body": "<a id='comment:3'></a>\nHere is a more complex example, which shows this is not only a printing issue:\n\n```\ndef method2(prec):\n   n=[0,9,7,8,11,6,3,7,6,6,4,3,4,1,2,2,1,1,1,2,0,0,0,3,0,0,0,0,1]\n   R = RealIntervalField(prec)\n   P.<xk1,sk1,sk2> = PolynomialRing(R)\n   Q.<xk> = PolynomialRing(P)\n   C = (sk1-xk)^n[1]*xk^n[2]\n   C=C.integral()\n   C=C(sk1/2)-C(xk1)\n   C=R(10^6)*C.subs(sk1=sk2-xk1)\n   C=C.subs(xk1=xk,sk2=sk1)\n   for k in range(3,29):\n      C=C*xk^n[k]\n      C=C.integral()\n      C=C(sk1/k)-C(xk1)\n      C=R(10^6)*C.subs(sk1=sk2-xk1)\n      C=C.subs(xk1=xk,sk2=sk1)\n   C=C.subs(xk=R(0),sk1=R(1))\n   return C(0,0,0)\n\nsage: method2(391)\n0\nsage: _.parent() \nInteger Ring\n\nsage: method2(392)\n1.?e-8\nsage: _.parent()\nReal Interval Field with 392 bits of precision\n```\nNormally, both calls should return an object of type \"Real Interval Field\", isn't it?\n(If necessary, I can open a different trac ticket for both issues.)",
    "created_at": "2009-12-17T09:22:10Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/7712",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/7712#issuecomment-59497",
    "user": "https://github.com/zimmermann6"
}
```

<a id='comment:3'></a>
Here is a more complex example, which shows this is not only a printing issue:

```
def method2(prec):
   n=[0,9,7,8,11,6,3,7,6,6,4,3,4,1,2,2,1,1,1,2,0,0,0,3,0,0,0,0,1]
   R = RealIntervalField(prec)
   P.<xk1,sk1,sk2> = PolynomialRing(R)
   Q.<xk> = PolynomialRing(P)
   C = (sk1-xk)^n[1]*xk^n[2]
   C=C.integral()
   C=C(sk1/2)-C(xk1)
   C=R(10^6)*C.subs(sk1=sk2-xk1)
   C=C.subs(xk1=xk,sk2=sk1)
   for k in range(3,29):
      C=C*xk^n[k]
      C=C.integral()
      C=C(sk1/k)-C(xk1)
      C=R(10^6)*C.subs(sk1=sk2-xk1)
      C=C.subs(xk1=xk,sk2=sk1)
   C=C.subs(xk=R(0),sk1=R(1))
   return C(0,0,0)

sage: method2(391)
0
sage: _.parent() 
Integer Ring

sage: method2(392)
1.?e-8
sage: _.parent()
Real Interval Field with 392 bits of precision
```
Normally, both calls should return an object of type "Real Interval Field", isn't it?
(If necessary, I can open a different trac ticket for both issues.)



---

archive/issue_events_053014.json:
```json
{
    "actor": "https://github.com/zimmermann6",
    "created_at": "2009-12-17T09:22:10Z",
    "event": "renamed",
    "issue": "https://github.com/sagemath/sage/issues/7712",
    "rename": {
        "from": "error in printing interval coefficients (together with variables)",
        "to": "error with polynomial with interval coefficients"
    },
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/7712#event-53014"
}
```



---

archive/issue_events_053015.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2009-12-24T07:08:08Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/7712",
    "milestone_number": null,
    "milestone_title": "sage-4.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/7712#event-53015"
}
```



---

archive/issue_events_053016.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2009-12-24T07:08:08Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/7712",
    "milestone_number": null,
    "milestone_title": "sage-4.3.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/7712#event-53016"
}
```



---

archive/issue_comments_059498.json:
```json
{
    "body": "<a id='comment:4'></a>\nI'm declaring a total feature freeze on sage-4.3.",
    "created_at": "2009-12-24T07:08:08Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/7712",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/7712#issuecomment-59498",
    "user": "https://github.com/williamstein"
}
```

<a id='comment:4'></a>
I'm declaring a total feature freeze on sage-4.3.



---

archive/issue_comments_059499.json:
```json
{
    "body": "<a id='comment:5'></a>\nStill there in 4.3.1.",
    "created_at": "2010-02-05T20:22:08Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/7712",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/7712#issuecomment-59499",
    "user": "https://github.com/zimmermann6"
}
```

<a id='comment:5'></a>
Still there in 4.3.1.



---

archive/issue_events_053017.json:
```json
{
    "actor": "https://github.com/sagetrac-ylchapuy",
    "created_at": "2010-03-12T08:33:04Z",
    "event": "renamed",
    "issue": "https://github.com/sagemath/sage/issues/7712",
    "rename": {
        "from": "error with polynomial with interval coefficients",
        "to": "_"
    },
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/7712#event-53017"
}
```



---

archive/issue_comments_059500.json:
```json
{
    "body": "<a id='comment:6'></a>\nReplying to [@zimmermann6](#comment%3A3):\n>    C=C.subs(xk=R(0),sk1=R(1))\n\nThe two polynomials obtained here are constants.\nThe strange behaviour about the type comes from line 153 of\n\n`sage/rings/polynomial/multi_polynomial_element.py`\n\nwhere we find:\n\n```\n        try:\n            K = x[0].parent()     <<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<\n        except AttributeError:\n            K = self.parent().base_ring()\n        y = K(0) \n        for (m,c) in self.element().dict().iteritems():  \n            y += c*misc.mul([ x[i]**m[i] for i in range(n) if m[i] != 0])\n```\n\nI don't know exactly why, but It first try to take the type of the first input (here Integer 0) and this type is then changed only by coercion when doing the computation.\n\nWith precision 391 the polynomial is null and no operations are performed, so the results stays Integer.\n\nI would say this is a bug but maybe there is a purpose behind this.",
    "created_at": "2010-03-12T08:33:04Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/7712",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/7712#issuecomment-59500",
    "user": "https://github.com/sagetrac-ylchapuy"
}
```

<a id='comment:6'></a>
Replying to [@zimmermann6](#comment%3A3):
>    C=C.subs(xk=R(0),sk1=R(1))

The two polynomials obtained here are constants.
The strange behaviour about the type comes from line 153 of

`sage/rings/polynomial/multi_polynomial_element.py`

where we find:

```
        try:
            K = x[0].parent()     <<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
        except AttributeError:
            K = self.parent().base_ring()
        y = K(0) 
        for (m,c) in self.element().dict().iteritems():  
            y += c*misc.mul([ x[i]**m[i] for i in range(n) if m[i] != 0])
```

I don't know exactly why, but It first try to take the type of the first input (here Integer 0) and this type is then changed only by coercion when doing the computation.

With precision 391 the polynomial is null and no operations are performed, so the results stays Integer.

I would say this is a bug but maybe there is a purpose behind this.



---

archive/issue_events_053018.json:
```json
{
    "actor": "https://github.com/sagetrac-ylchapuy",
    "created_at": "2010-03-12T08:33:35Z",
    "event": "renamed",
    "issue": "https://github.com/sagemath/sage/issues/7712",
    "rename": {
        "from": "_",
        "to": "error with polynomial with interval coefficients"
    },
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/7712#event-53018"
}
```



---

archive/issue_comments_059501.json:
```json
{
    "body": "<a id='comment:8'></a>\nYann, are you sure this method `__call__` is called? I've added a print statement before\n`y=K(0)` and nothing is printed (in 4.3.3). I add David in cc, maybe he can help us.",
    "created_at": "2010-03-12T08:53:19Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/7712",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/7712#issuecomment-59501",
    "user": "https://github.com/zimmermann6"
}
```

<a id='comment:8'></a>
Yann, are you sure this method `__call__` is called? I've added a print statement before
`y=K(0)` and nothing is printed (in 4.3.3). I add David in cc, maybe he can help us.



---

archive/issue_comments_059502.json:
```json
{
    "body": "<a id='comment:9'></a>\nSorry, my last comment was not clear. The method call is called when you do `return C(0,0,0)`.",
    "created_at": "2010-03-12T09:15:52Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/7712",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/7712#issuecomment-59502",
    "user": "https://github.com/sagetrac-ylchapuy"
}
```

<a id='comment:9'></a>
Sorry, my last comment was not clear. The method call is called when you do `return C(0,0,0)`.



---

archive/issue_comments_059503.json:
```json
{
    "body": "<a id='comment:10'></a>\n> Sorry, my last comment was not clear. The method call is called when you do return C(0,0,0). \n\nwith `C(0,0,0)` I see no problem:\n\n```\nsage: P.<y,z> = PolynomialRing(RealIntervalField(2))\nsage: Q.<x> = PolynomialRing(P)\nsage: C = (y-x)^3\nsage: a=C(0,0,0)\nsage: type(a)\n<type 'sage.rings.real_mpfi.RealIntervalFieldElement'>\nsage: a.lower()\n0.00\nsage: a.upper()\n0.00\n```",
    "created_at": "2010-03-12T09:22:26Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/7712",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/7712#issuecomment-59503",
    "user": "https://github.com/zimmermann6"
}
```

<a id='comment:10'></a>
> Sorry, my last comment was not clear. The method call is called when you do return C(0,0,0). 

with `C(0,0,0)` I see no problem:

```
sage: P.<y,z> = PolynomialRing(RealIntervalField(2))
sage: Q.<x> = PolynomialRing(P)
sage: C = (y-x)^3
sage: a=C(0,0,0)
sage: type(a)
<type 'sage.rings.real_mpfi.RealIntervalFieldElement'>
sage: a.lower()
0.00
sage: a.upper()
0.00
```



---

archive/issue_comments_059504.json:
```json
{
    "body": "<a id='comment:11'></a>\nHere is my point:\n\n```\nsage: def method2(prec):\n....:        n=[0,9,7,8,11,6,3,7,6,6,4,3,4,1,2,2,1,1,1,2,0,0,0,3,0,0,0,0,1]\n....:    R = RealIntervalField(prec)\n....:    P.<xk1,sk1,sk2> = PolynomialRing(R)\n....:    Q.<xk> = PolynomialRing(P)\n....:    C = (sk1-xk)^n[1]*xk^n[2]\n....:    C=C.integral()\n....:    C=C(sk1/2)-C(xk1)\n....:    C=R(10^6)*C.subs(sk1=sk2-xk1)\n....:    C=C.subs(xk1=xk,sk2=sk1)\n....:    for k in range(3,29):\n....:           C=C*xk^n[k]\n....:       C=C.integral()\n....:       C=C(sk1/k)-C(xk1)\n....:       C=R(10^6)*C.subs(sk1=sk2-xk1)\n....:       C=C.subs(xk1=xk,sk2=sk1)\n....:    C=C.subs(xk=R(0),sk1=R(1))\n....:    return C\n....: \nsage: C391 = method2(391)\nsage: C391\n0\nsage: type(C391)\n<class 'sage.rings.polynomial.multi_polynomial_element.MPolynomial_polydict'>\nsage: type(C391(0,0,0))\n<type 'sage.rings.integer.Integer'>\nsage: type(C391(GF(17)['z'](0),0,0))\n<type 'sage.rings.polynomial.polynomial_zmod_flint.Polynomial_zmod_flint'>\n```",
    "created_at": "2010-03-12T09:34:11Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/7712",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/7712#issuecomment-59504",
    "user": "https://github.com/sagetrac-ylchapuy"
}
```

<a id='comment:11'></a>
Here is my point:

```
sage: def method2(prec):
....:        n=[0,9,7,8,11,6,3,7,6,6,4,3,4,1,2,2,1,1,1,2,0,0,0,3,0,0,0,0,1]
....:    R = RealIntervalField(prec)
....:    P.<xk1,sk1,sk2> = PolynomialRing(R)
....:    Q.<xk> = PolynomialRing(P)
....:    C = (sk1-xk)^n[1]*xk^n[2]
....:    C=C.integral()
....:    C=C(sk1/2)-C(xk1)
....:    C=R(10^6)*C.subs(sk1=sk2-xk1)
....:    C=C.subs(xk1=xk,sk2=sk1)
....:    for k in range(3,29):
....:           C=C*xk^n[k]
....:       C=C.integral()
....:       C=C(sk1/k)-C(xk1)
....:       C=R(10^6)*C.subs(sk1=sk2-xk1)
....:       C=C.subs(xk1=xk,sk2=sk1)
....:    C=C.subs(xk=R(0),sk1=R(1))
....:    return C
....: 
sage: C391 = method2(391)
sage: C391
0
sage: type(C391)
<class 'sage.rings.polynomial.multi_polynomial_element.MPolynomial_polydict'>
sage: type(C391(0,0,0))
<type 'sage.rings.integer.Integer'>
sage: type(C391(GF(17)['z'](0),0,0))
<type 'sage.rings.polynomial.polynomial_zmod_flint.Polynomial_zmod_flint'>
```



---

archive/issue_comments_059505.json:
```json
{
    "body": "<a id='comment:12'></a>\n> Here is my point: [...]\n\nok, I thought you were speaking about the first (smaller) examples. I can reduce this second\nproblem to the following:\n\n```\nsage: R.<x,y> = PolynomialRing(RR)\nsage: f=R(1); type(f(0,0))\n<type 'sage.rings.real_mpfr.RealNumber'>\nsage: f=R(0); type(f(0,0))\n<type 'sage.rings.integer.Integer'>\n```\nDavid, please can you explain why it is so?",
    "created_at": "2010-03-12T15:15:02Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/7712",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/7712#issuecomment-59505",
    "user": "https://github.com/zimmermann6"
}
```

<a id='comment:12'></a>
> Here is my point: [...]

ok, I thought you were speaking about the first (smaller) examples. I can reduce this second
problem to the following:

```
sage: R.<x,y> = PolynomialRing(RR)
sage: f=R(1); type(f(0,0))
<type 'sage.rings.real_mpfr.RealNumber'>
sage: f=R(0); type(f(0,0))
<type 'sage.rings.integer.Integer'>
```
David, please can you explain why it is so?



---

archive/issue_comments_059506.json:
```json
{
    "body": "<a id='comment:13'></a>\nI didn't see this ticket when submitting the new ticket #13760. There I provide a patch that corrects this bug. The two tickets should be merged (and probably closed after review of the patch).",
    "created_at": "2012-12-06T10:35:35Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/7712",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/7712#issuecomment-59506",
    "user": "https://github.com/sagetrac-gmoroz"
}
```

<a id='comment:13'></a>
I didn't see this ticket when submitting the new ticket #13760. There I provide a patch that corrects this bug. The two tickets should be merged (and probably closed after review of the patch).



---

archive/issue_comments_059507.json:
```json
{
    "body": "**Attachment:** [trac_7712_regression_tests_for_13760_fix.patch.gz](https://github.com/sagemath/sage/files/ticket7712/trac_7712_regression_tests_for_13760_fix.patch.gz)\n\nTests should work after applying trac 13760 patch",
    "created_at": "2012-12-13T11:20:16Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/7712",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/7712#issuecomment-59507",
    "user": "https://github.com/sagetrac-gmoroz"
}
```

**Attachment:** [trac_7712_regression_tests_for_13760_fix.patch.gz](https://github.com/sagemath/sage/files/ticket7712/trac_7712_regression_tests_for_13760_fix.patch.gz)

Tests should work after applying trac 13760 patch



---

archive/issue_comments_059508.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -9,8 +9,8 @@\n ```\n I do not understand why the result is 0. In fact there are two\n errors:\n-(i) the result is a polynomial of degree 3 in y, thus y**3 should appear\n-(ii) the result should \"contain\" the exact result which is 0.125*y**3, thus it should be c*y**3 where c is an interval containing\n+(i) the result is a polynomial of degree 3 in y, thus y<sup>3</sup> should appear\n+(ii) the result should \"contain\" the exact result which is 0.125*y<sup>3</sup>, thus it should be c*y<sup>3</sup> where c is an interval containing\n 0.125. Compare the following with a precision of 10 bits:\n \n ```\n``````\n",
    "created_at": "2012-12-14T08:10:48Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/7712",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/7712#issuecomment-59508",
    "user": "https://github.com/zimmermann6"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -9,8 +9,8 @@
 ```
 I do not understand why the result is 0. In fact there are two
 errors:
-(i) the result is a polynomial of degree 3 in y, thus y**3 should appear
-(ii) the result should "contain" the exact result which is 0.125*y**3, thus it should be c*y**3 where c is an interval containing
+(i) the result is a polynomial of degree 3 in y, thus y<sup>3</sup> should appear
+(ii) the result should "contain" the exact result which is 0.125*y<sup>3</sup>, thus it should be c*y<sup>3</sup> where c is an interval containing
 0.125. Compare the following with a precision of 10 bits:
 
 ```
``````




---

archive/issue_events_053019.json:
```json
{
    "actor": "https://github.com/sagetrac-gmoroz",
    "created_at": "2012-12-14T09:50:44Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/7712",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "008080",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/7712#event-53019"
}
```



---

archive/issue_comments_059509.json:
```json
{
    "body": "**Dependencies:** #13760",
    "created_at": "2012-12-14T17:16:27Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/7712",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/7712#issuecomment-59509",
    "user": "https://github.com/zimmermann6"
}
```

**Dependencies:** #13760



---

archive/issue_comments_059510.json:
```json
{
    "body": "<a id='comment:16'></a>\nI propose to mark this as \"duplicate\", since #13760 solves that issue.\n\nPaul",
    "created_at": "2012-12-14T17:16:27Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/7712",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/7712#issuecomment-59510",
    "user": "https://github.com/zimmermann6"
}
```

<a id='comment:16'></a>
I propose to mark this as "duplicate", since #13760 solves that issue.

Paul



---

archive/issue_comments_059511.json:
```json
{
    "body": "<a id='comment:17'></a>\nHey Paul and Guillaume,\n\nFor future reference, just mark the patch as duplicate in the milestone dropdown and set it to *needs_review*.\n\n#13760 does seem to fix the problem:\n\n```\nsage: method2(391)\n0.?e-8\nsage: _.parent()\nReal Interval Field with 391 bits of precision\n```\n\nBest,\n\nTravis",
    "created_at": "2012-12-15T16:37:32Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/7712",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/7712#issuecomment-59511",
    "user": "https://github.com/tscrim"
}
```

<a id='comment:17'></a>
Hey Paul and Guillaume,

For future reference, just mark the patch as duplicate in the milestone dropdown and set it to *needs_review*.

#13760 does seem to fix the problem:

```
sage: method2(391)
0.?e-8
sage: _.parent()
Real Interval Field with 391 bits of precision
```

Best,

Travis



---

archive/issue_events_053020.json:
```json
{
    "actor": "https://github.com/tscrim",
    "created_at": "2012-12-15T16:37:32Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/7712",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "008080",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/7712#event-53020"
}
```



---

archive/issue_events_053021.json:
```json
{
    "actor": "https://github.com/tscrim",
    "created_at": "2012-12-15T16:37:32Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/7712",
    "label": "https://github.com/sagemath/sage/labels/positive%20review",
    "label_color": "008080",
    "label_name": "positive review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/7712#event-53021"
}
```



---

archive/issue_comments_059512.json:
```json
{
    "body": "**Reviewer:** Travis Scrimshaw",
    "created_at": "2012-12-15T16:37:32Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/7712",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/7712#issuecomment-59512",
    "user": "https://github.com/tscrim"
}
```

**Reviewer:** Travis Scrimshaw



---

archive/issue_events_053022.json:
```json
{
    "actor": "https://github.com/tscrim",
    "created_at": "2012-12-15T16:37:32Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/7712",
    "milestone_number": null,
    "milestone_title": "sage-5.6",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/7712#event-53022"
}
```



---

archive/issue_events_053023.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2012-12-21T22:49:33Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/7712",
    "label": "https://github.com/sagemath/sage/labels/duplicate",
    "label_color": "008080",
    "label_name": "duplicate",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/7712#event-53023"
}
```



---

archive/issue_events_053024.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2012-12-21T22:49:33Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/7712",
    "label": "https://github.com/sagemath/sage/labels/positive%20review",
    "label_color": "008080",
    "label_name": "positive review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/7712#event-53024"
}
```



---

archive/issue_events_053025.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2012-12-21T22:49:33Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/7712",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/7712#event-53025"
}
```
