# Issue 2025: bug in applying functions to a symbolic matrix

archive/issues_002025.json:
```json
{
    "assignees": [
        "https://github.com/garyfurnish"
    ],
    "body": "Note below that the stupid constant term of the taylor expansion\ninside the matrix keeps getting pushed off to the far right!\n\n```\nsage: m = matrix(1,[-x/(2*x-4)])\nsage: m.apply_map(lambda e: taylor(e,x,0,4))\n[x^4/32 + x^3/16 + x^2/8 + x/4]\nsage: m.apply_map(lambda e: taylor(e,x,0,4))\n[x^4/32 + x^3/16 + x^2/8 + x/4]\nsage: m.apply_map(lambda e: taylor(e,x,1,4))\n[x + (x - 1)^4 + (x - 1)^3 + (x - 1)^2 - 1/2]\nsage: m.apply_map(lambda e: taylor(e,x,2,4))\n[-1/(x - 2) - 1/2]\nsage: m.apply_map(lambda e: taylor(e,x,3,4))\n[x - (x - 3)^4 + (x - 3)^3 - (x - 3)^2 - 9/2]\nsage: m[0,0].taylor(x,3,4)\n-3/2 + x - 3 - (x - 3)^2 + (x - 3)^3 - (x - 3)^4\n```\n\nComponent: **calculus**\n\n_Issue created by migration from https://trac.sagemath.org/ticket/2025_\n\n",
    "closed_at": "2009-06-04T21:15:47Z",
    "created_at": "2008-02-01T14:02:18Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/bug",
        "https://github.com/sagemath/sage/labels/c%3A%20calculus",
        "https://github.com/sagemath/sage/labels/invalid"
    ],
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "bug in applying functions to a symbolic matrix",
    "type": "issue",
    "updated_at": "2009-06-04T21:15:47Z",
    "url": "https://github.com/sagemath/sage/issues/2025",
    "user": "https://github.com/williamstein"
}
```
Note below that the stupid constant term of the taylor expansion
inside the matrix keeps getting pushed off to the far right!

```
sage: m = matrix(1,[-x/(2*x-4)])
sage: m.apply_map(lambda e: taylor(e,x,0,4))
[x^4/32 + x^3/16 + x^2/8 + x/4]
sage: m.apply_map(lambda e: taylor(e,x,0,4))
[x^4/32 + x^3/16 + x^2/8 + x/4]
sage: m.apply_map(lambda e: taylor(e,x,1,4))
[x + (x - 1)^4 + (x - 1)^3 + (x - 1)^2 - 1/2]
sage: m.apply_map(lambda e: taylor(e,x,2,4))
[-1/(x - 2) - 1/2]
sage: m.apply_map(lambda e: taylor(e,x,3,4))
[x - (x - 3)^4 + (x - 3)^3 - (x - 3)^2 - 9/2]
sage: m[0,0].taylor(x,3,4)
-3/2 + x - 3 - (x - 3)^2 + (x - 3)^3 - (x - 3)^4
```

Component: **calculus**

_Issue created by migration from https://trac.sagemath.org/ticket/2025_





---

archive/issue_events_020391.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2008-02-01T14:02:18Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/2025",
    "milestone_number": null,
    "milestone_title": "sage-4.0.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/2025#event-20391"
}
```



---

archive/issue_events_020392.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2008-02-01T14:02:18Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/2025",
    "label": "https://github.com/sagemath/sage/labels/c%3A%20calculus",
    "label_color": "0000ff",
    "label_name": "c: calculus",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/2025#event-20392"
}
```



---

archive/issue_events_020393.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2008-02-01T14:02:18Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/2025",
    "label": "https://github.com/sagemath/sage/labels/p%3A%203%20%E2%80%93%20major",
    "label_color": "ffbb00",
    "label_name": "p: 3 \u2013 major",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/2025#event-20393"
}
```



---

archive/issue_events_020394.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2008-02-01T14:02:18Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/2025",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "d73a4a",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/2025#event-20394"
}
```



---

archive/issue_events_020395.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2008-02-01T14:02:18Z",
    "event": "assigned",
    "issue": "https://github.com/sagemath/sage/issues/2025",
    "subject": "https://github.com/williamstein",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/2025#event-20395"
}
```



---

archive/issue_comments_009631.json:
```json
{
    "body": "<div id=\"comment:1\" align=\"right\">comment:1</div>\n\nThis is caused by the following.\n\n\n```\nsage: a = -x/(2*x-4)\nsage: e = lambda e: taylor(e,x,3,4)\nsage: b = e(a)._maxima_(); b\nx-(x-3)^4+(x-3)^3-(x-3)^2-9/2\n```\n\n\nI don't know a good/easy way to prevent this from happening.",
    "created_at": "2008-02-02T02:30:57Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/2025",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/2025#issuecomment-9631",
    "user": "https://github.com/mwhansen"
}
```

<div id="comment:1" align="right">comment:1</div>

This is caused by the following.


```
sage: a = -x/(2*x-4)
sage: e = lambda e: taylor(e,x,3,4)
sage: b = e(a)._maxima_(); b
x-(x-3)^4+(x-3)^3-(x-3)^2-9/2
```


I don't know a good/easy way to prevent this from happening.



---

archive/issue_comments_009632.json:
```json
{
    "body": "<div id=\"comment:2\" align=\"right\">comment:2</div>\n\nNote that this issue arises from using Maxima internally for symbolic matrices.  If we use Sage's generic matrices over SR, then this isn't an issue.\n\n\nOne possible fix would be to add a simplify=False option to tell maxima not to use any simplification rules when constructing the object.",
    "created_at": "2008-02-02T02:41:06Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/2025",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/2025#issuecomment-9632",
    "user": "https://github.com/mwhansen"
}
```

<div id="comment:2" align="right">comment:2</div>

Note that this issue arises from using Maxima internally for symbolic matrices.  If we use Sage's generic matrices over SR, then this isn't an issue.


One possible fix would be to add a simplify=False option to tell maxima not to use any simplification rules when constructing the object.



---

archive/issue_events_020396.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2008-03-16T20:10:56Z",
    "event": "unassigned",
    "issue": "https://github.com/sagemath/sage/issues/2025",
    "subject": "https://github.com/garyfurnish",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/2025#event-20396"
}
```



---

archive/issue_events_020397.json:
```json
{
    "actor": "https://github.com/garyfurnish",
    "created_at": "2008-03-16T20:10:56Z",
    "event": "assigned",
    "issue": "https://github.com/sagemath/sage/issues/2025",
    "subject": "https://github.com/garyfurnish",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/2025#event-20397"
}
```



---

archive/issue_comments_009633.json:
```json
{
    "body": "<div id=\"comment:4\" align=\"right\">comment:4</div>\n\nNote that this will be fixed when we switch over to Pynac as symbolic arithmetic won't have a huge overhead.",
    "created_at": "2009-01-22T22:49:41Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/2025",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/2025#issuecomment-9633",
    "user": "https://github.com/mwhansen"
}
```

<div id="comment:4" align="right">comment:4</div>

Note that this will be fixed when we switch over to Pynac as symbolic arithmetic won't have a huge overhead.



---

archive/issue_events_020398.json:
```json
{
    "actor": "https://github.com/mwhansen",
    "created_at": "2009-06-04T21:15:47Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/2025",
    "milestone_number": null,
    "milestone_title": "sage-4.0.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/2025#event-20398"
}
```



---

archive/issue_events_020399.json:
```json
{
    "actor": "https://github.com/mwhansen",
    "created_at": "2009-06-04T21:15:47Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/2025",
    "label": "https://github.com/sagemath/sage/labels/p%3A%203%20%E2%80%93%20major",
    "label_color": "ffbb00",
    "label_name": "p: 3 \u2013 major",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/2025#event-20399"
}
```



---

archive/issue_events_020400.json:
```json
{
    "actor": "https://github.com/mwhansen",
    "created_at": "2009-06-04T21:15:47Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/2025",
    "label": "https://github.com/sagemath/sage/labels/invalid",
    "label_color": "a6a6a6",
    "label_name": "invalid",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/2025#event-20400"
}
```



---

archive/issue_events_020401.json:
```json
{
    "actor": "https://github.com/mwhansen",
    "created_at": "2009-06-04T21:15:47Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/2025",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/2025#event-20401"
}
```



---

archive/issue_comments_009634.json:
```json
{
    "body": "<div id=\"comment:5\" align=\"right\">comment:5</div>\n\nThis is now fixed due to the changes in 4.0\n\n```\n----------------------------------------------------------------------\n| Sage Version 4.0.1.rc1, Release Date: 2009-06-04                   |\n| Type notebook() for the GUI, and license() for information.        |\n----------------------------------------------------------------------\nsage: sage: m = matrix(1,[-x/(2*x-4)])\nsage: sage: m.apply_map(lambda e: taylor(e,x,0,4))\n[1/32*x^4 + 1/16*x^3 + 1/8*x^2 + 1/4*x]\nsage: sage: m.apply_map(lambda e: taylor(e,x,0,4))\n[1/32*x^4 + 1/16*x^3 + 1/8*x^2 + 1/4*x]\nsage: sage: m.apply_map(lambda e: taylor(e,x,1,4))\n[(x - 1)^4 + (x - 1)^3 + (x - 1)^2 + x - 1/2]\nsage: sage: m.apply_map(lambda e: taylor(e,x,2,4))\n[-1/(x - 2) - 1/2]\nsage: sage: m.apply_map(lambda e: taylor(e,x,3,4))\n[-(x - 3)^4 + (x - 3)^3 - (x - 3)^2 + x - 9/2]\nsage: sage: m[0,0].taylor(x,3,4)\n-(x - 3)^4 + (x - 3)^3 - (x - 3)^2 + x - 9/2\n```",
    "created_at": "2009-06-04T21:15:47Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/2025",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/2025#issuecomment-9634",
    "user": "https://github.com/mwhansen"
}
```

<div id="comment:5" align="right">comment:5</div>

This is now fixed due to the changes in 4.0

```
----------------------------------------------------------------------
| Sage Version 4.0.1.rc1, Release Date: 2009-06-04                   |
| Type notebook() for the GUI, and license() for information.        |
----------------------------------------------------------------------
sage: sage: m = matrix(1,[-x/(2*x-4)])
sage: sage: m.apply_map(lambda e: taylor(e,x,0,4))
[1/32*x^4 + 1/16*x^3 + 1/8*x^2 + 1/4*x]
sage: sage: m.apply_map(lambda e: taylor(e,x,0,4))
[1/32*x^4 + 1/16*x^3 + 1/8*x^2 + 1/4*x]
sage: sage: m.apply_map(lambda e: taylor(e,x,1,4))
[(x - 1)^4 + (x - 1)^3 + (x - 1)^2 + x - 1/2]
sage: sage: m.apply_map(lambda e: taylor(e,x,2,4))
[-1/(x - 2) - 1/2]
sage: sage: m.apply_map(lambda e: taylor(e,x,3,4))
[-(x - 3)^4 + (x - 3)^3 - (x - 3)^2 + x - 9/2]
sage: sage: m[0,0].taylor(x,3,4)
-(x - 3)^4 + (x - 3)^3 - (x - 3)^2 + x - 9/2
```
