# Issue 2025: bug in applying functions to a symbolic matrix

archive/issues_002025.json:
```json
{
    "assignees": [],
    "body": "Note below that the stupid constant term of the taylor expansion\ninside the matrix keeps getting pushed off to the far right!\n\n```\nsage: m = matrix(1,[-x/(2*x-4)])\nsage: m.apply_map(lambda e: taylor(e,x,0,4))\n[x^4/32 + x^3/16 + x^2/8 + x/4]\nsage: m.apply_map(lambda e: taylor(e,x,0,4))\n[x^4/32 + x^3/16 + x^2/8 + x/4]\nsage: m.apply_map(lambda e: taylor(e,x,1,4))\n[x + (x - 1)^4 + (x - 1)^3 + (x - 1)^2 - 1/2]\nsage: m.apply_map(lambda e: taylor(e,x,2,4))\n[-1/(x - 2) - 1/2]\nsage: m.apply_map(lambda e: taylor(e,x,3,4))\n[x - (x - 3)^4 + (x - 3)^3 - (x - 3)^2 - 9/2]\nsage: m[0,0].taylor(x,3,4)\n-3/2 + x - 3 - (x - 3)^2 + (x - 3)^3 - (x - 3)^4\n```\n\nAssignee: **@garyfurnish**\n\n_Issue created by migration from https://trac.sagemath.org/ticket/2025_\n\n",
    "closed_at": "2009-06-04T21:15:47Z",
    "created_at": "2008-02-01T14:02:18Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/bug",
        "https://github.com/sagemath/sage/labels/component%3A%20calculus",
        "https://github.com/sagemath/sage/labels/invalid"
    ],
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "bug in applying functions to a symbolic matrix",
    "type": "issue",
    "updated_at": "2009-06-04T21:15:47Z",
    "url": "https://github.com/sagemath/sage/issues/2025",
    "user": "https://github.com/williamstein"
}
```
Note below that the stupid constant term of the taylor expansion
inside the matrix keeps getting pushed off to the far right!

```
sage: m = matrix(1,[-x/(2*x-4)])
sage: m.apply_map(lambda e: taylor(e,x,0,4))
[x^4/32 + x^3/16 + x^2/8 + x/4]
sage: m.apply_map(lambda e: taylor(e,x,0,4))
[x^4/32 + x^3/16 + x^2/8 + x/4]
sage: m.apply_map(lambda e: taylor(e,x,1,4))
[x + (x - 1)^4 + (x - 1)^3 + (x - 1)^2 - 1/2]
sage: m.apply_map(lambda e: taylor(e,x,2,4))
[-1/(x - 2) - 1/2]
sage: m.apply_map(lambda e: taylor(e,x,3,4))
[x - (x - 3)^4 + (x - 3)^3 - (x - 3)^2 - 9/2]
sage: m[0,0].taylor(x,3,4)
-3/2 + x - 3 - (x - 3)^2 + (x - 3)^3 - (x - 3)^4
```

Assignee: **@garyfurnish**

_Issue created by migration from https://trac.sagemath.org/ticket/2025_





---

archive/issue_events_017872.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2008-02-01T14:02:18Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/2025",
    "milestone_number": null,
    "milestone_title": "sage-4.0.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/2025#event-17872"
}
```



---

archive/issue_events_017873.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2008-02-01T14:02:18Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/2025",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20calculus",
    "label_color": "0000ff",
    "label_name": "component: calculus",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/2025#event-17873"
}
```



---

archive/issue_events_017874.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2008-02-01T14:02:18Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/2025",
    "label": "https://github.com/sagemath/sage/labels/p3%20%E2%80%93%20major",
    "label_color": "ffbb00",
    "label_name": "p3 \u2013 major",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/2025#event-17874"
}
```



---

archive/issue_events_017875.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2008-02-01T14:02:18Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/2025",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "d73a4a",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/2025#event-17875"
}
```



---

archive/issue_comments_010178.json:
```json
{
    "body": "<a id='comment:1'>Comment 1:</a>\nThis is caused by the following.\n\n\n```\nsage: a = -x/(2*x-4)\nsage: e = lambda e: taylor(e,x,3,4)\nsage: b = e(a)._maxima_(); b\nx-(x-3)^4+(x-3)^3-(x-3)^2-9/2\n```\n\n\nI don't know a good/easy way to prevent this from happening.",
    "created_at": "2008-02-02T02:30:57Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/2025",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/2025#issuecomment-10178",
    "user": "https://github.com/mwhansen"
}
```

<a id='comment:1'>Comment 1:</a>
This is caused by the following.


```
sage: a = -x/(2*x-4)
sage: e = lambda e: taylor(e,x,3,4)
sage: b = e(a)._maxima_(); b
x-(x-3)^4+(x-3)^3-(x-3)^2-9/2
```


I don't know a good/easy way to prevent this from happening.



---

archive/issue_comments_010179.json:
```json
{
    "body": "<a id='comment:2'>Comment 2:</a>\nNote that this issue arises from using Maxima internally for symbolic matrices.  If we use Sage's generic matrices over SR, then this isn't an issue.\n\n\nOne possible fix would be to add a simplify=False option to tell maxima not to use any simplification rules when constructing the object.",
    "created_at": "2008-02-02T02:41:06Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/2025",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/2025#issuecomment-10179",
    "user": "https://github.com/mwhansen"
}
```

<a id='comment:2'>Comment 2:</a>
Note that this issue arises from using Maxima internally for symbolic matrices.  If we use Sage's generic matrices over SR, then this isn't an issue.


One possible fix would be to add a simplify=False option to tell maxima not to use any simplification rules when constructing the object.



---

archive/issue_comments_010180.json:
```json
{
    "body": "Changed assignee from **@williamstein** to **@garyfurnish**",
    "created_at": "2008-03-16T20:10:56Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/2025",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/2025#issuecomment-10180",
    "user": "https://github.com/garyfurnish"
}
```

Changed assignee from **@williamstein** to **@garyfurnish**



---

archive/issue_comments_010181.json:
```json
{
    "body": "<a id='comment:4'>Comment 4:</a>\nNote that this will be fixed when we switch over to Pynac as symbolic arithmetic won't have a huge overhead.",
    "created_at": "2009-01-22T22:49:41Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/2025",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/2025#issuecomment-10181",
    "user": "https://github.com/mwhansen"
}
```

<a id='comment:4'>Comment 4:</a>
Note that this will be fixed when we switch over to Pynac as symbolic arithmetic won't have a huge overhead.



---

archive/issue_events_017876.json:
```json
{
    "actor": "https://github.com/mwhansen",
    "created_at": "2009-06-04T21:15:47Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/2025",
    "milestone_number": null,
    "milestone_title": "sage-4.0.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/2025#event-17876"
}
```



---

archive/issue_events_017877.json:
```json
{
    "actor": "https://github.com/mwhansen",
    "created_at": "2009-06-04T21:15:47Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/2025",
    "label": "https://github.com/sagemath/sage/labels/p3%20%E2%80%93%20major",
    "label_color": "ffbb00",
    "label_name": "p3 \u2013 major",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/2025#event-17877"
}
```



---

archive/issue_events_017878.json:
```json
{
    "actor": "https://github.com/mwhansen",
    "created_at": "2009-06-04T21:15:47Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/2025",
    "label": "https://github.com/sagemath/sage/labels/invalid",
    "label_color": "a6a6a6",
    "label_name": "invalid",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/2025#event-17878"
}
```



---

archive/issue_events_017879.json:
```json
{
    "actor": "https://github.com/mwhansen",
    "created_at": "2009-06-04T21:15:47Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/2025",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/2025#event-17879"
}
```



---

archive/issue_comments_010182.json:
```json
{
    "body": "<a id='comment:5'>Comment 5:</a>\nThis is now fixed due to the changes in 4.0\n\n```\n----------------------------------------------------------------------\n| Sage Version 4.0.1.rc1, Release Date: 2009-06-04                   |\n| Type notebook() for the GUI, and license() for information.        |\n----------------------------------------------------------------------\nsage: sage: m = matrix(1,[-x/(2*x-4)])\nsage: sage: m.apply_map(lambda e: taylor(e,x,0,4))\n[1/32*x^4 + 1/16*x^3 + 1/8*x^2 + 1/4*x]\nsage: sage: m.apply_map(lambda e: taylor(e,x,0,4))\n[1/32*x^4 + 1/16*x^3 + 1/8*x^2 + 1/4*x]\nsage: sage: m.apply_map(lambda e: taylor(e,x,1,4))\n[(x - 1)^4 + (x - 1)^3 + (x - 1)^2 + x - 1/2]\nsage: sage: m.apply_map(lambda e: taylor(e,x,2,4))\n[-1/(x - 2) - 1/2]\nsage: sage: m.apply_map(lambda e: taylor(e,x,3,4))\n[-(x - 3)^4 + (x - 3)^3 - (x - 3)^2 + x - 9/2]\nsage: sage: m[0,0].taylor(x,3,4)\n-(x - 3)^4 + (x - 3)^3 - (x - 3)^2 + x - 9/2\n```",
    "created_at": "2009-06-04T21:15:47Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/2025",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/2025#issuecomment-10182",
    "user": "https://github.com/mwhansen"
}
```

<a id='comment:5'>Comment 5:</a>
This is now fixed due to the changes in 4.0

```
----------------------------------------------------------------------
| Sage Version 4.0.1.rc1, Release Date: 2009-06-04                   |
| Type notebook() for the GUI, and license() for information.        |
----------------------------------------------------------------------
sage: sage: m = matrix(1,[-x/(2*x-4)])
sage: sage: m.apply_map(lambda e: taylor(e,x,0,4))
[1/32*x^4 + 1/16*x^3 + 1/8*x^2 + 1/4*x]
sage: sage: m.apply_map(lambda e: taylor(e,x,0,4))
[1/32*x^4 + 1/16*x^3 + 1/8*x^2 + 1/4*x]
sage: sage: m.apply_map(lambda e: taylor(e,x,1,4))
[(x - 1)^4 + (x - 1)^3 + (x - 1)^2 + x - 1/2]
sage: sage: m.apply_map(lambda e: taylor(e,x,2,4))
[-1/(x - 2) - 1/2]
sage: sage: m.apply_map(lambda e: taylor(e,x,3,4))
[-(x - 3)^4 + (x - 3)^3 - (x - 3)^2 + x - 9/2]
sage: sage: m[0,0].taylor(x,3,4)
-(x - 3)^4 + (x - 3)^3 - (x - 3)^2 + x - 9/2
```
