# Issue 2052: PolyBoRi wrapper incomplete

archive/issues_002052.json:
```json
{
    "body": "Try these:\n\n```\nsage: P.<x0, x1, x2, x3> = BooleanPolynomialRing(4)\nsage: I = P.ideal(x0*x1*x2*x3 + x0*x1*x3 + x0*x1 + x0*x2 + x0)\nsage: I\nIdeal (x0*x1*x2*x3 + x0*x1*x3 + x0*x1 + x0*x2 + x0) of Boolean PolynomialRing in x0, x1, x2, x3\n\nsage: I.groebner_basis(draw_matrices=True)\n*BOOM*\nsage: I.groebner_basis(invert=True)\n*BOOM*\nsage: I.groebner_basis(noro=True)\n*BOOM*\nsage: I.groebner_basis(preprocess_only=True)\n*BOOM*\n```\n\nAssignee: @burcin\n\nKeywords: polybori\n\nResolution: fixed\n\nIssue created by migration from https://trac.sagemath.org/ticket/2052\n\n",
    "closed_at": "2008-02-05T17:35:45Z",
    "created_at": "2008-02-05T11:56:20Z",
    "labels": [
        "component: commutative algebra",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-2.10.2",
    "title": "PolyBoRi wrapper incomplete",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/2052",
    "user": "https://github.com/malb"
}
```
Try these:

```
sage: P.<x0, x1, x2, x3> = BooleanPolynomialRing(4)
sage: I = P.ideal(x0*x1*x2*x3 + x0*x1*x3 + x0*x1 + x0*x2 + x0)
sage: I
Ideal (x0*x1*x2*x3 + x0*x1*x3 + x0*x1 + x0*x2 + x0) of Boolean PolynomialRing in x0, x1, x2, x3

sage: I.groebner_basis(draw_matrices=True)
*BOOM*
sage: I.groebner_basis(invert=True)
*BOOM*
sage: I.groebner_basis(noro=True)
*BOOM*
sage: I.groebner_basis(preprocess_only=True)
*BOOM*
```

Assignee: @burcin

Keywords: polybori

Resolution: fixed

Issue created by migration from https://trac.sagemath.org/ticket/2052





---

archive/issue_events_004934.json:
```json
{
    "actor": "https://github.com/malb",
    "created_at": "2008-02-05T17:35:45Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/2052",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/2052#event-4934"
}
```



---

archive/issue_comments_014309.json:
```json
{
    "body": "<a id='comment:1'></a>\nI think this can be closed again, see #2051.",
    "created_at": "2008-02-05T17:35:45Z",
    "issue": "https://github.com/sagemath/sagetest/issues/2052",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/2052#issuecomment-14309",
    "user": "https://github.com/malb"
}
```

<a id='comment:1'></a>
I think this can be closed again, see #2051.



---

archive/issue_comments_014310.json:
```json
{
    "body": "Resolution: fixed",
    "created_at": "2008-02-05T17:35:45Z",
    "issue": "https://github.com/sagemath/sagetest/issues/2052",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/2052#issuecomment-14310",
    "user": "https://github.com/malb"
}
```

Resolution: fixed
