# Issue 2071: SymbolicExpression conjugate() method assumes variables are real

archive/issues_002071.json:
```json
{
    "assignees": [],
    "body": "\n```\nsage: var('x')\nx\nsage: x.conjugate()\nx\n```\n\nUnder the assumption that x might be complex, this should really return conjugate(x).\n\n\n**Assignee:** @garyfurnish\n\nIssue created by migration from https://trac.sagemath.org/ticket/2071\n\n",
    "closed_at": "2009-05-26T16:17:23Z",
    "created_at": "2008-02-06T06:37:57Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20calculus",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-4.0",
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "SymbolicExpression conjugate() method assumes variables are real",
    "type": "issue",
    "updated_at": "2009-05-26T16:17:23Z",
    "url": "https://github.com/sagemath/sage/issues/2071",
    "user": "https://github.com/sagetrac-cwitty"
}
```

```
sage: var('x')
x
sage: x.conjugate()
x
```

Under the assumption that x might be complex, this should really return conjugate(x).


**Assignee:** @garyfurnish

Issue created by migration from https://trac.sagemath.org/ticket/2071





---

archive/issue_events_016596.json:
```json
{
    "actor": "https://github.com/sagetrac-cwitty",
    "created_at": "2008-02-06T06:37:57Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/2071",
    "milestone_number": null,
    "milestone_title": "sage-4.0",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/2071#event-16596"
}
```



---

archive/issue_events_016597.json:
```json
{
    "actor": "https://github.com/sagetrac-cwitty",
    "created_at": "2008-02-06T06:37:57Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/2071",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20calculus",
    "label_color": "08517b",
    "label_name": "component: calculus",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/2071#event-16597"
}
```



---

archive/issue_events_016598.json:
```json
{
    "actor": "https://github.com/sagetrac-cwitty",
    "created_at": "2008-02-06T06:37:57Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/2071",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "008080",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/2071#event-16598"
}
```



---

archive/issue_comments_010409.json:
```json
{
    "body": "**Changing assignee** from @williamstein to @garyfurnish.",
    "created_at": "2008-03-16T20:10:41Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/2071",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/2071#issuecomment-10409",
    "user": "https://github.com/garyfurnish"
}
```

**Changing assignee** from @williamstein to @garyfurnish.



---

archive/issue_comments_010410.json:
```json
{
    "body": "<a id='comment:2'>**Comment 2:**</a>\nThis could be handled using Maxima's declare facility:\n\n```\nsage: sage.calculus.calculus.maxima.eval('declare(x, complex)')\n'done'\nsage: x.conjugate()\nconjugate(x)\n```\n\nThis also fixed by Pynac:\n\n```\nsage: x = var('x', ns=1)\nsage: x\nx\nsage: x.conjugate()\nconjugate(x)\n```",
    "created_at": "2008-11-14T09:13:10Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/2071",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/2071#issuecomment-10410",
    "user": "https://github.com/mwhansen"
}
```

<a id='comment:2'>**Comment 2:**</a>
This could be handled using Maxima's declare facility:

```
sage: sage.calculus.calculus.maxima.eval('declare(x, complex)')
'done'
sage: x.conjugate()
conjugate(x)
```

This also fixed by Pynac:

```
sage: x = var('x', ns=1)
sage: x
x
sage: x.conjugate()
conjugate(x)
```



---

archive/issue_comments_010411.json:
```json
{
    "body": "<a id='comment:3'>**Comment 3:**</a>\nThis is fixed in 4.0.rc0. There is a doctest in line 3871 of sage/symbolic/expression.pyx.\n\nThis bug should be closed as fixed.",
    "created_at": "2009-05-25T09:27:32Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/2071",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/2071#issuecomment-10411",
    "user": "https://github.com/burcin"
}
```

<a id='comment:3'>**Comment 3:**</a>
This is fixed in 4.0.rc0. There is a doctest in line 3871 of sage/symbolic/expression.pyx.

This bug should be closed as fixed.



---

archive/issue_events_016599.json:
```json
{
    "actor": "https://github.com/burcin",
    "created_at": "2009-05-25T09:27:32Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/2071",
    "milestone_number": null,
    "milestone_title": "sage-4.0.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/2071#event-16599"
}
```



---

archive/issue_events_016600.json:
```json
{
    "actor": "https://github.com/burcin",
    "created_at": "2009-05-25T09:27:32Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/2071",
    "milestone_number": null,
    "milestone_title": "sage-4.0",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/2071#event-16600"
}
```



---

archive/issue_events_016601.json:
```json
{
    "actor": "https://github.com/mwhansen",
    "created_at": "2009-05-26T16:17:23Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/2071",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/2071#event-16601"
}
```
