# Issue 2151: Error in quotient ring loaded from a file

archive/issues_002151.json:
```json
{
    "assignees": [
        "https://github.com/malb"
    ],
    "body": "Create a ring, an ideal and the quotient ring, and save ideal and quotient:\n\n```\nsage: Ring = PolynomialRing(QQ,'x,y,z')\nsage: R = PolynomialRing(QQ,'x,y,z')\nsage: Rel=R.ideal('x*y*z-1')\nsage: QR=R.quotient_ring(Rel)\nsage: QR('y')\nybar\nsage: save(Rel,'Relation')\nsage: save(QR,'Quotient')\nsage: quit\n```\n\nAfter restart, try to reconstruct R,Rel and QR:\n\n```\nsage: Rel=load('Relation.sobj')\nsage: Rel\nIdeal (x*y*z - 1) of Multivariate Polynomial Ring in x, y, z over Rational Field\nsage: R=Rel.ring()\nsage: R('y')\ny\nsage: QR=R.quotient_ring(Rel)\nsage: QR\nQuotient of Multivariate Polynomial Ring in x, y, z over Rational Field by the ideal (x*y*z - 1)\nsage: QR('y')\nsage: QR.gens()\n```\n\nBoth the last two commands result in a traceback, ending with\n\n```\n<type 'exceptions.TypeError'>: Singular error:\n   ? `x` is not defined\n   ? error occurred in STDIN line 21: `def sage10=[x*y*z - 1];`\n```\n\nAlso the other saved data do not help:\n\n```\nsage: QR = load('Quotient')\nsage: QR('y')\n```\nresulting in the same error.\n\nWilliam Stein suggested the following workaround, which may also help to track down the bug:\n\n```\nsage: R._singular_()\n\n//   characteristic : 0\n//   number of vars : 3\n//        block   1 : ordering dp\n//                  : names    x y z\n//        block   2 : ordering C\nsage: QR('y')\nybar\n```\n\n\nKeywords: **load quotient ring**\n\nComponent: **commutative algebra**\n\n_Issue created by migration from https://trac.sagemath.org/ticket/2151_\n\n",
    "closed_at": "2010-07-05T11:45:05Z",
    "created_at": "2008-02-13T20:54:50Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/c%3A%20commutative%20algebra",
        "https://github.com/sagemath/sage/labels/p%3A%203%20%E2%80%93%20major",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-4.5",
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "Error in quotient ring loaded from a file",
    "type": "issue",
    "updated_at": "2010-07-05T11:45:05Z",
    "url": "https://github.com/sagemath/sage/issues/2151",
    "user": "https://github.com/simon-king-jena"
}
```
Create a ring, an ideal and the quotient ring, and save ideal and quotient:

```
sage: Ring = PolynomialRing(QQ,'x,y,z')
sage: R = PolynomialRing(QQ,'x,y,z')
sage: Rel=R.ideal('x*y*z-1')
sage: QR=R.quotient_ring(Rel)
sage: QR('y')
ybar
sage: save(Rel,'Relation')
sage: save(QR,'Quotient')
sage: quit
```

After restart, try to reconstruct R,Rel and QR:

```
sage: Rel=load('Relation.sobj')
sage: Rel
Ideal (x*y*z - 1) of Multivariate Polynomial Ring in x, y, z over Rational Field
sage: R=Rel.ring()
sage: R('y')
y
sage: QR=R.quotient_ring(Rel)
sage: QR
Quotient of Multivariate Polynomial Ring in x, y, z over Rational Field by the ideal (x*y*z - 1)
sage: QR('y')
sage: QR.gens()
```

Both the last two commands result in a traceback, ending with

```
<type 'exceptions.TypeError'>: Singular error:
   ? `x` is not defined
   ? error occurred in STDIN line 21: `def sage10=[x*y*z - 1];`
```

Also the other saved data do not help:

```
sage: QR = load('Quotient')
sage: QR('y')
```
resulting in the same error.

William Stein suggested the following workaround, which may also help to track down the bug:

```
sage: R._singular_()

//   characteristic : 0
//   number of vars : 3
//        block   1 : ordering dp
//                  : names    x y z
//        block   2 : ordering C
sage: QR('y')
ybar
```


Keywords: **load quotient ring**

Component: **commutative algebra**

_Issue created by migration from https://trac.sagemath.org/ticket/2151_





---

archive/issue_events_021886.json:
```json
{
    "actor": "https://github.com/simon-king-jena",
    "created_at": "2008-02-13T20:54:50Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/2151",
    "milestone_number": null,
    "milestone_title": "sage-4.5",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/2151#event-21886"
}
```



---

archive/issue_events_021887.json:
```json
{
    "actor": "https://github.com/simon-king-jena",
    "created_at": "2008-02-13T20:54:50Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/2151",
    "label": "https://github.com/sagemath/sage/labels/c%3A%20commutative%20algebra",
    "label_color": "0000ff",
    "label_name": "c: commutative algebra",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/2151#event-21887"
}
```



---

archive/issue_events_021888.json:
```json
{
    "actor": "https://github.com/simon-king-jena",
    "created_at": "2008-02-13T20:54:50Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/2151",
    "label": "https://github.com/sagemath/sage/labels/p%3A%203%20%E2%80%93%20major",
    "label_color": "ffbb00",
    "label_name": "p: 3 \u2013 major",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/2151#event-21888"
}
```



---

archive/issue_events_021889.json:
```json
{
    "actor": "https://github.com/simon-king-jena",
    "created_at": "2008-02-13T20:54:50Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/2151",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "d73a4a",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/2151#event-21889"
}
```



---

archive/issue_events_021890.json:
```json
{
    "actor": "https://github.com/malb",
    "created_at": "2008-02-13T20:54:50Z",
    "event": "assigned",
    "issue": "https://github.com/sagemath/sage/issues/2151",
    "subject": "https://github.com/simon-king-jena",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/2151#event-21890"
}
```



---

archive/issue_comments_010457.json:
```json
{
    "body": "<div id=\"comment:1\" align=\"right\">comment:1</div>\n\nAddendum: The workaround does not solve all problems.\n\nFirst session:\n\n```\nsage: R=PolynomialRing(QQ,'x0,y0,z0')\nsage: Rel=R.ideal('z0**2-1','x0*y0-1')\nsage: QR=R.quotient_ring(Rel)\nsage: QR('x0*y0')\n1\nsage: save(Rel,'Relation.sobj')\nsage: quit \n```\nSecond session:\n\n```\nsage: Rel=load('Relation.sobj')\nsage: R=Rel.ring()\nsage: R._singular_()\n\n//   characteristic : 0\n//   number of vars : 3\n//        block   1 : ordering dp\n//                  : names    x0 y0 z0\n//        block   2 : ordering C\nsage: QR=R.quotient_ring(Rel)\nsage: QR('x0*y0')\nx0bar*y0bar\n```\n\nBut the result should be 1, as in the first session!",
    "created_at": "2008-02-13T21:26:52Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/2151",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/2151#issuecomment-10457",
    "user": "https://github.com/simon-king-jena"
}
```

<div id="comment:1" align="right">comment:1</div>

Addendum: The workaround does not solve all problems.

First session:

```
sage: R=PolynomialRing(QQ,'x0,y0,z0')
sage: Rel=R.ideal('z0**2-1','x0*y0-1')
sage: QR=R.quotient_ring(Rel)
sage: QR('x0*y0')
1
sage: save(Rel,'Relation.sobj')
sage: quit 
```
Second session:

```
sage: Rel=load('Relation.sobj')
sage: R=Rel.ring()
sage: R._singular_()

//   characteristic : 0
//   number of vars : 3
//        block   1 : ordering dp
//                  : names    x0 y0 z0
//        block   2 : ordering C
sage: QR=R.quotient_ring(Rel)
sage: QR('x0*y0')
x0bar*y0bar
```

But the result should be 1, as in the first session!



---

archive/issue_comments_010458.json:
```json
{
    "body": "<div id=\"comment:2\" align=\"right\">comment:2</div>\n\nI don't know who did it, but it seems that the problem is solved! \n\nI tried the above failing examples with 3.1.alpha0, and it all worked fine.\n\nThank you very much!",
    "created_at": "2008-08-14T11:38:26Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/2151",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/2151#issuecomment-10458",
    "user": "https://github.com/simon-king-jena"
}
```

<div id="comment:2" align="right">comment:2</div>

I don't know who did it, but it seems that the problem is solved! 

I tried the above failing examples with 3.1.alpha0, and it all worked fine.

Thank you very much!



---

archive/issue_events_021891.json:
```json
{
    "actor": "https://github.com/simon-king-jena",
    "created_at": "2008-08-14T11:38:26Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/2151",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/2151#event-21891"
}
```



---

archive/issue_comments_010459.json:
```json
{
    "body": "<div id=\"comment:3\" align=\"right\">comment:3</div>\n\nSimon,\n\nwe do not just close tickets. Please add a patch adding a doctest that verifies that this functionality is fixed.\n\nCheers,\n\nMichael",
    "created_at": "2008-08-14T14:25:10Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/2151",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/2151#issuecomment-10459",
    "user": "https://github.com/sagetrac-mabshoff"
}
```

<div id="comment:3" align="right">comment:3</div>

Simon,

we do not just close tickets. Please add a patch adding a doctest that verifies that this functionality is fixed.

Cheers,

Michael



---

archive/issue_comments_010460.json:
```json
{
    "body": "<div id=\"comment:4\" align=\"right\">comment:4</div>\n\nI don't see how this can be doctested, since it requires two Sage sessions.",
    "created_at": "2008-08-18T12:14:24Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/2151",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/2151#issuecomment-10460",
    "user": "https://github.com/malb"
}
```

<div id="comment:4" align="right">comment:4</div>

I don't see how this can be doctested, since it requires two Sage sessions.



---

archive/issue_comments_010461.json:
```json
{
    "body": "<div id=\"comment:5\" align=\"right\">comment:5</div>\n\nReplying to [@malb](#comment:4):\n> I don't see how this can be doctested, since it requires two Sage sessions.\n\nIt is about pickling/unpickling, hence it should be testable with loads(dumps(...)). I'll see if I succeed in finding a test. \n\nAnd sorry for closing the ticket. A question: Is it possible to modify the trac system such that *only* administrators are able to close a ticket? This would have prevented me from a couple of errors.",
    "created_at": "2008-08-18T13:12:23Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/2151",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/2151#issuecomment-10461",
    "user": "https://github.com/simon-king-jena"
}
```

<div id="comment:5" align="right">comment:5</div>

Replying to [@malb](#comment:4):
> I don't see how this can be doctested, since it requires two Sage sessions.

It is about pickling/unpickling, hence it should be testable with loads(dumps(...)). I'll see if I succeed in finding a test. 

And sorry for closing the ticket. A question: Is it possible to modify the trac system such that *only* administrators are able to close a ticket? This would have prevented me from a couple of errors.



---

archive/issue_comments_010462.json:
```json
{
    "body": "<div id=\"comment:6\" align=\"right\">comment:6</div>\n\nReplying to [@simon-king-jena](#comment:5):\n> Replying to [@malb](#comment:4):\n> > I don't see how this can be doctested, since it requires two Sage sessions.\n\n> \n> It is about pickling/unpickling, hence it should be testable with loads(dumps(...)). I'll see if I succeed in finding a test. \n\nI thought the issue was only present if the dump is unpickled from a different session, nevermind then & know yourself out writing doctests :-)\n\n> And sorry for closing the ticket. A question: Is it possible to modify the trac system such that *only* administrators are able to close a ticket? This would have prevented me from a couple of errors.\n\nAFAIK no, there is repeated talk about a new Trac version which matches our process better, but nothing solid has emerged.",
    "created_at": "2008-08-18T13:36:59Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/2151",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/2151#issuecomment-10462",
    "user": "https://github.com/malb"
}
```

<div id="comment:6" align="right">comment:6</div>

Replying to [@simon-king-jena](#comment:5):
> Replying to [@malb](#comment:4):
> > I don't see how this can be doctested, since it requires two Sage sessions.

> 
> It is about pickling/unpickling, hence it should be testable with loads(dumps(...)). I'll see if I succeed in finding a test. 

I thought the issue was only present if the dump is unpickled from a different session, nevermind then & know yourself out writing doctests :-)

> And sorry for closing the ticket. A question: Is it possible to modify the trac system such that *only* administrators are able to close a ticket? This would have prevented me from a couple of errors.

AFAIK no, there is repeated talk about a new Trac version which matches our process better, but nothing solid has emerged.



---

archive/issue_events_021892.json:
```json
{
    "actor": "https://github.com/simon-king-jena",
    "created_at": "2010-07-05T11:45:05Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/2151",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/2151#event-21892"
}
```



---

archive/issue_comments_010463.json:
```json
{
    "body": "<div id=\"comment:7\" align=\"right\">comment:7</div>\n\nReplying to [@simon-king-jena](#comment:2):\n> I don't know who did it, but it seems that the problem is solved! \n> \n> I tried the above failing examples with 3.1.alpha0, and it all worked fine.\n\nI tried again, with sage 4.4.3, and it still works. So, can please someone finally close this ticket? I hope I am at least entitled to resolve it as \"fixed\".",
    "created_at": "2010-07-05T11:45:05Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/2151",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/2151#issuecomment-10463",
    "user": "https://github.com/simon-king-jena"
}
```

<div id="comment:7" align="right">comment:7</div>

Replying to [@simon-king-jena](#comment:2):
> I don't know who did it, but it seems that the problem is solved! 
> 
> I tried the above failing examples with 3.1.alpha0, and it all worked fine.

I tried again, with sage 4.4.3, and it still works. So, can please someone finally close this ticket? I hope I am at least entitled to resolve it as "fixed".
