# Issue 2151: Error in quotient ring loaded from a file

archive/issues_002151.json:
```json
{
    "body": "Create a ring, an ideal and the quotient ring, and save ideal and quotient:\n\n```\nsage: Ring = PolynomialRing(QQ,'x,y,z')\nsage: R = PolynomialRing(QQ,'x,y,z')\nsage: Rel=R.ideal('x*y*z-1')\nsage: QR=R.quotient_ring(Rel)\nsage: QR('y')\nybar\nsage: save(Rel,'Relation')\nsage: save(QR,'Quotient')\nsage: quit\n```\n\nAfter restart, try to reconstruct R,Rel and QR:\n\n```\nsage: Rel=load('Relation.sobj')\nsage: Rel\nIdeal (x*y*z - 1) of Multivariate Polynomial Ring in x, y, z over Rational Field\nsage: R=Rel.ring()\nsage: R('y')\ny\nsage: QR=R.quotient_ring(Rel)\nsage: QR\nQuotient of Multivariate Polynomial Ring in x, y, z over Rational Field by the ideal (x*y*z - 1)\nsage: QR('y')\nsage: QR.gens()\n```\n\nBoth the last two commands result in a traceback, ending with\n\n```\n<type 'exceptions.TypeError'>: Singular error:\n   ? `x` is not defined\n   ? error occurred in STDIN line 21: `def sage10=[x*y*z - 1];`\n```\n\nAlso the other saved data do not help:\n\n```\nsage: QR = load('Quotient')\nsage: QR('y')\n```\nresulting in the same error.\n\nWilliam Stein suggested the following workaround, which may also help to track down the bug:\n\n```\nsage: R._singular_()\n\n//   characteristic : 0\n//   number of vars : 3\n//        block   1 : ordering dp\n//                  : names    x y z\n//        block   2 : ordering C\nsage: QR('y')\nybar\n```\n\n\n**Assignee:** @malb\n\n**Keywords:** load quotient ring\n\nIssue created by migration from https://trac.sagemath.org/ticket/2151\n\n",
    "closed_at": "2010-07-05T11:45:05Z",
    "created_at": "2008-02-13T20:54:50Z",
    "labels": [
        "component: commutative algebra",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-4.5",
    "title": "Error in quotient ring loaded from a file",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/2151",
    "user": "https://github.com/simon-king-jena"
}
```
Create a ring, an ideal and the quotient ring, and save ideal and quotient:

```
sage: Ring = PolynomialRing(QQ,'x,y,z')
sage: R = PolynomialRing(QQ,'x,y,z')
sage: Rel=R.ideal('x*y*z-1')
sage: QR=R.quotient_ring(Rel)
sage: QR('y')
ybar
sage: save(Rel,'Relation')
sage: save(QR,'Quotient')
sage: quit
```

After restart, try to reconstruct R,Rel and QR:

```
sage: Rel=load('Relation.sobj')
sage: Rel
Ideal (x*y*z - 1) of Multivariate Polynomial Ring in x, y, z over Rational Field
sage: R=Rel.ring()
sage: R('y')
y
sage: QR=R.quotient_ring(Rel)
sage: QR
Quotient of Multivariate Polynomial Ring in x, y, z over Rational Field by the ideal (x*y*z - 1)
sage: QR('y')
sage: QR.gens()
```

Both the last two commands result in a traceback, ending with

```
<type 'exceptions.TypeError'>: Singular error:
   ? `x` is not defined
   ? error occurred in STDIN line 21: `def sage10=[x*y*z - 1];`
```

Also the other saved data do not help:

```
sage: QR = load('Quotient')
sage: QR('y')
```
resulting in the same error.

William Stein suggested the following workaround, which may also help to track down the bug:

```
sage: R._singular_()

//   characteristic : 0
//   number of vars : 3
//        block   1 : ordering dp
//                  : names    x y z
//        block   2 : ordering C
sage: QR('y')
ybar
```


**Assignee:** @malb

**Keywords:** load quotient ring

Issue created by migration from https://trac.sagemath.org/ticket/2151





---

archive/issue_comments_013173.json:
```json
{
    "body": "<a id='comment:1'></a>\nAddendum: The workaround does not solve all problems.\n\nFirst session:\n\n```\nsage: R=PolynomialRing(QQ,'x0,y0,z0')\nsage: Rel=R.ideal('z0**2-1','x0*y0-1')\nsage: QR=R.quotient_ring(Rel)\nsage: QR('x0*y0')\n1\nsage: save(Rel,'Relation.sobj')\nsage: quit \n```\nSecond session:\n\n```\nsage: Rel=load('Relation.sobj')\nsage: R=Rel.ring()\nsage: R._singular_()\n\n//   characteristic : 0\n//   number of vars : 3\n//        block   1 : ordering dp\n//                  : names    x0 y0 z0\n//        block   2 : ordering C\nsage: QR=R.quotient_ring(Rel)\nsage: QR('x0*y0')\nx0bar*y0bar\n```\n\nBut the result should be 1, as in the first session!",
    "created_at": "2008-02-13T21:26:52Z",
    "issue": "https://github.com/sagemath/sagetest/issues/2151",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/2151#issuecomment-13173",
    "user": "https://github.com/simon-king-jena"
}
```

<a id='comment:1'></a>
Addendum: The workaround does not solve all problems.

First session:

```
sage: R=PolynomialRing(QQ,'x0,y0,z0')
sage: Rel=R.ideal('z0**2-1','x0*y0-1')
sage: QR=R.quotient_ring(Rel)
sage: QR('x0*y0')
1
sage: save(Rel,'Relation.sobj')
sage: quit 
```
Second session:

```
sage: Rel=load('Relation.sobj')
sage: R=Rel.ring()
sage: R._singular_()

//   characteristic : 0
//   number of vars : 3
//        block   1 : ordering dp
//                  : names    x0 y0 z0
//        block   2 : ordering C
sage: QR=R.quotient_ring(Rel)
sage: QR('x0*y0')
x0bar*y0bar
```

But the result should be 1, as in the first session!



---

archive/issue_comments_013174.json:
```json
{
    "body": "<a id='comment:2'></a>\nI don't know who did it, but it seems that the problem is solved! \n\nI tried the above failing examples with 3.1.alpha0, and it all worked fine.\n\nThank you very much!",
    "created_at": "2008-08-14T11:38:26Z",
    "issue": "https://github.com/sagemath/sagetest/issues/2151",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/2151#issuecomment-13174",
    "user": "https://github.com/simon-king-jena"
}
```

<a id='comment:2'></a>
I don't know who did it, but it seems that the problem is solved! 

I tried the above failing examples with 3.1.alpha0, and it all worked fine.

Thank you very much!



---

archive/issue_events_006389.json:
```json
{
    "actor": "https://github.com/simon-king-jena",
    "created_at": "2008-08-14T11:38:26Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/2151",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/2151#event-6389"
}
```



---

archive/issue_comments_013175.json:
```json
{
    "body": "<a id='comment:3'></a>\nSimon,\n\nwe do not just close tickets. Please add a patch adding a doctest that verifies that this functionality is fixed.\n\nCheers,\n\nMichael",
    "created_at": "2008-08-14T14:25:10Z",
    "issue": "https://github.com/sagemath/sagetest/issues/2151",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/2151#issuecomment-13175",
    "user": "https://trac.sagemath.org/admin/accounts/users/mabshoff"
}
```

<a id='comment:3'></a>
Simon,

we do not just close tickets. Please add a patch adding a doctest that verifies that this functionality is fixed.

Cheers,

Michael



---

archive/issue_comments_013176.json:
```json
{
    "body": "**Changing status** from closed to reopened.",
    "created_at": "2008-08-14T14:25:10Z",
    "issue": "https://github.com/sagemath/sagetest/issues/2151",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/2151#issuecomment-13176",
    "user": "https://trac.sagemath.org/admin/accounts/users/mabshoff"
}
```

**Changing status** from closed to reopened.



---

archive/issue_comments_013177.json:
```json
{
    "body": "<a id='comment:4'></a>\nI don't see how this can be doctested, since it requires two Sage sessions.",
    "created_at": "2008-08-18T12:14:24Z",
    "issue": "https://github.com/sagemath/sagetest/issues/2151",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/2151#issuecomment-13177",
    "user": "https://github.com/malb"
}
```

<a id='comment:4'></a>
I don't see how this can be doctested, since it requires two Sage sessions.



---

archive/issue_comments_013178.json:
```json
{
    "body": "<a id='comment:5'></a>\nReplying to [malb](#comment%3A4):\n> I don't see how this can be doctested, since it requires two Sage sessions.\n\n\nIt is about pickling/unpickling, hence it should be testable with loads(dumps(...)). I'll see if I succeed in finding a test. \n\nAnd sorry for closing the ticket. A question: Is it possible to modify the trac system such that *only* administrators are able to close a ticket? This would have prevented me from a couple of errors.",
    "created_at": "2008-08-18T13:12:23Z",
    "issue": "https://github.com/sagemath/sagetest/issues/2151",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/2151#issuecomment-13178",
    "user": "https://github.com/simon-king-jena"
}
```

<a id='comment:5'></a>
Replying to [malb](#comment%3A4):
> I don't see how this can be doctested, since it requires two Sage sessions.


It is about pickling/unpickling, hence it should be testable with loads(dumps(...)). I'll see if I succeed in finding a test. 

And sorry for closing the ticket. A question: Is it possible to modify the trac system such that *only* administrators are able to close a ticket? This would have prevented me from a couple of errors.



---

archive/issue_comments_013179.json:
```json
{
    "body": "<a id='comment:6'></a>\nReplying to [SimonKing](#comment%3A5):\n> Replying to [malb](#comment%3A4):\n> > I don't see how this can be doctested, since it requires two Sage sessions.\n\n> \n> It is about pickling/unpickling, hence it should be testable with loads(dumps(...)). I'll see if I succeed in finding a test. \n\n\nI thought the issue was only present if the dump is unpickled from a different session, nevermind then & know yourself out writing doctests :-)\n\n> And sorry for closing the ticket. A question: Is it possible to modify the trac system such that *only* administrators are able to close a ticket? This would have prevented me from a couple of errors.\n\n\nAFAIK no, there is repeated talk about a new Trac version which matches our process better, but nothing solid has emerged.",
    "created_at": "2008-08-18T13:36:59Z",
    "issue": "https://github.com/sagemath/sagetest/issues/2151",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/2151#issuecomment-13179",
    "user": "https://github.com/malb"
}
```

<a id='comment:6'></a>
Replying to [SimonKing](#comment%3A5):
> Replying to [malb](#comment%3A4):
> > I don't see how this can be doctested, since it requires two Sage sessions.

> 
> It is about pickling/unpickling, hence it should be testable with loads(dumps(...)). I'll see if I succeed in finding a test. 


I thought the issue was only present if the dump is unpickled from a different session, nevermind then & know yourself out writing doctests :-)

> And sorry for closing the ticket. A question: Is it possible to modify the trac system such that *only* administrators are able to close a ticket? This would have prevented me from a couple of errors.


AFAIK no, there is repeated talk about a new Trac version which matches our process better, but nothing solid has emerged.



---

archive/issue_events_006390.json:
```json
{
    "actor": "https://github.com/simon-king-jena",
    "created_at": "2010-07-05T11:45:05Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/2151",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/2151#event-6390"
}
```



---

archive/issue_comments_013180.json:
```json
{
    "body": "<a id='comment:7'></a>\nReplying to [SimonKing](#comment%3A2):\n> I don't know who did it, but it seems that the problem is solved! \n> \n> I tried the above failing examples with 3.1.alpha0, and it all worked fine.\n\n\nI tried again, with sage 4.4.3, and it still works. So, can please someone finally close this ticket? I hope I am at least entitled to resolve it as \"fixed\".",
    "created_at": "2010-07-05T11:45:05Z",
    "issue": "https://github.com/sagemath/sagetest/issues/2151",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/2151#issuecomment-13180",
    "user": "https://github.com/simon-king-jena"
}
```

<a id='comment:7'></a>
Replying to [SimonKing](#comment%3A2):
> I don't know who did it, but it seems that the problem is solved! 
> 
> I tried the above failing examples with 3.1.alpha0, and it all worked fine.


I tried again, with sage 4.4.3, and it still works. So, can please someone finally close this ticket? I hope I am at least entitled to resolve it as "fixed".



---

archive/issue_comments_013181.json:
```json
{
    "body": "**Upstream:** N/A",
    "created_at": "2010-07-05T11:45:05Z",
    "issue": "https://github.com/sagemath/sagetest/issues/2151",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/2151#issuecomment-13181",
    "user": "https://github.com/simon-king-jena"
}
```

**Upstream:** N/A
