# Issue 2348: Teach the gap interface about field extensions

archive/issues_002348.json:
```json
{
    "body": "Define the following:\n\n```\nsage: F = CyclotomicField(8)\nsage: z = F.gen()\nsage: a = z+1/z\nsage: MS = MatrixSpace(F, 2, 2)\nsage: g1 = MS([[1/a,1/a],[1/a,-1/a]])\nsage: b = z^2\nsage: g2 = MS([[1,0],[0,b]])\nsage: g3 = MS([[b,0],[0,1]])\nsage: G = MatrixGroup([g1,g2,g3])\n```\n\nThen, one obtains a traceback by the attempt to see G:\n\n```\nsage: G\n<traceback removed>\n<type 'exceptions.TypeError'>: Gap produced error output\nVariable: 'zeta8' must have a value\n\n\n   executing Read(\"/home/king/.sage//temp/mpc739/6870//interface//tmp\");\n```\n\nNote that in fact `zeta8` is known:\n\n```\nsage: G.base_ring().gen()\nzeta8\n```\n\n\n**Assignee:** @wdjoyner\n\n**CC:**  @williamstein @wdjoyner\n\n**Keywords:** gap, field extension\n\nIssue created by migration from https://trac.sagemath.org/ticket/2348\n\n",
    "closed_at": "2008-03-05T10:47:22Z",
    "created_at": "2008-02-28T18:36:58Z",
    "labels": [
        "component: interfaces",
        "critical",
        "bug",
        "invalid"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-2.10.3",
    "title": "Teach the gap interface about field extensions",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/2348",
    "user": "https://github.com/simon-king-jena"
}
```
Define the following:

```
sage: F = CyclotomicField(8)
sage: z = F.gen()
sage: a = z+1/z
sage: MS = MatrixSpace(F, 2, 2)
sage: g1 = MS([[1/a,1/a],[1/a,-1/a]])
sage: b = z^2
sage: g2 = MS([[1,0],[0,b]])
sage: g3 = MS([[b,0],[0,1]])
sage: G = MatrixGroup([g1,g2,g3])
```

Then, one obtains a traceback by the attempt to see G:

```
sage: G
<traceback removed>
<type 'exceptions.TypeError'>: Gap produced error output
Variable: 'zeta8' must have a value


   executing Read("/home/king/.sage//temp/mpc739/6870//interface//tmp");
```

Note that in fact `zeta8` is known:

```
sage: G.base_ring().gen()
zeta8
```


**Assignee:** @wdjoyner

**CC:**  @williamstein @wdjoyner

**Keywords:** gap, field extension

Issue created by migration from https://trac.sagemath.org/ticket/2348





---

archive/issue_comments_012385.json:
```json
{
    "body": "<a id='comment:1'></a>\nSearching in `sage/groups/matrix_gps/matrix_group.py`, i found that `MatrixGroup([g1,g2,g3])` calls `MatrixGroup_gens.__init__`, which in turn calls `MatrixGroup_gap.__init__`. The latter has signature `(self, n, R, var='a')`. \n\nIn the above example, i guess `var` is supposed to be `'zeta8'`, and by consequence `G._var` should be `'zeta8'`. But it isn't, `G._var` will never be initialised with a value different from `'a'`.\n\nI thought this might be a source of trouble. But unfortunately, it doesn't help to change `MatrixGroup_gens.__init__` accordingly. \n\nBy the way, it seems that the attribute `_var` is not used somewhere.",
    "created_at": "2008-02-28T19:16:26Z",
    "issue": "https://github.com/sagemath/sagetest/issues/2348",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/2348#issuecomment-12385",
    "user": "https://github.com/simon-king-jena"
}
```

<a id='comment:1'></a>
Searching in `sage/groups/matrix_gps/matrix_group.py`, i found that `MatrixGroup([g1,g2,g3])` calls `MatrixGroup_gens.__init__`, which in turn calls `MatrixGroup_gap.__init__`. The latter has signature `(self, n, R, var='a')`. 

In the above example, i guess `var` is supposed to be `'zeta8'`, and by consequence `G._var` should be `'zeta8'`. But it isn't, `G._var` will never be initialised with a value different from `'a'`.

I thought this might be a source of trouble. But unfortunately, it doesn't help to change `MatrixGroup_gens.__init__` accordingly. 

By the way, it seems that the attribute `_var` is not used somewhere.



---

archive/issue_comments_012386.json:
```json
{
    "body": "<a id='comment:2'></a>\nThis is my guess:\nThe problem is buried in `_gap_init_`, which behaves incorrectly for cyclotomics:\n\nsage: F = GF(8,\"z\"); a = F.gen(); a._gap_init_()\n'Z(8)^1'\nsage: F = CyclotomicField(8); a = F.gen(); a._gap_init_()\n'zeta8'\n\nI don't know if fixing that will fix the problem though.",
    "created_at": "2008-02-28T19:47:37Z",
    "issue": "https://github.com/sagemath/sagetest/issues/2348",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/2348#issuecomment-12386",
    "user": "https://github.com/wdjoyner"
}
```

<a id='comment:2'></a>
This is my guess:
The problem is buried in `_gap_init_`, which behaves incorrectly for cyclotomics:

sage: F = GF(8,"z"); a = F.gen(); a._gap_init_()
'Z(8)^1'
sage: F = CyclotomicField(8); a = F.gen(); a._gap_init_()
'zeta8'

I don't know if fixing that will fix the problem though.



---

archive/issue_comments_012387.json:
```json
{
    "body": "<a id='comment:3'></a>\nI should have added that in the last line of \n\n```\nsage: F = GF(8,\"z\"); a = F.gen(); a._gap_init_() \n'Z(8)1'\nsage: F = CyclotomicField?(8); a = F.gen(); a._gap_init_()\n'zeta8'\n```\nthe output should be 'E(8)', or possibly 'E(8)^1', since this\nis the GAP notation for a primitive 8th root of unity.",
    "created_at": "2008-02-28T19:55:29Z",
    "issue": "https://github.com/sagemath/sagetest/issues/2348",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/2348#issuecomment-12387",
    "user": "https://github.com/wdjoyner"
}
```

<a id='comment:3'></a>
I should have added that in the last line of 

```
sage: F = GF(8,"z"); a = F.gen(); a._gap_init_() 
'Z(8)1'
sage: F = CyclotomicField?(8); a = F.gen(); a._gap_init_()
'zeta8'
```
the output should be 'E(8)', or possibly 'E(8)^1', since this
is the GAP notation for a primitive 8th root of unity.



---

archive/issue_comments_012388.json:
```json
{
    "body": "<a id='comment:4'></a>\nReplying to [wdj](#comment%3A2):\n> This is my guess:\n> The problem is buried in `_gap_init_`, which behaves incorrectly for cyclotomics:\n\n\nIt seems to me that you are right that it is the gap interface. Therefore i change Summary, Component, and Keywords of the ticket, and send Cc to William.\n\nIn the above example, `G._repr_()` refers to `G.gens()`, and that is calling the gap interface for the matrices that have been used to define `G`.\n\nWhile the following works,\n\n```\nsage: F=CyclotomicField(8)\nsage: N=Matrix(F,[[1,0],[0,1]])\nsage: gap(N)\n[ [ 1, 0 ], [ 0, 1 ] ]\n```\nthe following crashes,\n\n```\nsage: M=Matrix(F,[[F.gen(),0],[0,F.gen()]])\nsage: M\n[zeta8     0]\n[    0 zeta8]\nsage: gap(M)\n```\nAgain, `gap` complains that `'zeta8'` has no value.\n\nFor solving the problem with `MatrixGroup` i would appreciate if someone could explain to me \n* how one can introduce `zeta8` to `gap`\nor\n* how `F.gen()` should be called in order to be understood by `gap`",
    "created_at": "2008-02-28T19:59:03Z",
    "issue": "https://github.com/sagemath/sagetest/issues/2348",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/2348#issuecomment-12388",
    "user": "https://github.com/simon-king-jena"
}
```

<a id='comment:4'></a>
Replying to [wdj](#comment%3A2):
> This is my guess:
> The problem is buried in `_gap_init_`, which behaves incorrectly for cyclotomics:


It seems to me that you are right that it is the gap interface. Therefore i change Summary, Component, and Keywords of the ticket, and send Cc to William.

In the above example, `G._repr_()` refers to `G.gens()`, and that is calling the gap interface for the matrices that have been used to define `G`.

While the following works,

```
sage: F=CyclotomicField(8)
sage: N=Matrix(F,[[1,0],[0,1]])
sage: gap(N)
[ [ 1, 0 ], [ 0, 1 ] ]
```
the following crashes,

```
sage: M=Matrix(F,[[F.gen(),0],[0,F.gen()]])
sage: M
[zeta8     0]
[    0 zeta8]
sage: gap(M)
```
Again, `gap` complains that `'zeta8'` has no value.

For solving the problem with `MatrixGroup` i would appreciate if someone could explain to me 
* how one can introduce `zeta8` to `gap`
or
* how `F.gen()` should be called in order to be understood by `gap`



---

archive/issue_comments_012389.json:
```json
{
    "body": "**Changing keywords** from \"matrix group, cyclotomic field\" to \"gap interface, matrix group, cyclotomic field\".",
    "created_at": "2008-02-28T19:59:03Z",
    "issue": "https://github.com/sagemath/sagetest/issues/2348",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/2348#issuecomment-12389",
    "user": "https://github.com/simon-king-jena"
}
```

**Changing keywords** from "matrix group, cyclotomic field" to "gap interface, matrix group, cyclotomic field".



---

archive/issue_events_011719.json:
```json
{
    "actor": "https://github.com/simon-king-jena",
    "created_at": "2008-02-28T19:59:03Z",
    "event": "renamed",
    "issue": "https://github.com/sagemath/sagetest/issues/2348",
    "rename": {
        "from": "MatrixGroup over CyclotomicField is broken",
        "to": "gap(Matrix) and MatrixGroup over CyclotomicField are broken"
    },
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/2348#event-11719"
}
```



---

archive/issue_events_011720.json:
```json
{
    "actor": "https://github.com/simon-king-jena",
    "created_at": "2008-02-28T19:59:03Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sagetest/issues/2348",
    "label": "component: group theory",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/2348#event-11720"
}
```



---

archive/issue_events_011721.json:
```json
{
    "actor": "https://github.com/simon-king-jena",
    "created_at": "2008-02-28T19:59:03Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sagetest/issues/2348",
    "label": "component: interfaces",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/2348#event-11721"
}
```



---

archive/issue_comments_012390.json:
```json
{
    "body": "<a id='comment:5'></a>\nMore and more it seems to me that the troubles come from gaps in the gap interface. So i think this ticket should really be focused on the interface.\n\nIn the above example, one has to tell `gap` that it shall create a field extension, namely the cyclotomic field. The following crashes:\n\n```\nsage: F=CyclotomicField(8)\nsage: gap(F)\n---------------------------------------------------------------------------\n<type 'exceptions.TypeError'>             Traceback (most recent call last)\n ...\nSyntax error: ; expected\n$sage7:=Cyclotomic Field of order 8 and degree 4;;\n                       ^\nVariable: 'of' must have a value\n\nVariable: 'degree' must have a value\n\n   executing $sage7:=Cyclotomic Field of order 8 and degree 4;;\n```\nApparently, `gap(F)` is equivalent to `gap(str(F))`, which of course yields nonsense.\n\nInstead, the `gap` related methods of the class `NumberField` and related classes should do something like that:\n\n```\nsage: PR=PolynomialRing(F.base_field(),F.gen())\nsage: pr=gap(PR)\nsage: bf=gap(F.base_field())\nsage: mp=gap(F.polynomial())\nsage: f=bf.AlgebraicExtension(mp)\nsage: f\n<algebraic extension over the Rationals of degree 4>\n```\nNow `f` is the `gap` version of `F`.",
    "created_at": "2008-02-29T08:36:27Z",
    "issue": "https://github.com/sagemath/sagetest/issues/2348",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/2348#issuecomment-12390",
    "user": "https://github.com/simon-king-jena"
}
```

<a id='comment:5'></a>
More and more it seems to me that the troubles come from gaps in the gap interface. So i think this ticket should really be focused on the interface.

In the above example, one has to tell `gap` that it shall create a field extension, namely the cyclotomic field. The following crashes:

```
sage: F=CyclotomicField(8)
sage: gap(F)
---------------------------------------------------------------------------
<type 'exceptions.TypeError'>             Traceback (most recent call last)
 ...
Syntax error: ; expected
$sage7:=Cyclotomic Field of order 8 and degree 4;;
                       ^
Variable: 'of' must have a value

Variable: 'degree' must have a value

   executing $sage7:=Cyclotomic Field of order 8 and degree 4;;
```
Apparently, `gap(F)` is equivalent to `gap(str(F))`, which of course yields nonsense.

Instead, the `gap` related methods of the class `NumberField` and related classes should do something like that:

```
sage: PR=PolynomialRing(F.base_field(),F.gen())
sage: pr=gap(PR)
sage: bf=gap(F.base_field())
sage: mp=gap(F.polynomial())
sage: f=bf.AlgebraicExtension(mp)
sage: f
<algebraic extension over the Rationals of degree 4>
```
Now `f` is the `gap` version of `F`.



---

archive/issue_comments_012391.json:
```json
{
    "body": "**Changing keywords** from \"gap interface, matrix group, cyclotomic field\" to \"gap, field extension\".",
    "created_at": "2008-02-29T08:36:27Z",
    "issue": "https://github.com/sagemath/sagetest/issues/2348",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/2348#issuecomment-12391",
    "user": "https://github.com/simon-king-jena"
}
```

**Changing keywords** from "gap interface, matrix group, cyclotomic field" to "gap, field extension".



---

archive/issue_events_011722.json:
```json
{
    "actor": "https://github.com/simon-king-jena",
    "created_at": "2008-02-29T08:36:27Z",
    "event": "renamed",
    "issue": "https://github.com/sagemath/sagetest/issues/2348",
    "rename": {
        "from": "gap(Matrix) and MatrixGroup over CyclotomicField are broken",
        "to": "Teach the gap interface about field extensions"
    },
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/2348#event-11722"
}
```



---

archive/issue_comments_012392.json:
```json
{
    "body": "<a id='comment:6'></a>\nI agree this needs fixing but, based on my reading of sage/interfaces/gap.py, I'm not sure how to do this. Do you have a suggestion William?",
    "created_at": "2008-02-29T11:51:38Z",
    "issue": "https://github.com/sagemath/sagetest/issues/2348",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/2348#issuecomment-12392",
    "user": "https://github.com/wdjoyner"
}
```

<a id='comment:6'></a>
I agree this needs fixing but, based on my reading of sage/interfaces/gap.py, I'm not sure how to do this. Do you have a suggestion William?



---

archive/issue_comments_012393.json:
```json
{
    "body": "<a id='comment:7'></a>\nI tried to figure out how the interfaces are used, and it seems to me that there will be much work to do.\n\nAm i right that, if `X` is some Sage object, `gap(X)` sends the value of `X._gap_init_()` (which is a string) through the gap interface; and similarly `singular(X)` sends `X._singular_init_()`?\n\nThe problem is that `_gap_init_` and `_singular_init_` often can not be interpreted by gap or by Singular. Examples:\n\n```\nsage: QQ._singular_init_()\n'Rationals'\n```\nThis is ok, since `gap` knows what Rationals means. But:\n\n```\nsage: QQ._singular_init_()\n'Rational Field'\n```\nThis is something that Singular does not understand! In fact, for Singular the rationals do not exist, except as the base field of a polynomial ring. So i believe there should be a `NotImplementedError` in that case.\n\n```\nsage: CyclotomicField(8)._gap_init_()\n'Cyclotomic Field of order 8 and degree 4'\nsage: CyclotomicField(8)._singular_init_()\n'Cyclotomic Field of order 8 and degree 4'\n```\nNeither gap nor Singular can interprete that string.\n\nSomething that seems inconsistent to me: the method `_singular_init_` is not always returning a string:\n\n```\nsage: QQ[x]._gap_init_()\n'PolynomialRing(Rationals, [\"x\"])'\nsage: QQ[x]._singular_init_()\n\n//   characteristic : 0\n//   number of vars : 1\n//        block   1 : ordering lp\n//                  : names    x\n//        block   2 : ordering C\nsage: type(QQ[x]._gap_init_())\n<type 'str'>\nsage: type(QQ[x]._singular_init_())\n<class 'sage.interfaces.singular.SingularElement'>\n```\n\nI found that in `sage/rings/number_field/number_field.py` there is no method `_singular_init_` or `_gap_init_`. Do you think it would solve the problem if one implements such methods?",
    "created_at": "2008-02-29T23:26:49Z",
    "issue": "https://github.com/sagemath/sagetest/issues/2348",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/2348#issuecomment-12393",
    "user": "https://github.com/simon-king-jena"
}
```

<a id='comment:7'></a>
I tried to figure out how the interfaces are used, and it seems to me that there will be much work to do.

Am i right that, if `X` is some Sage object, `gap(X)` sends the value of `X._gap_init_()` (which is a string) through the gap interface; and similarly `singular(X)` sends `X._singular_init_()`?

The problem is that `_gap_init_` and `_singular_init_` often can not be interpreted by gap or by Singular. Examples:

```
sage: QQ._singular_init_()
'Rationals'
```
This is ok, since `gap` knows what Rationals means. But:

```
sage: QQ._singular_init_()
'Rational Field'
```
This is something that Singular does not understand! In fact, for Singular the rationals do not exist, except as the base field of a polynomial ring. So i believe there should be a `NotImplementedError` in that case.

```
sage: CyclotomicField(8)._gap_init_()
'Cyclotomic Field of order 8 and degree 4'
sage: CyclotomicField(8)._singular_init_()
'Cyclotomic Field of order 8 and degree 4'
```
Neither gap nor Singular can interprete that string.

Something that seems inconsistent to me: the method `_singular_init_` is not always returning a string:

```
sage: QQ[x]._gap_init_()
'PolynomialRing(Rationals, ["x"])'
sage: QQ[x]._singular_init_()

//   characteristic : 0
//   number of vars : 1
//        block   1 : ordering lp
//                  : names    x
//        block   2 : ordering C
sage: type(QQ[x]._gap_init_())
<type 'str'>
sage: type(QQ[x]._singular_init_())
<class 'sage.interfaces.singular.SingularElement'>
```

I found that in `sage/rings/number_field/number_field.py` there is no method `_singular_init_` or `_gap_init_`. Do you think it would solve the problem if one implements such methods?



---

archive/attachments_002097.json:
```json
{
    "asset_content_type": "application/octet-stream",
    "asset_name": "numberfields_gap.patch",
    "asset_url": "tarball://root/attachments/some-uuid/ticket2348/numberfields_gap.patch",
    "created_at": "2008-03-01T10:14:42Z",
    "issue": "https://github.com/sagemath/sagetest/issues/2348",
    "type": "attachment",
    "url": "https://github.com/assets/some-id/some-uuid.patch",
    "user": "https://github.com/simon-king-jena"
}
```



---

archive/issue_comments_012394.json:
```json
{
    "body": "This solves only a part of the problem",
    "created_at": "2008-03-01T10:14:42Z",
    "issue": "https://github.com/sagemath/sagetest/issues/2348",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/2348#issuecomment-12394",
    "user": "https://github.com/simon-king-jena"
}
```

This solves only a part of the problem



---

archive/issue_comments_012395.json:
```json
{
    "body": "<a id='comment:8'></a>\nI was just attaching a patch (relative to 2.10.3.rc0) that adds a `_gap_init_` method to `NumberField_generic` and may be part of a solution. \n\nSometimes `_singular_init_` does not return a string but a SingularElement. I don't know whether it is possible to define a number field in gap in a single line (i.e., by a single string). So, it seemed reasonable to me to return a GapElement rather than a string.\n\nHowever, this would require many changes in other parts of the code. E.g., I also need a change in \n`/local/lib/python2.5/site-packages/sage/rings/polynomial/polynomial_ring.py`.\nThis seems not to be part of the mercurial repository, so i have no patch for it.\nHowever, the method `_gap_init_` of the class `PolynomialRing_general` should be like that:\n\n```\n    def _gap_init_(self):\n        br=self.base_ring()._gap_init_()\n        if isinstance(br,str):\n            return 'PolynomialRing(%s, [\"%s\"])'%(br, self.variable_name())\n        return br.PolynomialRing('[\"%s\"]'%(self.variable_name()))\n```\n\nWith these patches, the initial problem is almost solved:\n\n```\nsage: F = CyclotomicField(8)\nsage: gap(F)\n<algebraic extension over the Rationals of degree 4>\nsage: z = F.gen()\nsage: a = z+1/z\nsage: MS = MatrixSpace(F, 2, 2)\nsage: g1 = MS([[1/a,1/a],[1/a,-1/a]])\nsage: b = z^2\nsage: g2 = MS([[1,0],[0,b]])\nsage: g3 = MS([[b,0],[0,1]])\nsage: gap(g1)\n[ [ -1/2*zeta8^3+1/2*zeta8, -1/2*zeta8^3+1/2*zeta8 ],\n  [ -1/2*zeta8^3+1/2*zeta8, 1/2*zeta8^3-1/2*zeta8 ] ]\nsage: G = MatrixGroup([g1,g2,g3])\nsage: G\nMatrix group over Cyclotomic Field of order 8 and degree 4 with 3 generators:\n [[[-1/2*zeta8^3 + 1/2*zeta8, -1/2*zeta8^3 + 1/2*zeta8], [-1/2*zeta8^3 + 1/2*zeta8, 1/2*zeta8^3 - 1/2*zeta8]], [[1, 0], [0, zeta8^2]], [[zeta8^2, 0], [0, 1]]]\n```\n\nWhy is that only **almost** a solution? \nSince the line `sage: gap(F)` is necessary; otherwise `zeta8` would not be defined in gap. Hence, it would be needed to change the `_gap_init_` method of MatrixSpace, and so on and so on.\n\n*Conclusion*\n* What i do in the patch can't be a definite solution. \n* Is there a way to find a string s so that `gap(s)` returns a gap version of `F`, with the variable name `zeta8`? Having this would probably solve the problem.",
    "created_at": "2008-03-01T10:50:02Z",
    "issue": "https://github.com/sagemath/sagetest/issues/2348",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/2348#issuecomment-12395",
    "user": "https://github.com/simon-king-jena"
}
```

<a id='comment:8'></a>
I was just attaching a patch (relative to 2.10.3.rc0) that adds a `_gap_init_` method to `NumberField_generic` and may be part of a solution. 

Sometimes `_singular_init_` does not return a string but a SingularElement. I don't know whether it is possible to define a number field in gap in a single line (i.e., by a single string). So, it seemed reasonable to me to return a GapElement rather than a string.

However, this would require many changes in other parts of the code. E.g., I also need a change in 
`/local/lib/python2.5/site-packages/sage/rings/polynomial/polynomial_ring.py`.
This seems not to be part of the mercurial repository, so i have no patch for it.
However, the method `_gap_init_` of the class `PolynomialRing_general` should be like that:

```
    def _gap_init_(self):
        br=self.base_ring()._gap_init_()
        if isinstance(br,str):
            return 'PolynomialRing(%s, ["%s"])'%(br, self.variable_name())
        return br.PolynomialRing('["%s"]'%(self.variable_name()))
```

With these patches, the initial problem is almost solved:

```
sage: F = CyclotomicField(8)
sage: gap(F)
<algebraic extension over the Rationals of degree 4>
sage: z = F.gen()
sage: a = z+1/z
sage: MS = MatrixSpace(F, 2, 2)
sage: g1 = MS([[1/a,1/a],[1/a,-1/a]])
sage: b = z^2
sage: g2 = MS([[1,0],[0,b]])
sage: g3 = MS([[b,0],[0,1]])
sage: gap(g1)
[ [ -1/2*zeta8^3+1/2*zeta8, -1/2*zeta8^3+1/2*zeta8 ],
  [ -1/2*zeta8^3+1/2*zeta8, 1/2*zeta8^3-1/2*zeta8 ] ]
sage: G = MatrixGroup([g1,g2,g3])
sage: G
Matrix group over Cyclotomic Field of order 8 and degree 4 with 3 generators:
 [[[-1/2*zeta8^3 + 1/2*zeta8, -1/2*zeta8^3 + 1/2*zeta8], [-1/2*zeta8^3 + 1/2*zeta8, 1/2*zeta8^3 - 1/2*zeta8]], [[1, 0], [0, zeta8^2]], [[zeta8^2, 0], [0, 1]]]
```

Why is that only **almost** a solution? 
Since the line `sage: gap(F)` is necessary; otherwise `zeta8` would not be defined in gap. Hence, it would be needed to change the `_gap_init_` method of MatrixSpace, and so on and so on.

*Conclusion*
* What i do in the patch can't be a definite solution. 
* Is there a way to find a string s so that `gap(s)` returns a gap version of `F`, with the variable name `zeta8`? Having this would probably solve the problem.



---

archive/attachments_002098.json:
```json
{
    "asset_content_type": "application/octet-stream",
    "asset_name": "numberfields_gap.2.patch",
    "asset_url": "tarball://root/attachments/some-uuid/ticket2348/numberfields_gap.2.patch",
    "created_at": "2008-03-01T14:34:08Z",
    "issue": "https://github.com/sagemath/sagetest/issues/2348",
    "type": "attachment",
    "url": "https://github.com/assets/some-id/some-uuid.patch",
    "user": "https://github.com/simon-king-jena"
}
```



---

archive/issue_comments_012396.json:
```json
{
    "body": "This may be close to a solution",
    "created_at": "2008-03-01T14:34:08Z",
    "issue": "https://github.com/sagemath/sagetest/issues/2348",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/2348#issuecomment-12396",
    "user": "https://github.com/simon-king-jena"
}
```

This may be close to a solution



---

archive/issue_comments_012397.json:
```json
{
    "body": "<a id='comment:9'></a>\nThe second patch (again relative to rc0-version) may be close to a solution. The following now works:\n\n```\nsage: F=CyclotomicField(8)\nsage: z=F.gen()\nsage: a=z+1/z\nsage: b=z^2\nsage: MS=MatrixSpace(F,2,2)\nsage: g1=MS([[1/a,1/a],[1/a,-1/a]])\nsage: g2=MS([[1,0],[0,b]])\nsage: g3=MS([[b,0],[0,1]])\nsage: G = MatrixGroup([g1,g2,g3])\nsage: gap(g1)\n[ [ -1/2*zeta8^3+1/2*zeta8, -1/2*zeta8^3+1/2*zeta8 ],\n  [ -1/2*zeta8^3+1/2*zeta8, 1/2*zeta8^3-1/2*zeta8 ] ]\nsage: G\nMatrix group over Cyclotomic Field of order 8 and degree 4 with 3 generators:\n [[[-1/2*zeta8^3 + 1/2*zeta8, -1/2*zeta8^3 + 1/2*zeta8], [-1/2*zeta8^3 + 1/2*zeta8, 1/2*zeta8^3 - 1/2*zeta8]], [[1, 0], [0, zeta8^2]], [[zeta8^2, 0], [0, 1]]]\n```\n\nThe suggested solution works as follows.\n* F._gap_init_() returns the *name* of a gap object corresponding to F. That name is stored in the dictionary of F. If it does not exist in the dictionary, then the gap object is created first; so, that happens only once.\n* If g is an element of F, then `g._gap_init_()` first checks whether there is already a gap version of `g.parent()` (which is F). If there isn't, `F._gap_init_()` is called and creates that object. In either case, `g.__repr__()` is returned.\n* If M is a matrix with coefficients in F then the existing methods can remain unchanged.\n\nDo you think that approach makes sense? And by the way: I raise a NotImplementedError if F.is_absolute()==False, because gap can not deal with non-simple extensions.\n\nI still see some problems:\n* gap(G) does not work in the above example. So, the `_gap_init_` method for matrix groups needs being fixed.\n* In my suggested solution, it is not possible to work with non-standard gap interfaces: F._gap_init_() returns a name that is defined in the standard gap interface. Do you have an idea how this can be fixed?",
    "created_at": "2008-03-01T14:55:49Z",
    "issue": "https://github.com/sagemath/sagetest/issues/2348",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/2348#issuecomment-12397",
    "user": "https://github.com/simon-king-jena"
}
```

<a id='comment:9'></a>
The second patch (again relative to rc0-version) may be close to a solution. The following now works:

```
sage: F=CyclotomicField(8)
sage: z=F.gen()
sage: a=z+1/z
sage: b=z^2
sage: MS=MatrixSpace(F,2,2)
sage: g1=MS([[1/a,1/a],[1/a,-1/a]])
sage: g2=MS([[1,0],[0,b]])
sage: g3=MS([[b,0],[0,1]])
sage: G = MatrixGroup([g1,g2,g3])
sage: gap(g1)
[ [ -1/2*zeta8^3+1/2*zeta8, -1/2*zeta8^3+1/2*zeta8 ],
  [ -1/2*zeta8^3+1/2*zeta8, 1/2*zeta8^3-1/2*zeta8 ] ]
sage: G
Matrix group over Cyclotomic Field of order 8 and degree 4 with 3 generators:
 [[[-1/2*zeta8^3 + 1/2*zeta8, -1/2*zeta8^3 + 1/2*zeta8], [-1/2*zeta8^3 + 1/2*zeta8, 1/2*zeta8^3 - 1/2*zeta8]], [[1, 0], [0, zeta8^2]], [[zeta8^2, 0], [0, 1]]]
```

The suggested solution works as follows.
* F._gap_init_() returns the *name* of a gap object corresponding to F. That name is stored in the dictionary of F. If it does not exist in the dictionary, then the gap object is created first; so, that happens only once.
* If g is an element of F, then `g._gap_init_()` first checks whether there is already a gap version of `g.parent()` (which is F). If there isn't, `F._gap_init_()` is called and creates that object. In either case, `g.__repr__()` is returned.
* If M is a matrix with coefficients in F then the existing methods can remain unchanged.

Do you think that approach makes sense? And by the way: I raise a NotImplementedError if F.is_absolute()==False, because gap can not deal with non-simple extensions.

I still see some problems:
* gap(G) does not work in the above example. So, the `_gap_init_` method for matrix groups needs being fixed.
* In my suggested solution, it is not possible to work with non-standard gap interfaces: F._gap_init_() returns a name that is defined in the standard gap interface. Do you have an idea how this can be fixed?



---

archive/attachments_002099.json:
```json
{
    "asset_content_type": "application/octet-stream",
    "asset_name": "final_numberfields_gap.patch",
    "asset_url": "tarball://root/attachments/some-uuid/ticket2348/final_numberfields_gap.patch",
    "created_at": "2008-03-01T23:52:33Z",
    "issue": "https://github.com/sagemath/sagetest/issues/2348",
    "type": "attachment",
    "url": "https://github.com/assets/some-id/some-uuid.patch",
    "user": "https://github.com/simon-king-jena"
}
```



---

archive/issue_comments_012398.json:
```json
{
    "body": "The patch is relative to sage-2.10.3.rc0 and replaces the previous patches. I think it provides a solution of the problem",
    "created_at": "2008-03-01T23:52:33Z",
    "issue": "https://github.com/sagemath/sagetest/issues/2348",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/2348#issuecomment-12398",
    "user": "https://github.com/simon-king-jena"
}
```

The patch is relative to sage-2.10.3.rc0 and replaces the previous patches. I think it provides a solution of the problem



---

archive/issue_comments_012399.json:
```json
{
    "body": "<a id='comment:10'></a>\nI think that the last patch provides a solution. Now, simple algebraic extensions of the rationals and matrices over such extensions can by send through the gap interface. By consequence, Matrix Groups over such extensions work.\n\nExamples:\n\n```\nsage: F=CyclotomicField(8)\nsage: z=F.gen()\nsage: a=z+1/z\nsage: MS=MatrixSpace(F,2,2)\nsage: g1=MS([[1/a,1/a],[1/a,-1/a]])\nsage: b=z^2\nsage: g2=MS([[1,0],[0,b]])\nsage: g3=MS([[b,0],[0,1]])\nsage: gap(g1)*gap(g2)\n[ [ (1/2*a-1/2*a^3), (1/2*a+1/2*a^3) ], [ (1/2*a-1/2*a^3), (-1/2*a-1/2*a^3) ] ]\n```\nRemark: So far, the generator of the gap-version of F is alway displayed as 'a'. I did not learn yet how to make it being displayed by gap as 'zeta8', which is how sage displays the generator of F.\n\n```\nsage: (gap(g1)*gap(g2))^12\n[ [ !-1, !0 ], [ !0, !-1 ] ]\n```\nRemark: '!-1' is the integer -1 interpreted in the gap number field.\n\n```\nsage: G = MatrixGroup([g1,g2,g3])\nsage: G\nMatrix group over Cyclotomic Field of order 8 and degree 4 with 3 generators:\n [[[-1/2*zeta8^3 + 1/2*zeta8, -1/2*zeta8^3 + 1/2*zeta8], [-1/2*zeta8^3 + 1/2*zeta8, 1/2*zeta8^3 - 1/2*zeta8]], [[1, 0], [0, zeta8^2]], [[zeta8^2, 0], [0, 1]]]\nsage: G.order()\n192\n```\n\nThe last line is based on applying a gap method to G. So, it seems to me that everything works. Making the generator of gap(F) appear as 'a' would probably be a trivial change.",
    "created_at": "2008-03-02T00:06:40Z",
    "issue": "https://github.com/sagemath/sagetest/issues/2348",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/2348#issuecomment-12399",
    "user": "https://github.com/simon-king-jena"
}
```

<a id='comment:10'></a>
I think that the last patch provides a solution. Now, simple algebraic extensions of the rationals and matrices over such extensions can by send through the gap interface. By consequence, Matrix Groups over such extensions work.

Examples:

```
sage: F=CyclotomicField(8)
sage: z=F.gen()
sage: a=z+1/z
sage: MS=MatrixSpace(F,2,2)
sage: g1=MS([[1/a,1/a],[1/a,-1/a]])
sage: b=z^2
sage: g2=MS([[1,0],[0,b]])
sage: g3=MS([[b,0],[0,1]])
sage: gap(g1)*gap(g2)
[ [ (1/2*a-1/2*a^3), (1/2*a+1/2*a^3) ], [ (1/2*a-1/2*a^3), (-1/2*a-1/2*a^3) ] ]
```
Remark: So far, the generator of the gap-version of F is alway displayed as 'a'. I did not learn yet how to make it being displayed by gap as 'zeta8', which is how sage displays the generator of F.

```
sage: (gap(g1)*gap(g2))^12
[ [ !-1, !0 ], [ !0, !-1 ] ]
```
Remark: '!-1' is the integer -1 interpreted in the gap number field.

```
sage: G = MatrixGroup([g1,g2,g3])
sage: G
Matrix group over Cyclotomic Field of order 8 and degree 4 with 3 generators:
 [[[-1/2*zeta8^3 + 1/2*zeta8, -1/2*zeta8^3 + 1/2*zeta8], [-1/2*zeta8^3 + 1/2*zeta8, 1/2*zeta8^3 - 1/2*zeta8]], [[1, 0], [0, zeta8^2]], [[zeta8^2, 0], [0, 1]]]
sage: G.order()
192
```

The last line is based on applying a gap method to G. So, it seems to me that everything works. Making the generator of gap(F) appear as 'a' would probably be a trivial change.



---

archive/issue_events_011723.json:
```json
{
    "actor": "https://github.com/simon-king-jena",
    "created_at": "2008-03-02T00:06:40Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sagetest/issues/2348",
    "label": "needs review",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/2348#event-11723"
}
```



---

archive/issue_events_011724.json:
```json
{
    "actor": "https://github.com/wdjoyner",
    "created_at": "2008-03-02T11:45:57Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sagetest/issues/2348",
    "label": "needs review",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/2348#event-11724"
}
```



---

archive/issue_events_011725.json:
```json
{
    "actor": "https://github.com/wdjoyner",
    "created_at": "2008-03-02T11:45:57Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sagetest/issues/2348",
    "label": "positive review",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/2348#event-11725"
}
```



---

archive/issue_comments_012400.json:
```json
{
    "body": "<a id='comment:11'></a>\nApplies cleanly and fixes the problem. Great job Simon!\nRecommend acceptance.",
    "created_at": "2008-03-02T11:45:57Z",
    "issue": "https://github.com/sagemath/sagetest/issues/2348",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/2348#issuecomment-12400",
    "user": "https://github.com/wdjoyner"
}
```

<a id='comment:11'></a>
Applies cleanly and fixes the problem. Great job Simon!
Recommend acceptance.



---

archive/issue_comments_012401.json:
```json
{
    "body": "<a id='comment:12'></a>\nReplying to [wdj](#comment%3A11):\n> Applies cleanly and fixes the problem. Great job Simon!\n> Recommend acceptance.\n\n\nThere is one caveat: I had to fix the `_gap_init_` method of matrices, since in gap an expression of the form [[field elements,...],[...]] is not a matrix. That expression becomes a matrix in gap only when multiplied with One(field).\n\nBy consequence, the doc test of the `_gap_init_` method of MatrixGroup has to be modified. That modification is part of the patch provided in ticket #2367.",
    "created_at": "2008-03-02T14:14:03Z",
    "issue": "https://github.com/sagemath/sagetest/issues/2348",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/2348#issuecomment-12401",
    "user": "https://github.com/simon-king-jena"
}
```

<a id='comment:12'></a>
Replying to [wdj](#comment%3A11):
> Applies cleanly and fixes the problem. Great job Simon!
> Recommend acceptance.


There is one caveat: I had to fix the `_gap_init_` method of matrices, since in gap an expression of the form [[field elements,...],[...]] is not a matrix. That expression becomes a matrix in gap only when multiplied with One(field).

By consequence, the doc test of the `_gap_init_` method of MatrixGroup has to be modified. That modification is part of the patch provided in ticket #2367.



---

archive/issue_comments_012402.json:
```json
{
    "body": "<a id='comment:13'></a>\nReplying to [wdj](#comment%3A11):\n> Recommend acceptance.\n\n\nI still think it may be premature to include the patch. Nathan Dunfield gave me a hint on sage-support http://groups.google.com/group/sage-support/browse_thread/thread/ee3c23ea1b86cfe9?hl=en\n\nI think it would be better to change _gap_init_() for number fields according to Nathan's hint. But i think the rest of the patch can stay as it is.\n\nI hope tomorrow i will be able to submit a \"cleaner\" patch.",
    "created_at": "2008-03-02T14:56:25Z",
    "issue": "https://github.com/sagemath/sagetest/issues/2348",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/2348#issuecomment-12402",
    "user": "https://github.com/simon-king-jena"
}
```

<a id='comment:13'></a>
Replying to [wdj](#comment%3A11):
> Recommend acceptance.


I still think it may be premature to include the patch. Nathan Dunfield gave me a hint on sage-support http://groups.google.com/group/sage-support/browse_thread/thread/ee3c23ea1b86cfe9?hl=en

I think it would be better to change _gap_init_() for number fields according to Nathan's hint. But i think the rest of the patch can stay as it is.

I hope tomorrow i will be able to submit a "cleaner" patch.



---

archive/issue_comments_012403.json:
```json
{
    "body": "<a id='comment:14'></a>\nReplying to [SimonKing](#comment%3A13):\n> I still think it may be premature to include the patch. Nathan Dunfield gave me a hint on sage-support http://groups.google.com/group/sage-support/browse_thread/thread/ee3c23ea1b86cfe9?hl=en\n> \n> I think it would be better to change _gap_init_() for number fields according to Nathan's hint. \n\n\nNo, it doesn't work. If field elements are created using inline functions, they belong to different (but isomorphic) fields in gap and thus can not be added. Note that in the following example, x1 and x2 have the same definition, but can't be added to each other.\n\n```\nsage: x1=gap('GeneratorsOfField(CallFuncList(function() local x,E; x:=Indeterminate(Rationals,\"x\"); E:=AlgebraicExtension(Rationals,x^4 + 1); return E; end, []))[1]')\nsage: x2=gap('GeneratorsOfField(CallFuncList(function() local x,E; x:=Indeterminate(Rationals,\"x\"); E:=AlgebraicExtension(Rationals,x^4 + 1); return E; end, []))[1]')\nsage: x2+x2\n(2*a)\nsage: x1+x2\n  <Traceback>\n```\n\nSo, i will return to my previous approach, but taking more care about the doc tests.",
    "created_at": "2008-03-02T17:33:51Z",
    "issue": "https://github.com/sagemath/sagetest/issues/2348",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/2348#issuecomment-12403",
    "user": "https://github.com/simon-king-jena"
}
```

<a id='comment:14'></a>
Replying to [SimonKing](#comment%3A13):
> I still think it may be premature to include the patch. Nathan Dunfield gave me a hint on sage-support http://groups.google.com/group/sage-support/browse_thread/thread/ee3c23ea1b86cfe9?hl=en
> 
> I think it would be better to change _gap_init_() for number fields according to Nathan's hint. 


No, it doesn't work. If field elements are created using inline functions, they belong to different (but isomorphic) fields in gap and thus can not be added. Note that in the following example, x1 and x2 have the same definition, but can't be added to each other.

```
sage: x1=gap('GeneratorsOfField(CallFuncList(function() local x,E; x:=Indeterminate(Rationals,"x"); E:=AlgebraicExtension(Rationals,x^4 + 1); return E; end, []))[1]')
sage: x2=gap('GeneratorsOfField(CallFuncList(function() local x,E; x:=Indeterminate(Rationals,"x"); E:=AlgebraicExtension(Rationals,x^4 + 1); return E; end, []))[1]')
sage: x2+x2
(2*a)
sage: x1+x2
  <Traceback>
```

So, i will return to my previous approach, but taking more care about the doc tests.



---

archive/issue_comments_012404.json:
```json
{
    "body": "First apply the previous patch, then this patch. It fixes and extends doc tests related with the gap interface of number fields",
    "created_at": "2008-03-02T22:05:35Z",
    "issue": "https://github.com/sagemath/sagetest/issues/2348",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/2348#issuecomment-12404",
    "user": "https://github.com/simon-king-jena"
}
```

First apply the previous patch, then this patch. It fixes and extends doc tests related with the gap interface of number fields



---

archive/attachments_002100.json:
```json
{
    "asset_content_type": "application/octet-stream",
    "asset_name": "fix_doctests_gap_numberfield.patch",
    "asset_url": "tarball://root/attachments/some-uuid/ticket2348/fix_doctests_gap_numberfield.patch",
    "created_at": "2008-03-02T22:18:28Z",
    "issue": "https://github.com/sagemath/sagetest/issues/2348",
    "type": "attachment",
    "url": "https://github.com/assets/some-id/some-uuid.patch",
    "user": "https://github.com/simon-king-jena"
}
```



---

archive/issue_comments_012405.json:
```json
{
    "body": "<a id='comment:15'></a>\nThe patch fix_doctests_gap_numberfield.patch should be applied after final_numberfields_gap.patch. \n\nThe new patch fixes some problems with doc tests. Also, it adds more doc tests. Moreover, now the generator of a number field gets the same name in gap and in sage, which may be convenient for the users.\n\nThe following doctests related with and extended by the patch pass:\nmatrix_group.py,\nnumber_field.py,\nnumber_field_element.pyx,\nmatrix1.pyx\n\n@wdjoyner: Could you please see if your positive review still holds when adding the new patch?",
    "created_at": "2008-03-02T22:18:28Z",
    "issue": "https://github.com/sagemath/sagetest/issues/2348",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/2348#issuecomment-12405",
    "user": "https://github.com/simon-king-jena"
}
```

<a id='comment:15'></a>
The patch fix_doctests_gap_numberfield.patch should be applied after final_numberfields_gap.patch. 

The new patch fixes some problems with doc tests. Also, it adds more doc tests. Moreover, now the generator of a number field gets the same name in gap and in sage, which may be convenient for the users.

The following doctests related with and extended by the patch pass:
matrix_group.py,
number_field.py,
number_field_element.pyx,
matrix1.pyx

@wdjoyner: Could you please see if your positive review still holds when adding the new patch?



---

archive/issue_events_011726.json:
```json
{
    "actor": "https://github.com/simon-king-jena",
    "created_at": "2008-03-02T22:28:56Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/2348",
    "milestone": "sage-3.0",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/2348#event-11726"
}
```



---

archive/issue_events_011727.json:
```json
{
    "actor": "https://github.com/simon-king-jena",
    "created_at": "2008-03-02T22:28:56Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/2348",
    "milestone": "sage-2.10.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/2348#event-11727"
}
```



---

archive/issue_comments_012406.json:
```json
{
    "body": "<a id='comment:17'></a>\nThis applied cleanly against 2.10.3.rc0 and passed sage -testall.\nPositive review (again).",
    "created_at": "2008-03-02T23:37:23Z",
    "issue": "https://github.com/sagemath/sagetest/issues/2348",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/2348#issuecomment-12406",
    "user": "https://github.com/wdjoyner"
}
```

<a id='comment:17'></a>
This applied cleanly against 2.10.3.rc0 and passed sage -testall.
Positive review (again).



---

archive/issue_comments_012407.json:
```json
{
    "body": "<a id='comment:18'></a>\nThis ticket, together with #2367, is now ticket #2395. First reason is that we got a new sage pre-release. \n\nSecond reason is that my suggestions in this ticket for fixing the gap interface ought to be changed: By hints of Nathan Dunfield, i learned that `_gap_init_` is in fact called only once, and the objects in the gap interface are cached. Hence, using gap inline functions work. This different approach is in ticket #2395.\n\nThird reason is that #2367 and this ticket belong closely together, hence, they should be worked on in one ticket.",
    "created_at": "2008-03-05T10:47:22Z",
    "issue": "https://github.com/sagemath/sagetest/issues/2348",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/2348#issuecomment-12407",
    "user": "https://github.com/simon-king-jena"
}
```

<a id='comment:18'></a>
This ticket, together with #2367, is now ticket #2395. First reason is that we got a new sage pre-release. 

Second reason is that my suggestions in this ticket for fixing the gap interface ought to be changed: By hints of Nathan Dunfield, i learned that `_gap_init_` is in fact called only once, and the objects in the gap interface are cached. Hence, using gap inline functions work. This different approach is in ticket #2395.

Third reason is that #2367 and this ticket belong closely together, hence, they should be worked on in one ticket.



---

archive/issue_events_011728.json:
```json
{
    "actor": "https://github.com/simon-king-jena",
    "created_at": "2008-03-05T10:47:22Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sagetest/issues/2348",
    "label": "invalid",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/2348#event-11728"
}
```



---

archive/issue_events_011729.json:
```json
{
    "actor": "https://github.com/simon-king-jena",
    "created_at": "2008-03-05T10:47:22Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sagetest/issues/2348",
    "label": "positive review",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/2348#event-11729"
}
```



---

archive/issue_events_011730.json:
```json
{
    "actor": "https://github.com/simon-king-jena",
    "created_at": "2008-03-05T10:47:22Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/2348",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/2348#event-11730"
}
```
