# Issue 2408: MPolynomial_libsingular.factor does not set units

archive/issues_002408.json:
```json
{
    "assignees": [
        "https://github.com/malb"
    ],
    "body": "MPolynomial_libsingular.factor does not set units.\n\nWe now have\n\n```\nsage: R.<x,y,z> = QQ[]\nsage: p = -1*(x*y+z)  \nsage: F = p.factor(); F\n(-1) * (x*y + z)\nsage: F.unit()\n1\nsage: len(F)\n2\n```\n\nIt should be\n\n```\nsage: F = p.factor(); F\nx*y + z\nsage: F.unit()\n-1\nsage: len(F)\n1\n\nComponent: **commutative algebra**\n\n_Issue created by migration from https://trac.sagemath.org/ticket/2408_\n\n",
    "closed_at": "2008-03-06T18:07:03Z",
    "created_at": "2008-03-06T17:36:30Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/bug",
        "https://github.com/sagemath/sage/labels/c%3A%20commutative%20algebra",
        "https://github.com/sagemath/sage/labels/invalid"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-2.10.3",
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "MPolynomial_libsingular.factor does not set units",
    "type": "issue",
    "updated_at": "2008-03-06T18:07:03Z",
    "url": "https://github.com/sagemath/sage/issues/2408",
    "user": "https://github.com/burcin"
}
```
MPolynomial_libsingular.factor does not set units.

We now have

```
sage: R.<x,y,z> = QQ[]
sage: p = -1*(x*y+z)  
sage: F = p.factor(); F
(-1) * (x*y + z)
sage: F.unit()
1
sage: len(F)
2
```

It should be

```
sage: F = p.factor(); F
x*y + z
sage: F.unit()
-1
sage: len(F)
1

Component: **commutative algebra**

_Issue created by migration from https://trac.sagemath.org/ticket/2408_





---

archive/issue_events_025008.json:
```json
{
    "actor": "https://github.com/burcin",
    "created_at": "2008-03-06T17:36:30Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/2408",
    "milestone_number": null,
    "milestone_title": "sage-2.10.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/2408#event-25008"
}
```



---

archive/issue_events_025009.json:
```json
{
    "actor": "https://github.com/burcin",
    "created_at": "2008-03-06T17:36:30Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/2408",
    "label": "https://github.com/sagemath/sage/labels/c%3A%20commutative%20algebra",
    "label_color": "0000ff",
    "label_name": "c: commutative algebra",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/2408#event-25009"
}
```



---

archive/issue_events_025010.json:
```json
{
    "actor": "https://github.com/burcin",
    "created_at": "2008-03-06T17:36:30Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/2408",
    "label": "https://github.com/sagemath/sage/labels/p%3A%205%20%E2%80%93%20trivial",
    "label_color": "fff9e5",
    "label_name": "p: 5 \u2013 trivial",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/2408#event-25010"
}
```



---

archive/issue_events_025011.json:
```json
{
    "actor": "https://github.com/burcin",
    "created_at": "2008-03-06T17:36:30Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/2408",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "d73a4a",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/2408#event-25011"
}
```



---

archive/issue_events_025012.json:
```json
{
    "actor": "https://github.com/malb",
    "created_at": "2008-03-06T17:36:30Z",
    "event": "assigned",
    "issue": "https://github.com/sagemath/sage/issues/2408",
    "subject": "https://github.com/burcin",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/2408#event-25012"
}
```



---

archive/issue_comments_012165.json:
```json
{
    "body": "<div id=\"comment:1\" align=\"right\">comment:1</div>\n\nThis works on 2.10.2, I was using 2.10 at the time. Sorry for the noise.",
    "created_at": "2008-03-06T18:07:03Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/2408",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/2408#issuecomment-12165",
    "user": "https://github.com/burcin"
}
```

<div id="comment:1" align="right">comment:1</div>

This works on 2.10.2, I was using 2.10 at the time. Sorry for the noise.



---

archive/issue_events_025013.json:
```json
{
    "actor": "https://github.com/burcin",
    "created_at": "2008-03-06T18:07:03Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/2408",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/2408#event-25013"
}
```



---

archive/issue_events_025014.json:
```json
{
    "actor": "https://github.com/burcin",
    "created_at": "2008-03-06T18:07:03Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/2408",
    "label": "https://github.com/sagemath/sage/labels/p%3A%205%20%E2%80%93%20trivial",
    "label_color": "fff9e5",
    "label_name": "p: 5 \u2013 trivial",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/2408#event-25014"
}
```



---

archive/issue_events_025015.json:
```json
{
    "actor": "https://github.com/burcin",
    "created_at": "2008-03-06T18:07:03Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/2408",
    "label": "https://github.com/sagemath/sage/labels/invalid",
    "label_color": "a6a6a6",
    "label_name": "invalid",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/2408#event-25015"
}
```
