# Issue 2408: MPolynomial_libsingular.factor does not set units

archive/issues_002408.json:
```json
{
    "assignees": [],
    "body": "MPolynomial_libsingular.factor does not set units.\n\nWe now have\n\n```\nsage: R.<x,y,z> = QQ[]\nsage: p = -1*(x*y+z)  \nsage: F = p.factor(); F\n(-1) * (x*y + z)\nsage: F.unit()\n1\nsage: len(F)\n2\n```\n\nIt should be\n\n```\nsage: F = p.factor(); F\nx*y + z\nsage: F.unit()\n-1\nsage: len(F)\n1\n\n**Assignee:** @malb\n\nIssue created by migration from https://trac.sagemath.org/ticket/2408\n\n",
    "closed_at": "2008-03-06T18:07:03Z",
    "created_at": "2008-03-06T17:36:30Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20commutative%20algebra",
        "https://github.com/sagemath/sage/labels/trivial",
        "https://github.com/sagemath/sage/labels/bug",
        "https://github.com/sagemath/sage/labels/invalid"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-2.10.3",
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "MPolynomial_libsingular.factor does not set units",
    "type": "issue",
    "updated_at": "2008-03-06T18:07:03Z",
    "url": "https://github.com/sagemath/sage/issues/2408",
    "user": "https://github.com/burcin"
}
```
MPolynomial_libsingular.factor does not set units.

We now have

```
sage: R.<x,y,z> = QQ[]
sage: p = -1*(x*y+z)  
sage: F = p.factor(); F
(-1) * (x*y + z)
sage: F.unit()
1
sage: len(F)
2
```

It should be

```
sage: F = p.factor(); F
x*y + z
sage: F.unit()
-1
sage: len(F)
1

**Assignee:** @malb

Issue created by migration from https://trac.sagemath.org/ticket/2408





---

archive/issue_comments_012807.json:
```json
{
    "body": "<a id='comment:1'></a>\nThis works on 2.10.2, I was using 2.10 at the time. Sorry for the noise.",
    "created_at": "2008-03-06T18:07:03Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/2408",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/2408#issuecomment-12807",
    "user": "https://github.com/burcin"
}
```

<a id='comment:1'></a>
This works on 2.10.2, I was using 2.10 at the time. Sorry for the noise.



---

archive/issue_events_012147.json:
```json
{
    "actor": "https://github.com/burcin",
    "created_at": "2008-03-06T18:07:03Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/2408",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/2408#event-12147"
}
```



---

archive/issue_events_012148.json:
```json
{
    "actor": "https://github.com/burcin",
    "created_at": "2008-03-06T18:07:03Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/2408",
    "label": "https://github.com/sagemath/sage/labels/invalid",
    "label_color": "008080",
    "label_name": "invalid",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/2408#event-12148"
}
```
