# Issue 2429: block_matrix command should be consistent with the syntax of the matrix command

archive/issues_002429.json:
```json
{
    "body": "The block matrix command uses a slightly different syntax than the matrix command, leading to confusion.  It would be great to fix it so that the following examples would work.  Assume that the xi variables below are matrices\n\n```\nsage: # Throw an error if the dimensions of the blocks don't match up correctly.\nsage: # explicitly specify the positions of the blocks\nsage: block_matrix([[x1,x2],[x3,x4]])\nsage: block_matrix([[x1,x2,x3],[x4,x5,x6]])\nsage: # dimensions are the numbers of block rows and columns\nsage: block_matrix(2,3, [x1,x2,x3,x4,x5,x6])\nsage: # coerce the matrix to a specific ring\nsage: block_matrix(QQ,2,3,[x1,x2,x3,x4,x5,x6])\nsage: # 1 and 0 should still be interpreted as the identity and zero matrices\nsage: block_matrix([[x1,1],[1,x2]])\nsage: # if only one dimension is given, assume the matrix is square\nsage: block_matrix(QQ,2,[x1,x2,x3,x4])\nsage: block_matrix(2,[x1,x2,x3,x4])\nsage: # the following works now\nsage: block_matrix([x1,x2,x3,x4])\n```\n\n\n**Assignee:** @williamstein\n\n**CC:**  @jdemeyer\n\n**Reviewer:** Willem Jan Palenstijn\n\nIssue created by migration from https://trac.sagemath.org/ticket/2429\n\n",
    "closed_at": "2011-02-16T10:36:07Z",
    "created_at": "2008-03-08T20:23:19Z",
    "labels": [
        "component: linear algebra",
        "enhancement",
        "duplicate"
    ],
    "title": "block_matrix command should be consistent with the syntax of the matrix command",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/2429",
    "user": "https://github.com/jasongrout"
}
```
The block matrix command uses a slightly different syntax than the matrix command, leading to confusion.  It would be great to fix it so that the following examples would work.  Assume that the xi variables below are matrices

```
sage: # Throw an error if the dimensions of the blocks don't match up correctly.
sage: # explicitly specify the positions of the blocks
sage: block_matrix([[x1,x2],[x3,x4]])
sage: block_matrix([[x1,x2,x3],[x4,x5,x6]])
sage: # dimensions are the numbers of block rows and columns
sage: block_matrix(2,3, [x1,x2,x3,x4,x5,x6])
sage: # coerce the matrix to a specific ring
sage: block_matrix(QQ,2,3,[x1,x2,x3,x4,x5,x6])
sage: # 1 and 0 should still be interpreted as the identity and zero matrices
sage: block_matrix([[x1,1],[1,x2]])
sage: # if only one dimension is given, assume the matrix is square
sage: block_matrix(QQ,2,[x1,x2,x3,x4])
sage: block_matrix(2,[x1,x2,x3,x4])
sage: # the following works now
sage: block_matrix([x1,x2,x3,x4])
```


**Assignee:** @williamstein

**CC:**  @jdemeyer

**Reviewer:** Willem Jan Palenstijn

Issue created by migration from https://trac.sagemath.org/ticket/2429





---

archive/issue_comments_013217.json:
```json
{
    "body": "<a id='comment:1'></a>\nAs commented in the original patch, the command \n\n```\nsage:  block_matrix([x1,x2,x3,x4])\n```\n\"works\" where \"works\" means that it makes a 2x2 matrix of submatrices.  While that was what I expected when I used the command, it is quite ambiguous and I felt like I was on shaky ground while writing my own code on top of it.  I do not like the ambiguity of that.\n\nNote that it is also inconsistent with the matrix command:\n\n```\nsage: matrix([1,2,3,4])\n[1 2 3 4]\n```\nwhich makes a 1x4 matrix.\n\nI'd say they should both make an 1xn matrix (or matrix of submatrices).  Indeed, I'd almost rather that the syntax with a simple list and no explicit dimensions be banned outright when we don't know the dimensions from some parent object due to ambiguity.  Seems to go along with \"Explicit is better than implicit.\"",
    "created_at": "2008-11-11T15:09:23Z",
    "issue": "https://github.com/sagemath/sagetest/issues/2429",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/2429#issuecomment-13217",
    "user": "https://trac.sagemath.org/admin/accounts/users/jbmohler"
}
```

<a id='comment:1'></a>
As commented in the original patch, the command 

```
sage:  block_matrix([x1,x2,x3,x4])
```
"works" where "works" means that it makes a 2x2 matrix of submatrices.  While that was what I expected when I used the command, it is quite ambiguous and I felt like I was on shaky ground while writing my own code on top of it.  I do not like the ambiguity of that.

Note that it is also inconsistent with the matrix command:

```
sage: matrix([1,2,3,4])
[1 2 3 4]
```
which makes a 1x4 matrix.

I'd say they should both make an 1xn matrix (or matrix of submatrices).  Indeed, I'd almost rather that the syntax with a simple list and no explicit dimensions be banned outright when we don't know the dimensions from some parent object due to ambiguity.  Seems to go along with "Explicit is better than implicit."



---

archive/issue_comments_013218.json:
```json
{
    "body": "**Upstream:** N/A",
    "created_at": "2011-01-12T01:48:23Z",
    "issue": "https://github.com/sagemath/sagetest/issues/2429",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/2429#issuecomment-13218",
    "user": "https://github.com/wjp"
}
```

**Upstream:** N/A



---

archive/issue_comments_013219.json:
```json
{
    "body": "<a id='comment:2'></a>\nThere is now a patch at #4492 that handles this issue too.",
    "created_at": "2011-01-12T01:48:23Z",
    "issue": "https://github.com/sagemath/sagetest/issues/2429",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/2429#issuecomment-13219",
    "user": "https://github.com/wjp"
}
```

<a id='comment:2'></a>
There is now a patch at #4492 that handles this issue too.



---

archive/issue_comments_013220.json:
```json
{
    "body": "<a id='comment:3'></a>\nSince ticket #4492 has been merged, this can now be closed too. Jeroen, could you do so?",
    "created_at": "2011-02-16T10:09:07Z",
    "issue": "https://github.com/sagemath/sagetest/issues/2429",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/2429#issuecomment-13220",
    "user": "https://github.com/wjp"
}
```

<a id='comment:3'></a>
Since ticket #4492 has been merged, this can now be closed too. Jeroen, could you do so?



---

archive/issue_comments_013221.json:
```json
{
    "body": "**Reviewer:** Willem Jan Palenstijn",
    "created_at": "2011-02-16T10:09:07Z",
    "issue": "https://github.com/sagemath/sagetest/issues/2429",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/2429#issuecomment-13221",
    "user": "https://github.com/wjp"
}
```

**Reviewer:** Willem Jan Palenstijn



---

archive/issue_events_012576.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2011-02-16T10:36:07Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/2429",
    "milestone": "sage-4.6.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/2429#event-12576"
}
```



---

archive/issue_events_012577.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2011-02-16T10:36:07Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sagetest/issues/2429",
    "label": "duplicate/invalid/wontfix",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/2429#event-12577"
}
```



---

archive/issue_events_012578.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2011-02-16T10:36:07Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/2429",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/2429#event-12578"
}
```



---

archive/issue_events_012579.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2011-02-16T10:36:07Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sagetest/issues/2429",
    "label": "duplicate",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/2429#event-12579"
}
```
