# Issue 2971: One method of creating a Laurent poly ring doesn't give access to the variables

archive/issues_002971.json:
```json
{
    "assignees": [],
    "body": "One method of creating a Laurent poly ring doesn't give access to the variables.\n\n```\nsage: R = LaurentPolynomialRing(QQ,'x',3) ; R\nMultivariate Laurent Polynomial Ring in x0, x1, x2 over Rational Field\nsage: x0\n---------------------------------------------------------------------------\n<type 'exceptions.NameError'>             Traceback (most recent call last)\n\n/home/bump/sage/<ipython console> in <module>()\n\n<type 'exceptions.NameError'>: name 'x0' is not defined\n```\n\n**Assignee:** @mwhansen\n\nIssue created by migration from https://trac.sagemath.org/ticket/2971\n\n",
    "closed_at": "2008-04-20T05:32:03Z",
    "created_at": "2008-04-20T05:26:13Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20combinatorics",
        "https://github.com/sagemath/sage/labels/bug",
        "https://github.com/sagemath/sage/labels/invalid"
    ],
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "One method of creating a Laurent poly ring doesn't give access to the variables",
    "type": "issue",
    "updated_at": "2008-04-20T05:42:03Z",
    "url": "https://github.com/sagemath/sage/issues/2971",
    "user": "https://github.com/dwbump"
}
```
One method of creating a Laurent poly ring doesn't give access to the variables.

```
sage: R = LaurentPolynomialRing(QQ,'x',3) ; R
Multivariate Laurent Polynomial Ring in x0, x1, x2 over Rational Field
sage: x0
---------------------------------------------------------------------------
<type 'exceptions.NameError'>             Traceback (most recent call last)

/home/bump/sage/<ipython console> in <module>()

<type 'exceptions.NameError'>: name 'x0' is not defined
```

**Assignee:** @mwhansen

Issue created by migration from https://trac.sagemath.org/ticket/2971





---

archive/issue_events_015663.json:
```json
{
    "actor": "https://github.com/mwhansen",
    "created_at": "2008-04-20T05:32:03Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/2971",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/2971#event-15663"
}
```



---

archive/issue_comments_016325.json:
```json
{
    "body": "<a id='comment:1'></a>\nHi Dan,\n\nThat is by design, and the other polynomial rings work that way as well.\n\n```\nsage: R = PolynomialRing(QQ,'x',3)\nsage: x0\n---------------------------------------------------------------------------\n<type 'exceptions.NameError'>             Traceback (most recent call last)\n\n/opt/sage-3.0.alpha6/devel/sage-839/<ipython console> in <module>()\n\n<type 'exceptions.NameError'>: name 'x0' is not defined\n```\n\nYou can use the .inject_variables() method to get access to the variables.\n\n```\nsage: R.inject_variables()\nDefining x0, x1, x2\nsage: x0\nx0\n```",
    "created_at": "2008-04-20T05:32:03Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/2971",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/2971#issuecomment-16325",
    "user": "https://github.com/mwhansen"
}
```

<a id='comment:1'></a>
Hi Dan,

That is by design, and the other polynomial rings work that way as well.

```
sage: R = PolynomialRing(QQ,'x',3)
sage: x0
---------------------------------------------------------------------------
<type 'exceptions.NameError'>             Traceback (most recent call last)

/opt/sage-3.0.alpha6/devel/sage-839/<ipython console> in <module>()

<type 'exceptions.NameError'>: name 'x0' is not defined
```

You can use the .inject_variables() method to get access to the variables.

```
sage: R.inject_variables()
Defining x0, x1, x2
sage: x0
x0
```



---

archive/issue_events_015664.json:
```json
{
    "actor": "https://github.com/sagetrac-mabshoff",
    "created_at": "2008-04-20T05:42:03Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/2971",
    "milestone_number": null,
    "milestone_title": "sage-3.0",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/2971#event-15664"
}
```
