# Issue 24010: method number_of_terms of InfinitePolynomialRing fails for zero polynomial

archive/issues_023773.json:
```json
{
    "body": "\n```\nsage: R.<x> = InfinitePolynomialRing(ZZ)\nsage: (x[17]+x[42]).number_of_terms()\n2\nsage: R(0).number_of_terms()\n...\nAttributeError: <class 'sage.rings.polynomial.infinite_polynomial_element.InfinitePolynomial_sparse'> has no attribute number_of_terms\n```\n\n**Status:** new\n\nIssue created by migration from https://trac.sagemath.org/ticket/24010\n\n",
    "created_at": "2017-10-11T07:36:50Z",
    "labels": [
        "component: algebra",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-8.1",
    "title": "method number_of_terms of InfinitePolynomialRing fails for zero polynomial",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/24010",
    "user": "https://github.com/zimmermann6"
}
```

```
sage: R.<x> = InfinitePolynomialRing(ZZ)
sage: (x[17]+x[42]).number_of_terms()
2
sage: R(0).number_of_terms()
...
AttributeError: <class 'sage.rings.polynomial.infinite_polynomial_element.InfinitePolynomial_sparse'> has no attribute number_of_terms
```

**Status:** new

Issue created by migration from https://trac.sagemath.org/ticket/24010





---

archive/issue_comments_455933.json:
```json
{
    "body": "<a id='comment:1'></a>\nI noticed another problem that the elements are not respecting the sparseness of the parent:\n\n```\nsage: R.<x> = InfinitePolynomialRing(ZZ)\nsage: R\nInfinite polynomial ring in x over Integer Ring\nsage: type(R)\n<class 'sage.rings.polynomial.infinite_polynomial_ring.InfinitePolynomialRing_dense_with_category'>\nsage: type(x[0])\n<class 'sage.rings.polynomial.infinite_polynomial_element.InfinitePolynomial_dense'>\nsage: type(R.zero())\n<class 'sage.rings.polynomial.infinite_polynomial_element.InfinitePolynomial_sparse'>\n```\nHowever, it turns out that is unrelated to this ticket. Instead, extra attributes such as `number_of_terms` are obtained from the wrapped object:\n\n```\nsage: R.zero()._p.parent()\nInteger Ring\nsage: x[0]._p.parent()\nMultivariate Polynomial Ring in x_1, x_0 over Integer Ring\n```\nFor consistency, constants should be in some polynomial ring (perhaps with 0 variables). This whole thing likely needs quite a bit of cleanup (at some point).",
    "created_at": "2017-10-13T01:33:29Z",
    "issue": "https://github.com/sagemath/sagetest/issues/24010",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/24010#issuecomment-455933",
    "user": "https://github.com/tscrim"
}
```


<a id='comment:1'></a>
I noticed another problem that the elements are not respecting the sparseness of the parent:

```
sage: R.<x> = InfinitePolynomialRing(ZZ)
sage: R
Infinite polynomial ring in x over Integer Ring
sage: type(R)
<class 'sage.rings.polynomial.infinite_polynomial_ring.InfinitePolynomialRing_dense_with_category'>
sage: type(x[0])
<class 'sage.rings.polynomial.infinite_polynomial_element.InfinitePolynomial_dense'>
sage: type(R.zero())
<class 'sage.rings.polynomial.infinite_polynomial_element.InfinitePolynomial_sparse'>
```
However, it turns out that is unrelated to this ticket. Instead, extra attributes such as `number_of_terms` are obtained from the wrapped object:

```
sage: R.zero()._p.parent()
Integer Ring
sage: x[0]._p.parent()
Multivariate Polynomial Ring in x_1, x_0 over Integer Ring
```
For consistency, constants should be in some polynomial ring (perhaps with 0 variables). This whole thing likely needs quite a bit of cleanup (at some point).
