# Issue 24296: min() is wrong with interval as 2nd argument

archive/issues_024059.json:
```json
{
    "body": "```\nsage: min(1,RIF(0,2))\n1\nsage: min(RIF(0,2),1)\n[0.00000000000000000 .. 2.0000000000000000]\n```\nThe first result is wrong, the second is correct (and since `min(x,y)=min(y,x)`, both should give the same result).\n\nStatus: new\n\nIssue created by migration from https://trac.sagemath.org/ticket/24296\n\n",
    "created_at": "2017-11-28T19:37:30Z",
    "labels": [
        "component: basic arithmetic",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-8.1",
    "title": "min() is wrong with interval as 2nd argument",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/24296",
    "user": "https://github.com/zimmermann6"
}
```
```
sage: min(1,RIF(0,2))
1
sage: min(RIF(0,2),1)
[0.00000000000000000 .. 2.0000000000000000]
```
The first result is wrong, the second is correct (and since `min(x,y)=min(y,x)`, both should give the same result).

Status: new

Issue created by migration from https://trac.sagemath.org/ticket/24296





---

archive/issue_comments_459908.json:
```json
{
    "body": "<a id='comment:1'></a>Just for the record this question is documented in [RealIntervalFieldElement.min](https://doc.sagemath.org/html/en/reference/rings_numerical/sage/rings/real_mpfi.html#sage.rings.real_mpfi.RealIntervalFieldElement.min).\n\n\n```\nThe generic min does not always do the right thing:\n\nsage: min(0, RIF(-1, 1))\n0\nsage: min(RIF(-1, 1), RIF(-100, 100)).endpoints()\n(-1.00000000000000, 1.00000000000000)\nNote that calls involving NaNs try to return a number when possible.\nThis is consistent with IEEE-754-2008 but may be surprising.\n```",
    "created_at": "2017-12-05T11:16:28Z",
    "issue": "https://github.com/sagemath/sagetest/issues/24296",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/24296#issuecomment-459908",
    "user": "https://github.com/vinklein"
}
```

<a id='comment:1'></a>Just for the record this question is documented in [RealIntervalFieldElement.min](https://doc.sagemath.org/html/en/reference/rings_numerical/sage/rings/real_mpfi.html#sage.rings.real_mpfi.RealIntervalFieldElement.min).


```
The generic min does not always do the right thing:

sage: min(0, RIF(-1, 1))
0
sage: min(RIF(-1, 1), RIF(-100, 100)).endpoints()
(-1.00000000000000, 1.00000000000000)
Note that calls involving NaNs try to return a number when possible.
This is consistent with IEEE-754-2008 but may be surprising.
```
