# Issue 24808: Equality in quotient of a free algebra is broken

archive/issues_024571.json:
```json
{
    "body": "As reported in [this ask question](https://ask.sagemath.org/question/41219/calculations-in-quotient-of-a-free-algebra/):\n\n```\nsage: A.<x,y> = FreeAlgebra(QQbar)\nsage: I = A.ideal([x*x - 1, y*y, x*y + y*x])\nsage: I\nTwosided Ideal (-1 + x^2, y^2, x*y + y*x) of Free Algebra on 2 generators (x, y) over Algebraic Field\nsage: H = A.quotient(I)\nsage: H\nQuotient of Free Algebra on 2 generators (x, y) over Algebraic Field by the ideal (-1 + x^2, y^2, x*y + y*x)\nsage: H.inject_variables()\nDefining xbar, ybar\nsage: xbar.lift()\nx\nsage: xbar*xbar\nxbar^2\nsage: xbar*xbar == 1\nFalse\n```\n\nSee also:\n\n```\nsage: R.<x,y,z> = FreeAlgebra(QQ, 3)\nsage: Q = R.quotient(z-x*y)\nsage: Q\nQuotient of Free Algebra on 3 generators (x, y, z) over Rational Field by the ideal (z - x*y)\nsage: Q(x*y) == Q(z)\nFalse\n```\n\n\n**CC:**  @obtext @tscrim simonking\n\n**Keywords:** mathexp2018\n\n**Status:** new\n\nIssue created by migration from https://trac.sagemath.org/ticket/24808\n\n",
    "created_at": "2018-02-21T15:32:17Z",
    "labels": [
        "component: algebra",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-8.2",
    "title": "Equality in quotient of a free algebra is broken",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/24808",
    "user": "https://trac.sagemath.org/admin/accounts/users/tmonteil"
}
```
As reported in [this ask question](https://ask.sagemath.org/question/41219/calculations-in-quotient-of-a-free-algebra/):

```
sage: A.<x,y> = FreeAlgebra(QQbar)
sage: I = A.ideal([x*x - 1, y*y, x*y + y*x])
sage: I
Twosided Ideal (-1 + x^2, y^2, x*y + y*x) of Free Algebra on 2 generators (x, y) over Algebraic Field
sage: H = A.quotient(I)
sage: H
Quotient of Free Algebra on 2 generators (x, y) over Algebraic Field by the ideal (-1 + x^2, y^2, x*y + y*x)
sage: H.inject_variables()
Defining xbar, ybar
sage: xbar.lift()
x
sage: xbar*xbar
xbar^2
sage: xbar*xbar == 1
False
```

See also:

```
sage: R.<x,y,z> = FreeAlgebra(QQ, 3)
sage: Q = R.quotient(z-x*y)
sage: Q
Quotient of Free Algebra on 3 generators (x, y, z) over Rational Field by the ideal (z - x*y)
sage: Q(x*y) == Q(z)
False
```


**CC:**  @obtext @tscrim simonking

**Keywords:** mathexp2018

**Status:** new

Issue created by migration from https://trac.sagemath.org/ticket/24808





---

archive/issue_comments_473458.json:
```json
{
    "body": "<a id='comment:1'></a>\nIs this just a bug with equality, or is it a bug with elements of quotient algebras in general? I would hope that either `xbar * ybar` or `ybar * xbar` would be simplified, but neither is:\n\n```\nsage: xbar*ybar\nxbar*ybar\nsage: ybar*xbar\nybar*xbar\n```\nAs you might expect, `xbar * ybar + ybar * xbar` does not simplify to 0, either.",
    "created_at": "2018-02-21T18:49:06Z",
    "issue": "https://github.com/sagemath/sagetest/issues/24808",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/24808#issuecomment-473458",
    "user": "https://github.com/jhpalmieri"
}
```


<a id='comment:1'></a>
Is this just a bug with equality, or is it a bug with elements of quotient algebras in general? I would hope that either `xbar * ybar` or `ybar * xbar` would be simplified, but neither is:

```
sage: xbar*ybar
xbar*ybar
sage: ybar*xbar
ybar*xbar
```
As you might expect, `xbar * ybar + ybar * xbar` does not simplify to 0, either.



---

archive/issue_comments_473459.json:
```json
{
    "body": "<a id='comment:2'></a>\nI don't know about simplification, i did not dig into the code of `FreeAlgebra`. Sometimes Sage is lazy and shows simplified result only when it knows it already, so that representation does not cost possibly useless computation, e.g.\n\n```\nsage: a = sqrt(QQbar(3))^2\nsage: a\n3.000000000000000?\nsage: a == 3\nTrue\nsage: a\n3\n```",
    "created_at": "2018-02-21T22:32:17Z",
    "issue": "https://github.com/sagemath/sagetest/issues/24808",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/24808#issuecomment-473459",
    "user": "https://trac.sagemath.org/admin/accounts/users/tmonteil"
}
```


<a id='comment:2'></a>
I don't know about simplification, i did not dig into the code of `FreeAlgebra`. Sometimes Sage is lazy and shows simplified result only when it knows it already, so that representation does not cost possibly useless computation, e.g.

```
sage: a = sqrt(QQbar(3))^2
sage: a
3.000000000000000?
sage: a == 3
True
sage: a
3
```



---

archive/issue_comments_473460.json:
```json
{
    "body": "**Changing keywords** from \"\" to \"mathexp2018\".",
    "created_at": "2018-05-31T15:41:06Z",
    "issue": "https://github.com/sagemath/sagetest/issues/24808",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/24808#issuecomment-473460",
    "user": "https://trac.sagemath.org/admin/accounts/users/tmonteil"
}
```


**Changing keywords** from "" to "mathexp2018".



---

archive/issue_comments_473461.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -18,3 +18,14 @@\n False\n ```\n \n+See also:\n+\n+```\n+sage: R.<x,y,z> = FreeAlgebra(QQ, 3)\n+sage: Q = R.quotient(z-x*y)\n+sage: Q\n+Quotient of Free Algebra on 3 generators (x, y, z) over Rational Field by the ideal (z - x*y)\n+sage: Q(x*y) == Q(z)\n+False\n+```\n+\n``````\n",
    "created_at": "2018-05-31T15:41:06Z",
    "issue": "https://github.com/sagemath/sagetest/issues/24808",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/24808#issuecomment-473461",
    "user": "https://trac.sagemath.org/admin/accounts/users/tmonteil"
}
```


**Description changed:**
``````diff
--- 
+++ 
@@ -18,3 +18,14 @@
 False
 ```
 
+See also:
+
+```
+sage: R.<x,y,z> = FreeAlgebra(QQ, 3)
+sage: Q = R.quotient(z-x*y)
+sage: Q
+Quotient of Free Algebra on 3 generators (x, y, z) over Rational Field by the ideal (z - x*y)
+sage: Q(x*y) == Q(z)
+False
+```
+
``````




---

archive/issue_comments_473462.json:
```json
{
    "body": "<a id='comment:4'></a>\nThis bug just reappeared at mathexp2018:\n\n```\nsage: R.<x,y,z> = FreeAlgebra(QQ, 3)\nsage: Q = R.quotient(z-x*y)\nsage: Q\nQuotient of Free Algebra on 3 generators (x, y, z) over Rational Field by the ideal (z - x*y)\nsage: Q(x*y) == Q(z)\nFalse\n```",
    "created_at": "2018-05-31T15:41:06Z",
    "issue": "https://github.com/sagemath/sagetest/issues/24808",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/24808#issuecomment-473462",
    "user": "https://trac.sagemath.org/admin/accounts/users/tmonteil"
}
```


<a id='comment:4'></a>
This bug just reappeared at mathexp2018:

```
sage: R.<x,y,z> = FreeAlgebra(QQ, 3)
sage: Q = R.quotient(z-x*y)
sage: Q
Quotient of Free Algebra on 3 generators (x, y, z) over Rational Field by the ideal (z - x*y)
sage: Q(x*y) == Q(z)
False
```
