# Issue 24808: Equality in quotient of a free algebra is broken

archive/issues_024571.json:
```json
{
    "assignees": [],
    "body": "As reported in [this ask question](https://ask.sagemath.org/question/41219/calculations-in-quotient-of-a-free-algebra/):\n\n```\nsage: A.<x,y> = FreeAlgebra(QQbar)\nsage: I = A.ideal([x*x - 1, y*y, x*y + y*x])\nsage: I\nTwosided Ideal (-1 + x^2, y^2, x*y + y*x) of Free Algebra on 2 generators (x, y) over Algebraic Field\nsage: H = A.quotient(I)\nsage: H\nQuotient of Free Algebra on 2 generators (x, y) over Algebraic Field by the ideal (-1 + x^2, y^2, x*y + y*x)\nsage: H.inject_variables()\nDefining xbar, ybar\nsage: xbar.lift()\nx\nsage: xbar*xbar\nxbar^2\nsage: xbar*xbar == 1\nFalse\n```\n\nSee also:\n\n```\nsage: R.<x,y,z> = FreeAlgebra(QQ, 3)\nsage: Q = R.quotient(z-x*y)\nsage: Q\nQuotient of Free Algebra on 3 generators (x, y, z) over Rational Field by the ideal (z - x*y)\nsage: Q(x*y) == Q(z)\nFalse\n```\n\n\nCC:  @obtext @tscrim @simon-king-jena\n\nKeywords: **mathexp2018**\n\nComponent: **algebra**\n\n_Issue created by migration from https://trac.sagemath.org/ticket/24808_\n\n",
    "created_at": "2018-02-21T15:32:17Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/c%3A%20algebra",
        "https://github.com/sagemath/sage/labels/p%3A%203%20%E2%80%93%20major",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "Equality in quotient of a free algebra is broken",
    "type": "issue",
    "updated_at": "2022-12-29T01:40:48Z",
    "url": "https://github.com/sagemath/sage/issues/24808",
    "user": "https://github.com/sagetrac-tmonteil"
}
```
As reported in [this ask question](https://ask.sagemath.org/question/41219/calculations-in-quotient-of-a-free-algebra/):

```
sage: A.<x,y> = FreeAlgebra(QQbar)
sage: I = A.ideal([x*x - 1, y*y, x*y + y*x])
sage: I
Twosided Ideal (-1 + x^2, y^2, x*y + y*x) of Free Algebra on 2 generators (x, y) over Algebraic Field
sage: H = A.quotient(I)
sage: H
Quotient of Free Algebra on 2 generators (x, y) over Algebraic Field by the ideal (-1 + x^2, y^2, x*y + y*x)
sage: H.inject_variables()
Defining xbar, ybar
sage: xbar.lift()
x
sage: xbar*xbar
xbar^2
sage: xbar*xbar == 1
False
```

See also:

```
sage: R.<x,y,z> = FreeAlgebra(QQ, 3)
sage: Q = R.quotient(z-x*y)
sage: Q
Quotient of Free Algebra on 3 generators (x, y, z) over Rational Field by the ideal (z - x*y)
sage: Q(x*y) == Q(z)
False
```


CC:  @obtext @tscrim @simon-king-jena

Keywords: **mathexp2018**

Component: **algebra**

_Issue created by migration from https://trac.sagemath.org/ticket/24808_





---

archive/issue_events_344979.json:
```json
{
    "actor": "https://github.com/sagetrac-tmonteil",
    "created_at": "2018-02-21T15:32:17Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/24808",
    "milestone_number": null,
    "milestone_title": "sage-8.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/24808#event-344979"
}
```



---

archive/issue_events_344980.json:
```json
{
    "actor": "https://github.com/sagetrac-tmonteil",
    "created_at": "2018-02-21T15:32:17Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/24808",
    "label": "https://github.com/sagemath/sage/labels/c%3A%20algebra",
    "label_color": "0000ff",
    "label_name": "c: algebra",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/24808#event-344980"
}
```



---

archive/issue_events_344981.json:
```json
{
    "actor": "https://github.com/sagetrac-tmonteil",
    "created_at": "2018-02-21T15:32:17Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/24808",
    "label": "https://github.com/sagemath/sage/labels/p%3A%203%20%E2%80%93%20major",
    "label_color": "ffbb00",
    "label_name": "p: 3 \u2013 major",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/24808#event-344981"
}
```



---

archive/issue_events_344982.json:
```json
{
    "actor": "https://github.com/sagetrac-tmonteil",
    "created_at": "2018-02-21T15:32:17Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/24808",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "d73a4a",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/24808#event-344982"
}
```



---

archive/issue_comments_377105.json:
```json
{
    "body": "<div id=\"comment:1\" align=\"right\">comment:1</div>\n\nIs this just a bug with equality, or is it a bug with elements of quotient algebras in general? I would hope that either `xbar * ybar` or `ybar * xbar` would be simplified, but neither is:\n\n```\nsage: xbar*ybar\nxbar*ybar\nsage: ybar*xbar\nybar*xbar\n```\nAs you might expect, `xbar * ybar + ybar * xbar` does not simplify to 0, either.",
    "created_at": "2018-02-21T18:49:06Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/24808",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/24808#issuecomment-377105",
    "user": "https://github.com/jhpalmieri"
}
```

<div id="comment:1" align="right">comment:1</div>

Is this just a bug with equality, or is it a bug with elements of quotient algebras in general? I would hope that either `xbar * ybar` or `ybar * xbar` would be simplified, but neither is:

```
sage: xbar*ybar
xbar*ybar
sage: ybar*xbar
ybar*xbar
```
As you might expect, `xbar * ybar + ybar * xbar` does not simplify to 0, either.



---

archive/issue_comments_377106.json:
```json
{
    "body": "<div id=\"comment:2\" align=\"right\">comment:2</div>\n\nI don't know about simplification, i did not dig into the code of `FreeAlgebra`. Sometimes Sage is lazy and shows simplified result only when it knows it already, so that representation does not cost possibly useless computation, e.g.\n\n```\nsage: a = sqrt(QQbar(3))^2\nsage: a\n3.000000000000000?\nsage: a == 3\nTrue\nsage: a\n3\n```",
    "created_at": "2018-02-21T22:32:17Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/24808",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/24808#issuecomment-377106",
    "user": "https://github.com/sagetrac-tmonteil"
}
```

<div id="comment:2" align="right">comment:2</div>

I don't know about simplification, i did not dig into the code of `FreeAlgebra`. Sometimes Sage is lazy and shows simplified result only when it knows it already, so that representation does not cost possibly useless computation, e.g.

```
sage: a = sqrt(QQbar(3))^2
sage: a
3.000000000000000?
sage: a == 3
True
sage: a
3
```



---

archive/issue_comments_377107.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -18,3 +18,14 @@\n False\n ```\n \n+See also:\n+\n+```\n+sage: R.<x,y,z> = FreeAlgebra(QQ, 3)\n+sage: Q = R.quotient(z-x*y)\n+sage: Q\n+Quotient of Free Algebra on 3 generators (x, y, z) over Rational Field by the ideal (z - x*y)\n+sage: Q(x*y) == Q(z)\n+False\n+```\n+\n``````\n",
    "created_at": "2018-05-31T15:41:06Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/24808",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/24808#issuecomment-377107",
    "user": "https://github.com/sagetrac-tmonteil"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -18,3 +18,14 @@
 False
 ```
 
+See also:
+
+```
+sage: R.<x,y,z> = FreeAlgebra(QQ, 3)
+sage: Q = R.quotient(z-x*y)
+sage: Q
+Quotient of Free Algebra on 3 generators (x, y, z) over Rational Field by the ideal (z - x*y)
+sage: Q(x*y) == Q(z)
+False
+```
+
``````




---

archive/issue_comments_377108.json:
```json
{
    "body": "Changed keywords from none to **mathexp2018**",
    "created_at": "2018-05-31T15:41:06Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/24808",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/24808#issuecomment-377108",
    "user": "https://github.com/sagetrac-tmonteil"
}
```

Changed keywords from none to **mathexp2018**



---

archive/issue_comments_377109.json:
```json
{
    "body": "<div id=\"comment:4\" align=\"right\">comment:4</div>\n\nThis bug just reappeared at mathexp2018:\n\n```\nsage: R.<x,y,z> = FreeAlgebra(QQ, 3)\nsage: Q = R.quotient(z-x*y)\nsage: Q\nQuotient of Free Algebra on 3 generators (x, y, z) over Rational Field by the ideal (z - x*y)\nsage: Q(x*y) == Q(z)\nFalse\n```",
    "created_at": "2018-05-31T15:41:06Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/24808",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/24808#issuecomment-377109",
    "user": "https://github.com/sagetrac-tmonteil"
}
```

<div id="comment:4" align="right">comment:4</div>

This bug just reappeared at mathexp2018:

```
sage: R.<x,y,z> = FreeAlgebra(QQ, 3)
sage: Q = R.quotient(z-x*y)
sage: Q
Quotient of Free Algebra on 3 generators (x, y, z) over Rational Field by the ideal (z - x*y)
sage: Q(x*y) == Q(z)
False
```



---

archive/issue_events_344983.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-12-29T01:40:48Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/24808",
    "milestone_number": null,
    "milestone_title": "sage-8.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/24808#event-344983"
}
```
