# Issue 24962: Gen * AA

archive/issues_024725.json:
```json
{
    "body": "\n```\nsage: pari(-1) * AA(2)\n-2\nsage: pari(-1) * AA(2).sqrt()\n---------------------------------------------------------------------------\nTypeError                                 Traceback (most recent call last)\n<ipython-input-21-b14927ebe1c8> in <module>()\n----> 1 pari(-Integer(1)) * AA(Integer(2)).sqrt()\n\nTypeError: unsupported operand type(s) for *: 'cypari2.gen.Gen' and 'AlgebraicReal'\n\n```\n\n**Status:** new\n\nIssue created by migration from https://trac.sagemath.org/ticket/24962\n\n",
    "created_at": "2018-03-13T11:35:14Z",
    "labels": [
        "component: number theory",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-8.2",
    "title": "Gen * AA",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/24962",
    "user": "https://github.com/videlec"
}
```

```
sage: pari(-1) * AA(2)
-2
sage: pari(-1) * AA(2).sqrt()
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)
<ipython-input-21-b14927ebe1c8> in <module>()
----> 1 pari(-Integer(1)) * AA(Integer(2)).sqrt()

TypeError: unsupported operand type(s) for *: 'cypari2.gen.Gen' and 'AlgebraicReal'

```

**Status:** new

Issue created by migration from https://trac.sagemath.org/ticket/24962





---

archive/issue_comments_476941.json:
```json
{
    "body": "<a id='comment:1'></a>\nWhat do you expect the answer to be? A PARI number field element?",
    "created_at": "2018-03-13T14:28:49Z",
    "issue": "https://github.com/sagemath/sagetest/issues/24962",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/24962#issuecomment-476941",
    "user": "https://github.com/jdemeyer"
}
```

<a id='comment:1'></a>
What do you expect the answer to be? A PARI number field element?



---

archive/issue_comments_476942.json:
```json
{
    "body": "<a id='comment:2'></a>\nIndeed, I did not realize that the object we got was a Gen and not an element of AA\n\n```\nsage: pari(-1) * AA(2)\n-2\nsage: type(_)\n<type 'cypari2.gen.Gen'>\n```",
    "created_at": "2018-03-13T15:03:14Z",
    "issue": "https://github.com/sagemath/sagetest/issues/24962",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/24962#issuecomment-476942",
    "user": "https://github.com/videlec"
}
```

<a id='comment:2'></a>
Indeed, I did not realize that the object we got was a Gen and not an element of AA

```
sage: pari(-1) * AA(2)
-2
sage: type(_)
<type 'cypari2.gen.Gen'>
```
