# Issue 11225: improve piecewise plotting

archive/issues_011053.json:
```json
{
    "body": "Until we actually totally rewrite piecewise functions (done in #14801), we should improve some things.\n\nFor concreteness, here is one thing that should work but doesn't. I'm sure there are more - add to this list, and then whatever isn't fixed in this ticket can be moved to another ticket.  I just want to make sure they're listed in one place, not ten tickets.\n\nList:\n* plotting more than one\n\n```\nsage: f = Piecewise([[(0,1),x^3], [(1,2),x^2]], x)\nsage: plot([f,x^3],(x,0,2))\n```\n   A very similar example was at [this ask.sagemath.org post](http://ask.sagemath.org/question/868/two-piecewise-defined-functions-in-one-plot):\n\n```\nsage: f = Piecewise([[(-2,1),1],[(1,4),x]])\nsage: g =  Piecewise([[(-2,1),1],[(1,4),2*x]])\nsage: plot([f,g])\nAttributeError: PiecewisePolynomial instance has no attribute '__float__'\n```\n\n  Both examples work in the new `piecewise` (#14801): \n\n```\nsage: f = piecewise([[(0,1),x^3], [(1,2),x^2]], var=x)\nsage: plot([f,x^3],(x,0,2))\n```\n\n```\nsage: f = piecewise([[(-2,1),1],[(1,4),x]])\nsage: g =  piecewise([[(-2,1),1],[(1,4),2*x]])\nsage: plot([f,g], xmin=-3, xmax=5)\n```\n\n* plotting a product of a piecewise with a symbolic (well, the problem is multiplying the two, but still worth putting here - see [this sage-support thread](http://groups.google.com/group/sage-support/browse_thread/thread/7357d08529de32dd))\n\n  fixed in new `piecewise`\n\n* Maybe unify with `plot_step_function`, which currently is sort of its own thing?\n* In this example:\n\n```\nsage: zero_func(x)=0\nsage: g = Piecewise([[(-1000,1),zero_func],[(1,1000),(x-1)^3]],x)\nsage: G = g.plot()\nsage: G.show(xmin=-5,xmax=5,ymax=100)\nsage: g(1)\n0\n```\n* You can use oo (infinity) for endpoints, but then the plot code for Piecewise gets screwed up.\n* You can try putting in zero instead of defining this new zero function, but then g(1) and g(-1) etc. won't work.\n* You can try using extend_by_zero to make the zero part, but it gives the same problem.\n* You can plot without xmin and xmax, but that gives the whole function.\n* You can plot without ymax, but that gives the range further out than you want.\n* You can try plot(g), but that turns out to uncover a very strange error that may or may not be a bug.\n\n  In new `piecewise` (#14801) 0 is no longer in the domain (open intervals?); and there is now support for unbounded intervals.\n\n``` \nsage: zero_func(x)=0\nsage: g = piecewise([[(-1000,1),zero_func],[(1,1000),(x-1)^3]])\nsage: G = g.plot()\nsage: G.show(xmin=-5,xmax=5,ymax=100)\nLaunched png viewer for Graphics object consisting of 1 graphics primitive\nsage: g(1)\nValueError: point 1 is not in the domain\n```\n\nSee also #1773.\n\n\nAssignee: jason, was\n\nCC:  @wdjoyner @jasongrout @jondo @kcrisman @vbraun @slel @mkoeppe @eviatarbach @rwst\n\nKeywords: piecewise\n\nStatus: new\n\nDependencies: #14801\n\nIssue created by migration from https://trac.sagemath.org/ticket/11225\n\n",
    "created_at": "2011-04-20T15:52:28Z",
    "labels": [
        "component: graphics",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-7.3",
    "title": "improve piecewise plotting",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/11225",
    "user": "https://github.com/kcrisman"
}
```
Until we actually totally rewrite piecewise functions (done in #14801), we should improve some things.

For concreteness, here is one thing that should work but doesn't. I'm sure there are more - add to this list, and then whatever isn't fixed in this ticket can be moved to another ticket.  I just want to make sure they're listed in one place, not ten tickets.

List:
* plotting more than one

```
sage: f = Piecewise([[(0,1),x^3], [(1,2),x^2]], x)
sage: plot([f,x^3],(x,0,2))
```
   A very similar example was at [this ask.sagemath.org post](http://ask.sagemath.org/question/868/two-piecewise-defined-functions-in-one-plot):

```
sage: f = Piecewise([[(-2,1),1],[(1,4),x]])
sage: g =  Piecewise([[(-2,1),1],[(1,4),2*x]])
sage: plot([f,g])
AttributeError: PiecewisePolynomial instance has no attribute '__float__'
```

  Both examples work in the new `piecewise` (#14801): 

```
sage: f = piecewise([[(0,1),x^3], [(1,2),x^2]], var=x)
sage: plot([f,x^3],(x,0,2))
```

```
sage: f = piecewise([[(-2,1),1],[(1,4),x]])
sage: g =  piecewise([[(-2,1),1],[(1,4),2*x]])
sage: plot([f,g], xmin=-3, xmax=5)
```

* plotting a product of a piecewise with a symbolic (well, the problem is multiplying the two, but still worth putting here - see [this sage-support thread](http://groups.google.com/group/sage-support/browse_thread/thread/7357d08529de32dd))

  fixed in new `piecewise`

* Maybe unify with `plot_step_function`, which currently is sort of its own thing?
* In this example:

```
sage: zero_func(x)=0
sage: g = Piecewise([[(-1000,1),zero_func],[(1,1000),(x-1)^3]],x)
sage: G = g.plot()
sage: G.show(xmin=-5,xmax=5,ymax=100)
sage: g(1)
0
```
* You can use oo (infinity) for endpoints, but then the plot code for Piecewise gets screwed up.
* You can try putting in zero instead of defining this new zero function, but then g(1) and g(-1) etc. won't work.
* You can try using extend_by_zero to make the zero part, but it gives the same problem.
* You can plot without xmin and xmax, but that gives the whole function.
* You can plot without ymax, but that gives the range further out than you want.
* You can try plot(g), but that turns out to uncover a very strange error that may or may not be a bug.

  In new `piecewise` (#14801) 0 is no longer in the domain (open intervals?); and there is now support for unbounded intervals.

``` 
sage: zero_func(x)=0
sage: g = piecewise([[(-1000,1),zero_func],[(1,1000),(x-1)^3]])
sage: G = g.plot()
sage: G.show(xmin=-5,xmax=5,ymax=100)
Launched png viewer for Graphics object consisting of 1 graphics primitive
sage: g(1)
ValueError: point 1 is not in the domain
```

See also #1773.


Assignee: jason, was

CC:  @wdjoyner @jasongrout @jondo @kcrisman @vbraun @slel @mkoeppe @eviatarbach @rwst

Keywords: piecewise

Status: new

Dependencies: #14801

Issue created by migration from https://trac.sagemath.org/ticket/11225





---

archive/issue_comments_120251.json:
```json
{
    "body": "<a id='comment:5'></a>Regarding the first item (can't plot two of them), It probably wouldn't even be that hard to fix.  The problem is that `setup_for_eval_on_grid` wants to use `fast_float` but `Piecewise` guys don't have that, or more precisely don't have `__float__`.",
    "created_at": "2011-11-03T15:52:38Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11225",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11225#issuecomment-120251",
    "user": "https://github.com/kcrisman"
}
```

<a id='comment:5'></a>Regarding the first item (can't plot two of them), It probably wouldn't even be that hard to fix.  The problem is that `setup_for_eval_on_grid` wants to use `fast_float` but `Piecewise` guys don't have that, or more precisely don't have `__float__`.



---

archive/issue_comments_120252.json:
```json
{
    "body": "<a id='comment:7'></a>From DSM on [this ask.sagemath.org question](http://ask.sagemath.org/question/925/piecewise-functions-and-legend-label):\n\n```\n# monkeypatch legend duplication of trac #11225\ndef fix_piecewise(fn):\n    import types\n    def fixed_plot(self, *args, **kwargs): \n        from sage.plot.all import plot\n        return sum([plot(f, a, b, *args, **(dict((k,v) for k,v in kwargs.items() if i == 0 or k != 'legend_label')))\n                    for i, ((a,b),f) in enumerate(self.list())])\n    def fn2(*args, **kwargs):\n        ans = fn(*args, **kwargs)\n        ans.plot = types.MethodType(fixed_plot, ans)\n        return ans\n    return fn2\n\nPiecewise = fix_piecewise(Piecewise)\n```\nNice protopatch, perhaps?",
    "created_at": "2011-11-22T17:44:56Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11225",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11225#issuecomment-120252",
    "user": "https://github.com/kcrisman"
}
```

<a id='comment:7'></a>From DSM on [this ask.sagemath.org question](http://ask.sagemath.org/question/925/piecewise-functions-and-legend-label):

```
# monkeypatch legend duplication of trac #11225
def fix_piecewise(fn):
    import types
    def fixed_plot(self, *args, **kwargs): 
        from sage.plot.all import plot
        return sum([plot(f, a, b, *args, **(dict((k,v) for k,v in kwargs.items() if i == 0 or k != 'legend_label')))
                    for i, ((a,b),f) in enumerate(self.list())])
    def fn2(*args, **kwargs):
        ans = fn(*args, **kwargs)
        ans.plot = types.MethodType(fixed_plot, ans)
        return ans
    return fn2

Piecewise = fix_piecewise(Piecewise)
```
Nice protopatch, perhaps?



---

archive/issue_comments_120253.json:
```json
{
    "body": "<a id='comment:8'></a>I removed the last bullet point and created #12651 where I'll post a patch with dsm's fix.",
    "created_at": "2012-03-10T18:32:11Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11225",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11225#issuecomment-120253",
    "user": "https://github.com/orlitzky"
}
```

<a id='comment:8'></a>I removed the last bullet point and created #12651 where I'll post a patch with dsm's fix.



---

archive/issue_comments_120254.json:
```json
{
    "body": "Changing keywords from \"\" to \"piecewise\".",
    "created_at": "2016-06-25T18:33:21Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11225",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11225#issuecomment-120254",
    "user": "https://github.com/mkoeppe"
}
```

Changing keywords from "" to "piecewise".



---

archive/issue_comments_120255.json:
```json
{
    "body": "<a id='comment:11'></a>Updated description for new `piecewise` (#14801).\nDidn't check the xmin/xmax etc. behavior that is mentioned in the description.\n\nThis can probably be closed when the old `Piecewise` (now deprecated) is removed completely.",
    "created_at": "2016-06-25T18:33:21Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11225",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11225#issuecomment-120255",
    "user": "https://github.com/mkoeppe"
}
```

<a id='comment:11'></a>Updated description for new `piecewise` (#14801).
Didn't check the xmin/xmax etc. behavior that is mentioned in the description.

This can probably be closed when the old `Piecewise` (now deprecated) is removed completely.



---

archive/issue_events_029071.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2016-06-25T21:14:18Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/11225",
    "milestone": "sage-7.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/11225#event-29071"
}
```
