# Issue 11309: Sage sees - x + y > 0, - y + x >= 0,  and  x - y > 0 as equivalent

archive/issues_011137.json:
```json
{
    "body": "-x + y > 0 and x - y > 0  are treated the same in Sage.  \n\n```python\nsage: version()\n'Sage Version 4.6.2, Release Date: 2011-02-25'\n\nsage: (-x +y < 0) in [x -y < 0] \nTrue \n\nSet([-x +y >= 0,x -y >= 0]) \n{-x + y >= 0} \n```\n\nand they have the same Hash\n\n```python\nsage: var('x,y') \n(x, y) \nsage: hash(-x + y > 0 )\n1221566266\nsage: hash(-x + y >= 0 )\n1221566266\nsage: hash(x - y >= 0 )\n1221566266\nsage: hash(-y + x >= 0 )\n1221566266\nsage: hash(x - y > 0 )\n1221566266\n```\n\nIt seems to me that Sage treats `>`, `>=`, and `==` the same (see #7660). If this is true then it's a serious problem and needs to be addressed.\n\nApply:\n\n1. [attachment:trac_11309-fix-comparison-of-comparisons.patch]\n2. [attachment:trac_11309-equate-flipped-comparisons.patch]\n\nAssignee: @burcin\n\nCC:  @kini @kcrisman tnv\n\nKeywords: inequality equality relational sd31 __richcmp__ sd40.5\n\nReviewer: Karl-Dieter Crisman, ThanhVu Nguyen\n\nAuthor: Keshav Kini, Burcin Erocal\n\nMerged: sage-5.1.beta3\n\nResolution: fixed\n\nIssue created by migration from https://trac.sagemath.org/ticket/11309\n\n",
    "closed_at": "2012-06-05T11:50:48Z",
    "created_at": "2011-05-06T22:44:13Z",
    "labels": [
        "component: symbolics",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-5.1",
    "title": "Sage sees - x + y > 0, - y + x >= 0,  and  x - y > 0 as equivalent",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/11309",
    "user": "https://trac.sagemath.org/admin/accounts/users/tnv"
}
```
-x + y > 0 and x - y > 0  are treated the same in Sage.  

```python
sage: version()
'Sage Version 4.6.2, Release Date: 2011-02-25'

sage: (-x +y < 0) in [x -y < 0] 
True 

Set([-x +y >= 0,x -y >= 0]) 
{-x + y >= 0} 
```

and they have the same Hash

```python
sage: var('x,y') 
(x, y) 
sage: hash(-x + y > 0 )
1221566266
sage: hash(-x + y >= 0 )
1221566266
sage: hash(x - y >= 0 )
1221566266
sage: hash(-y + x >= 0 )
1221566266
sage: hash(x - y > 0 )
1221566266
```

It seems to me that Sage treats `>`, `>=`, and `==` the same (see #7660). If this is true then it's a serious problem and needs to be addressed.

Apply:

1. [attachment:trac_11309-fix-comparison-of-comparisons.patch]
2. [attachment:trac_11309-equate-flipped-comparisons.patch]

Assignee: @burcin

CC:  @kini @kcrisman tnv

Keywords: inequality equality relational sd31 __richcmp__ sd40.5

Reviewer: Karl-Dieter Crisman, ThanhVu Nguyen

Author: Keshav Kini, Burcin Erocal

Merged: sage-5.1.beta3

Resolution: fixed

Issue created by migration from https://trac.sagemath.org/ticket/11309





---

archive/issue_comments_128158.json:
```json
{
    "body": "Description changed:\n```diff\n--- \n+++ \n@@ -1,5 +1,6 @@\n -x + y > 0 and x - y > 0  are treated the same in Sage.  \n \n+\\`\\`\\`\n sage: version()\n 'Sage Version 4.6.2, Release Date: 2011-02-25'\n \n@@ -8,10 +9,11 @@\n \n Set([-x +y >= 0,x -y >= 0]) \n {-x + y >= 0} \n-\n+\\`\\`\\`\n \n and they have the same Hash\n \n+\\`\\`\\`\n sage: var('x,y') \n (x, y) \n sage: hash(-x + y > 0 )\n@@ -24,13 +26,10 @@\n 1221566266\n sage: hash(x - y > 0 )\n 1221566266\n-\n+\\`\\`\\`\n \n It seems to me that Sage treats > , >= ,  ==  the same (see http://trac.sagemath.org/sage_trac/ticket/7660).    If this is true then it's a serious problem and needs to be addressed.\n \n-Assignee: @burcin\n-\n-Keywords: inequality, equality\n \n Comment: 1\n \n```\n",
    "created_at": "2011-05-06T22:53:19Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128158",
    "user": "https://trac.sagemath.org/admin/accounts/users/tnv"
}
```

Description changed:
```diff
--- 
+++ 
@@ -1,5 +1,6 @@
 -x + y > 0 and x - y > 0  are treated the same in Sage.  
 
+\`\`\`
 sage: version()
 'Sage Version 4.6.2, Release Date: 2011-02-25'
 
@@ -8,10 +9,11 @@
 
 Set([-x +y >= 0,x -y >= 0]) 
 {-x + y >= 0} 
-
+\`\`\`
 
 and they have the same Hash
 
+\`\`\`
 sage: var('x,y') 
 (x, y) 
 sage: hash(-x + y > 0 )
@@ -24,13 +26,10 @@
 1221566266
 sage: hash(x - y > 0 )
 1221566266
-
+\`\`\`
 
 It seems to me that Sage treats > , >= ,  ==  the same (see http://trac.sagemath.org/sage_trac/ticket/7660).    If this is true then it's a serious problem and needs to be addressed.
 
-Assignee: @burcin
-
-Keywords: inequality, equality
 
 Comment: 1
 
```




---

archive/issue_comments_128159.json:
```json
{
    "body": "Description changed:\n```diff\n--- \n+++ \n@@ -1,3 +1,34 @@\n+-x + y > 0 and x - y > 0  are treated the same in Sage.  \n+\n+\\`\\`\\`python\n+sage: version()\n+'Sage Version 4.6.2, Release Date: 2011-02-25'\n+\n+sage: (-x +y < 0) in [x -y < 0] \n+True \n+\n+Set([-x +y >= 0,x -y >= 0]) \n+{-x + y >= 0} \n+\\`\\`\\`\n+\n+and they have the same Hash\n+\n+\\`\\`\\`python\n+sage: var('x,y') \n+(x, y) \n+sage: hash(-x + y > 0 )\n+1221566266\n+sage: hash(-x + y >= 0 )\n+1221566266\n+sage: hash(x - y >= 0 )\n+1221566266\n+sage: hash(-y + x >= 0 )\n+1221566266\n+sage: hash(x - y > 0 )\n+1221566266\n+\\`\\`\\`\n+\n+It seems to me that Sage treats \\`>\\`, \\`>=\\`, and \\`==\\` the same (see #7660). If this is true then it's a serious problem and needs to be addressed.\n \n \n Comment: 1\n```\n",
    "created_at": "2011-06-15T23:22:30Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128159",
    "user": "https://github.com/kini"
}
```

Description changed:
```diff
--- 
+++ 
@@ -1,3 +1,34 @@
+-x + y > 0 and x - y > 0  are treated the same in Sage.  
+
+\`\`\`python
+sage: version()
+'Sage Version 4.6.2, Release Date: 2011-02-25'
+
+sage: (-x +y < 0) in [x -y < 0] 
+True 
+
+Set([-x +y >= 0,x -y >= 0]) 
+{-x + y >= 0} 
+\`\`\`
+
+and they have the same Hash
+
+\`\`\`python
+sage: var('x,y') 
+(x, y) 
+sage: hash(-x + y > 0 )
+1221566266
+sage: hash(-x + y >= 0 )
+1221566266
+sage: hash(x - y >= 0 )
+1221566266
+sage: hash(-y + x >= 0 )
+1221566266
+sage: hash(x - y > 0 )
+1221566266
+\`\`\`
+
+It seems to me that Sage treats \`>\`, \`>=\`, and \`==\` the same (see #7660). If this is true then it's a serious problem and needs to be addressed.
 
 
 Comment: 1
```




---

archive/issue_comments_128160.json:
```json
{
    "body": "<a id='comment:4'></a>Ready for review! Thanks to Burcin for walking me through the Cython code.",
    "created_at": "2011-06-16T00:34:56Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128160",
    "user": "https://github.com/kini"
}
```

<a id='comment:4'></a>Ready for review! Thanks to Burcin for walking me through the Cython code.



---

archive/issue_comments_128161.json:
```json
{
    "body": "Changing status from new to needs_review.",
    "created_at": "2011-06-16T00:34:56Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128161",
    "user": "https://github.com/kini"
}
```

Changing status from new to needs_review.



---

archive/issue_comments_128162.json:
```json
{
    "body": "<a id='comment:5'></a>Thanks for creating the patch!!\n\n\nI don't know how to apply this patch though  - if you can walk me through it then I can test.  \n\nBut in the mean time, what are the result for these commands ?   If the results are different than the defected version above and as expected then probably the patch is correct.  \n\nsage: (-x +y < 0) in [x -y < 0] \n\nSet([-x +y >= 0,x -y >= 0]) \n\nsage: var('x,y') \n(x, y) \nsage: hash(-x + y > 0 )\nsage: hash(-x + y >= 0 )\nsage: hash(x - y >= 0 )\nsage: hash(-y + x >= 0 )\nsage: hash(x - y > 0 )",
    "created_at": "2011-06-16T04:24:50Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128162",
    "user": "https://trac.sagemath.org/admin/accounts/users/tnv"
}
```

<a id='comment:5'></a>Thanks for creating the patch!!


I don't know how to apply this patch though  - if you can walk me through it then I can test.  

But in the mean time, what are the result for these commands ?   If the results are different than the defected version above and as expected then probably the patch is correct.  

sage: (-x +y < 0) in [x -y < 0] 

Set([-x +y >= 0,x -y >= 0]) 

sage: var('x,y') 
(x, y) 
sage: hash(-x + y > 0 )
sage: hash(-x + y >= 0 )
sage: hash(x - y >= 0 )
sage: hash(-y + x >= 0 )
sage: hash(x - y > 0 )



---

archive/issue_comments_128163.json:
```json
{
    "body": "<a id='comment:6'></a>I've changed the patch a little bit just now, by the way.\n\nTo apply the patch, go to `devel/sage/` inside your sage directory, and type `sage -hg qimport http://trac.sagemath.org/sage_trac/raw-attachment/ticket/11309/trac_11309-fix-comparison-of-comparisons.patch`, type `sage -hg qpush`, type `sage -b`, and finally launch sage to test the patch!\n\nYour examples are fixed, yes. You can see them listed inside the patch, where I added some more examples in the documentation of the function I changed.",
    "created_at": "2011-06-16T04:37:58Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128163",
    "user": "https://github.com/kini"
}
```

<a id='comment:6'></a>I've changed the patch a little bit just now, by the way.

To apply the patch, go to `devel/sage/` inside your sage directory, and type `sage -hg qimport http://trac.sagemath.org/sage_trac/raw-attachment/ticket/11309/trac_11309-fix-comparison-of-comparisons.patch`, type `sage -hg qpush`, type `sage -b`, and finally launch sage to test the patch!

Your examples are fixed, yes. You can see them listed inside the patch, where I added some more examples in the documentation of the function I changed.



---

archive/issue_comments_128164.json:
```json
{
    "body": "<a id='comment:7'></a>Oh, by the way, I didn't fix the hashes. They're screwed up anyway, so this solution avoids using them to decide anything about whether expressions are the same or not. We might fix that in a later ticket...",
    "created_at": "2011-06-16T04:47:42Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128164",
    "user": "https://github.com/kini"
}
```

<a id='comment:7'></a>Oh, by the way, I didn't fix the hashes. They're screwed up anyway, so this solution avoids using them to decide anything about whether expressions are the same or not. We might fix that in a later ticket...



---

archive/issue_comments_128165.json:
```json
{
    "body": "<a id='comment:8'></a>Thanks for the info.  \n\nWhich Sage version do I apply the patch to ?  the latest 4.7  ?    I'll do that tomorrow at work\n\nif they still give the same hashes then   (-x +y < 0) in [x -y < 0]  still gives True and \nSet([-x +y >= 0,x -y >= 0]) still eliminates one of them .  Correct ?",
    "created_at": "2011-06-16T05:04:15Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128165",
    "user": "https://trac.sagemath.org/admin/accounts/users/tnv"
}
```

<a id='comment:8'></a>Thanks for the info.  

Which Sage version do I apply the patch to ?  the latest 4.7  ?    I'll do that tomorrow at work

if they still give the same hashes then   (-x +y < 0) in [x -y < 0]  still gives True and 
Set([-x +y >= 0,x -y >= 0]) still eliminates one of them .  Correct ?



---

archive/issue_comments_128166.json:
```json
{
    "body": "<a id='comment:9'></a>No, incorrect, because I changed the code to not use the hashes at all when doing the comparison. The hashes are now irrelevant to this operation. However kcrisman found a bug in my patch so I will update it again in just a second...",
    "created_at": "2011-06-16T05:19:55Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128166",
    "user": "https://github.com/kini"
}
```

<a id='comment:9'></a>No, incorrect, because I changed the code to not use the hashes at all when doing the comparison. The hashes are now irrelevant to this operation. However kcrisman found a bug in my patch so I will update it again in just a second...



---

archive/issue_comments_128167.json:
```json
{
    "body": "Changing status from needs_review to needs_work.",
    "created_at": "2011-06-16T05:48:41Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128167",
    "user": "https://github.com/kini"
}
```

Changing status from needs_review to needs_work.



---

archive/issue_comments_128168.json:
```json
{
    "body": "<a id='comment:10'></a>OK, this looks like it's going to take a little while, I'm getting some unexpected doctest errors... I'll fix it in the morning :)",
    "created_at": "2011-06-16T05:48:41Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128168",
    "user": "https://github.com/kini"
}
```

<a id='comment:10'></a>OK, this looks like it's going to take a little while, I'm getting some unexpected doctest errors... I'll fix it in the morning :)



---

archive/issue_comments_128169.json:
```json
{
    "body": "Changing status from needs_work to needs_review.",
    "created_at": "2011-06-16T06:07:00Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128169",
    "user": "https://github.com/kini"
}
```

Changing status from needs_work to needs_review.



---

archive/issue_comments_128170.json:
```json
{
    "body": "<a id='comment:11'></a>Never mind, ready for review again!",
    "created_at": "2011-06-16T06:07:00Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128170",
    "user": "https://github.com/kini"
}
```

<a id='comment:11'></a>Never mind, ready for review again!



---

archive/issue_comments_128171.json:
```json
{
    "body": "Remove assignee @burcin.",
    "created_at": "2011-06-16T06:16:34Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128171",
    "user": "https://github.com/kini"
}
```

Remove assignee @burcin.



---

archive/issue_comments_128172.json:
```json
{
    "body": "Set assignee to @burcin.",
    "created_at": "2011-06-16T06:17:02Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128172",
    "user": "https://github.com/kini"
}
```

Set assignee to @burcin.



---

archive/issue_comments_128173.json:
```json
{
    "body": "<a id='comment:13'></a>burcin got deleted from this ticket... that trac bug is annoying!",
    "created_at": "2011-06-16T06:17:02Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128173",
    "user": "https://github.com/kini"
}
```

<a id='comment:13'></a>burcin got deleted from this ticket... that trac bug is annoying!



---

archive/issue_comments_128174.json:
```json
{
    "body": "<a id='comment:14'></a>Code is correct (corner cases discussed in person, so that e.g. `(x < y) != x ` is True.\n\n`GEx e` seems far from where it comes from.",
    "created_at": "2011-06-16T06:22:30Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128174",
    "user": "https://github.com/kcrisman"
}
```

<a id='comment:14'></a>Code is correct (corner cases discussed in person, so that e.g. `(x < y) != x ` is True.

`GEx e` seems far from where it comes from.



---

archive/issue_comments_128175.json:
```json
{
    "body": "<a id='comment:15'></a>Attachment [trac_11309-fix-comparison-of-comparisons.patch](tarball://root/attachments/some-uuid/ticket11309/trac_11309-fix-comparison-of-comparisons.patch) by @kini created at 2011-06-16 06:27:31\n\nfixed! (sorry, that was left over from when I was doing something that made cython not like that declaration where it was)",
    "created_at": "2011-06-16T06:27:31Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128175",
    "user": "https://github.com/kini"
}
```

<a id='comment:15'></a>Attachment [trac_11309-fix-comparison-of-comparisons.patch](tarball://root/attachments/some-uuid/ticket11309/trac_11309-fix-comparison-of-comparisons.patch) by @kini created at 2011-06-16 06:27:31

fixed! (sorry, that was left over from when I was doing something that made cython not like that declaration where it was)



---

archive/issue_comments_128176.json:
```json
{
    "body": "Changing keywords from \"inequality, equality\" to \"inequality equality relational sd31 __richcmp__\".",
    "created_at": "2011-06-16T06:29:37Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128176",
    "user": "https://github.com/kini"
}
```

Changing keywords from "inequality, equality" to "inequality equality relational sd31 __richcmp__".



---

archive/issue_comments_128177.json:
```json
{
    "body": "<a id='comment:17'></a>This looks good.  Passing relevant tests.",
    "created_at": "2011-06-16T06:37:50Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128177",
    "user": "https://github.com/kcrisman"
}
```

<a id='comment:17'></a>This looks good.  Passing relevant tests.



---

archive/issue_comments_128178.json:
```json
{
    "body": "Changing status from needs_review to positive_review.",
    "created_at": "2011-06-16T06:37:58Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128178",
    "user": "https://github.com/kcrisman"
}
```

Changing status from needs_review to positive_review.



---

archive/issue_comments_128179.json:
```json
{
    "body": "<a id='comment:20'></a>It now can tell that  -x +y >0 is different than -y + x >= 0  but it says that  -x+y >0  is not the same as y > x  ---  \n\nor may be this is another problem ?  \n\n```\nsage: ( -x+y >0 ) == (y > x )\nFalse\n\nsage: (-x + y < 0)  ==  (-x < -y)\nFalse\nsage: (x + y == 0)  ==  (x == -y)\nFalse\nsage: (x - y == 0)  ==  (x == y)\nFalse\nsage: (- x + y == 0)  ==  (0 == -x + y)\nFalse\nsage: (x < y)  ==  (y > x)\nFalse\nsage: (x == y) == (-x == -y)\nFalse\nsage: (x + y < 1 )  ==  (x + y -1 < 0)\nFalse\n\n```",
    "created_at": "2011-06-16T22:59:40Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128179",
    "user": "https://trac.sagemath.org/admin/accounts/users/tnv"
}
```

<a id='comment:20'></a>It now can tell that  -x +y >0 is different than -y + x >= 0  but it says that  -x+y >0  is not the same as y > x  ---  

or may be this is another problem ?  

```
sage: ( -x+y >0 ) == (y > x )
False

sage: (-x + y < 0)  ==  (-x < -y)
False
sage: (x + y == 0)  ==  (x == -y)
False
sage: (x - y == 0)  ==  (x == y)
False
sage: (- x + y == 0)  ==  (0 == -x + y)
False
sage: (x < y)  ==  (y > x)
False
sage: (x == y) == (-x == -y)
False
sage: (x + y < 1 )  ==  (x + y -1 < 0)
False

```



---

archive/issue_comments_128180.json:
```json
{
    "body": "<a id='comment:21'></a>This patch *breaks* the following \n\n{{\nSage 4.7 (prepatched)\n\nsage: (- x + y == 0)  ==  (0 == -x + y)\nTrue\nsage: (-x + y == 0)  ==  (0 == -x + y)\nTrue\nsage: (x < y)  ==  (y > x)\nTrue\n\n\nSage 4.7 (postpatched)\n\n\nsage: (- x + y == 0)  ==  (0 == -x + y)\nFalse\nsage: (-x + y == 0)  ==  (0 == -x + y)\nFalse\nsage: (x < y)  ==  (y > x)\nFalse\n\n}}}",
    "created_at": "2011-06-16T23:03:36Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128180",
    "user": "https://trac.sagemath.org/admin/accounts/users/tnv"
}
```

<a id='comment:21'></a>This patch *breaks* the following 

{{
Sage 4.7 (prepatched)

sage: (- x + y == 0)  ==  (0 == -x + y)
True
sage: (-x + y == 0)  ==  (0 == -x + y)
True
sage: (x < y)  ==  (y > x)
True


Sage 4.7 (postpatched)


sage: (- x + y == 0)  ==  (0 == -x + y)
False
sage: (-x + y == 0)  ==  (0 == -x + y)
False
sage: (x < y)  ==  (y > x)
False

}}}



---

archive/issue_comments_128181.json:
```json
{
    "body": "Changing status from positive_review to needs_work.",
    "created_at": "2011-06-16T23:03:36Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128181",
    "user": "https://trac.sagemath.org/admin/accounts/users/tnv"
}
```

Changing status from positive_review to needs_work.



---

archive/issue_comments_128182.json:
```json
{
    "body": "<a id='comment:22'></a>\n``` \nSage 4.7 (prepatched)\n\nsage: (- x + y == 0) == (0 == -x + y) True sage: (-x + y == 0) == (0 == -x + y) True sage: (x < y) == (y > x) True\n\nSage 4.7 (postpatched)\n\nsage: (- x + y == 0) == (0 == -x + y) False sage: (-x + y == 0) == (0 == -x + y) False sage: (x < y) == (y > x) False\n\n```",
    "created_at": "2011-06-16T23:06:10Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128182",
    "user": "https://github.com/kcrisman"
}
```

<a id='comment:22'></a>
``` 
Sage 4.7 (prepatched)

sage: (- x + y == 0) == (0 == -x + y) True sage: (-x + y == 0) == (0 == -x + y) True sage: (x < y) == (y > x) True

Sage 4.7 (postpatched)

sage: (- x + y == 0) == (0 == -x + y) False sage: (-x + y == 0) == (0 == -x + y) False sage: (x < y) == (y > x) False

```



---

archive/issue_comments_128183.json:
```json
{
    "body": "<a id='comment:23'></a>{{ Sage 4.7 (prepatched)\n\nsage: (- x + y == 0) == (0 == -x + y) \nTrue \nsage: (-x + y == 0) == (0 == -x + y) \nTrue \nsage: (x < y) == (y > x) \nTrue\n\nSage 4.7 (postpatched)\n\nsage: (- x + y == 0) == (0 == -x + y) \nFalse \nsage: (-x + y == 0) == (0 == -x + y) \nFalse \nsage: (x < y) == (y > x) \nFalse\n\n}}}",
    "created_at": "2011-06-16T23:06:48Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128183",
    "user": "https://github.com/kcrisman"
}
```

<a id='comment:23'></a>{{ Sage 4.7 (prepatched)

sage: (- x + y == 0) == (0 == -x + y) 
True 
sage: (-x + y == 0) == (0 == -x + y) 
True 
sage: (x < y) == (y > x) 
True

Sage 4.7 (postpatched)

sage: (- x + y == 0) == (0 == -x + y) 
False 
sage: (-x + y == 0) == (0 == -x + y) 
False 
sage: (x < y) == (y > x) 
False

}}}



---

archive/issue_comments_128184.json:
```json
{
    "body": "<a id='comment:24'></a>Finally used preview...\n\n``` \nSage 4.7 (prepatched)\n\nsage: (- x + y == 0) == (0 == -x + y) \nTrue \nsage: (-x + y == 0) == (0 == -x + y) \nTrue \nsage: (x < y) == (y > x) \nTrue\n\nSage 4.7 (postpatched)\n\nsage: (- x + y == 0) == (0 == -x + y) \nFalse \nsage: (-x + y == 0) == (0 == -x + y) \nFalse \nsage: (x < y) == (y > x) \nFalse\n\n```",
    "created_at": "2011-06-16T23:07:52Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128184",
    "user": "https://github.com/kcrisman"
}
```

<a id='comment:24'></a>Finally used preview...

``` 
Sage 4.7 (prepatched)

sage: (- x + y == 0) == (0 == -x + y) 
True 
sage: (-x + y == 0) == (0 == -x + y) 
True 
sage: (x < y) == (y > x) 
True

Sage 4.7 (postpatched)

sage: (- x + y == 0) == (0 == -x + y) 
False 
sage: (-x + y == 0) == (0 == -x + y) 
False 
sage: (x < y) == (y > x) 
False

```



---

archive/issue_comments_128185.json:
```json
{
    "body": "<a id='comment:25'></a>\n```\n-x+y >0 is not the same as y > x\n```\nCorrect.  We use the philosophy (used elsewhere) that a comparison is True if you can prove it is True, and that otherwise it is False.  False means that we can't prove it's True, and in general these kinds of simplifications are super hard.   So all your examples need to be False, sadly.  \n\nAs for the thing that breaks... I agree that is a problem.  Great catch!  Can you put your (real) name as a reviewer?  (You should also feel free to add yourself to the [main Trac page](http://trac.sagemath.org/sage_trac/) as a developer/contributor.",
    "created_at": "2011-06-16T23:11:52Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128185",
    "user": "https://github.com/kcrisman"
}
```

<a id='comment:25'></a>
```
-x+y >0 is not the same as y > x
```
Correct.  We use the philosophy (used elsewhere) that a comparison is True if you can prove it is True, and that otherwise it is False.  False means that we can't prove it's True, and in general these kinds of simplifications are super hard.   So all your examples need to be False, sadly.  

As for the thing that breaks... I agree that is a problem.  Great catch!  Can you put your (real) name as a reviewer?  (You should also feel free to add yourself to the [main Trac page](http://trac.sagemath.org/sage_trac/) as a developer/contributor.



---

archive/issue_comments_128186.json:
```json
{
    "body": "<a id='comment:26'></a>just put my name as reviewer -- thanks.   \n\nFrom your msg,  would it be reasonable to add a SMT theorem prover package to Sage ?   So that it can show equivalence of expressions  (at least under some specific theories).",
    "created_at": "2011-06-17T03:47:41Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128186",
    "user": "https://trac.sagemath.org/admin/accounts/users/tnv"
}
```

<a id='comment:26'></a>just put my name as reviewer -- thanks.   

From your msg,  would it be reasonable to add a SMT theorem prover package to Sage ?   So that it can show equivalence of expressions  (at least under some specific theories).



---

archive/issue_comments_128187.json:
```json
{
    "body": "<a id='comment:27'></a>There are some tickets open for things like this, I think, or something related, but I don't really know.  Keshav or Burcin may know more.",
    "created_at": "2011-06-17T03:50:07Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128187",
    "user": "https://github.com/kcrisman"
}
```

<a id='comment:27'></a>There are some tickets open for things like this, I think, or something related, but I don't really know.  Keshav or Burcin may know more.



---

archive/issue_comments_128188.json:
```json
{
    "body": "<a id='comment:28'></a>Hm. In order to eventually solve #2778 and other such things, I think we need to allow nested relations after all. I talked to Burcin on IRC and he agrees. So we would plan to have all of these return an output which is the same as the input. If you wanted to force it to resolve, you could run bool() on them, and you would always get false, except when comparing `x < y` and `y > x`, `x <= y` and `y >= x`, `x == y` and `y == x`, and `x != y` and `y != x`, for symbolic expressions `x` and `y` (on kcrisman's insistence :) ). I'll need to implement this and figure out how it influences existing doctests (probably severely), so I'm leaving this as \"needs_work\" for now...",
    "created_at": "2011-06-18T00:52:37Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128188",
    "user": "https://github.com/kini"
}
```

<a id='comment:28'></a>Hm. In order to eventually solve #2778 and other such things, I think we need to allow nested relations after all. I talked to Burcin on IRC and he agrees. So we would plan to have all of these return an output which is the same as the input. If you wanted to force it to resolve, you could run bool() on them, and you would always get false, except when comparing `x < y` and `y > x`, `x <= y` and `y >= x`, `x == y` and `y == x`, and `x != y` and `y != x`, for symbolic expressions `x` and `y` (on kcrisman's insistence :) ). I'll need to implement this and figure out how it influences existing doctests (probably severely), so I'm leaving this as "needs_work" for now...



---

archive/issue_comments_128189.json:
```json
{
    "body": "<a id='comment:29'></a>Sorry, I meant #2744, not #2778.",
    "created_at": "2011-06-18T00:53:07Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128189",
    "user": "https://github.com/kini"
}
```

<a id='comment:29'></a>Sorry, I meant #2744, not #2778.



---

archive/issue_comments_128190.json:
```json
{
    "body": "<a id='comment:30'></a>Replying to [comment:26 tnv]:\n\n> From your msg,  would it be reasonable to add a SMT theorem prover package to Sage ?   So that it can show equivalence of expressions  (at least under some specific theories).     \n\n\nSage is really large as it is. While I'd be really interested to have this capability in Sage, I don't know how many others would want it in the standard distribution. The first step is to start with an optional package/prototype. We can see where it goes from there. :)\n\nWhich prover are you thinking of? What would this let us do in Sage? Perhaps you should write a message to sage-devel about this.",
    "created_at": "2011-06-18T01:10:50Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128190",
    "user": "https://github.com/burcin"
}
```

<a id='comment:30'></a>Replying to [comment:26 tnv]:

> From your msg,  would it be reasonable to add a SMT theorem prover package to Sage ?   So that it can show equivalence of expressions  (at least under some specific theories).     


Sage is really large as it is. While I'd be really interested to have this capability in Sage, I don't know how many others would want it in the standard distribution. The first step is to start with an optional package/prototype. We can see where it goes from there. :)

Which prover are you thinking of? What would this let us do in Sage? Perhaps you should write a message to sage-devel about this.



---

archive/issue_comments_128191.json:
```json
{
    "body": "<a id='comment:31'></a>> Which prover are you thinking of? What would this let us do in Sage? Perhaps you should write a message to sage-devel about this.\n\n\nI am thinking about the optional package too.  Someone told me qepcad (not exactly SMT but can be used for many similar purpose) already in Sage as an optional package.  \n\nThe good thing about these SMT solvers is that most of them support a standard language (smtlib) and therefore you can use any of the SMT's out there with a single interface.  SMT can be used to show if something (a set of expressions or constraints) is valid  or  satisfiable under different types of theories (not just boolean), or simplify a set of expression, etc.  I rely on these for implications on my project-- to see if 2 sets of expressions are equi-satisfiable .  \n\nSo all the above examples of whether if exp1 == exp2  should be easily answered with SMT.",
    "created_at": "2011-06-18T01:33:20Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128191",
    "user": "https://trac.sagemath.org/admin/accounts/users/tnv"
}
```

<a id='comment:31'></a>> Which prover are you thinking of? What would this let us do in Sage? Perhaps you should write a message to sage-devel about this.


I am thinking about the optional package too.  Someone told me qepcad (not exactly SMT but can be used for many similar purpose) already in Sage as an optional package.  

The good thing about these SMT solvers is that most of them support a standard language (smtlib) and therefore you can use any of the SMT's out there with a single interface.  SMT can be used to show if something (a set of expressions or constraints) is valid  or  satisfiable under different types of theories (not just boolean), or simplify a set of expression, etc.  I rely on these for implications on my project-- to see if 2 sets of expressions are equi-satisfiable .  

So all the above examples of whether if exp1 == exp2  should be easily answered with SMT.



---

archive/issue_comments_128192.json:
```json
{
    "body": "<a id='comment:32'></a>Replying to [comment:31 tnv]:\n\n> So all the above examples of whether if exp1 == exp2  should be easily answered with SMT.\n\n\nI'd really like to see Sage have it's own framework to handle assumptions (see `assume?` -- this relies completely on maxima right now), so I'm really interested in this. I'd be glad to help with the first steps of making a package, writing an interface, etc. We should have this conversation in sage-devel instead of this ticket though. ;)",
    "created_at": "2011-06-18T02:05:08Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128192",
    "user": "https://github.com/burcin"
}
```

<a id='comment:32'></a>Replying to [comment:31 tnv]:

> So all the above examples of whether if exp1 == exp2  should be easily answered with SMT.


I'd really like to see Sage have it's own framework to handle assumptions (see `assume?` -- this relies completely on maxima right now), so I'm really interested in this. I'd be glad to help with the first steps of making a package, writing an interface, etc. We should have this conversation in sage-devel instead of this ticket though. ;)



---

archive/issue_comments_128193.json:
```json
{
    "body": "<a id='comment:33'></a>This still applies, and fixes another issue.\n\n```\n\nsage: c = (x-2<=0)\nsage: assume(c)\nsage: a = (x-1<=0)\nsage:  if a in sage.symbolic.assumptions._assumptions:\n....:     print 'yes'\n....:     \nsage: assumptions()\n[x - 2 <= 0]\nsage: assume(a)\nsage: assumptions()\n[x - 2 <= 0, x - 1 <= 0]\n```\nBefore, the second assumption didn't obtain, because currently\n\n```\n\nsage: c = (x-2<=0)\nsage: L = [c]\nsage: L\n[x - 2 <= 0]\nsage: a = (x-1<=0)\nsage: a in L\nTrue\n```\nwhich is not good.  See [this sage-support thread](https://groups.google.com/forum/#!topic/sage-support/H-QcXkNCajM).",
    "created_at": "2012-05-11T13:24:18Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128193",
    "user": "https://github.com/kcrisman"
}
```

<a id='comment:33'></a>This still applies, and fixes another issue.

```

sage: c = (x-2<=0)
sage: assume(c)
sage: a = (x-1<=0)
sage:  if a in sage.symbolic.assumptions._assumptions:
....:     print 'yes'
....:     
sage: assumptions()
[x - 2 <= 0]
sage: assume(a)
sage: assumptions()
[x - 2 <= 0, x - 1 <= 0]
```
Before, the second assumption didn't obtain, because currently

```

sage: c = (x-2<=0)
sage: L = [c]
sage: L
[x - 2 <= 0]
sage: a = (x-1<=0)
sage: a in L
True
```
which is not good.  See [this sage-support thread](https://groups.google.com/forum/#!topic/sage-support/H-QcXkNCajM).



---

archive/issue_comments_128194.json:
```json
{
    "body": "<a id='comment:34'></a>Since #2744 is on sage-wishlist, would it suffice to do some sort of \"switch lhs and rhs\" check as a last branch in the code to fix tnv's point in comment:21 (formatted in comment:24)?  It would be nice to finally resolve this at the upcoming Bug Days.",
    "created_at": "2012-05-11T13:27:17Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128194",
    "user": "https://github.com/kcrisman"
}
```

<a id='comment:34'></a>Since #2744 is on sage-wishlist, would it suffice to do some sort of "switch lhs and rhs" check as a last branch in the code to fix tnv's point in comment:21 (formatted in comment:24)?  It would be nice to finally resolve this at the upcoming Bug Days.



---

archive/issue_comments_128195.json:
```json
{
    "body": "<a id='comment:35'></a>In the patch, why is this evaluated to `True`?\n\n```diff\n+            sage: (x < y) != (y > x)\n+            True\n```\n\nEDIT: Oops. I should have read the earlier comments. Sorry.",
    "created_at": "2012-05-11T15:43:27Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128195",
    "user": "https://github.com/ppurka"
}
```

<a id='comment:35'></a>In the patch, why is this evaluated to `True`?

```diff
+            sage: (x < y) != (y > x)
+            True
```

EDIT: Oops. I should have read the earlier comments. Sorry.



---

archive/issue_comments_128196.json:
```json
{
    "body": "<a id='comment:36'></a>kcrisman: OK, I'll try to implement those minimal checks for now, and we can do nesting expressions later.",
    "created_at": "2012-05-12T22:55:26Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128196",
    "user": "https://github.com/kini"
}
```

<a id='comment:36'></a>kcrisman: OK, I'll try to implement those minimal checks for now, and we can do nesting expressions later.



---

archive/issue_comments_128197.json:
```json
{
    "body": "<a id='comment:37'></a>Added a new patch. Burcin, can you look over it to make sure I'm doing this the right way? In particular are those operator comparisons optimizable somehow?",
    "created_at": "2012-05-13T01:20:04Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128197",
    "user": "https://github.com/kini"
}
```

<a id='comment:37'></a>Added a new patch. Burcin, can you look over it to make sure I'm doing this the right way? In particular are those operator comparisons optimizable somehow?



---

archive/issue_comments_128198.json:
```json
{
    "body": "Description changed:\n```diff\n--- \n+++ \n@@ -1,4 +1,39 @@\n+-x + y > 0 and x - y > 0  are treated the same in Sage.  \n \n+\\`\\`\\`python\n+sage: version()\n+'Sage Version 4.6.2, Release Date: 2011-02-25'\n+\n+sage: (-x +y < 0) in [x -y < 0] \n+True \n+\n+Set([-x +y >= 0,x -y >= 0]) \n+{-x + y >= 0} \n+\\`\\`\\`\n+\n+and they have the same Hash\n+\n+\\`\\`\\`python\n+sage: var('x,y') \n+(x, y) \n+sage: hash(-x + y > 0 )\n+1221566266\n+sage: hash(-x + y >= 0 )\n+1221566266\n+sage: hash(x - y >= 0 )\n+1221566266\n+sage: hash(-y + x >= 0 )\n+1221566266\n+sage: hash(x - y > 0 )\n+1221566266\n+\\`\\`\\`\n+\n+It seems to me that Sage treats \\`>\\`, \\`>=\\`, and \\`==\\` the same (see #7660). If this is true then it's a serious problem and needs to be addressed.\n+\n+Apply:\n+\n+1. [attachment:trac_11309-fix-comparison-of-comparisons.patch]\n+2. [attachment:trac_11309-equate-flipped-comparisons.patch]\n \n Comment: 1\n \n```\n",
    "created_at": "2012-05-13T01:20:04Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128198",
    "user": "https://github.com/kini"
}
```

Description changed:
```diff
--- 
+++ 
@@ -1,4 +1,39 @@
+-x + y > 0 and x - y > 0  are treated the same in Sage.  
 
+\`\`\`python
+sage: version()
+'Sage Version 4.6.2, Release Date: 2011-02-25'
+
+sage: (-x +y < 0) in [x -y < 0] 
+True 
+
+Set([-x +y >= 0,x -y >= 0]) 
+{-x + y >= 0} 
+\`\`\`
+
+and they have the same Hash
+
+\`\`\`python
+sage: var('x,y') 
+(x, y) 
+sage: hash(-x + y > 0 )
+1221566266
+sage: hash(-x + y >= 0 )
+1221566266
+sage: hash(x - y >= 0 )
+1221566266
+sage: hash(-y + x >= 0 )
+1221566266
+sage: hash(x - y > 0 )
+1221566266
+\`\`\`
+
+It seems to me that Sage treats \`>\`, \`>=\`, and \`==\` the same (see #7660). If this is true then it's a serious problem and needs to be addressed.
+
+Apply:
+
+1. [attachment:trac_11309-fix-comparison-of-comparisons.patch]
+2. [attachment:trac_11309-equate-flipped-comparisons.patch]
 
 Comment: 1
 
```




---

archive/issue_comments_128199.json:
```json
{
    "body": "Changing status from needs_work to needs_review.",
    "created_at": "2012-05-13T01:20:04Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128199",
    "user": "https://github.com/kini"
}
```

Changing status from needs_work to needs_review.



---

archive/issue_comments_128200.json:
```json
{
    "body": "<a id='comment:38'></a>Update: added three more lines to the doctests",
    "created_at": "2012-05-13T01:24:55Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128200",
    "user": "https://github.com/kini"
}
```

<a id='comment:38'></a>Update: added three more lines to the doctests



---

archive/issue_comments_128201.json:
```json
{
    "body": "<a id='comment:39'></a>Hey patchbot:\n\nApply trac_11309-fix-comparison-of-comparisons.patch trac_11309-equate-flipped-comparisons.patch",
    "created_at": "2012-05-14T05:52:15Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128201",
    "user": "https://github.com/kini"
}
```

<a id='comment:39'></a>Hey patchbot:

Apply trac_11309-fix-comparison-of-comparisons.patch trac_11309-equate-flipped-comparisons.patch



---

archive/issue_comments_128202.json:
```json
{
    "body": "<a id='comment:40'></a>The code itself seems fine right now, thanks for such fast action and especially for actual comments in the code!  \n\nDid you do any timing runs on previously-working comparisons?  I agree that it would be good for someone who knows to comment on whether there is some obvious optimization missing.  For instance, lines 1241ff. would be nicer if it so happened there was a \"operator.opposite()\" function which reversed `<=` and `>=` (though someone else might want them to be complements, `<=` and `>`).    Similarly for the rhs/lhs comparisons.\n\nKeshav, do you mind putting in a test in your patch for \n\n```\nsage: (x-1<0) in [x-2<0]\nFalse\n```\njust to test for the comment:33 issue?  While we wait for someone more knowledgeable... but as I said it does seem good to go.",
    "created_at": "2012-05-14T18:15:04Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128202",
    "user": "https://github.com/kcrisman"
}
```

<a id='comment:40'></a>The code itself seems fine right now, thanks for such fast action and especially for actual comments in the code!  

Did you do any timing runs on previously-working comparisons?  I agree that it would be good for someone who knows to comment on whether there is some obvious optimization missing.  For instance, lines 1241ff. would be nicer if it so happened there was a "operator.opposite()" function which reversed `<=` and `>=` (though someone else might want them to be complements, `<=` and `>`).    Similarly for the rhs/lhs comparisons.

Keshav, do you mind putting in a test in your patch for 

```
sage: (x-1<0) in [x-2<0]
False
```
just to test for the comment:33 issue?  While we wait for someone more knowledgeable... but as I said it does seem good to go.



---

archive/issue_comments_128203.json:
```json
{
    "body": "Attachment [trac_11309-equate-flipped-comparisons.patch](tarball://root/attachments/some-uuid/ticket11309/trac_11309-equate-flipped-comparisons.patch) by @kini created at 2012-05-14 18:51:16\n\napply to $SAGE_ROOT/devel/sage",
    "created_at": "2012-05-14T18:51:16Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128203",
    "user": "https://github.com/kini"
}
```

Attachment [trac_11309-equate-flipped-comparisons.patch](tarball://root/attachments/some-uuid/ticket11309/trac_11309-equate-flipped-comparisons.patch) by @kini created at 2012-05-14 18:51:16

apply to $SAGE_ROOT/devel/sage



---

archive/issue_comments_128204.json:
```json
{
    "body": "<a id='comment:41'></a>Done! Glad you like the comments :)\n\nI did not do any timing, no. I'm not sure what you mean by \"lines 1241ff\", but function calls should typically be avoided if you're optimizing for speed, afaik. The main thing I was wondering was, the argument `op` to the function `_richcmp_c_impl()` is an integer, but `operator.*` as seen in lines 1245-1252 seem to be strings, if I'm not mistaken. So I'm just wondering if that many string operations for a single comparison of symbolic expression couldn't be better optimized by somehow getting the operator of the lhs and rhs of the big relation as integers rather than strings. Well, not to mention that I'm calling `.operator()` a bunch of times, but I don't know if it would actually be any faster to compute it once and store it in a variable.\n\nThey say you shouldn't try to second-guess compilers... I guess the best way to find out is to try a few different ways and see how `timeit` behaves. I'll do that later, I guess...",
    "created_at": "2012-05-14T19:01:04Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128204",
    "user": "https://github.com/kini"
}
```

<a id='comment:41'></a>Done! Glad you like the comments :)

I did not do any timing, no. I'm not sure what you mean by "lines 1241ff", but function calls should typically be avoided if you're optimizing for speed, afaik. The main thing I was wondering was, the argument `op` to the function `_richcmp_c_impl()` is an integer, but `operator.*` as seen in lines 1245-1252 seem to be strings, if I'm not mistaken. So I'm just wondering if that many string operations for a single comparison of symbolic expression couldn't be better optimized by somehow getting the operator of the lhs and rhs of the big relation as integers rather than strings. Well, not to mention that I'm calling `.operator()` a bunch of times, but I don't know if it would actually be any faster to compute it once and store it in a variable.

They say you shouldn't try to second-guess compilers... I guess the best way to find out is to try a few different ways and see how `timeit` behaves. I'll do that later, I guess...



---

archive/issue_comments_128205.json:
```json
{
    "body": "<a id='comment:42'></a>Hey patchbot:\n\nApply trac_11309-fix-comparison-of-comparisons.patch trac_11309-equate-flipped-comparisons.patch",
    "created_at": "2012-05-14T19:02:11Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128205",
    "user": "https://github.com/kini"
}
```

<a id='comment:42'></a>Hey patchbot:

Apply trac_11309-fix-comparison-of-comparisons.patch trac_11309-equate-flipped-comparisons.patch



---

archive/issue_comments_128206.json:
```json
{
    "body": "<a id='comment:43'></a>I guess there isn't any reason to put this off, unless the timing issue really is a biggie.  Did you want to run a few of them first?",
    "created_at": "2012-05-25T14:50:32Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128206",
    "user": "https://github.com/kcrisman"
}
```

<a id='comment:43'></a>I guess there isn't any reason to put this off, unless the timing issue really is a biggie.  Did you want to run a few of them first?



---

archive/issue_comments_128207.json:
```json
{
    "body": "Changing keywords from \"inequality equality relational sd31 __richcmp__\" to \"inequality equality relational sd31 __richcmp__ sd40.5\".",
    "created_at": "2012-05-25T14:50:32Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128207",
    "user": "https://github.com/kcrisman"
}
```

Changing keywords from "inequality equality relational sd31 __richcmp__" to "inequality equality relational sd31 __richcmp__ sd40.5".



---

archive/issue_comments_128208.json:
```json
{
    "body": "<a id='comment:44'></a>Hmm, this is a big slowdown in at least one case.\n\n```\n# old\nsage: timeit(\"(x < y) != (y > x)\")\n625 loops, best of 3: 2.76 \u00b5s per loop\n# new\nsage: timeit(\"(x < y) != (y > x)\")\n625 loops, best of 3: 13.3 \u00b5s per loop\n```\nIt looks like it's fairly constantly adding this.  Here, in the much slower checking of a list\n\n```\n# old\nsage: timeit(\"(x - 1 < 0) in [x - 2 < 0]\")\n625 loops, best of 3: 104 \u00b5s per loop\n# new\nsage: timeit(\"(x - 1 < 0) in [x - 2 < 0]\")\n625 loops, best of 3: 116 \u00b5s per loop\n```\nHere's another one.\n\n```\n# old\nsage: timeit(\"(y > y) != (y > y) \")\n625 loops, best of 3: 2.24 \u00b5s per loop\n# new\nsage: timeit(\"(y > y) != (y > y) \")\n625 loops, best of 3: 8.45 \u00b5s per loop\n```",
    "created_at": "2012-05-25T15:34:13Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128208",
    "user": "https://github.com/kcrisman"
}
```

<a id='comment:44'></a>Hmm, this is a big slowdown in at least one case.

```
# old
sage: timeit("(x < y) != (y > x)")
625 loops, best of 3: 2.76 µs per loop
# new
sage: timeit("(x < y) != (y > x)")
625 loops, best of 3: 13.3 µs per loop
```
It looks like it's fairly constantly adding this.  Here, in the much slower checking of a list

```
# old
sage: timeit("(x - 1 < 0) in [x - 2 < 0]")
625 loops, best of 3: 104 µs per loop
# new
sage: timeit("(x - 1 < 0) in [x - 2 < 0]")
625 loops, best of 3: 116 µs per loop
```
Here's another one.

```
# old
sage: timeit("(y > y) != (y > y) ")
625 loops, best of 3: 2.24 µs per loop
# new
sage: timeit("(y > y) != (y > y) ")
625 loops, best of 3: 8.45 µs per loop
```



---

archive/issue_comments_128209.json:
```json
{
    "body": "<a id='comment:45'></a>I'm kind of OK with this slowdown. It's in the low microseconds range, and it's also understandable considering the new code actually checks some stuff, whereas the old code doesn't really.\n\nI guess I will ping Burcin about this via email.",
    "created_at": "2012-05-26T07:17:29Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128209",
    "user": "https://github.com/kini"
}
```

<a id='comment:45'></a>I'm kind of OK with this slowdown. It's in the low microseconds range, and it's also understandable considering the new code actually checks some stuff, whereas the old code doesn't really.

I guess I will ping Burcin about this via email.



---

archive/issue_comments_128210.json:
```json
{
    "body": "<a id='comment:46'></a>Burcin says he's too busy to look carefully but that the code probably can't be optimized much further.",
    "created_at": "2012-05-28T22:18:33Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128210",
    "user": "https://github.com/kini"
}
```

<a id='comment:46'></a>Burcin says he's too busy to look carefully but that the code probably can't be optimized much further.



---

archive/issue_comments_128211.json:
```json
{
    "body": "Changing status from needs_review to positive_review.",
    "created_at": "2012-05-28T22:34:14Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128211",
    "user": "https://github.com/kcrisman"
}
```

Changing status from needs_review to positive_review.



---

archive/issue_comments_128212.json:
```json
{
    "body": "<a id='comment:48'></a>> Burcin says he's too busy to look carefully but that the code probably can't be optimized much further.\n\nGood enough for me.",
    "created_at": "2012-05-28T22:34:14Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128212",
    "user": "https://github.com/kcrisman"
}
```

<a id='comment:48'></a>> Burcin says he's too busy to look carefully but that the code probably can't be optimized much further.

Good enough for me.



---

archive/issue_comments_128213.json:
```json
{
    "body": "<a id='comment:49'></a>Thanks!",
    "created_at": "2012-05-28T22:57:03Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128213",
    "user": "https://github.com/kini"
}
```

<a id='comment:49'></a>Thanks!



---

archive/issue_comments_128214.json:
```json
{
    "body": "<a id='comment:50'></a>I am interested in trying this patch but not sure how to apply it correctly.  This is what I did on Sage 5.0  (Mac OS Snow Leopard) \n\n```\n$ pwd\n/Users/tnguyen/Src/Devel/SAGE/sage-5.0/devel/sage\n$ sage -hg qimport http://trac.sagemath.org/sage_trac/raw-attachment/ticket/11309/trac_11309-equate-flipped-comparisons.patch\nadding trac_11309-equate-flipped-comparisons.patch to series file\nGodel Wed May 30:23:05:42 (4714) ~/Src/Devel/SAGE/sage-5.0/devel/sage \n$ sage -hg qpushapplying trac_11309-equate-flipped-comparisons.patch\npatching file sage/symbolic/expression.pyx\nHunk #1 FAILED at 1179\nHunk #2 FAILED at 1186\nHunk #3 FAILED at 1204\n3 out of 3 hunks FAILED -- saving rejects to file sage/symbolic/expression.pyx.rej\npatch failed, unable to continue (try -v)\npatch failed, rejects left in working dir\nerrors during apply, please fix and refresh trac_11309-equate-flipped-comparisons.patch\nGodel Wed May 30:23:05:51 (4715) ~/Src/Devel/SAGE/sage-5.0/devel/sage \n```",
    "created_at": "2012-05-31T06:10:02Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128214",
    "user": "https://trac.sagemath.org/admin/accounts/users/tnv"
}
```

<a id='comment:50'></a>I am interested in trying this patch but not sure how to apply it correctly.  This is what I did on Sage 5.0  (Mac OS Snow Leopard) 

```
$ pwd
/Users/tnguyen/Src/Devel/SAGE/sage-5.0/devel/sage
$ sage -hg qimport http://trac.sagemath.org/sage_trac/raw-attachment/ticket/11309/trac_11309-equate-flipped-comparisons.patch
adding trac_11309-equate-flipped-comparisons.patch to series file
Godel Wed May 30:23:05:42 (4714) ~/Src/Devel/SAGE/sage-5.0/devel/sage 
$ sage -hg qpushapplying trac_11309-equate-flipped-comparisons.patch
patching file sage/symbolic/expression.pyx
Hunk #1 FAILED at 1179
Hunk #2 FAILED at 1186
Hunk #3 FAILED at 1204
3 out of 3 hunks FAILED -- saving rejects to file sage/symbolic/expression.pyx.rej
patch failed, unable to continue (try -v)
patch failed, rejects left in working dir
errors during apply, please fix and refresh trac_11309-equate-flipped-comparisons.patch
Godel Wed May 30:23:05:51 (4715) ~/Src/Devel/SAGE/sage-5.0/devel/sage 
```



---

archive/issue_comments_128215.json:
```json
{
    "body": "<a id='comment:51'></a>Replying to [comment:50 tnv]:\n> I am interested in trying this patch but not sure how to apply it correctly.\n\nYou need to apply both the patches *in the order mentioned in the description of this ticket*. Try these commands (assuming you are in devel/sage)\n\n```\n../../sage -hg qimport -P http://trac.sagemath.org/sage_trac/raw-attachment/ticket/11309/trac_11309-fix-comparison-of-comparisons.patch\n../../sage -hg qimport -P http://trac.sagemath.org/sage_trac/raw-attachment/ticket/11309/trac_11309-equate-flipped-comparisons.patch\n../../sage -br\n```",
    "created_at": "2012-05-31T06:34:49Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128215",
    "user": "https://github.com/ppurka"
}
```

<a id='comment:51'></a>Replying to [comment:50 tnv]:
> I am interested in trying this patch but not sure how to apply it correctly.

You need to apply both the patches *in the order mentioned in the description of this ticket*. Try these commands (assuming you are in devel/sage)

```
../../sage -hg qimport -P http://trac.sagemath.org/sage_trac/raw-attachment/ticket/11309/trac_11309-fix-comparison-of-comparisons.patch
../../sage -hg qimport -P http://trac.sagemath.org/sage_trac/raw-attachment/ticket/11309/trac_11309-equate-flipped-comparisons.patch
../../sage -br
```



---

archive/issue_comments_128216.json:
```json
{
    "body": "<a id='comment:52'></a>Patchbot: Apply trac_11309-fix-comparison-of-comparisons.patch trac_11309-equate-flipped-comparisons.patch",
    "created_at": "2012-05-31T07:30:31Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128216",
    "user": "https://github.com/kini"
}
```

<a id='comment:52'></a>Patchbot: Apply trac_11309-fix-comparison-of-comparisons.patch trac_11309-equate-flipped-comparisons.patch



---

archive/issue_comments_128217.json:
```json
{
    "body": "<a id='comment:53'></a>Hi, may be I've missed something but these patches still break things as listed in my comment:24.  \n\n\n```\n(prepatched)\n\nsage: (- x + y == 0) == (0 == -x + y) \nTrue \nsage: (-x + y == 0) == (0 == -x + y) \nTrue \nsage: (x < y) == (y > x) \nTrue\n\n(postpatched)\n\nsage: (- x + y == 0) == (0 == -x + y) \nFalse \nsage: (-x + y == 0) == (0 == -x + y) \nFalse \nsage: (x < y) == (y > x) \nFalse\n```\n\nThe main reason why I report this in the first place is because of this error in which multiplying by -1 does not switch the sign.  I think they are related but not sure.  \n\n```\nsage: -1 * (x<5)\n-x < -5\n```",
    "created_at": "2012-05-31T20:45:55Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128217",
    "user": "https://trac.sagemath.org/admin/accounts/users/tnv"
}
```

<a id='comment:53'></a>Hi, may be I've missed something but these patches still break things as listed in my comment:24.  


```
(prepatched)

sage: (- x + y == 0) == (0 == -x + y) 
True 
sage: (-x + y == 0) == (0 == -x + y) 
True 
sage: (x < y) == (y > x) 
True

(postpatched)

sage: (- x + y == 0) == (0 == -x + y) 
False 
sage: (-x + y == 0) == (0 == -x + y) 
False 
sage: (x < y) == (y > x) 
False
```

The main reason why I report this in the first place is because of this error in which multiplying by -1 does not switch the sign.  I think they are related but not sure.  

```
sage: -1 * (x<5)
-x < -5
```



---

archive/issue_comments_128218.json:
```json
{
    "body": "<a id='comment:54'></a>Did you forget to rebuild Sage after applying the patches?\n\n```\n[1] fs-boone@zhenghe /opt/sage/devel/sage $ hg qapplied\ntrac_13057-no-intersphinx.patch\ntrac_11309-fix-comparison-of-comparisons.patch\ntrac_11309-equate-flipped-comparisons.patch\n[1] fs-boone@zhenghe /opt/sage/devel/sage $ sage -b &> /dev/null\n[1] fs-boone@zhenghe /opt/sage/devel/sage $ sage -q\nsage: var('y')\ny\nsage: (- x + y == 0) == (0 == -x + y) \nTrue\nsage: (-x + y == 0) == (0 == -x + y) \nTrue\nsage: (x < y) == (y > x) \nTrue\nsage: -(x < 5)\n-x < -5\nsage: \n```\n\nPersonally I don't see why `x * (y < z)` should even be simplified to anything other than `x * (y < z)`. `y < z` is a mathematical object which does not live in a space which has a multiplication operation - it lives in the space of logical predicates. But that is something to address in a different ticket. Testing the title of this ticket:\n\n```\nsage: Set([-x + y > 0, -y + x >= 0, x - y > 0])    \n{-x + y > 0, x - y >= 0, x - y > 0}\nsage: len(_)   \n3\n```\n\nSo the patches do at least address and solve the issue in the ticket's name.",
    "created_at": "2012-05-31T21:03:17Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128218",
    "user": "https://github.com/kini"
}
```

<a id='comment:54'></a>Did you forget to rebuild Sage after applying the patches?

```
[1] fs-boone@zhenghe /opt/sage/devel/sage $ hg qapplied
trac_13057-no-intersphinx.patch
trac_11309-fix-comparison-of-comparisons.patch
trac_11309-equate-flipped-comparisons.patch
[1] fs-boone@zhenghe /opt/sage/devel/sage $ sage -b &> /dev/null
[1] fs-boone@zhenghe /opt/sage/devel/sage $ sage -q
sage: var('y')
y
sage: (- x + y == 0) == (0 == -x + y) 
True
sage: (-x + y == 0) == (0 == -x + y) 
True
sage: (x < y) == (y > x) 
True
sage: -(x < 5)
-x < -5
sage: 
```

Personally I don't see why `x * (y < z)` should even be simplified to anything other than `x * (y < z)`. `y < z` is a mathematical object which does not live in a space which has a multiplication operation - it lives in the space of logical predicates. But that is something to address in a different ticket. Testing the title of this ticket:

```
sage: Set([-x + y > 0, -y + x >= 0, x - y > 0])    
{-x + y > 0, x - y >= 0, x - y > 0}
sage: len(_)   
3
```

So the patches do at least address and solve the issue in the ticket's name.



---

archive/issue_comments_128219.json:
```json
{
    "body": "<a id='comment:55'></a>Replying to [comment:53 tnv]:\n>\n> The main reason why I report this in the first place is because of this error in which multiplying by -1 does not switch the sign.  I think they are related but not sure.  \n> \n> {{{\n> sage: -1 * (x<5)\n> -x < -5\n> }}}\n\n\nThis is #7660. It would be quite easy to remove the `if is_a_relational(left._gobj)` checks in `_add_, `_mul_`, etc. in `sage/symbolic/expression.pyx` to revert back to GiNaC behavior.",
    "created_at": "2012-06-01T10:01:03Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128219",
    "user": "https://github.com/burcin"
}
```

<a id='comment:55'></a>Replying to [comment:53 tnv]:
>
> The main reason why I report this in the first place is because of this error in which multiplying by -1 does not switch the sign.  I think they are related but not sure.  
> 
> {{{
> sage: -1 * (x<5)
> -x < -5
> }}}


This is #7660. It would be quite easy to remove the `if is_a_relational(left._gobj)` checks in `_add_, `_mul_`, etc. in `sage/symbolic/expression.pyx` to revert back to GiNaC behavior.



---

archive/issue_comments_128220.json:
```json
{
    "body": "<a id='comment:56'></a>It seems to work fine now -- not sure what I did previously.  So if you don't use hash for comparison , what do you use ?   Thanks all of those who spend time to create these patches.",
    "created_at": "2012-06-01T20:05:45Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128220",
    "user": "https://trac.sagemath.org/admin/accounts/users/tnv"
}
```

<a id='comment:56'></a>It seems to work fine now -- not sure what I did previously.  So if you don't use hash for comparison , what do you use ?   Thanks all of those who spend time to create these patches.



---

archive/issue_comments_128221.json:
```json
{
    "body": "<a id='comment:57'></a>Given two relational expressions `a ? b` and `c ! d`, first I check whether `?` and `!` are the same relation. If so, I have a couple of cases. One, if `?` and `!` are both `==` or are both `!=`, then I check whether `a == c` and `b == d`, or `a == d` and `b == c`. Two, if `?` and `!` are some other relation than `==` or `!=`, then I only allow the case `a == c` and `b == d`.\n\nIf `?` and `!` are different from each other, I check whether they are reversals of each other (like one is `<` and the other is `>`, etc.). If that is the case, then I allow `a == d` and `b == c`.\n\nIn all other cases, the two relational expressions are considered unequal.\n\n... that explanation looks kind of confusing. Maybe it's better if you just look at the patch... it's probably easier to understand :)",
    "created_at": "2012-06-01T20:56:13Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128221",
    "user": "https://github.com/kini"
}
```

<a id='comment:57'></a>Given two relational expressions `a ? b` and `c ! d`, first I check whether `?` and `!` are the same relation. If so, I have a couple of cases. One, if `?` and `!` are both `==` or are both `!=`, then I check whether `a == c` and `b == d`, or `a == d` and `b == c`. Two, if `?` and `!` are some other relation than `==` or `!=`, then I only allow the case `a == c` and `b == d`.

If `?` and `!` are different from each other, I check whether they are reversals of each other (like one is `<` and the other is `>`, etc.). If that is the case, then I allow `a == d` and `b == c`.

In all other cases, the two relational expressions are considered unequal.

... that explanation looks kind of confusing. Maybe it's better if you just look at the patch... it's probably easier to understand :)



---

archive/issue_comments_128222.json:
```json
{
    "body": "Resolution: fixed",
    "created_at": "2012-06-05T11:50:48Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11309#issuecomment-128222",
    "user": "https://github.com/jdemeyer"
}
```

Resolution: fixed



---

archive/issue_events_029291.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2012-06-05T11:50:48Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/11309",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/11309#event-29291"
}
```
