# Issue 11309: Sage sees - x + y > 0, - y + x >= 0,  and  x - y > 0 as equivalent

archive/issues_011137.json:
```json
{
    "assignees": [
        "https://github.com/burcin"
    ],
    "body": "<div id=\"comment:0\"></div>\n\n-x + y > 0 and x - y > 0  are treated the same in Sage.  \n\n```python\nsage: version()\n'Sage Version 4.6.2, Release Date: 2011-02-25'\n\nsage: (-x +y < 0) in [x -y < 0] \nTrue \n\nSet([-x +y >= 0,x -y >= 0]) \n{-x + y >= 0} \n```\n\nand they have the same Hash\n\n```python\nsage: var('x,y') \n(x, y) \nsage: hash(-x + y > 0 )\n1221566266\nsage: hash(-x + y >= 0 )\n1221566266\nsage: hash(x - y >= 0 )\n1221566266\nsage: hash(-y + x >= 0 )\n1221566266\nsage: hash(x - y > 0 )\n1221566266\n```\n\nIt seems to me that Sage treats `>`, `>=`, and `==` the same (see #7660). If this is true then it's a serious problem and needs to be addressed.\n\nApply:\n\n1. [attachment: trac_11309-fix-comparison-of-comparisons.patch](https://github.com/sagemath/sage/files/ticket11309/trac_11309-fix-comparison-of-comparisons.patch.gz)\n2. [attachment: trac_11309-equate-flipped-comparisons.patch](https://github.com/sagemath/sage/files/ticket11309/trac_11309-equate-flipped-comparisons.patch.gz)\n\nCC:  @kini @kcrisman @sagetrac-tnv\n\nComponent: **symbolics**\n\nKeywords: **inequality equality relational sd31 __richcmp__ sd40.5**\n\nAuthor: **Keshav Kini, Burcin Erocal**\n\nReviewer: **Karl-Dieter Crisman, ThanhVu Nguyen**\n\nMerged: **sage-5.1.beta3**\n\n_Issue created by migration from https://trac.sagemath.org/ticket/11309_\n\n",
    "closed_at": "2012-06-05T11:50:48Z",
    "created_at": "2011-05-06T22:44:13Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/c%3A%20symbolics",
        "https://github.com/sagemath/sage/labels/p%3A%20major%20/%203",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-5.1",
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "Sage sees - x + y > 0, - y + x >= 0,  and  x - y > 0 as equivalent",
    "type": "issue",
    "updated_at": "2012-06-05T11:50:48Z",
    "url": "https://github.com/sagemath/sage/issues/11309",
    "user": "https://github.com/sagetrac-tnv"
}
```
<div id="comment:0"></div>

-x + y > 0 and x - y > 0  are treated the same in Sage.  

```python
sage: version()
'Sage Version 4.6.2, Release Date: 2011-02-25'

sage: (-x +y < 0) in [x -y < 0] 
True 

Set([-x +y >= 0,x -y >= 0]) 
{-x + y >= 0} 
```

and they have the same Hash

```python
sage: var('x,y') 
(x, y) 
sage: hash(-x + y > 0 )
1221566266
sage: hash(-x + y >= 0 )
1221566266
sage: hash(x - y >= 0 )
1221566266
sage: hash(-y + x >= 0 )
1221566266
sage: hash(x - y > 0 )
1221566266
```

It seems to me that Sage treats `>`, `>=`, and `==` the same (see #7660). If this is true then it's a serious problem and needs to be addressed.

Apply:

1. [attachment: trac_11309-fix-comparison-of-comparisons.patch](https://github.com/sagemath/sage/files/ticket11309/trac_11309-fix-comparison-of-comparisons.patch.gz)
2. [attachment: trac_11309-equate-flipped-comparisons.patch](https://github.com/sagemath/sage/files/ticket11309/trac_11309-equate-flipped-comparisons.patch.gz)

CC:  @kini @kcrisman @sagetrac-tnv

Component: **symbolics**

Keywords: **inequality equality relational sd31 __richcmp__ sd40.5**

Author: **Keshav Kini, Burcin Erocal**

Reviewer: **Karl-Dieter Crisman, ThanhVu Nguyen**

Merged: **sage-5.1.beta3**

_Issue created by migration from https://trac.sagemath.org/ticket/11309_





---

archive/issue_events_148528.json:
```json
{
    "actor": "https://github.com/sagetrac-tnv",
    "created_at": "2011-05-06T22:44:13Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "milestone_number": null,
    "milestone_title": "sage-5.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/11309#event-148528"
}
```



---

archive/issue_events_148529.json:
```json
{
    "actor": "https://github.com/sagetrac-tnv",
    "created_at": "2011-05-06T22:44:13Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "label": "https://github.com/sagemath/sage/labels/c%3A%20symbolics",
    "label_color": "0000ff",
    "label_name": "c: symbolics",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/11309#event-148529"
}
```



---

archive/issue_events_148530.json:
```json
{
    "actor": "https://github.com/sagetrac-tnv",
    "created_at": "2011-05-06T22:44:13Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "label": "https://github.com/sagemath/sage/labels/p%3A%20major%20/%203",
    "label_color": "ffbb00",
    "label_name": "p: major / 3",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/11309#event-148530"
}
```



---

archive/issue_events_148531.json:
```json
{
    "actor": "https://github.com/sagetrac-tnv",
    "created_at": "2011-05-06T22:44:13Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "d73a4a",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/11309#event-148531"
}
```



---

archive/issue_events_148532.json:
```json
{
    "actor": "https://github.com/burcin",
    "created_at": "2011-05-06T22:44:13Z",
    "event": "assigned",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "subject": "https://github.com/sagetrac-tnv",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/11309#event-148532"
}
```



---

archive/issue_comments_113433.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -1,5 +1,6 @@\n -x + y > 0 and x - y > 0  are treated the same in Sage.  \n \n+```\n sage: version()\n 'Sage Version 4.6.2, Release Date: 2011-02-25'\n \n@@ -8,10 +9,11 @@\n \n Set([-x +y >= 0,x -y >= 0]) \n {-x + y >= 0} \n-\n+```\n \n and they have the same Hash\n \n+```\n sage: var('x,y') \n (x, y) \n sage: hash(-x + y > 0 )\n@@ -24,7 +26,7 @@\n 1221566266\n sage: hash(x - y > 0 )\n 1221566266\n-\n+```\n \n It seems to me that Sage treats > , >= ,  ==  the same (see https://github.com/sagemath/sage/issues/7660).    If this is true then it's a serious problem and needs to be addressed.\n \n``````\n",
    "created_at": "2011-05-06T22:53:19Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113433",
    "user": "https://github.com/sagetrac-tnv"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -1,5 +1,6 @@
 -x + y > 0 and x - y > 0  are treated the same in Sage.  
 
+```
 sage: version()
 'Sage Version 4.6.2, Release Date: 2011-02-25'
 
@@ -8,10 +9,11 @@
 
 Set([-x +y >= 0,x -y >= 0]) 
 {-x + y >= 0} 
-
+```
 
 and they have the same Hash
 
+```
 sage: var('x,y') 
 (x, y) 
 sage: hash(-x + y > 0 )
@@ -24,7 +26,7 @@
 1221566266
 sage: hash(x - y > 0 )
 1221566266
-
+```
 
 It seems to me that Sage treats > , >= ,  ==  the same (see https://github.com/sagemath/sage/issues/7660).    If this is true then it's a serious problem and needs to be addressed.
 
``````




---

archive/issue_comments_113434.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -1,6 +1,6 @@\n -x + y > 0 and x - y > 0  are treated the same in Sage.  \n \n-```\n+```python\n sage: version()\n 'Sage Version 4.6.2, Release Date: 2011-02-25'\n \n@@ -13,7 +13,7 @@\n \n and they have the same Hash\n \n-```\n+```python\n sage: var('x,y') \n (x, y) \n sage: hash(-x + y > 0 )\n@@ -28,5 +28,5 @@\n 1221566266\n ```\n \n-It seems to me that Sage treats > , >= ,  ==  the same (see https://github.com/sagemath/sage/issues/7660).    If this is true then it's a serious problem and needs to be addressed.\n+It seems to me that Sage treats `>`, `>=`, and `==` the same (see #7660). If this is true then it's a serious problem and needs to be addressed.\n \n``````\n",
    "created_at": "2011-06-15T23:22:30Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113434",
    "user": "https://github.com/kini"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -1,6 +1,6 @@
 -x + y > 0 and x - y > 0  are treated the same in Sage.  
 
-```
+```python
 sage: version()
 'Sage Version 4.6.2, Release Date: 2011-02-25'
 
@@ -13,7 +13,7 @@
 
 and they have the same Hash
 
-```
+```python
 sage: var('x,y') 
 (x, y) 
 sage: hash(-x + y > 0 )
@@ -28,5 +28,5 @@
 1221566266
 ```
 
-It seems to me that Sage treats > , >= ,  ==  the same (see https://github.com/sagemath/sage/issues/7660).    If this is true then it's a serious problem and needs to be addressed.
+It seems to me that Sage treats `>`, `>=`, and `==` the same (see #7660). If this is true then it's a serious problem and needs to be addressed.
 
``````




---

archive/issue_comments_113435.json:
```json
{
    "body": "<div id=\"comment:4\" align=\"right\">comment:4</div>\n\nReady for review! Thanks to Burcin for walking me through the Cython code.",
    "created_at": "2011-06-16T00:34:56Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113435",
    "user": "https://github.com/kini"
}
```

<div id="comment:4" align="right">comment:4</div>

Ready for review! Thanks to Burcin for walking me through the Cython code.



---

archive/issue_events_148533.json:
```json
{
    "actor": "https://github.com/kini",
    "created_at": "2011-06-16T00:34:56Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "7fff00",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/11309#event-148533"
}
```



---

archive/issue_comments_113436.json:
```json
{
    "body": "Author: **Keshav Kini, Burcin Erocal**",
    "created_at": "2011-06-16T00:34:56Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113436",
    "user": "https://github.com/kini"
}
```

Author: **Keshav Kini, Burcin Erocal**



---

archive/issue_comments_113437.json:
```json
{
    "body": "<div id=\"comment:5\" align=\"right\">comment:5</div>\n\nThanks for creating the patch!!\n\n\nI don't know how to apply this patch though  - if you can walk me through it then I can test.  \n\nBut in the mean time, what are the result for these commands ?   If the results are different than the defected version above and as expected then probably the patch is correct.  \n\nsage: (-x +y < 0) in [x -y < 0] \n\nSet([-x +y >= 0,x -y >= 0]) \n\nsage: var('x,y') \n(x, y) \nsage: hash(-x + y > 0 )\nsage: hash(-x + y >= 0 )\nsage: hash(x - y >= 0 )\nsage: hash(-y + x >= 0 )\nsage: hash(x - y > 0 )",
    "created_at": "2011-06-16T04:24:50Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113437",
    "user": "https://github.com/sagetrac-tnv"
}
```

<div id="comment:5" align="right">comment:5</div>

Thanks for creating the patch!!


I don't know how to apply this patch though  - if you can walk me through it then I can test.  

But in the mean time, what are the result for these commands ?   If the results are different than the defected version above and as expected then probably the patch is correct.  

sage: (-x +y < 0) in [x -y < 0] 

Set([-x +y >= 0,x -y >= 0]) 

sage: var('x,y') 
(x, y) 
sage: hash(-x + y > 0 )
sage: hash(-x + y >= 0 )
sage: hash(x - y >= 0 )
sage: hash(-y + x >= 0 )
sage: hash(x - y > 0 )



---

archive/issue_comments_113438.json:
```json
{
    "body": "<div id=\"comment:6\" align=\"right\">comment:6</div>\n\nI've changed the patch a little bit just now, by the way.\n\nTo apply the patch, go to `devel/sage/` inside your sage directory, and type `sage -hg qimport https://github.com/sagemath/sage/files/ticket11309/trac_11309-fix-comparison-of-comparisons.patch.gz`, type `sage -hg qpush`, type `sage -b`, and finally launch sage to test the patch!\n\nYour examples are fixed, yes. You can see them listed inside the patch, where I added some more examples in the documentation of the function I changed.",
    "created_at": "2011-06-16T04:37:58Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113438",
    "user": "https://github.com/kini"
}
```

<div id="comment:6" align="right">comment:6</div>

I've changed the patch a little bit just now, by the way.

To apply the patch, go to `devel/sage/` inside your sage directory, and type `sage -hg qimport https://github.com/sagemath/sage/files/ticket11309/trac_11309-fix-comparison-of-comparisons.patch.gz`, type `sage -hg qpush`, type `sage -b`, and finally launch sage to test the patch!

Your examples are fixed, yes. You can see them listed inside the patch, where I added some more examples in the documentation of the function I changed.



---

archive/issue_comments_113439.json:
```json
{
    "body": "<div id=\"comment:7\" align=\"right\">comment:7</div>\n\nOh, by the way, I didn't fix the hashes. They're screwed up anyway, so this solution avoids using them to decide anything about whether expressions are the same or not. We might fix that in a later ticket...",
    "created_at": "2011-06-16T04:47:42Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113439",
    "user": "https://github.com/kini"
}
```

<div id="comment:7" align="right">comment:7</div>

Oh, by the way, I didn't fix the hashes. They're screwed up anyway, so this solution avoids using them to decide anything about whether expressions are the same or not. We might fix that in a later ticket...



---

archive/issue_comments_113440.json:
```json
{
    "body": "<div id=\"comment:8\" align=\"right\">comment:8</div>\n\nThanks for the info.  \n\nWhich Sage version do I apply the patch to ?  the latest 4.7  ?    I'll do that tomorrow at work\n\nif they still give the same hashes then   (-x +y < 0) in [x -y < 0]  still gives True and \nSet([-x +y >= 0,x -y >= 0]) still eliminates one of them .  Correct ?",
    "created_at": "2011-06-16T05:04:15Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113440",
    "user": "https://github.com/sagetrac-tnv"
}
```

<div id="comment:8" align="right">comment:8</div>

Thanks for the info.  

Which Sage version do I apply the patch to ?  the latest 4.7  ?    I'll do that tomorrow at work

if they still give the same hashes then   (-x +y < 0) in [x -y < 0]  still gives True and 
Set([-x +y >= 0,x -y >= 0]) still eliminates one of them .  Correct ?



---

archive/issue_comments_113441.json:
```json
{
    "body": "<div id=\"comment:9\" align=\"right\">comment:9</div>\n\nNo, incorrect, because I changed the code to not use the hashes at all when doing the comparison. The hashes are now irrelevant to this operation. However kcrisman found a bug in my patch so I will update it again in just a second...",
    "created_at": "2011-06-16T05:19:55Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113441",
    "user": "https://github.com/kini"
}
```

<div id="comment:9" align="right">comment:9</div>

No, incorrect, because I changed the code to not use the hashes at all when doing the comparison. The hashes are now irrelevant to this operation. However kcrisman found a bug in my patch so I will update it again in just a second...



---

archive/issue_events_148534.json:
```json
{
    "actor": "https://github.com/kini",
    "created_at": "2011-06-16T05:48:41Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "7fff00",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/11309#event-148534"
}
```



---

archive/issue_events_148535.json:
```json
{
    "actor": "https://github.com/kini",
    "created_at": "2011-06-16T05:48:41Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "label": "https://github.com/sagemath/sage/labels/needs%20work",
    "label_color": "ffff00",
    "label_name": "needs work",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/11309#event-148535"
}
```



---

archive/issue_comments_113442.json:
```json
{
    "body": "<div id=\"comment:10\" align=\"right\">comment:10</div>\n\nOK, this looks like it's going to take a little while, I'm getting some unexpected doctest errors... I'll fix it in the morning :)",
    "created_at": "2011-06-16T05:48:41Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113442",
    "user": "https://github.com/kini"
}
```

<div id="comment:10" align="right">comment:10</div>

OK, this looks like it's going to take a little while, I'm getting some unexpected doctest errors... I'll fix it in the morning :)



---

archive/issue_events_148536.json:
```json
{
    "actor": "https://github.com/kini",
    "created_at": "2011-06-16T06:07:00Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "label": "https://github.com/sagemath/sage/labels/needs%20work",
    "label_color": "ffff00",
    "label_name": "needs work",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/11309#event-148536"
}
```



---

archive/issue_events_148537.json:
```json
{
    "actor": "https://github.com/kini",
    "created_at": "2011-06-16T06:07:00Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "7fff00",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/11309#event-148537"
}
```



---

archive/issue_comments_113443.json:
```json
{
    "body": "<div id=\"comment:11\" align=\"right\">comment:11</div>\n\nNever mind, ready for review again!",
    "created_at": "2011-06-16T06:07:00Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113443",
    "user": "https://github.com/kini"
}
```

<div id="comment:11" align="right">comment:11</div>

Never mind, ready for review again!



---

archive/issue_events_148538.json:
```json
{
    "actor": "https://github.com/burcin",
    "created_at": "2011-06-16T06:16:34Z",
    "event": "unassigned",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "subject": "https://github.com/kini",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/11309#event-148538"
}
```



---

archive/issue_events_148539.json:
```json
{
    "actor": "https://github.com/burcin",
    "created_at": "2011-06-16T06:17:02Z",
    "event": "assigned",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "subject": "https://github.com/kini",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/11309#event-148539"
}
```



---

archive/issue_comments_113444.json:
```json
{
    "body": "<div id=\"comment:13\" align=\"right\">comment:13</div>\n\nburcin got deleted from this ticket... that trac bug is annoying!",
    "created_at": "2011-06-16T06:17:02Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113444",
    "user": "https://github.com/kini"
}
```

<div id="comment:13" align="right">comment:13</div>

burcin got deleted from this ticket... that trac bug is annoying!



---

archive/issue_comments_113445.json:
```json
{
    "body": "<div id=\"comment:14\" align=\"right\">comment:14</div>\n\nCode is correct (corner cases discussed in person, so that e.g. `(x < y) != x ` is True.\n\n`GEx e` seems far from where it comes from.",
    "created_at": "2011-06-16T06:22:30Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113445",
    "user": "https://github.com/kcrisman"
}
```

<div id="comment:14" align="right">comment:14</div>

Code is correct (corner cases discussed in person, so that e.g. `(x < y) != x ` is True.

`GEx e` seems far from where it comes from.



---

archive/issue_comments_113446.json:
```json
{
    "body": "<div id=\"comment:15\" align=\"right\">comment:15</div>\n\nAttachment: **[trac_11309-fix-comparison-of-comparisons.patch.gz](https://github.com/sagemath/sage/files/ticket11309/trac_11309-fix-comparison-of-comparisons.patch.gz)**\n\nfixed! (sorry, that was left over from when I was doing something that made cython not like that declaration where it was)",
    "created_at": "2011-06-16T06:27:31Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113446",
    "user": "https://github.com/kini"
}
```

<div id="comment:15" align="right">comment:15</div>

Attachment: **[trac_11309-fix-comparison-of-comparisons.patch.gz](https://github.com/sagemath/sage/files/ticket11309/trac_11309-fix-comparison-of-comparisons.patch.gz)**

fixed! (sorry, that was left over from when I was doing something that made cython not like that declaration where it was)



---

archive/issue_comments_113447.json:
```json
{
    "body": "Changed keywords from **inequality, equality** to **inequality equality relational sd31 __richcmp__**",
    "created_at": "2011-06-16T06:29:37Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113447",
    "user": "https://github.com/kini"
}
```

Changed keywords from **inequality, equality** to **inequality equality relational sd31 __richcmp__**



---

archive/issue_comments_113448.json:
```json
{
    "body": "<div id=\"comment:17\" align=\"right\">comment:17</div>\n\nThis looks good.  Passing relevant tests.",
    "created_at": "2011-06-16T06:37:50Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113448",
    "user": "https://github.com/kcrisman"
}
```

<div id="comment:17" align="right">comment:17</div>

This looks good.  Passing relevant tests.



---

archive/issue_events_148540.json:
```json
{
    "actor": "https://github.com/kcrisman",
    "created_at": "2011-06-16T06:37:58Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "7fff00",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/11309#event-148540"
}
```



---

archive/issue_events_148541.json:
```json
{
    "actor": "https://github.com/kcrisman",
    "created_at": "2011-06-16T06:37:58Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "label": "https://github.com/sagemath/sage/labels/positive%20review",
    "label_color": "dfffc0",
    "label_name": "positive review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/11309#event-148541"
}
```



---

archive/issue_comments_113449.json:
```json
{
    "body": "Reviewer: **Karl-Dieter Crisman**",
    "created_at": "2011-06-16T11:56:37Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113449",
    "user": "https://github.com/jdemeyer"
}
```

Reviewer: **Karl-Dieter Crisman**



---

archive/issue_comments_113450.json:
```json
{
    "body": "<div id=\"comment:20\" align=\"right\">comment:20</div>\n\nIt now can tell that  -x +y >0 is different than -y + x >= 0  but it says that  -x+y >0  is not the same as y > x  ---  \n\nor may be this is another problem ?  \n\n```\nsage: ( -x+y >0 ) == (y > x )\nFalse\n\nsage: (-x + y < 0)  ==  (-x < -y)\nFalse\nsage: (x + y == 0)  ==  (x == -y)\nFalse\nsage: (x - y == 0)  ==  (x == y)\nFalse\nsage: (- x + y == 0)  ==  (0 == -x + y)\nFalse\nsage: (x < y)  ==  (y > x)\nFalse\nsage: (x == y) == (-x == -y)\nFalse\nsage: (x + y < 1 )  ==  (x + y -1 < 0)\nFalse\n\n```",
    "created_at": "2011-06-16T22:59:40Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113450",
    "user": "https://github.com/sagetrac-tnv"
}
```

<div id="comment:20" align="right">comment:20</div>

It now can tell that  -x +y >0 is different than -y + x >= 0  but it says that  -x+y >0  is not the same as y > x  ---  

or may be this is another problem ?  

```
sage: ( -x+y >0 ) == (y > x )
False

sage: (-x + y < 0)  ==  (-x < -y)
False
sage: (x + y == 0)  ==  (x == -y)
False
sage: (x - y == 0)  ==  (x == y)
False
sage: (- x + y == 0)  ==  (0 == -x + y)
False
sage: (x < y)  ==  (y > x)
False
sage: (x == y) == (-x == -y)
False
sage: (x + y < 1 )  ==  (x + y -1 < 0)
False

```



---

archive/issue_comments_113451.json:
```json
{
    "body": "<div id=\"comment:21\" align=\"right\">comment:21</div>\n\nThis patch *breaks* the following \n\n{{\nSage 4.7 (prepatched)\n\nsage: (- x + y == 0)  ==  (0 == -x + y)\nTrue\nsage: (-x + y == 0)  ==  (0 == -x + y)\nTrue\nsage: (x < y)  ==  (y > x)\nTrue\n\n\nSage 4.7 (postpatched)\n\n\nsage: (- x + y == 0)  ==  (0 == -x + y)\nFalse\nsage: (-x + y == 0)  ==  (0 == -x + y)\nFalse\nsage: (x < y)  ==  (y > x)\nFalse\n\n}}}",
    "created_at": "2011-06-16T23:03:36Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113451",
    "user": "https://github.com/sagetrac-tnv"
}
```

<div id="comment:21" align="right">comment:21</div>

This patch *breaks* the following 

{{
Sage 4.7 (prepatched)

sage: (- x + y == 0)  ==  (0 == -x + y)
True
sage: (-x + y == 0)  ==  (0 == -x + y)
True
sage: (x < y)  ==  (y > x)
True


Sage 4.7 (postpatched)


sage: (- x + y == 0)  ==  (0 == -x + y)
False
sage: (-x + y == 0)  ==  (0 == -x + y)
False
sage: (x < y)  ==  (y > x)
False

}}}



---

archive/issue_events_148542.json:
```json
{
    "actor": "https://github.com/sagetrac-tnv",
    "created_at": "2011-06-16T23:03:36Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "label": "https://github.com/sagemath/sage/labels/positive%20review",
    "label_color": "dfffc0",
    "label_name": "positive review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/11309#event-148542"
}
```



---

archive/issue_events_148543.json:
```json
{
    "actor": "https://github.com/sagetrac-tnv",
    "created_at": "2011-06-16T23:03:36Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "label": "https://github.com/sagemath/sage/labels/needs%20work",
    "label_color": "ffff00",
    "label_name": "needs work",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/11309#event-148543"
}
```



---

archive/issue_comments_113452.json:
```json
{
    "body": "<div id=\"comment:22\" align=\"right\">comment:22</div>\n\n\n``` \nSage 4.7 (prepatched)\n\nsage: (- x + y == 0) == (0 == -x + y) True sage: (-x + y == 0) == (0 == -x + y) True sage: (x < y) == (y > x) True\n\nSage 4.7 (postpatched)\n\nsage: (- x + y == 0) == (0 == -x + y) False sage: (-x + y == 0) == (0 == -x + y) False sage: (x < y) == (y > x) False\n\n```",
    "created_at": "2011-06-16T23:06:10Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113452",
    "user": "https://github.com/kcrisman"
}
```

<div id="comment:22" align="right">comment:22</div>


``` 
Sage 4.7 (prepatched)

sage: (- x + y == 0) == (0 == -x + y) True sage: (-x + y == 0) == (0 == -x + y) True sage: (x < y) == (y > x) True

Sage 4.7 (postpatched)

sage: (- x + y == 0) == (0 == -x + y) False sage: (-x + y == 0) == (0 == -x + y) False sage: (x < y) == (y > x) False

```



---

archive/issue_comments_113453.json:
```json
{
    "body": "<div id=\"comment:23\" align=\"right\">comment:23</div>\n\n{{ Sage 4.7 (prepatched)\n\nsage: (- x + y == 0) == (0 == -x + y) \nTrue \nsage: (-x + y == 0) == (0 == -x + y) \nTrue \nsage: (x < y) == (y > x) \nTrue\n\nSage 4.7 (postpatched)\n\nsage: (- x + y == 0) == (0 == -x + y) \nFalse \nsage: (-x + y == 0) == (0 == -x + y) \nFalse \nsage: (x < y) == (y > x) \nFalse\n\n}}}",
    "created_at": "2011-06-16T23:06:48Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113453",
    "user": "https://github.com/kcrisman"
}
```

<div id="comment:23" align="right">comment:23</div>

{{ Sage 4.7 (prepatched)

sage: (- x + y == 0) == (0 == -x + y) 
True 
sage: (-x + y == 0) == (0 == -x + y) 
True 
sage: (x < y) == (y > x) 
True

Sage 4.7 (postpatched)

sage: (- x + y == 0) == (0 == -x + y) 
False 
sage: (-x + y == 0) == (0 == -x + y) 
False 
sage: (x < y) == (y > x) 
False

}}}



---

archive/issue_comments_113454.json:
```json
{
    "body": "<div id=\"comment:24\" align=\"right\">comment:24</div>\n\nFinally used preview...\n\n``` \nSage 4.7 (prepatched)\n\nsage: (- x + y == 0) == (0 == -x + y) \nTrue \nsage: (-x + y == 0) == (0 == -x + y) \nTrue \nsage: (x < y) == (y > x) \nTrue\n\nSage 4.7 (postpatched)\n\nsage: (- x + y == 0) == (0 == -x + y) \nFalse \nsage: (-x + y == 0) == (0 == -x + y) \nFalse \nsage: (x < y) == (y > x) \nFalse\n\n```",
    "created_at": "2011-06-16T23:07:52Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113454",
    "user": "https://github.com/kcrisman"
}
```

<div id="comment:24" align="right">comment:24</div>

Finally used preview...

``` 
Sage 4.7 (prepatched)

sage: (- x + y == 0) == (0 == -x + y) 
True 
sage: (-x + y == 0) == (0 == -x + y) 
True 
sage: (x < y) == (y > x) 
True

Sage 4.7 (postpatched)

sage: (- x + y == 0) == (0 == -x + y) 
False 
sage: (-x + y == 0) == (0 == -x + y) 
False 
sage: (x < y) == (y > x) 
False

```



---

archive/issue_comments_113455.json:
```json
{
    "body": "<div id=\"comment:25\" align=\"right\">comment:25</div>\n\n\n```\n-x+y >0 is not the same as y > x\n```\nCorrect.  We use the philosophy (used elsewhere) that a comparison is True if you can prove it is True, and that otherwise it is False.  False means that we can't prove it's True, and in general these kinds of simplifications are super hard.   So all your examples need to be False, sadly.  \n\nAs for the thing that breaks... I agree that is a problem.  Great catch!  Can you put your (real) name as a reviewer?  (You should also feel free to add yourself to the [main Trac page](http://trac.sagemath.org/sage_trac/) as a developer/contributor.",
    "created_at": "2011-06-16T23:11:52Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113455",
    "user": "https://github.com/kcrisman"
}
```

<div id="comment:25" align="right">comment:25</div>


```
-x+y >0 is not the same as y > x
```
Correct.  We use the philosophy (used elsewhere) that a comparison is True if you can prove it is True, and that otherwise it is False.  False means that we can't prove it's True, and in general these kinds of simplifications are super hard.   So all your examples need to be False, sadly.  

As for the thing that breaks... I agree that is a problem.  Great catch!  Can you put your (real) name as a reviewer?  (You should also feel free to add yourself to the [main Trac page](http://trac.sagemath.org/sage_trac/) as a developer/contributor.



---

archive/issue_comments_113456.json:
```json
{
    "body": "<div id=\"comment:26\" align=\"right\">comment:26</div>\n\njust put my name as reviewer -- thanks.   \n\nFrom your msg,  would it be reasonable to add a SMT theorem prover package to Sage ?   So that it can show equivalence of expressions  (at least under some specific theories).",
    "created_at": "2011-06-17T03:47:41Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113456",
    "user": "https://github.com/sagetrac-tnv"
}
```

<div id="comment:26" align="right">comment:26</div>

just put my name as reviewer -- thanks.   

From your msg,  would it be reasonable to add a SMT theorem prover package to Sage ?   So that it can show equivalence of expressions  (at least under some specific theories).



---

archive/issue_comments_113457.json:
```json
{
    "body": "Changed reviewer from **Karl-Dieter Crisman** to **Karl-Dieter Crisman, ThanhVu Nguyen**",
    "created_at": "2011-06-17T03:47:41Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113457",
    "user": "https://github.com/sagetrac-tnv"
}
```

Changed reviewer from **Karl-Dieter Crisman** to **Karl-Dieter Crisman, ThanhVu Nguyen**



---

archive/issue_comments_113458.json:
```json
{
    "body": "<div id=\"comment:27\" align=\"right\">comment:27</div>\n\nThere are some tickets open for things like this, I think, or something related, but I don't really know.  Keshav or Burcin may know more.",
    "created_at": "2011-06-17T03:50:07Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113458",
    "user": "https://github.com/kcrisman"
}
```

<div id="comment:27" align="right">comment:27</div>

There are some tickets open for things like this, I think, or something related, but I don't really know.  Keshav or Burcin may know more.



---

archive/issue_comments_113459.json:
```json
{
    "body": "<div id=\"comment:28\" align=\"right\">comment:28</div>\n\nHm. In order to eventually solve #2778 and other such things, I think we need to allow nested relations after all. I talked to Burcin on IRC and he agrees. So we would plan to have all of these return an output which is the same as the input. If you wanted to force it to resolve, you could run bool() on them, and you would always get false, except when comparing `x < y` and `y > x`, `x <= y` and `y >= x`, `x == y` and `y == x`, and `x != y` and `y != x`, for symbolic expressions `x` and `y` (on kcrisman's insistence :) ). I'll need to implement this and figure out how it influences existing doctests (probably severely), so I'm leaving this as \"needs_work\" for now...",
    "created_at": "2011-06-18T00:52:37Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113459",
    "user": "https://github.com/kini"
}
```

<div id="comment:28" align="right">comment:28</div>

Hm. In order to eventually solve #2778 and other such things, I think we need to allow nested relations after all. I talked to Burcin on IRC and he agrees. So we would plan to have all of these return an output which is the same as the input. If you wanted to force it to resolve, you could run bool() on them, and you would always get false, except when comparing `x < y` and `y > x`, `x <= y` and `y >= x`, `x == y` and `y == x`, and `x != y` and `y != x`, for symbolic expressions `x` and `y` (on kcrisman's insistence :) ). I'll need to implement this and figure out how it influences existing doctests (probably severely), so I'm leaving this as "needs_work" for now...



---

archive/issue_comments_113460.json:
```json
{
    "body": "<div id=\"comment:29\" align=\"right\">comment:29</div>\n\nSorry, I meant #2744, not #2778.",
    "created_at": "2011-06-18T00:53:07Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113460",
    "user": "https://github.com/kini"
}
```

<div id="comment:29" align="right">comment:29</div>

Sorry, I meant #2744, not #2778.



---

archive/issue_comments_113461.json:
```json
{
    "body": "<div id=\"comment:30\" align=\"right\">comment:30</div>\n\nReplying to [@sagetrac-tnv](#comment%3A26):\n\n> From your msg,  would it be reasonable to add a SMT theorem prover package to Sage ?   So that it can show equivalence of expressions  (at least under some specific theories).     \n\nSage is really large as it is. While I'd be really interested to have this capability in Sage, I don't know how many others would want it in the standard distribution. The first step is to start with an optional package/prototype. We can see where it goes from there. :)\n\nWhich prover are you thinking of? What would this let us do in Sage? Perhaps you should write a message to sage-devel about this.",
    "created_at": "2011-06-18T01:10:50Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113461",
    "user": "https://github.com/burcin"
}
```

<div id="comment:30" align="right">comment:30</div>

Replying to [@sagetrac-tnv](#comment%3A26):

> From your msg,  would it be reasonable to add a SMT theorem prover package to Sage ?   So that it can show equivalence of expressions  (at least under some specific theories).     

Sage is really large as it is. While I'd be really interested to have this capability in Sage, I don't know how many others would want it in the standard distribution. The first step is to start with an optional package/prototype. We can see where it goes from there. :)

Which prover are you thinking of? What would this let us do in Sage? Perhaps you should write a message to sage-devel about this.



---

archive/issue_comments_113462.json:
```json
{
    "body": "<div id=\"comment:31\" align=\"right\">comment:31</div>\n\n> Which prover are you thinking of? What would this let us do in Sage? Perhaps you should write a message to sage-devel about this.\n\nI am thinking about the optional package too.  Someone told me qepcad (not exactly SMT but can be used for many similar purpose) already in Sage as an optional package.  \n\nThe good thing about these SMT solvers is that most of them support a standard language (smtlib) and therefore you can use any of the SMT's out there with a single interface.  SMT can be used to show if something (a set of expressions or constraints) is valid  or  satisfiable under different types of theories (not just boolean), or simplify a set of expression, etc.  I rely on these for implications on my project-- to see if 2 sets of expressions are equi-satisfiable .  \n\nSo all the above examples of whether if exp1 == exp2  should be easily answered with SMT.",
    "created_at": "2011-06-18T01:33:20Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113462",
    "user": "https://github.com/sagetrac-tnv"
}
```

<div id="comment:31" align="right">comment:31</div>

> Which prover are you thinking of? What would this let us do in Sage? Perhaps you should write a message to sage-devel about this.

I am thinking about the optional package too.  Someone told me qepcad (not exactly SMT but can be used for many similar purpose) already in Sage as an optional package.  

The good thing about these SMT solvers is that most of them support a standard language (smtlib) and therefore you can use any of the SMT's out there with a single interface.  SMT can be used to show if something (a set of expressions or constraints) is valid  or  satisfiable under different types of theories (not just boolean), or simplify a set of expression, etc.  I rely on these for implications on my project-- to see if 2 sets of expressions are equi-satisfiable .  

So all the above examples of whether if exp1 == exp2  should be easily answered with SMT.



---

archive/issue_comments_113463.json:
```json
{
    "body": "<div id=\"comment:32\" align=\"right\">comment:32</div>\n\nReplying to [@sagetrac-tnv](#comment%3A31):\n\n> So all the above examples of whether if exp1 == exp2  should be easily answered with SMT.\n\nI'd really like to see Sage have it's own framework to handle assumptions (see `assume?` -- this relies completely on maxima right now), so I'm really interested in this. I'd be glad to help with the first steps of making a package, writing an interface, etc. We should have this conversation in sage-devel instead of this ticket though. ;)",
    "created_at": "2011-06-18T02:05:08Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113463",
    "user": "https://github.com/burcin"
}
```

<div id="comment:32" align="right">comment:32</div>

Replying to [@sagetrac-tnv](#comment%3A31):

> So all the above examples of whether if exp1 == exp2  should be easily answered with SMT.

I'd really like to see Sage have it's own framework to handle assumptions (see `assume?` -- this relies completely on maxima right now), so I'm really interested in this. I'd be glad to help with the first steps of making a package, writing an interface, etc. We should have this conversation in sage-devel instead of this ticket though. ;)



---

archive/issue_comments_113464.json:
```json
{
    "body": "<div id=\"comment:33\" align=\"right\">comment:33</div>\n\nThis still applies, and fixes another issue.\n\n```\n\nsage: c = (x-2<=0)\nsage: assume(c)\nsage: a = (x-1<=0)\nsage:  if a in sage.symbolic.assumptions._assumptions:\n....:     print 'yes'\n....:     \nsage: assumptions()\n[x - 2 <= 0]\nsage: assume(a)\nsage: assumptions()\n[x - 2 <= 0, x - 1 <= 0]\n```\nBefore, the second assumption didn't obtain, because currently\n\n```\n\nsage: c = (x-2<=0)\nsage: L = [c]\nsage: L\n[x - 2 <= 0]\nsage: a = (x-1<=0)\nsage: a in L\nTrue\n```\nwhich is not good.  See [this sage-support thread](https://groups.google.com/forum/#!topic/sage-support/H-QcXkNCajM).",
    "created_at": "2012-05-11T13:24:18Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113464",
    "user": "https://github.com/kcrisman"
}
```

<div id="comment:33" align="right">comment:33</div>

This still applies, and fixes another issue.

```

sage: c = (x-2<=0)
sage: assume(c)
sage: a = (x-1<=0)
sage:  if a in sage.symbolic.assumptions._assumptions:
....:     print 'yes'
....:     
sage: assumptions()
[x - 2 <= 0]
sage: assume(a)
sage: assumptions()
[x - 2 <= 0, x - 1 <= 0]
```
Before, the second assumption didn't obtain, because currently

```

sage: c = (x-2<=0)
sage: L = [c]
sage: L
[x - 2 <= 0]
sage: a = (x-1<=0)
sage: a in L
True
```
which is not good.  See [this sage-support thread](https://groups.google.com/forum/#!topic/sage-support/H-QcXkNCajM).



---

archive/issue_comments_113465.json:
```json
{
    "body": "<div id=\"comment:34\" align=\"right\">comment:34</div>\n\nSince #2744 is on sage-wishlist, would it suffice to do some sort of \"switch lhs and rhs\" check as a last branch in the code to fix tnv's point in [comment:21](#comment%3A21) (formatted in [comment:24](#comment%3A24))?  It would be nice to finally resolve this at the upcoming Bug Days.",
    "created_at": "2012-05-11T13:27:17Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113465",
    "user": "https://github.com/kcrisman"
}
```

<div id="comment:34" align="right">comment:34</div>

Since #2744 is on sage-wishlist, would it suffice to do some sort of "switch lhs and rhs" check as a last branch in the code to fix tnv's point in [comment:21](#comment%3A21) (formatted in [comment:24](#comment%3A24))?  It would be nice to finally resolve this at the upcoming Bug Days.



---

archive/issue_comments_113466.json:
```json
{
    "body": "<div id=\"comment:35\" align=\"right\">comment:35</div>\n\nIn the patch, why is this evaluated to `True`?\n\n```diff\n+            sage: (x < y) != (y > x)\n+            True\n```\n\nEDIT: Oops. I should have read the earlier comments. Sorry.",
    "created_at": "2012-05-11T15:43:27Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113466",
    "user": "https://github.com/ppurka"
}
```

<div id="comment:35" align="right">comment:35</div>

In the patch, why is this evaluated to `True`?

```diff
+            sage: (x < y) != (y > x)
+            True
```

EDIT: Oops. I should have read the earlier comments. Sorry.



---

archive/issue_comments_113467.json:
```json
{
    "body": "<div id=\"comment:36\" align=\"right\">comment:36</div>\n\nkcrisman: OK, I'll try to implement those minimal checks for now, and we can do nesting expressions later.",
    "created_at": "2012-05-12T22:55:26Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113467",
    "user": "https://github.com/kini"
}
```

<div id="comment:36" align="right">comment:36</div>

kcrisman: OK, I'll try to implement those minimal checks for now, and we can do nesting expressions later.



---

archive/issue_comments_113468.json:
```json
{
    "body": "<div id=\"comment:37\" align=\"right\">comment:37</div>\n\nAdded a new patch. Burcin, can you look over it to make sure I'm doing this the right way? In particular are those operator comparisons optimizable somehow?",
    "created_at": "2012-05-13T01:20:04Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113468",
    "user": "https://github.com/kini"
}
```

<div id="comment:37" align="right">comment:37</div>

Added a new patch. Burcin, can you look over it to make sure I'm doing this the right way? In particular are those operator comparisons optimizable somehow?



---

archive/issue_comments_113469.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -30,3 +30,7 @@\n \n It seems to me that Sage treats `>`, `>=`, and `==` the same (see #7660). If this is true then it's a serious problem and needs to be addressed.\n \n+Apply:\n+\n+1. [attachment: trac_11309-fix-comparison-of-comparisons.patch](https://github.com/sagemath/sage/files/ticket11309/trac_11309-fix-comparison-of-comparisons.patch.gz)\n+2. [attachment: trac_11309-equate-flipped-comparisons.patch](https://github.com/sagemath/sage/files/ticket11309/trac_11309-equate-flipped-comparisons.patch.gz)\n``````\n",
    "created_at": "2012-05-13T01:20:04Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113469",
    "user": "https://github.com/kini"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -30,3 +30,7 @@
 
 It seems to me that Sage treats `>`, `>=`, and `==` the same (see #7660). If this is true then it's a serious problem and needs to be addressed.
 
+Apply:
+
+1. [attachment: trac_11309-fix-comparison-of-comparisons.patch](https://github.com/sagemath/sage/files/ticket11309/trac_11309-fix-comparison-of-comparisons.patch.gz)
+2. [attachment: trac_11309-equate-flipped-comparisons.patch](https://github.com/sagemath/sage/files/ticket11309/trac_11309-equate-flipped-comparisons.patch.gz)
``````




---

archive/issue_events_148544.json:
```json
{
    "actor": "https://github.com/kini",
    "created_at": "2012-05-13T01:20:04Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "label": "https://github.com/sagemath/sage/labels/needs%20work",
    "label_color": "ffff00",
    "label_name": "needs work",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/11309#event-148544"
}
```



---

archive/issue_events_148545.json:
```json
{
    "actor": "https://github.com/kini",
    "created_at": "2012-05-13T01:20:04Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "7fff00",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/11309#event-148545"
}
```



---

archive/issue_comments_113470.json:
```json
{
    "body": "<div id=\"comment:38\" align=\"right\">comment:38</div>\n\nUpdate: added three more lines to the doctests",
    "created_at": "2012-05-13T01:24:55Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113470",
    "user": "https://github.com/kini"
}
```

<div id="comment:38" align="right">comment:38</div>

Update: added three more lines to the doctests



---

archive/issue_comments_113471.json:
```json
{
    "body": "<div id=\"comment:39\" align=\"right\">comment:39</div>\n\nHey patchbot:\n\nApply trac_11309-fix-comparison-of-comparisons.patch trac_11309-equate-flipped-comparisons.patch",
    "created_at": "2012-05-14T05:52:15Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113471",
    "user": "https://github.com/kini"
}
```

<div id="comment:39" align="right">comment:39</div>

Hey patchbot:

Apply trac_11309-fix-comparison-of-comparisons.patch trac_11309-equate-flipped-comparisons.patch



---

archive/issue_comments_113472.json:
```json
{
    "body": "<div id=\"comment:40\" align=\"right\">comment:40</div>\n\nThe code itself seems fine right now, thanks for such fast action and especially for actual comments in the code!  \n\nDid you do any timing runs on previously-working comparisons?  I agree that it would be good for someone who knows to comment on whether there is some obvious optimization missing.  For instance, lines 1241ff. would be nicer if it so happened there was a \"operator.opposite()\" function which reversed `<=` and `>=` (though someone else might want them to be complements, `<=` and `>`).    Similarly for the rhs/lhs comparisons.\n\nKeshav, do you mind putting in a test in your patch for \n\n```\nsage: (x-1<0) in [x-2<0]\nFalse\n```\njust to test for the [comment:33](#comment%3A33) issue?  While we wait for someone more knowledgeable... but as I said it does seem good to go.",
    "created_at": "2012-05-14T18:15:04Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113472",
    "user": "https://github.com/kcrisman"
}
```

<div id="comment:40" align="right">comment:40</div>

The code itself seems fine right now, thanks for such fast action and especially for actual comments in the code!  

Did you do any timing runs on previously-working comparisons?  I agree that it would be good for someone who knows to comment on whether there is some obvious optimization missing.  For instance, lines 1241ff. would be nicer if it so happened there was a "operator.opposite()" function which reversed `<=` and `>=` (though someone else might want them to be complements, `<=` and `>`).    Similarly for the rhs/lhs comparisons.

Keshav, do you mind putting in a test in your patch for 

```
sage: (x-1<0) in [x-2<0]
False
```
just to test for the [comment:33](#comment%3A33) issue?  While we wait for someone more knowledgeable... but as I said it does seem good to go.



---

archive/issue_comments_113473.json:
```json
{
    "body": "Attachment: **[trac_11309-equate-flipped-comparisons.patch.gz](https://github.com/sagemath/sage/files/ticket11309/trac_11309-equate-flipped-comparisons.patch.gz)**\n\napply to $SAGE_ROOT/devel/sage",
    "created_at": "2012-05-14T18:51:16Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113473",
    "user": "https://github.com/kini"
}
```

Attachment: **[trac_11309-equate-flipped-comparisons.patch.gz](https://github.com/sagemath/sage/files/ticket11309/trac_11309-equate-flipped-comparisons.patch.gz)**

apply to $SAGE_ROOT/devel/sage



---

archive/issue_comments_113474.json:
```json
{
    "body": "<div id=\"comment:41\" align=\"right\">comment:41</div>\n\nDone! Glad you like the comments :)\n\nI did not do any timing, no. I'm not sure what you mean by \"lines 1241ff\", but function calls should typically be avoided if you're optimizing for speed, afaik. The main thing I was wondering was, the argument `op` to the function `_richcmp_c_impl()` is an integer, but `operator.*` as seen in lines 1245-1252 seem to be strings, if I'm not mistaken. So I'm just wondering if that many string operations for a single comparison of symbolic expression couldn't be better optimized by somehow getting the operator of the lhs and rhs of the big relation as integers rather than strings. Well, not to mention that I'm calling `.operator()` a bunch of times, but I don't know if it would actually be any faster to compute it once and store it in a variable.\n\nThey say you shouldn't try to second-guess compilers... I guess the best way to find out is to try a few different ways and see how `timeit` behaves. I'll do that later, I guess...",
    "created_at": "2012-05-14T19:01:04Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113474",
    "user": "https://github.com/kini"
}
```

<div id="comment:41" align="right">comment:41</div>

Done! Glad you like the comments :)

I did not do any timing, no. I'm not sure what you mean by "lines 1241ff", but function calls should typically be avoided if you're optimizing for speed, afaik. The main thing I was wondering was, the argument `op` to the function `_richcmp_c_impl()` is an integer, but `operator.*` as seen in lines 1245-1252 seem to be strings, if I'm not mistaken. So I'm just wondering if that many string operations for a single comparison of symbolic expression couldn't be better optimized by somehow getting the operator of the lhs and rhs of the big relation as integers rather than strings. Well, not to mention that I'm calling `.operator()` a bunch of times, but I don't know if it would actually be any faster to compute it once and store it in a variable.

They say you shouldn't try to second-guess compilers... I guess the best way to find out is to try a few different ways and see how `timeit` behaves. I'll do that later, I guess...



---

archive/issue_comments_113475.json:
```json
{
    "body": "<div id=\"comment:42\" align=\"right\">comment:42</div>\n\nHey patchbot:\n\nApply trac_11309-fix-comparison-of-comparisons.patch trac_11309-equate-flipped-comparisons.patch",
    "created_at": "2012-05-14T19:02:11Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113475",
    "user": "https://github.com/kini"
}
```

<div id="comment:42" align="right">comment:42</div>

Hey patchbot:

Apply trac_11309-fix-comparison-of-comparisons.patch trac_11309-equate-flipped-comparisons.patch



---

archive/issue_comments_113476.json:
```json
{
    "body": "<div id=\"comment:43\" align=\"right\">comment:43</div>\n\nI guess there isn't any reason to put this off, unless the timing issue really is a biggie.  Did you want to run a few of them first?",
    "created_at": "2012-05-25T14:50:32Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113476",
    "user": "https://github.com/kcrisman"
}
```

<div id="comment:43" align="right">comment:43</div>

I guess there isn't any reason to put this off, unless the timing issue really is a biggie.  Did you want to run a few of them first?



---

archive/issue_comments_113477.json:
```json
{
    "body": "Changed keywords from **inequality equality relational sd31 __richcmp__** to **inequality equality relational sd31 __richcmp__ sd40.5**",
    "created_at": "2012-05-25T14:50:32Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113477",
    "user": "https://github.com/kcrisman"
}
```

Changed keywords from **inequality equality relational sd31 __richcmp__** to **inequality equality relational sd31 __richcmp__ sd40.5**



---

archive/issue_comments_113478.json:
```json
{
    "body": "<div id=\"comment:44\" align=\"right\">comment:44</div>\n\nHmm, this is a big slowdown in at least one case.\n\n```\n# old\nsage: timeit(\"(x < y) != (y > x)\")\n625 loops, best of 3: 2.76 \u00b5s per loop\n# new\nsage: timeit(\"(x < y) != (y > x)\")\n625 loops, best of 3: 13.3 \u00b5s per loop\n```\nIt looks like it's fairly constantly adding this.  Here, in the much slower checking of a list\n\n```\n# old\nsage: timeit(\"(x - 1 < 0) in [x - 2 < 0]\")\n625 loops, best of 3: 104 \u00b5s per loop\n# new\nsage: timeit(\"(x - 1 < 0) in [x - 2 < 0]\")\n625 loops, best of 3: 116 \u00b5s per loop\n```\nHere's another one.\n\n```\n# old\nsage: timeit(\"(y > y) != (y > y) \")\n625 loops, best of 3: 2.24 \u00b5s per loop\n# new\nsage: timeit(\"(y > y) != (y > y) \")\n625 loops, best of 3: 8.45 \u00b5s per loop\n```",
    "created_at": "2012-05-25T15:34:13Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113478",
    "user": "https://github.com/kcrisman"
}
```

<div id="comment:44" align="right">comment:44</div>

Hmm, this is a big slowdown in at least one case.

```
# old
sage: timeit("(x < y) != (y > x)")
625 loops, best of 3: 2.76 µs per loop
# new
sage: timeit("(x < y) != (y > x)")
625 loops, best of 3: 13.3 µs per loop
```
It looks like it's fairly constantly adding this.  Here, in the much slower checking of a list

```
# old
sage: timeit("(x - 1 < 0) in [x - 2 < 0]")
625 loops, best of 3: 104 µs per loop
# new
sage: timeit("(x - 1 < 0) in [x - 2 < 0]")
625 loops, best of 3: 116 µs per loop
```
Here's another one.

```
# old
sage: timeit("(y > y) != (y > y) ")
625 loops, best of 3: 2.24 µs per loop
# new
sage: timeit("(y > y) != (y > y) ")
625 loops, best of 3: 8.45 µs per loop
```



---

archive/issue_comments_113479.json:
```json
{
    "body": "<div id=\"comment:45\" align=\"right\">comment:45</div>\n\nI'm kind of OK with this slowdown. It's in the low microseconds range, and it's also understandable considering the new code actually checks some stuff, whereas the old code doesn't really.\n\nI guess I will ping Burcin about this via email.",
    "created_at": "2012-05-26T07:17:29Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113479",
    "user": "https://github.com/kini"
}
```

<div id="comment:45" align="right">comment:45</div>

I'm kind of OK with this slowdown. It's in the low microseconds range, and it's also understandable considering the new code actually checks some stuff, whereas the old code doesn't really.

I guess I will ping Burcin about this via email.



---

archive/issue_comments_113480.json:
```json
{
    "body": "<div id=\"comment:46\" align=\"right\">comment:46</div>\n\nBurcin says he's too busy to look carefully but that the code probably can't be optimized much further.",
    "created_at": "2012-05-28T22:18:33Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113480",
    "user": "https://github.com/kini"
}
```

<div id="comment:46" align="right">comment:46</div>

Burcin says he's too busy to look carefully but that the code probably can't be optimized much further.



---

archive/issue_events_148546.json:
```json
{
    "actor": "https://github.com/kini",
    "created_at": "2012-05-28T22:21:20Z",
    "event": "renamed",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "title_is": "Sage sees - x + y > 0, - y + x >= 0,  and  x - y > 0 as equivalent",
    "title_was": "Sage sees -x +y > 0, -y + x >= 0,  and  x -y > 0 as equivalent",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/11309#event-148546"
}
```



---

archive/issue_events_148547.json:
```json
{
    "actor": "https://github.com/kcrisman",
    "created_at": "2012-05-28T22:34:14Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "7fff00",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/11309#event-148547"
}
```



---

archive/issue_events_148548.json:
```json
{
    "actor": "https://github.com/kcrisman",
    "created_at": "2012-05-28T22:34:14Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "label": "https://github.com/sagemath/sage/labels/positive%20review",
    "label_color": "dfffc0",
    "label_name": "positive review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/11309#event-148548"
}
```



---

archive/issue_comments_113481.json:
```json
{
    "body": "<div id=\"comment:48\" align=\"right\">comment:48</div>\n\n> Burcin says he's too busy to look carefully but that the code probably can't be optimized much further.\n\nGood enough for me.",
    "created_at": "2012-05-28T22:34:14Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113481",
    "user": "https://github.com/kcrisman"
}
```

<div id="comment:48" align="right">comment:48</div>

> Burcin says he's too busy to look carefully but that the code probably can't be optimized much further.

Good enough for me.



---

archive/issue_comments_113482.json:
```json
{
    "body": "<div id=\"comment:49\" align=\"right\">comment:49</div>\n\nThanks!",
    "created_at": "2012-05-28T22:57:03Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113482",
    "user": "https://github.com/kini"
}
```

<div id="comment:49" align="right">comment:49</div>

Thanks!



---

archive/issue_comments_113483.json:
```json
{
    "body": "<div id=\"comment:50\" align=\"right\">comment:50</div>\n\nI am interested in trying this patch but not sure how to apply it correctly.  This is what I did on Sage 5.0  (Mac OS Snow Leopard) \n\n```\n$ pwd\n/Users/tnguyen/Src/Devel/SAGE/sage-5.0/devel/sage\n$ sage -hg qimport https://github.com/sagemath/sage/files/ticket11309/trac_11309-equate-flipped-comparisons.patch.gz\nadding trac_11309-equate-flipped-comparisons.patch to series file\nGodel Wed May 30:23:05:42 (4714) ~/Src/Devel/SAGE/sage-5.0/devel/sage \n$ sage -hg qpushapplying trac_11309-equate-flipped-comparisons.patch\npatching file sage/symbolic/expression.pyx\nHunk #1 FAILED at 1179\nHunk #2 FAILED at 1186\nHunk #3 FAILED at 1204\n3 out of 3 hunks FAILED -- saving rejects to file sage/symbolic/expression.pyx.rej\npatch failed, unable to continue (try -v)\npatch failed, rejects left in working dir\nerrors during apply, please fix and refresh trac_11309-equate-flipped-comparisons.patch\nGodel Wed May 30:23:05:51 (4715) ~/Src/Devel/SAGE/sage-5.0/devel/sage \n```",
    "created_at": "2012-05-31T06:10:02Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113483",
    "user": "https://github.com/sagetrac-tnv"
}
```

<div id="comment:50" align="right">comment:50</div>

I am interested in trying this patch but not sure how to apply it correctly.  This is what I did on Sage 5.0  (Mac OS Snow Leopard) 

```
$ pwd
/Users/tnguyen/Src/Devel/SAGE/sage-5.0/devel/sage
$ sage -hg qimport https://github.com/sagemath/sage/files/ticket11309/trac_11309-equate-flipped-comparisons.patch.gz
adding trac_11309-equate-flipped-comparisons.patch to series file
Godel Wed May 30:23:05:42 (4714) ~/Src/Devel/SAGE/sage-5.0/devel/sage 
$ sage -hg qpushapplying trac_11309-equate-flipped-comparisons.patch
patching file sage/symbolic/expression.pyx
Hunk #1 FAILED at 1179
Hunk #2 FAILED at 1186
Hunk #3 FAILED at 1204
3 out of 3 hunks FAILED -- saving rejects to file sage/symbolic/expression.pyx.rej
patch failed, unable to continue (try -v)
patch failed, rejects left in working dir
errors during apply, please fix and refresh trac_11309-equate-flipped-comparisons.patch
Godel Wed May 30:23:05:51 (4715) ~/Src/Devel/SAGE/sage-5.0/devel/sage 
```



---

archive/issue_comments_113484.json:
```json
{
    "body": "<div id=\"comment:51\" align=\"right\">comment:51</div>\n\nReplying to [@sagetrac-tnv](#comment%3A50):\n> I am interested in trying this patch but not sure how to apply it correctly.\n\nYou need to apply both the patches *in the order mentioned in the description of this ticket*. Try these commands (assuming you are in devel/sage)\n\n```\n../../sage -hg qimport -P https://github.com/sagemath/sage/files/ticket11309/trac_11309-fix-comparison-of-comparisons.patch.gz\n../../sage -hg qimport -P https://github.com/sagemath/sage/files/ticket11309/trac_11309-equate-flipped-comparisons.patch.gz\n../../sage -br\n```",
    "created_at": "2012-05-31T06:34:49Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113484",
    "user": "https://github.com/ppurka"
}
```

<div id="comment:51" align="right">comment:51</div>

Replying to [@sagetrac-tnv](#comment%3A50):
> I am interested in trying this patch but not sure how to apply it correctly.

You need to apply both the patches *in the order mentioned in the description of this ticket*. Try these commands (assuming you are in devel/sage)

```
../../sage -hg qimport -P https://github.com/sagemath/sage/files/ticket11309/trac_11309-fix-comparison-of-comparisons.patch.gz
../../sage -hg qimport -P https://github.com/sagemath/sage/files/ticket11309/trac_11309-equate-flipped-comparisons.patch.gz
../../sage -br
```



---

archive/issue_comments_113485.json:
```json
{
    "body": "<div id=\"comment:52\" align=\"right\">comment:52</div>\n\nPatchbot: Apply trac_11309-fix-comparison-of-comparisons.patch trac_11309-equate-flipped-comparisons.patch",
    "created_at": "2012-05-31T07:30:31Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113485",
    "user": "https://github.com/kini"
}
```

<div id="comment:52" align="right">comment:52</div>

Patchbot: Apply trac_11309-fix-comparison-of-comparisons.patch trac_11309-equate-flipped-comparisons.patch



---

archive/issue_comments_113486.json:
```json
{
    "body": "<div id=\"comment:53\" align=\"right\">comment:53</div>\n\nHi, may be I've missed something but these patches still break things as listed in my [comment:24](#comment%3A24).  \n\n\n```\n(prepatched)\n\nsage: (- x + y == 0) == (0 == -x + y) \nTrue \nsage: (-x + y == 0) == (0 == -x + y) \nTrue \nsage: (x < y) == (y > x) \nTrue\n\n(postpatched)\n\nsage: (- x + y == 0) == (0 == -x + y) \nFalse \nsage: (-x + y == 0) == (0 == -x + y) \nFalse \nsage: (x < y) == (y > x) \nFalse\n```\n\nThe main reason why I report this in the first place is because of this error in which multiplying by -1 does not switch the sign.  I think they are related but not sure.  \n\n```\nsage: -1 * (x<5)\n-x < -5\n```",
    "created_at": "2012-05-31T20:45:55Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113486",
    "user": "https://github.com/sagetrac-tnv"
}
```

<div id="comment:53" align="right">comment:53</div>

Hi, may be I've missed something but these patches still break things as listed in my [comment:24](#comment%3A24).  


```
(prepatched)

sage: (- x + y == 0) == (0 == -x + y) 
True 
sage: (-x + y == 0) == (0 == -x + y) 
True 
sage: (x < y) == (y > x) 
True

(postpatched)

sage: (- x + y == 0) == (0 == -x + y) 
False 
sage: (-x + y == 0) == (0 == -x + y) 
False 
sage: (x < y) == (y > x) 
False
```

The main reason why I report this in the first place is because of this error in which multiplying by -1 does not switch the sign.  I think they are related but not sure.  

```
sage: -1 * (x<5)
-x < -5
```



---

archive/issue_comments_113487.json:
```json
{
    "body": "<div id=\"comment:54\" align=\"right\">comment:54</div>\n\nDid you forget to rebuild Sage after applying the patches?\n\n```\n[1] fs-boone@zhenghe /opt/sage/devel/sage $ hg qapplied\ntrac_13057-no-intersphinx.patch\ntrac_11309-fix-comparison-of-comparisons.patch\ntrac_11309-equate-flipped-comparisons.patch\n[1] fs-boone@zhenghe /opt/sage/devel/sage $ sage -b &> /dev/null\n[1] fs-boone@zhenghe /opt/sage/devel/sage $ sage -q\nsage: var('y')\ny\nsage: (- x + y == 0) == (0 == -x + y) \nTrue\nsage: (-x + y == 0) == (0 == -x + y) \nTrue\nsage: (x < y) == (y > x) \nTrue\nsage: -(x < 5)\n-x < -5\nsage: \n```\n\nPersonally I don't see why `x * (y < z)` should even be simplified to anything other than `x * (y < z)`. `y < z` is a mathematical object which does not live in a space which has a multiplication operation - it lives in the space of logical predicates. But that is something to address in a different ticket. Testing the title of this ticket:\n\n```\nsage: Set([-x + y > 0, -y + x >= 0, x - y > 0])    \n{-x + y > 0, x - y >= 0, x - y > 0}\nsage: len(_)   \n3\n```\n\nSo the patches do at least address and solve the issue in the ticket's name.",
    "created_at": "2012-05-31T21:03:17Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113487",
    "user": "https://github.com/kini"
}
```

<div id="comment:54" align="right">comment:54</div>

Did you forget to rebuild Sage after applying the patches?

```
[1] fs-boone@zhenghe /opt/sage/devel/sage $ hg qapplied
trac_13057-no-intersphinx.patch
trac_11309-fix-comparison-of-comparisons.patch
trac_11309-equate-flipped-comparisons.patch
[1] fs-boone@zhenghe /opt/sage/devel/sage $ sage -b &> /dev/null
[1] fs-boone@zhenghe /opt/sage/devel/sage $ sage -q
sage: var('y')
y
sage: (- x + y == 0) == (0 == -x + y) 
True
sage: (-x + y == 0) == (0 == -x + y) 
True
sage: (x < y) == (y > x) 
True
sage: -(x < 5)
-x < -5
sage: 
```

Personally I don't see why `x * (y < z)` should even be simplified to anything other than `x * (y < z)`. `y < z` is a mathematical object which does not live in a space which has a multiplication operation - it lives in the space of logical predicates. But that is something to address in a different ticket. Testing the title of this ticket:

```
sage: Set([-x + y > 0, -y + x >= 0, x - y > 0])    
{-x + y > 0, x - y >= 0, x - y > 0}
sage: len(_)   
3
```

So the patches do at least address and solve the issue in the ticket's name.



---

archive/issue_comments_113488.json:
```json
{
    "body": "<div id=\"comment:55\" align=\"right\">comment:55</div>\n\nReplying to [@sagetrac-tnv](#comment%3A53):\n>\n> The main reason why I report this in the first place is because of this error in which multiplying by -1 does not switch the sign.  I think they are related but not sure.  \n> \n>\n> ```\n> sage: -1 * (x<5)\n> -x < -5\n> ```\n\nThis is #7660. It would be quite easy to remove the `if is_a_relational(left._gobj)` checks in `_add_, `_mul_`, etc. in `sage/symbolic/expression.pyx` to revert back to GiNaC behavior.",
    "created_at": "2012-06-01T10:01:03Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113488",
    "user": "https://github.com/burcin"
}
```

<div id="comment:55" align="right">comment:55</div>

Replying to [@sagetrac-tnv](#comment%3A53):
>
> The main reason why I report this in the first place is because of this error in which multiplying by -1 does not switch the sign.  I think they are related but not sure.  
> 
>
> ```
> sage: -1 * (x<5)
> -x < -5
> ```

This is #7660. It would be quite easy to remove the `if is_a_relational(left._gobj)` checks in `_add_, `_mul_`, etc. in `sage/symbolic/expression.pyx` to revert back to GiNaC behavior.



---

archive/issue_comments_113489.json:
```json
{
    "body": "<div id=\"comment:56\" align=\"right\">comment:56</div>\n\nIt seems to work fine now -- not sure what I did previously.  So if you don't use hash for comparison , what do you use ?   Thanks all of those who spend time to create these patches.",
    "created_at": "2012-06-01T20:05:45Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113489",
    "user": "https://github.com/sagetrac-tnv"
}
```

<div id="comment:56" align="right">comment:56</div>

It seems to work fine now -- not sure what I did previously.  So if you don't use hash for comparison , what do you use ?   Thanks all of those who spend time to create these patches.



---

archive/issue_comments_113490.json:
```json
{
    "body": "<div id=\"comment:57\" align=\"right\">comment:57</div>\n\nGiven two relational expressions `a ? b` and `c ! d`, first I check whether `?` and `!` are the same relation. If so, I have a couple of cases. One, if `?` and `!` are both `==` or are both `!=`, then I check whether `a == c` and `b == d`, or `a == d` and `b == c`. Two, if `?` and `!` are some other relation than `==` or `!=`, then I only allow the case `a == c` and `b == d`.\n\nIf `?` and `!` are different from each other, I check whether they are reversals of each other (like one is `<` and the other is `>`, etc.). If that is the case, then I allow `a == d` and `b == c`.\n\nIn all other cases, the two relational expressions are considered unequal.\n\n... that explanation looks kind of confusing. Maybe it's better if you just look at the patch... it's probably easier to understand :)",
    "created_at": "2012-06-01T20:56:13Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113490",
    "user": "https://github.com/kini"
}
```

<div id="comment:57" align="right">comment:57</div>

Given two relational expressions `a ? b` and `c ! d`, first I check whether `?` and `!` are the same relation. If so, I have a couple of cases. One, if `?` and `!` are both `==` or are both `!=`, then I check whether `a == c` and `b == d`, or `a == d` and `b == c`. Two, if `?` and `!` are some other relation than `==` or `!=`, then I only allow the case `a == c` and `b == d`.

If `?` and `!` are different from each other, I check whether they are reversals of each other (like one is `<` and the other is `>`, etc.). If that is the case, then I allow `a == d` and `b == c`.

In all other cases, the two relational expressions are considered unequal.

... that explanation looks kind of confusing. Maybe it's better if you just look at the patch... it's probably easier to understand :)



---

archive/issue_comments_113491.json:
```json
{
    "body": "Merged: **sage-5.1.beta3**",
    "created_at": "2012-06-05T11:50:48Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11309#issuecomment-113491",
    "user": "https://github.com/jdemeyer"
}
```

Merged: **sage-5.1.beta3**



---

archive/issue_events_148549.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2012-06-05T11:50:48Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "label": "https://github.com/sagemath/sage/labels/positive%20review",
    "label_color": "dfffc0",
    "label_name": "positive review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/11309#event-148549"
}
```



---

archive/issue_events_148550.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2012-06-05T11:50:48Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/11309",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/11309#event-148550"
}
```
