# Issue 11590: Integrating the sgn() function can produce incorrect results

archive/issues_011418.json:
```json
{
    "assignees": [
        "https://github.com/burcin"
    ],
    "body": "Actual result:\n\n```\nsage: integrate(x * sgn(x^2 - 1/4), x, -1, 0)\n1/2\n```\n\nSince the argument to sgn() has only one root, -1/2, on (-1, 0), there are only two subintervals on which sgn() can have different values. In particular,\n\n```\nsage: sgn(x^2 - 1/4)(x = -0.75)\n1\n\nsage: sgn(x^2 - 1/4)(x = -0.25)\n-1\n```\n\nNow, the original, actual result should be equivalent to the sum of the following:\n\n```\nsage: integrate(x, x, -1, -0.5)\n-0.375\n\nsage: integrate(-x, x, -0.5, 0)\n0.125\n```\n\nSo, something went wrong during the initial integration.\n\nCC:  @nbruin @fchapoton\n\nBranch/Commit: **[`bf1b50b`](https://github.com/sagemath/sagetrac-mirror/commit/bf1b50b7d9264e5695ec8cb900de253e6706136b)**\n\nUpstream: **Fixed upstream, in a later stable release.**\n\nStopgaps: **#12731**\n\nReviewer: **Fr\u00e9d\u00e9ric Chapoton**\n\nAuthor: **Michael Orlitzky**\n\nComponent: **calculus**\n\n_Issue created by migration from https://trac.sagemath.org/ticket/11590_\n\n",
    "closed_at": "2020-12-27T00:23:33Z",
    "created_at": "2011-07-12T20:05:19Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/c%3A%20calculus",
        "https://github.com/sagemath/sage/labels/p%3A%20major%20/%203",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-9.3",
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "Integrating the sgn() function can produce incorrect results",
    "type": "issue",
    "updated_at": "2020-12-27T00:23:33Z",
    "url": "https://github.com/sagemath/sage/issues/11590",
    "user": "https://github.com/orlitzky"
}
```
Actual result:

```
sage: integrate(x * sgn(x^2 - 1/4), x, -1, 0)
1/2
```

Since the argument to sgn() has only one root, -1/2, on (-1, 0), there are only two subintervals on which sgn() can have different values. In particular,

```
sage: sgn(x^2 - 1/4)(x = -0.75)
1

sage: sgn(x^2 - 1/4)(x = -0.25)
-1
```

Now, the original, actual result should be equivalent to the sum of the following:

```
sage: integrate(x, x, -1, -0.5)
-0.375

sage: integrate(-x, x, -0.5, 0)
0.125
```

So, something went wrong during the initial integration.

CC:  @nbruin @fchapoton

Branch/Commit: **[`bf1b50b`](https://github.com/sagemath/sagetrac-mirror/commit/bf1b50b7d9264e5695ec8cb900de253e6706136b)**

Upstream: **Fixed upstream, in a later stable release.**

Stopgaps: **#12731**

Reviewer: **Frédéric Chapoton**

Author: **Michael Orlitzky**

Component: **calculus**

_Issue created by migration from https://trac.sagemath.org/ticket/11590_





---

archive/issue_events_153618.json:
```json
{
    "actor": "https://github.com/orlitzky",
    "created_at": "2011-07-12T20:05:19Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/11590",
    "label": "https://github.com/sagemath/sage/labels/c%3A%20calculus",
    "label_color": "0000ff",
    "label_name": "c: calculus",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/11590#event-153618"
}
```



---

archive/issue_events_153619.json:
```json
{
    "actor": "https://github.com/orlitzky",
    "created_at": "2011-07-12T20:05:19Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/11590",
    "label": "https://github.com/sagemath/sage/labels/p%3A%20major%20/%203",
    "label_color": "ffbb00",
    "label_name": "p: major / 3",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/11590#event-153619"
}
```



---

archive/issue_events_153620.json:
```json
{
    "actor": "https://github.com/burcin",
    "created_at": "2011-07-12T20:05:19Z",
    "event": "assigned",
    "issue": "https://github.com/sagemath/sage/issues/11590",
    "subject": "https://github.com/orlitzky",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/11590#event-153620"
}
```



---

archive/issue_events_153621.json:
```json
{
    "actor": "https://github.com/orlitzky",
    "created_at": "2011-07-13T00:27:01Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/11590",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "d73a4a",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/11590#event-153621"
}
```



---

archive/issue_comments_118910.json:
```json
{
    "body": "<div id=\"comment:2\" align=\"right\">comment:2</div>\n\nThis appears to be in Maxima, and is reported at [their bug tracker](https://sourceforge.net/tracker/?func=detail&aid=3382358&group_id=4933&atid=104933).\n\n```\n\n(%i11) integrate(x*signum(x^2-1/4),x,-1,0);\n                                       1\n(%o11)                                 -\n                                       2\n(%i15) integrate(x*signum(x^2-1/4),x);\n                                   ! 2   1!\n                                   !x  - -!\n                                   !     4!\n(%o15)                             --------\n                                      2\n```",
    "created_at": "2011-07-29T18:30:49Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11590",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11590#issuecomment-118910",
    "user": "https://github.com/kcrisman"
}
```

<div id="comment:2" align="right">comment:2</div>

This appears to be in Maxima, and is reported at [their bug tracker](https://sourceforge.net/tracker/?func=detail&aid=3382358&group_id=4933&atid=104933).

```

(%i11) integrate(x*signum(x^2-1/4),x,-1,0);
                                       1
(%o11)                                 -
                                       2
(%i15) integrate(x*signum(x^2-1/4),x);
                                   ! 2   1!
                                   !x  - -!
                                   !     4!
(%o15)                             --------
                                      2
```



---

archive/issue_comments_118911.json:
```json
{
    "body": "Upstream: **Reported upstream. Little or no feedback.**",
    "created_at": "2011-07-29T18:30:49Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11590",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11590#issuecomment-118911",
    "user": "https://github.com/kcrisman"
}
```

Upstream: **Reported upstream. Little or no feedback.**



---

archive/issue_comments_118912.json:
```json
{
    "body": "<div id=\"comment:3\" align=\"right\">comment:3</div>\n\nEven with #11483, this isn't working right.  It should, though - see Barton's post at the Maxima ticket:\n\n```\nBy the way:\n\n(%i4) load(abs_integrate)$\n\nCorrect antiderivative:\n\n(%i5) 'integrate(x*signum(x^2-1/4),x);\n(%o5) abs(x^2-1/4)/2\n\nCorrect definite integral\n\n(%i6) 'integrate(x*signum(x^2-1/4),x,-1,0);\n(%o6) -1/4\n```\nso I'm not sure why this is still returning the \"wrong\" thing.  Probably something about the integration code...",
    "created_at": "2012-01-28T02:50:59Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11590",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11590#issuecomment-118912",
    "user": "https://github.com/kcrisman"
}
```

<div id="comment:3" align="right">comment:3</div>

Even with #11483, this isn't working right.  It should, though - see Barton's post at the Maxima ticket:

```
By the way:

(%i4) load(abs_integrate)$

Correct antiderivative:

(%i5) 'integrate(x*signum(x^2-1/4),x);
(%o5) abs(x^2-1/4)/2

Correct definite integral

(%i6) 'integrate(x*signum(x^2-1/4),x,-1,0);
(%o6) -1/4
```
so I'm not sure why this is still returning the "wrong" thing.  Probably something about the integration code...



---

archive/issue_comments_118913.json:
```json
{
    "body": "Changed upstream from **Reported upstream. Little or no feedback.** to **Reported upstream. Developers acknowledge bug.**",
    "created_at": "2012-01-28T02:50:59Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11590",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11590#issuecomment-118913",
    "user": "https://github.com/kcrisman"
}
```

Changed upstream from **Reported upstream. Little or no feedback.** to **Reported upstream. Developers acknowledge bug.**



---

archive/issue_comments_118914.json:
```json
{
    "body": "<div id=\"comment:4\" align=\"right\">comment:4</div>\n\nI'm stumped on this one. We get the correct antiderivative:\n\n```\nsage: integrate(x*sgn(x^2-1/4),x)     \n1/2*abs(x^2 - 1/4)\n```\n\nAnd ECL gives us the right answer, so it's not an environment setting:\n\n```\nsage: from sage.interfaces.maxima_lib import ecl_eval\nsage: ecl_eval(\"#$'integrate(x*signum(x^2-1/4),x,-1,0);$\")                           \n<ECL: ((RAT SIMP) -1 4)>\n```\n\nBut going through `maxima_eval` is still trouble:\n\n```\nsage: integrate(x*sgn(x^2-1/4),x,-1,0)                                            \n1/2\nsage: from sage.interfaces.maxima_lib import maxima_eval\nsage: a = '($INTEGRATE ((MTIMES SIMP) $X ((%SIGNUM SIMP) ((MPLUS SIMP) ((RAT SIMP) (- 1) 4) ((MEXPT SIMP) $X 2))) ) $X -1 0)'\nsage: maxima_eval(a)\n<ECL: ((RAT SIMP) 1 2)>\n```",
    "created_at": "2012-01-30T20:37:37Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11590",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11590#issuecomment-118914",
    "user": "https://github.com/orlitzky"
}
```

<div id="comment:4" align="right">comment:4</div>

I'm stumped on this one. We get the correct antiderivative:

```
sage: integrate(x*sgn(x^2-1/4),x)     
1/2*abs(x^2 - 1/4)
```

And ECL gives us the right answer, so it's not an environment setting:

```
sage: from sage.interfaces.maxima_lib import ecl_eval
sage: ecl_eval("#$'integrate(x*signum(x^2-1/4),x,-1,0);$")                           
<ECL: ((RAT SIMP) -1 4)>
```

But going through `maxima_eval` is still trouble:

```
sage: integrate(x*sgn(x^2-1/4),x,-1,0)                                            
1/2
sage: from sage.interfaces.maxima_lib import maxima_eval
sage: a = '($INTEGRATE ((MTIMES SIMP) $X ((%SIGNUM SIMP) ((MPLUS SIMP) ((RAT SIMP) (- 1) 4) ((MEXPT SIMP) $X 2))) ) $X -1 0)'
sage: maxima_eval(a)
<ECL: ((RAT SIMP) 1 2)>
```



---

archive/issue_comments_118915.json:
```json
{
    "body": "<div id=\"comment:5\" align=\"right\">comment:5</div>\n\nWell, I'm glad it wasn't just me!    \n\nCould it be that because we get an answer without `abs_integrate` it just returns the 'regular' answer?  But I don't recall the integrate code doing that, I think once we turn on `abs_integrate` it should just 'be on'...",
    "created_at": "2012-01-30T20:41:59Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11590",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11590#issuecomment-118915",
    "user": "https://github.com/kcrisman"
}
```

<div id="comment:5" align="right">comment:5</div>

Well, I'm glad it wasn't just me!    

Could it be that because we get an answer without `abs_integrate` it just returns the 'regular' answer?  But I don't recall the integrate code doing that, I think once we turn on `abs_integrate` it should just 'be on'...



---

archive/issue_comments_118916.json:
```json
{
    "body": "<div id=\"comment:6\" align=\"right\">comment:6</div>\n\nReplying to [@kcrisman](#comment:5):\n> Well, I'm glad it wasn't just me!    \n> \n> Could it be that because we get an answer without `abs_integrate` it just returns the 'regular' answer?  But I don't recall the integrate code doing that, I think once we turn on `abs_integrate` it should just 'be on'...\n\nIt's possible. The abs_integrate code looks like it defines extra definite integration methods, and then loops through them until `'integrate` is gone from the expression. Within maxima, the extra methods obviously get tried first, because we get the right answer. But I suppose something in the ECL integration could be trying the default definite integration first.",
    "created_at": "2012-01-30T21:23:15Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11590",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11590#issuecomment-118916",
    "user": "https://github.com/orlitzky"
}
```

<div id="comment:6" align="right">comment:6</div>

Replying to [@kcrisman](#comment:5):
> Well, I'm glad it wasn't just me!    
> 
> Could it be that because we get an answer without `abs_integrate` it just returns the 'regular' answer?  But I don't recall the integrate code doing that, I think once we turn on `abs_integrate` it should just 'be on'...

It's possible. The abs_integrate code looks like it defines extra definite integration methods, and then loops through them until `'integrate` is gone from the expression. Within maxima, the extra methods obviously get tried first, because we get the right answer. But I suppose something in the ECL integration could be trying the default definite integration first.



---

archive/issue_comments_118917.json:
```json
{
    "body": "<div id=\"comment:7\" align=\"right\">comment:7</div>\n\nSomething else is weird here. In standalone maxima-5.26, we don't get back the wrong answer. But through sage, **without** abs_integrate, we get `1/2`:\n\n```\nsage: integrate(x * sgn(x^2 - 1/4), x, -1, 0) \n1/2\nsage: maxima.console()\n;;; Loading #P\"/home/mjo/src/sage-5.0.beta1/local/lib/ecl/sb-bsd-sockets.fas\"\n;;; Loading #P\"/home/mjo/src/sage-5.0.beta1/local/lib/ecl/sockets.fas\"\n;;; Loading #P\"/home/mjo/src/sage-5.0.beta1/local/lib/ecl/defsystem.fas\"\n;;; Loading #P\"/home/mjo/src/sage-5.0.beta1/local/lib/ecl/cmp.fas\"\nMaxima 5.26.0 http://maxima.sourceforge.net\nusing Lisp ECL 11.1.1\nDistributed under the GNU Public License. See the file COPYING.\nDedicated to the memory of William Schelter.\nThe function bug_report() provides bug reporting information.\n(%i1) display2d:false;\n\n(%o1) false\n(%i2) 'integrate(x*signum(x^2-1/4),x);\n\n(%o2) 'integrate(x*signum(x^2-1/4),x)\n(%i3) 'integrate(x*signum(x^2-1/4),x,-1,0);\n\n(%o3) 'integrate(x*signum(x^2-1/4),x,-1,0)\n```\n\nIntriguing!",
    "created_at": "2012-01-31T01:14:11Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11590",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11590#issuecomment-118917",
    "user": "https://github.com/orlitzky"
}
```

<div id="comment:7" align="right">comment:7</div>

Something else is weird here. In standalone maxima-5.26, we don't get back the wrong answer. But through sage, **without** abs_integrate, we get `1/2`:

```
sage: integrate(x * sgn(x^2 - 1/4), x, -1, 0) 
1/2
sage: maxima.console()
;;; Loading #P"/home/mjo/src/sage-5.0.beta1/local/lib/ecl/sb-bsd-sockets.fas"
;;; Loading #P"/home/mjo/src/sage-5.0.beta1/local/lib/ecl/sockets.fas"
;;; Loading #P"/home/mjo/src/sage-5.0.beta1/local/lib/ecl/defsystem.fas"
;;; Loading #P"/home/mjo/src/sage-5.0.beta1/local/lib/ecl/cmp.fas"
Maxima 5.26.0 http://maxima.sourceforge.net
using Lisp ECL 11.1.1
Distributed under the GNU Public License. See the file COPYING.
Dedicated to the memory of William Schelter.
The function bug_report() provides bug reporting information.
(%i1) display2d:false;

(%o1) false
(%i2) 'integrate(x*signum(x^2-1/4),x);

(%o2) 'integrate(x*signum(x^2-1/4),x)
(%i3) 'integrate(x*signum(x^2-1/4),x,-1,0);

(%o3) 'integrate(x*signum(x^2-1/4),x,-1,0)
```

Intriguing!



---

archive/issue_comments_118918.json:
```json
{
    "body": "<div id=\"comment:8\" align=\"right\">comment:8</div>\n\nSome random observations that may or may not be relevant. First, let's separate the \"Reader\" (parser) and the \"Evaluator\".\n\n```\nsage: from sage.libs.ecl import *\nsage: I1=EclObject(\"#$integrate(x*signum(x^2-1/4),x,-1,0);$\").cadr().cdr().car() \nsage: I2=EclObject(\"#$'integrate(x*signum(x^2-1/4),x,-1,0);$\").cadr().cdr().car()\nsage: I1\n<ECL: (($INTEGRATE)\n ((MTIMES) $X\n  ((%SIGNUM) ((MPLUS) ((MEXPT) $X 2) ((MMINUS) ((MQUOTIENT) 1 4)))))\n $X ((MMINUS) 1) 0)>\nsage: I2\n<ECL: ((%INTEGRATE)\n ((MTIMES) $X\n  ((%SIGNUM) ((MPLUS) ((MEXPT) $X 2) ((MMINUS) ((MQUOTIENT) 1 4)))))\n $X ((MMINUS) 1) 0)>\n```\nNote the subtle difference between `$INTEGRATE` (function) `%INTEGRATE` (inert integral form). Sage's `sr_integral` produces the `$INTEGRATE` expression, so the two alternatives tested are *not* equivalent. I suspect those trigger different code-paths. You could try changing\n\n```\ninterfaces/maxima_lib.py:205:max_integrate=EclObject(\"$INTEGRATE\")\n```\nto `max_integrate=EclObject(\"%INTEGRATE\")` instead and see if that solves more than it messes up.\n\nSlightly less likely to make a difference: If you look at the full expression resulting for `EclObject(\"#$1+2$\")`, you'll notice an `MEVAL*`, whereas maxima_eval is defined with `MEVAL`. I've never worked out which one is the proper one to use. So, you should test all combinations (these skip setting up the proper maxima-error-catching environment):\n\n```\nsage: EclObject([\"meval*\",[\"quote\", I1]]).eval()\nsage: EclObject([\"meval*\",[\"quote\", I2]]).eval()\nsage: EclObject([\"meval\",[\"quote\", I1]]).eval()\nsage: EclObject([\"meval\",[\"quote\", I2]]).eval()\n```",
    "created_at": "2012-01-31T21:29:55Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11590",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11590#issuecomment-118918",
    "user": "https://github.com/nbruin"
}
```

<div id="comment:8" align="right">comment:8</div>

Some random observations that may or may not be relevant. First, let's separate the "Reader" (parser) and the "Evaluator".

```
sage: from sage.libs.ecl import *
sage: I1=EclObject("#$integrate(x*signum(x^2-1/4),x,-1,0);$").cadr().cdr().car() 
sage: I2=EclObject("#$'integrate(x*signum(x^2-1/4),x,-1,0);$").cadr().cdr().car()
sage: I1
<ECL: (($INTEGRATE)
 ((MTIMES) $X
  ((%SIGNUM) ((MPLUS) ((MEXPT) $X 2) ((MMINUS) ((MQUOTIENT) 1 4)))))
 $X ((MMINUS) 1) 0)>
sage: I2
<ECL: ((%INTEGRATE)
 ((MTIMES) $X
  ((%SIGNUM) ((MPLUS) ((MEXPT) $X 2) ((MMINUS) ((MQUOTIENT) 1 4)))))
 $X ((MMINUS) 1) 0)>
```
Note the subtle difference between `$INTEGRATE` (function) `%INTEGRATE` (inert integral form). Sage's `sr_integral` produces the `$INTEGRATE` expression, so the two alternatives tested are *not* equivalent. I suspect those trigger different code-paths. You could try changing

```
interfaces/maxima_lib.py:205:max_integrate=EclObject("$INTEGRATE")
```
to `max_integrate=EclObject("%INTEGRATE")` instead and see if that solves more than it messes up.

Slightly less likely to make a difference: If you look at the full expression resulting for `EclObject("#$1+2$")`, you'll notice an `MEVAL*`, whereas maxima_eval is defined with `MEVAL`. I've never worked out which one is the proper one to use. So, you should test all combinations (these skip setting up the proper maxima-error-catching environment):

```
sage: EclObject(["meval*",["quote", I1]]).eval()
sage: EclObject(["meval*",["quote", I2]]).eval()
sage: EclObject(["meval",["quote", I1]]).eval()
sage: EclObject(["meval",["quote", I2]]).eval()
```



---

archive/issue_comments_118919.json:
```json
{
    "body": "<div id=\"comment:9\" align=\"right\">comment:9</div>\n\nI took a much stupider approach, but I did essentially try replacing `$INTEGRATE` with `%INTEGRATE`. Once I discovered the `(#$$)` syntax, I tried replacing the call to `maxima_eval` in `sr_integral` with a simple string substitution. It causes more problems than it solves, I think.\n\nIf I replace `meval` with `meval*` in a few places, I'm able to break some additional things but not fix any =)\n\nI guess the Right Thing to do would be to go read the maxima source...",
    "created_at": "2012-01-31T23:48:07Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11590",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11590#issuecomment-118919",
    "user": "https://github.com/orlitzky"
}
```

<div id="comment:9" align="right">comment:9</div>

I took a much stupider approach, but I did essentially try replacing `$INTEGRATE` with `%INTEGRATE`. Once I discovered the `(#$$)` syntax, I tried replacing the call to `maxima_eval` in `sr_integral` with a simple string substitution. It causes more problems than it solves, I think.

If I replace `meval` with `meval*` in a few places, I'm able to break some additional things but not fix any =)

I guess the Right Thing to do would be to go read the maxima source...



---

archive/issue_comments_118920.json:
```json
{
    "body": "<div id=\"comment:10\" align=\"right\">comment:10</div>\n\nReplying to [@orlitzky](#comment:9):\n>  I tried replacing the call to `maxima_eval` in `sr_integral` with a simple string substitution. It causes more problems than it solves, I think.\n\nYes, that would make things much worse (not to mention a major step back in other ways). The `sr_integral` interface tries to avoid string-based conversion, but maxima_lib in general is still capable of it in a much better way than crafting your own string-mangling based on `#$...$`. For instance:\n\n```\nsage.calculus.calculus.maxima(sage.calculus.calculus.dummy_integrate(x * sgn(x^2 - 1/4), x, -1, 0))\n```\nshould work and compares nicely to the pexpect-based\n\n```\nmaxima(sage.calculus.calculus.dummy_integrate(x * sgn(x^2 - 1/4), x, -1, 0))\n```\n\nYou should really try the commands I suggested earlier to see where the problem is, though (no changes to the source required!). I don't have ready access to a sage build with the right patches, but you obviously do. Even on a clearly insufficiently patched sage I observe different behaviour:\n\n```\nsage: maxima_eval(I1)\n<ECL: ((RAT SIMP) 1 2)>\nsage: maxima_eval(I2)\nRuntimeError: ECL says: Error executing code in Maxima: first: empty argument.\n```",
    "created_at": "2012-02-01T01:06:36Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11590",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11590#issuecomment-118920",
    "user": "https://github.com/nbruin"
}
```

<div id="comment:10" align="right">comment:10</div>

Replying to [@orlitzky](#comment:9):
>  I tried replacing the call to `maxima_eval` in `sr_integral` with a simple string substitution. It causes more problems than it solves, I think.

Yes, that would make things much worse (not to mention a major step back in other ways). The `sr_integral` interface tries to avoid string-based conversion, but maxima_lib in general is still capable of it in a much better way than crafting your own string-mangling based on `#$...$`. For instance:

```
sage.calculus.calculus.maxima(sage.calculus.calculus.dummy_integrate(x * sgn(x^2 - 1/4), x, -1, 0))
```
should work and compares nicely to the pexpect-based

```
maxima(sage.calculus.calculus.dummy_integrate(x * sgn(x^2 - 1/4), x, -1, 0))
```

You should really try the commands I suggested earlier to see where the problem is, though (no changes to the source required!). I don't have ready access to a sage build with the right patches, but you obviously do. Even on a clearly insufficiently patched sage I observe different behaviour:

```
sage: maxima_eval(I1)
<ECL: ((RAT SIMP) 1 2)>
sage: maxima_eval(I2)
RuntimeError: ECL says: Error executing code in Maxima: first: empty argument.
```



---

archive/issue_comments_118921.json:
```json
{
    "body": "<div id=\"comment:11\" align=\"right\">comment:11</div>\n\nSorry, I should have been more clear: I did try everything you suggested. Replacing `$INTEGRATE` with `%INTEGRATE` causes the same test failures in maxima_lib.py that I got when I swapped out the whole thing for string substitution. It does fix this *particular* answer, though.\n\nHere's a session with just the abs_integrate patch applied, maxima-5.26. I left the error at the top intact, for whatever reason it doesn't work at all until after I've integrated something.\n\n```\nsage: from sage.libs.ecl import *                                               \nsage: I1=EclObject(\"#$integrate(x*signum(x^2-1/4),x,-1,0);$\").cadr().cdr().car()\n---------------------------------------------------------------------------\nTypeError                                 Traceback (most recent call last)\n\n/home/mjo/src/sage-5.0.beta1/devel/sage-devel/<ipython console> in <module>()\n\n/home/mjo/src/sage-5.0.beta1/local/lib/python2.7/site-packages/sage/libs/ecl.so in sage.libs.ecl.EclObject.cadr (sage/libs/ecl.c:5528)()\n\nTypeError: cadr can only be applied to a cons\nsage: integrate(x*sgn(x^2-1/4),x,-1,0)                                          \n1/2\nsage: I1=EclObject(\"#$integrate(x*signum(x^2-1/4),x,-1,0);$\").cadr().cdr().car()\nsage: I2=EclObject(\"#$'integrate(x*signum(x^2-1/4),x,-1,0);$\").cadr().cdr().car()\nsage: I1\n<ECL: (($INTEGRATE)\n ((MTIMES) $X\n  ((%SIGNUM) ((MPLUS) ((MEXPT) $X 2) ((MMINUS) ((MQUOTIENT) 1 4)))))\n $X ((MMINUS) 1) 0)>\nsage: I2\n<ECL: ((%INTEGRATE)\n ((MTIMES) $X\n  ((%SIGNUM) ((MPLUS) ((MEXPT) $X 2) ((MMINUS) ((MQUOTIENT) 1 4)))))\n $X ((MMINUS) 1) 0)>\nsage: EclObject([\"meval*\",[\"quote\", I1]]).eval()\n<ECL: ((RAT SIMP) 1 2)>\nsage: EclObject([\"meval*\",[\"quote\", I2]]).eval()\n<ECL: ((RAT SIMP) -1 4)>\nsage: EclObject([\"meval\",[\"quote\", I1]]).eval()\n<ECL: ((RAT SIMP) 1 2)>\nsage: EclObject([\"meval\",[\"quote\", I2]]).eval()\n<ECL: ((RAT SIMP) -1 4)>\n```\n\nAnd here's a session with `$INTEGRATE` switched to `%INTEGRATE`:\n\n```\nsage: from sage.libs.ecl import *                                                \nsage: I1=EclObject(\"#$integrate(x*signum(x^2-1/4),x,-1,0);$\").cadr().cdr().car()\n---------------------------------------------------------------------------\nTypeError                                 Traceback (most recent call last)\n\n/home/mjo/src/sage-5.0.beta1/devel/sage-devel/<ipython console> in <module>()\n\n/home/mjo/src/sage-5.0.beta1/local/lib/python2.7/site-packages/sage/libs/ecl.so in sage.libs.ecl.EclObject.cadr (sage/libs/ecl.c:5528)()\n\nTypeError: cadr can only be applied to a cons\nsage: integrate(x*sgn(x^2-1/4),x,-1,0)                                           \n-1/4\nsage: I1=EclObject(\"#$integrate(x*signum(x^2-1/4),x,-1,0);$\").cadr().cdr().car() \nsage: I2=EclObject(\"#$'integrate(x*signum(x^2-1/4),x,-1,0);$\").cadr().cdr().car()\nsage: I1\n<ECL: (($INTEGRATE)\n ((MTIMES) $X\n  ((%SIGNUM) ((MPLUS) ((MEXPT) $X 2) ((MMINUS) ((MQUOTIENT) 1 4)))))\n $X ((MMINUS) 1) 0)>\nsage: I2\n<ECL: ((%INTEGRATE)\n ((MTIMES) $X\n  ((%SIGNUM) ((MPLUS) ((MEXPT) $X 2) ((MMINUS) ((MQUOTIENT) 1 4)))))\n $X ((MMINUS) 1) 0)>\nsage: EclObject([\"meval*\",[\"quote\", I1]]).eval()                                 \n<ECL: ((RAT SIMP) 1 2)>\nsage: EclObject([\"meval*\",[\"quote\", I2]]).eval()                                 \n<ECL: ((RAT SIMP) -1 4)>\nsage: EclObject([\"meval\",[\"quote\", I1]]).eval()                                  \n<ECL: ((RAT SIMP) 1 2)>\nsage: EclObject([\"meval\",[\"quote\", I2]]).eval()                                  \n<ECL: ((RAT SIMP) -1 4)>\n```\n\nThe same thing, except the original integration actually works. Problem is, other tests start to fail with `%INTEGRATE`. Here's an example:\n\n```\n$ sage -t sage/interfaces/maxima_lib.py\nsage -t  \"devel/sage-devel/sage/interfaces/maxima_lib.py\"   \n**********************************************************************\nFile \"/home/mjo/src/sage-5.0.beta1/devel/sage-devel/sage/interfaces/maxima_lib.py\", line 661:\n    sage: integral(x^n,x)\nExpected:\n    Traceback (most recent call last):\n    ...\n    ValueError: Computation failed since Maxima requested additional\n    constraints; using the 'assume' command before integral evaluation\n    *may* help (example of legal syntax is 'assume(n+1>0)',\n    see `assume?` for more details)\n    Is  n+1  zero or nonzero?\nGot:\n    x^(n + 1)/(n + 1)\n**********************************************************************\nFile \"/home/mjo/src/sage-5.0.beta1/devel/sage-devel/sage/interfaces/maxima_lib.py\", line 685:\n    sage: integrate(sgn(x) - sgn(1-x), x)\nExpected:\n    abs(x - 1) + abs(x)\nGot:\n    (x - 1)*sgn(x - 1) + x*sgn(x)\n**********************************************************************\nFile \"/home/mjo/src/sage-5.0.beta1/devel/sage-devel/sage/interfaces/maxima_lib.py\", line 700:\n    sage: integrate(cos(x + abs(x)), x)\nExpected:\n    1/4*(sgn(x) + 1)*sin(2*x) - 1/2*x*sgn(x) + 1/2*x\nGot:\n    -1/4*(2*x - sin(2*x))*sgn(x) + 1/2*x + 1/4*sin(2*x)\n**********************************************************************\nFile \"/home/mjo/src/sage-5.0.beta1/devel/sage-devel/sage/interfaces/maxima_lib.py\", line 711:\n    sage: integral(abs(cos(x))*sin(x),(x,pi/2,pi))\nExpected:\n    1/2\nGot:\n    -1/2\n```",
    "created_at": "2012-02-01T01:29:28Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11590",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11590#issuecomment-118921",
    "user": "https://github.com/orlitzky"
}
```

<div id="comment:11" align="right">comment:11</div>

Sorry, I should have been more clear: I did try everything you suggested. Replacing `$INTEGRATE` with `%INTEGRATE` causes the same test failures in maxima_lib.py that I got when I swapped out the whole thing for string substitution. It does fix this *particular* answer, though.

Here's a session with just the abs_integrate patch applied, maxima-5.26. I left the error at the top intact, for whatever reason it doesn't work at all until after I've integrated something.

```
sage: from sage.libs.ecl import *                                               
sage: I1=EclObject("#$integrate(x*signum(x^2-1/4),x,-1,0);$").cadr().cdr().car()
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)

/home/mjo/src/sage-5.0.beta1/devel/sage-devel/<ipython console> in <module>()

/home/mjo/src/sage-5.0.beta1/local/lib/python2.7/site-packages/sage/libs/ecl.so in sage.libs.ecl.EclObject.cadr (sage/libs/ecl.c:5528)()

TypeError: cadr can only be applied to a cons
sage: integrate(x*sgn(x^2-1/4),x,-1,0)                                          
1/2
sage: I1=EclObject("#$integrate(x*signum(x^2-1/4),x,-1,0);$").cadr().cdr().car()
sage: I2=EclObject("#$'integrate(x*signum(x^2-1/4),x,-1,0);$").cadr().cdr().car()
sage: I1
<ECL: (($INTEGRATE)
 ((MTIMES) $X
  ((%SIGNUM) ((MPLUS) ((MEXPT) $X 2) ((MMINUS) ((MQUOTIENT) 1 4)))))
 $X ((MMINUS) 1) 0)>
sage: I2
<ECL: ((%INTEGRATE)
 ((MTIMES) $X
  ((%SIGNUM) ((MPLUS) ((MEXPT) $X 2) ((MMINUS) ((MQUOTIENT) 1 4)))))
 $X ((MMINUS) 1) 0)>
sage: EclObject(["meval*",["quote", I1]]).eval()
<ECL: ((RAT SIMP) 1 2)>
sage: EclObject(["meval*",["quote", I2]]).eval()
<ECL: ((RAT SIMP) -1 4)>
sage: EclObject(["meval",["quote", I1]]).eval()
<ECL: ((RAT SIMP) 1 2)>
sage: EclObject(["meval",["quote", I2]]).eval()
<ECL: ((RAT SIMP) -1 4)>
```

And here's a session with `$INTEGRATE` switched to `%INTEGRATE`:

```
sage: from sage.libs.ecl import *                                                
sage: I1=EclObject("#$integrate(x*signum(x^2-1/4),x,-1,0);$").cadr().cdr().car()
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)

/home/mjo/src/sage-5.0.beta1/devel/sage-devel/<ipython console> in <module>()

/home/mjo/src/sage-5.0.beta1/local/lib/python2.7/site-packages/sage/libs/ecl.so in sage.libs.ecl.EclObject.cadr (sage/libs/ecl.c:5528)()

TypeError: cadr can only be applied to a cons
sage: integrate(x*sgn(x^2-1/4),x,-1,0)                                           
-1/4
sage: I1=EclObject("#$integrate(x*signum(x^2-1/4),x,-1,0);$").cadr().cdr().car() 
sage: I2=EclObject("#$'integrate(x*signum(x^2-1/4),x,-1,0);$").cadr().cdr().car()
sage: I1
<ECL: (($INTEGRATE)
 ((MTIMES) $X
  ((%SIGNUM) ((MPLUS) ((MEXPT) $X 2) ((MMINUS) ((MQUOTIENT) 1 4)))))
 $X ((MMINUS) 1) 0)>
sage: I2
<ECL: ((%INTEGRATE)
 ((MTIMES) $X
  ((%SIGNUM) ((MPLUS) ((MEXPT) $X 2) ((MMINUS) ((MQUOTIENT) 1 4)))))
 $X ((MMINUS) 1) 0)>
sage: EclObject(["meval*",["quote", I1]]).eval()                                 
<ECL: ((RAT SIMP) 1 2)>
sage: EclObject(["meval*",["quote", I2]]).eval()                                 
<ECL: ((RAT SIMP) -1 4)>
sage: EclObject(["meval",["quote", I1]]).eval()                                  
<ECL: ((RAT SIMP) 1 2)>
sage: EclObject(["meval",["quote", I2]]).eval()                                  
<ECL: ((RAT SIMP) -1 4)>
```

The same thing, except the original integration actually works. Problem is, other tests start to fail with `%INTEGRATE`. Here's an example:

```
$ sage -t sage/interfaces/maxima_lib.py
sage -t  "devel/sage-devel/sage/interfaces/maxima_lib.py"   
**********************************************************************
File "/home/mjo/src/sage-5.0.beta1/devel/sage-devel/sage/interfaces/maxima_lib.py", line 661:
    sage: integral(x^n,x)
Expected:
    Traceback (most recent call last):
    ...
    ValueError: Computation failed since Maxima requested additional
    constraints; using the 'assume' command before integral evaluation
    *may* help (example of legal syntax is 'assume(n+1>0)',
    see `assume?` for more details)
    Is  n+1  zero or nonzero?
Got:
    x^(n + 1)/(n + 1)
**********************************************************************
File "/home/mjo/src/sage-5.0.beta1/devel/sage-devel/sage/interfaces/maxima_lib.py", line 685:
    sage: integrate(sgn(x) - sgn(1-x), x)
Expected:
    abs(x - 1) + abs(x)
Got:
    (x - 1)*sgn(x - 1) + x*sgn(x)
**********************************************************************
File "/home/mjo/src/sage-5.0.beta1/devel/sage-devel/sage/interfaces/maxima_lib.py", line 700:
    sage: integrate(cos(x + abs(x)), x)
Expected:
    1/4*(sgn(x) + 1)*sin(2*x) - 1/2*x*sgn(x) + 1/2*x
Got:
    -1/4*(2*x - sin(2*x))*sgn(x) + 1/2*x + 1/4*sin(2*x)
**********************************************************************
File "/home/mjo/src/sage-5.0.beta1/devel/sage-devel/sage/interfaces/maxima_lib.py", line 711:
    sage: integral(abs(cos(x))*sin(x),(x,pi/2,pi))
Expected:
    1/2
Got:
    -1/2
```



---

archive/issue_comments_118922.json:
```json
{
    "body": "<div id=\"comment:12\" align=\"right\">comment:12</div>\n\nReplying to [@orlitzky](#comment:11):\n> I left the error at the top intact, for whatever reason it doesn't work at all until after I've integrated something.\n\n\n```\nsage: from sage.libs.ecl import *\n```\nThis doesn't load maxima inside ecl yet, but once you evaluate an integral, maxima is loaded and the `#$...$` macro works. Sorry about that.",
    "created_at": "2012-02-01T01:59:44Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11590",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11590#issuecomment-118922",
    "user": "https://github.com/nbruin"
}
```

<div id="comment:12" align="right">comment:12</div>

Replying to [@orlitzky](#comment:11):
> I left the error at the top intact, for whatever reason it doesn't work at all until after I've integrated something.


```
sage: from sage.libs.ecl import *
```
This doesn't load maxima inside ecl yet, but once you evaluate an integral, maxima is loaded and the `#$...$` macro works. Sorry about that.



---

archive/issue_comments_118923.json:
```json
{
    "body": "<div id=\"comment:13\" align=\"right\">comment:13</div>\n\nReplying to [@kcrisman](#comment:3):\n> Even with #11483, this isn't working right.  It should, though - see Barton's post at the Maxima ticket:\n> \n> ```\n> By the way:\n> \n> (%i4) load(abs_integrate)$\n> \n> Correct antiderivative:\n> \n> (%i5) 'integrate(x*signum(x^2-1/4),x);\n> (%o5) abs(x^2-1/4)/2\n> \n> Correct definite integral\n> \n> (%i6) 'integrate(x*signum(x^2-1/4),x,-1,0);\n> (%o6) -1/4\n> ```\n> so I'm not sure why this is still returning the \"wrong\" thing.\n\nDid you try it with `integrate` rather than `'integrate`? Given what we've seen elsewhere in this ticket, I suspect it still gives the wrong answer. In sage, we are interfacing with `integrate`. If that is still broken, then the bug is not fixed as far as sage is concerned.\n\nIf maxima's position is that we should use a different integration routine (i.e., `'integrate`) then we need a heuristic on when to use what routine ... isn't it maxima's job to figure this out?",
    "created_at": "2012-02-01T02:06:40Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11590",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11590#issuecomment-118923",
    "user": "https://github.com/nbruin"
}
```

<div id="comment:13" align="right">comment:13</div>

Replying to [@kcrisman](#comment:3):
> Even with #11483, this isn't working right.  It should, though - see Barton's post at the Maxima ticket:
> 
> ```
> By the way:
> 
> (%i4) load(abs_integrate)$
> 
> Correct antiderivative:
> 
> (%i5) 'integrate(x*signum(x^2-1/4),x);
> (%o5) abs(x^2-1/4)/2
> 
> Correct definite integral
> 
> (%i6) 'integrate(x*signum(x^2-1/4),x,-1,0);
> (%o6) -1/4
> ```
> so I'm not sure why this is still returning the "wrong" thing.

Did you try it with `integrate` rather than `'integrate`? Given what we've seen elsewhere in this ticket, I suspect it still gives the wrong answer. In sage, we are interfacing with `integrate`. If that is still broken, then the bug is not fixed as far as sage is concerned.

If maxima's position is that we should use a different integration routine (i.e., `'integrate`) then we need a heuristic on when to use what routine ... isn't it maxima's job to figure this out?



---

archive/issue_comments_118924.json:
```json
{
    "body": "<div id=\"comment:14\" align=\"right\">comment:14</div>\n\n> Did you try it with `integrate` rather than `'integrate`? \n\n\n```\n(%i5) display2d:false;\n\n(%o5) false\n(%i6) integrate(x*signum(x^2-1/4),x,-1,0);\n\n(%o6) 1/2\n(%i7) 'integrate(x*signum(x^2-1/4),x,-1,0);\n\n(%o7) -1/4\n```\nNote that this was just Barton Willis (Maxima dev) example.\n> Given what we've seen elsewhere in this ticket, I suspect it still gives the wrong answer. In sage, we are interfacing with `integrate`. If that is still broken, then the bug is not fixed as far as sage is concerned.\n\nI don't think they claimed it was fixed. \n> If maxima's position is that we should use a different integration routine (i.e., `'integrate`) then we need a heuristic on when to use what routine ... isn't it maxima's job to figure this out?\n\nYes, I am a little stumped on this.  I thought that the apostrophe just meant \"don't evaluate nounform\", but apparently I was mistaken.    I just reported this example on the Maxima ticket, but I wouldn't hold my breath waiting for it, since there *is* a way to get it to work correctly there.",
    "created_at": "2012-02-01T02:28:03Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11590",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11590#issuecomment-118924",
    "user": "https://github.com/kcrisman"
}
```

<div id="comment:14" align="right">comment:14</div>

> Did you try it with `integrate` rather than `'integrate`? 


```
(%i5) display2d:false;

(%o5) false
(%i6) integrate(x*signum(x^2-1/4),x,-1,0);

(%o6) 1/2
(%i7) 'integrate(x*signum(x^2-1/4),x,-1,0);

(%o7) -1/4
```
Note that this was just Barton Willis (Maxima dev) example.
> Given what we've seen elsewhere in this ticket, I suspect it still gives the wrong answer. In sage, we are interfacing with `integrate`. If that is still broken, then the bug is not fixed as far as sage is concerned.

I don't think they claimed it was fixed. 
> If maxima's position is that we should use a different integration routine (i.e., `'integrate`) then we need a heuristic on when to use what routine ... isn't it maxima's job to figure this out?

Yes, I am a little stumped on this.  I thought that the apostrophe just meant "don't evaluate nounform", but apparently I was mistaken.    I just reported this example on the Maxima ticket, but I wouldn't hold my breath waiting for it, since there *is* a way to get it to work correctly there.



---

archive/issue_comments_118925.json:
```json
{
    "body": "Stopgaps: **#12731**",
    "created_at": "2012-03-22T19:01:56Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11590",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11590#issuecomment-118925",
    "user": "https://github.com/roed314"
}
```

Stopgaps: **#12731**



---

archive/issue_comments_118926.json:
```json
{
    "body": "<div id=\"comment:16\" align=\"right\">comment:16</div>\n\nSee also #12731.",
    "created_at": "2014-12-08T15:00:45Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11590",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11590#issuecomment-118926",
    "user": "https://github.com/kcrisman"
}
```

<div id="comment:16" align="right">comment:16</div>

See also #12731.



---

archive/issue_comments_118927.json:
```json
{
    "body": "Changed stopgaps from **#12731** to none",
    "created_at": "2014-12-08T15:00:45Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11590",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11590#issuecomment-118927",
    "user": "https://github.com/kcrisman"
}
```

Changed stopgaps from **#12731** to none



---

archive/issue_comments_118928.json:
```json
{
    "body": "Stopgaps: **#12731**",
    "created_at": "2015-02-10T00:20:24Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11590",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11590#issuecomment-118928",
    "user": "https://github.com/sagetrac-jakobkroeker"
}
```

Stopgaps: **#12731**



---

archive/issue_comments_118929.json:
```json
{
    "body": "<div id=\"comment:18\" align=\"right\">comment:18</div>\n\nFYI fixed in Maxima by commit 5a300aa, which I have cherry-picked to branch-5_38.\n\nRelated bug reports:\nhttps://sourceforge.net/p/maxima/bugs/2242\nhttps://sourceforge.net/p/maxima/bugs/3123",
    "created_at": "2016-04-14T20:49:53Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11590",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11590#issuecomment-118929",
    "user": "https://github.com/sagetrac-robert-dodier"
}
```

<div id="comment:18" align="right">comment:18</div>

FYI fixed in Maxima by commit 5a300aa, which I have cherry-picked to branch-5_38.

Related bug reports:
https://sourceforge.net/p/maxima/bugs/2242
https://sourceforge.net/p/maxima/bugs/3123



---

archive/issue_comments_118930.json:
```json
{
    "body": "Changed upstream from **Reported upstream. Developers acknowledge bug.** to **Fixed upstream, in a later stable release.**",
    "created_at": "2016-04-14T21:41:29Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11590",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11590#issuecomment-118930",
    "user": "https://github.com/kcrisman"
}
```

Changed upstream from **Reported upstream. Developers acknowledge bug.** to **Fixed upstream, in a later stable release.**



---

archive/issue_comments_118931.json:
```json
{
    "body": "<div id=\"comment:20\" align=\"right\">comment:20</div>\n\nThis now works in 8.9.b7. We need to add the doctest\n\n```\nsage: integrate(x * sgn(x^2 - 1/4), x, -1, 0)\n-1/4\n```",
    "created_at": "2019-08-26T19:07:20Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11590",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11590#issuecomment-118931",
    "user": "https://github.com/fchapoton"
}
```

<div id="comment:20" align="right">comment:20</div>

This now works in 8.9.b7. We need to add the doctest

```
sage: integrate(x * sgn(x^2 - 1/4), x, -1, 0)
-1/4
```



---

archive/issue_comments_118932.json:
```json
{
    "body": "Branch: **[u/mjo/ticket/11590](https://github.com/sagemath/sagetrac-mirror/tree/u/mjo/ticket/11590)**",
    "created_at": "2020-12-18T15:00:29Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11590",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11590#issuecomment-118932",
    "user": "https://github.com/orlitzky"
}
```

Branch: **[u/mjo/ticket/11590](https://github.com/sagemath/sagetrac-mirror/tree/u/mjo/ticket/11590)**



---

archive/issue_comments_118933.json:
```json
{
    "body": "<div id=\"comment:21\"></div>\n\nNew commits:\n<table><tr><td><a href=\"https://github.com/sagemath/sagetrac-mirror/commit/bf1b50b7d9264e5695ec8cb900de253e6706136b\"><code>bf1b50b</code></a></td><td><code>Trac #11590: add a doctest for the integral reported on this ticket.</code></td></tr></table>\n",
    "created_at": "2020-12-18T15:00:29Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11590",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11590#issuecomment-118933",
    "user": "https://github.com/orlitzky"
}
```

<div id="comment:21"></div>

New commits:
<table><tr><td><a href="https://github.com/sagemath/sagetrac-mirror/commit/bf1b50b7d9264e5695ec8cb900de253e6706136b"><code>bf1b50b</code></a></td><td><code>Trac #11590: add a doctest for the integral reported on this ticket.</code></td></tr></table>




---

archive/issue_comments_118934.json:
```json
{
    "body": "Commit: **[`bf1b50b`](https://github.com/sagemath/sagetrac-mirror/commit/bf1b50b7d9264e5695ec8cb900de253e6706136b)**",
    "created_at": "2020-12-18T15:00:29Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11590",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11590#issuecomment-118934",
    "user": "https://github.com/orlitzky"
}
```

Commit: **[`bf1b50b`](https://github.com/sagemath/sagetrac-mirror/commit/bf1b50b7d9264e5695ec8cb900de253e6706136b)**



---

archive/issue_events_153622.json:
```json
{
    "actor": "https://github.com/orlitzky",
    "created_at": "2020-12-18T15:00:29Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/11590",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "7fff00",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/11590#event-153622"
}
```



---

archive/issue_comments_118935.json:
```json
{
    "body": "Author: **Michael Orlitzky**",
    "created_at": "2020-12-18T15:00:29Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11590",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11590#issuecomment-118935",
    "user": "https://github.com/orlitzky"
}
```

Author: **Michael Orlitzky**



---

archive/issue_comments_118936.json:
```json
{
    "body": "Reviewer: **Fr\u00e9d\u00e9ric Chapoton**",
    "created_at": "2020-12-19T20:16:15Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11590",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11590#issuecomment-118936",
    "user": "https://github.com/fchapoton"
}
```

Reviewer: **Frédéric Chapoton**



---

archive/issue_comments_118937.json:
```json
{
    "body": "<div id=\"comment:22\" align=\"right\">comment:22</div>\n\nok, this is now handled by giac..",
    "created_at": "2020-12-19T20:16:15Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11590",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11590#issuecomment-118937",
    "user": "https://github.com/fchapoton"
}
```

<div id="comment:22" align="right">comment:22</div>

ok, this is now handled by giac..



---

archive/issue_events_153623.json:
```json
{
    "actor": "https://github.com/fchapoton",
    "created_at": "2020-12-19T20:16:15Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/11590",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "7fff00",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/11590#event-153623"
}
```



---

archive/issue_events_153624.json:
```json
{
    "actor": "https://github.com/fchapoton",
    "created_at": "2020-12-19T20:16:15Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/11590",
    "label": "https://github.com/sagemath/sage/labels/positive%20review",
    "label_color": "dfffc0",
    "label_name": "positive review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/11590#event-153624"
}
```



---

archive/issue_events_153625.json:
```json
{
    "actor": "https://github.com/fchapoton",
    "created_at": "2020-12-21T13:53:32Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/11590",
    "milestone_number": null,
    "milestone_title": "sage-9.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/11590#event-153625"
}
```



---

archive/issue_events_153626.json:
```json
{
    "actor": "https://github.com/vbraun",
    "created_at": "2020-12-27T00:23:33Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/11590",
    "label": "https://github.com/sagemath/sage/labels/positive%20review",
    "label_color": "dfffc0",
    "label_name": "positive review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/11590#event-153626"
}
```



---

archive/issue_events_153627.json:
```json
{
    "actor": "https://github.com/vbraun",
    "commit_id": "81aebb9649e654239a285d8f912ec9ebc218f6ac",
    "commit_repository": "https://github.com/sagemath/sage",
    "created_at": "2020-12-27T00:23:33Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/11590",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/11590#event-153627"
}
```



---

archive/issue_comments_118938.json:
```json
{
    "body": "Changed branch from **[u/mjo/ticket/11590](https://github.com/sagemath/sagetrac-mirror/tree/u/mjo/ticket/11590)** to **[`bf1b50b`](https://github.com/sagemath/sagetrac-mirror/commit/bf1b50b7d9264e5695ec8cb900de253e6706136b)**",
    "created_at": "2020-12-27T00:23:33Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11590",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11590#issuecomment-118938",
    "user": "https://github.com/vbraun"
}
```

Changed branch from **[u/mjo/ticket/11590](https://github.com/sagemath/sagetrac-mirror/tree/u/mjo/ticket/11590)** to **[`bf1b50b`](https://github.com/sagemath/sagetrac-mirror/commit/bf1b50b7d9264e5695ec8cb900de253e6706136b)**
