# Issue 11668: abs(a+b)^2 == (a+b)^2

archive/issues_011496.json:
```json
{
    "body": "\n```\nsage: version()\n'Sage Version 4.7, Release Date: 2011-05-23'\nsage: var('a b', domain='real');\nsage: A = abs((a+i*b))^2\nsage: A\nabs(a + I*b)^2\nsage: imag(A)\n0\nsage: A.simplify_full()\na^2 + 2*I*a*b - b^2\nsage: imag(A.simplify_full())\n2*a*b\n```\n\nThe last result is clearly wrong. abs() is real by definition. simplify_full() doesn't handle abs() correctly.\n\nDemo Notebook: http://demo.sagenb.org/home/pub/181/\n\nAssignee: @burcin\n\nCC:  @kcrisman @orlitzky\n\nKeywords: maxima abs\n\nReviewer: Michael Orlitzky\n\nAuthor: Karl-Dieter Crisman\n\nMerged: sage-5.11.beta3\n\nResolution: fixed\n\nIssue created by migration from https://trac.sagemath.org/ticket/11668\n\n",
    "closed_at": "2013-06-20T21:33:58Z",
    "created_at": "2011-08-08T18:51:28Z",
    "labels": [
        "component: symbolics",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-5.11",
    "title": "abs(a+b)^2 == (a+b)^2",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/11668",
    "user": "https://trac.sagemath.org/admin/accounts/users/jan"
}
```

```
sage: version()
'Sage Version 4.7, Release Date: 2011-05-23'
sage: var('a b', domain='real');
sage: A = abs((a+i*b))^2
sage: A
abs(a + I*b)^2
sage: imag(A)
0
sage: A.simplify_full()
a^2 + 2*I*a*b - b^2
sage: imag(A.simplify_full())
2*a*b
```

The last result is clearly wrong. abs() is real by definition. simplify_full() doesn't handle abs() correctly.

Demo Notebook: http://demo.sagenb.org/home/pub/181/

Assignee: @burcin

CC:  @kcrisman @orlitzky

Keywords: maxima abs

Reviewer: Michael Orlitzky

Author: Karl-Dieter Crisman

Merged: sage-5.11.beta3

Resolution: fixed

Issue created by migration from https://trac.sagemath.org/ticket/11668





---

archive/issue_comments_154755.json:
```json
{
    "body": "Changing assignee from @ncalexan to @burcin.",
    "created_at": "2011-08-08T18:52:02Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11668",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11668#issuecomment-154755",
    "user": "https://trac.sagemath.org/admin/accounts/users/jan"
}
```

Changing assignee from @ncalexan to @burcin.



---

archive/issue_comments_154756.json:
```json
{
    "body": "<a id='comment:2'></a>\nThe exact place is \n\n```\nsage: A.simplify_radical()\na^2 + 2*I*a*b - b^2\n```\nThis is how `radcan` in Maxima does this over the real domain, which `simplify_radical` temporarily makes us in.  \n\nI'm not sure what the best thing to do here is.  Two ideas:\n* Change so that we stay in `domain:complex` in Maxima, sort of missing the point of `simplify_radical`\n* Give lots of warnings not to trust simplification because (like most simplification) it is not always true, but useful.  (Sort of like how `\\sqrt{x^2}\\neq x` but sometimes it's useful to simplify it that way.)\n\nI do not think we pass the domain information from the (Pynac) variables in any case, or if that would be very easy to do.",
    "created_at": "2011-08-09T00:33:16Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11668",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11668#issuecomment-154756",
    "user": "https://github.com/kcrisman"
}
```

<a id='comment:2'></a>
The exact place is 

```
sage: A.simplify_radical()
a^2 + 2*I*a*b - b^2
```
This is how `radcan` in Maxima does this over the real domain, which `simplify_radical` temporarily makes us in.  

I'm not sure what the best thing to do here is.  Two ideas:
* Change so that we stay in `domain:complex` in Maxima, sort of missing the point of `simplify_radical`
* Give lots of warnings not to trust simplification because (like most simplification) it is not always true, but useful.  (Sort of like how `\sqrt{x^2}\neq x` but sometimes it's useful to simplify it that way.)

I do not think we pass the domain information from the (Pynac) variables in any case, or if that would be very easy to do.



---

archive/issue_comments_154757.json:
```json
{
    "body": "<a id='comment:3'></a>\nThis has been fixed by #12780.\n\n```\nsage: var('a b')\n(a, b)\nsage: A = abs((a+i*b))^2\nsage: A.simplify_radical()\nabs(a + I*b)^2\nsage: imag(A)\n0\nsage: imag(A.simplify_full())\n0\n```\nPatch probably coming up.  This would also be dealt with by #12737, but that is orthogonal to having fixed the domain issues.",
    "created_at": "2013-06-12T19:33:30Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11668",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11668#issuecomment-154757",
    "user": "https://github.com/kcrisman"
}
```

<a id='comment:3'></a>
This has been fixed by #12780.

```
sage: var('a b')
(a, b)
sage: A = abs((a+i*b))^2
sage: A.simplify_radical()
abs(a + I*b)^2
sage: imag(A)
0
sage: imag(A.simplify_full())
0
```
Patch probably coming up.  This would also be dealt with by #12737, but that is orthogonal to having fixed the domain issues.



---

archive/issue_comments_154758.json:
```json
{
    "body": "Changing status from new to needs_review.",
    "created_at": "2013-06-12T20:41:29Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11668",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11668#issuecomment-154758",
    "user": "https://github.com/kcrisman"
}
```

Changing status from new to needs_review.



---

archive/issue_comments_154759.json:
```json
{
    "body": "Changing author from \"\" to \"Karl-Dieter Crisman\"",
    "created_at": "2013-06-12T20:41:29Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11668",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11668#issuecomment-154759",
    "user": "https://github.com/kcrisman"
}
```

Changing author from "" to "Karl-Dieter Crisman"



---

archive/issue_comments_154760.json:
```json
{
    "body": "<a id='comment:5'></a>\nTwo minor things, can you use `a,b = SR.var('a,b')` to create the variables? That will eliminate one line of unrelated output. And just a style preference, since sage outputs the complex unit as `I`, I think it's a tiny bit more consistent to use that for input as well, but I'll take it either way.",
    "created_at": "2013-06-14T15:51:09Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11668",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11668#issuecomment-154760",
    "user": "https://github.com/orlitzky"
}
```

<a id='comment:5'></a>
Two minor things, can you use `a,b = SR.var('a,b')` to create the variables? That will eliminate one line of unrelated output. And just a style preference, since sage outputs the complex unit as `I`, I think it's a tiny bit more consistent to use that for input as well, but I'll take it either way.



---

archive/issue_comments_154761.json:
```json
{
    "body": "Attachment [trac_11668.patch](tarball://root/attachments/some-uuid/ticket11668/trac_11668.patch) by @kcrisman created at 2013-06-14 16:00:58\n\nBased on 5.10.rc1",
    "created_at": "2013-06-14T16:00:58Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11668",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11668#issuecomment-154761",
    "user": "https://github.com/kcrisman"
}
```

Attachment [trac_11668.patch](tarball://root/attachments/some-uuid/ticket11668/trac_11668.patch) by @kcrisman created at 2013-06-14 16:00:58

Based on 5.10.rc1



---

archive/issue_comments_154762.json:
```json
{
    "body": "<a id='comment:6'></a>\n> Two minor things\n\nSure, no problem.  I put the `i` instead of `I` just because I copied from the original example in the ticket, but that is unimportant.  Thanks!",
    "created_at": "2013-06-14T16:01:49Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11668",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11668#issuecomment-154762",
    "user": "https://github.com/kcrisman"
}
```

<a id='comment:6'></a>
> Two minor things

Sure, no problem.  I put the `i` instead of `I` just because I copied from the original example in the ticket, but that is unimportant.  Thanks!



---

archive/issue_comments_154763.json:
```json
{
    "body": "Changing reviewer from \"\" to \"Michael Orlitzky\"",
    "created_at": "2013-06-14T20:33:17Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11668",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11668#issuecomment-154763",
    "user": "https://github.com/orlitzky"
}
```

Changing reviewer from "" to "Michael Orlitzky"



---

archive/issue_comments_154764.json:
```json
{
    "body": "Changing status from needs_review to positive_review.",
    "created_at": "2013-06-14T20:33:17Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11668",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11668#issuecomment-154764",
    "user": "https://github.com/orlitzky"
}
```

Changing status from needs_review to positive_review.



---

archive/issue_comments_154765.json:
```json
{
    "body": "Changing merged from \"\" to \"sage-5.11.beta3\"",
    "created_at": "2013-06-20T21:33:58Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11668",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11668#issuecomment-154765",
    "user": "https://github.com/jdemeyer"
}
```

Changing merged from "" to "sage-5.11.beta3"



---

archive/issue_comments_154766.json:
```json
{
    "body": "Resolution: fixed",
    "created_at": "2013-06-20T21:33:58Z",
    "issue": "https://github.com/sagemath/sagetest/issues/11668",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/11668#issuecomment-154766",
    "user": "https://github.com/jdemeyer"
}
```

Resolution: fixed



---

archive/issue_events_043930.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2013-06-20T21:33:58Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/11668",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/11668#event-43930"
}
```
