# Issue 11962: mpmath mpc won't coerce to ComplexNumber

archive/issues_011790.json:
```json
{
    "assignees": [],
    "body": "Came across this working on #1173:\n\n```\nsage: version()\n'Sage Version 4.7.2.alpha3, Release Date: 2011-09-28'\nsage: import mpmath\nsage: \nsage: z = mpmath.mpf(2)\nsage: z\nmpf('2.0')\nsage: RR(z)\n2.00000000000000\nsage: CC(z)\n2.00000000000000\nsage: \nsage: z = mpmath.mpc(2,3)\nsage: z\nmpc(real='2.0', imag='3.0')\nsage: complex(z)\n(2+3j)\nsage: CC(z)\n---------------------------------------------------------------------------\nTypeError                                 Traceback (most recent call last)\n[...]\nTypeError: unable to coerce to a ComplexNumber: <type 'sage.libs.mpmath.ext_main.mpc'>\n```\n\n\n\n**Assignee:** @robertwb\n\n**CC:**  @nexttime\n\nIssue created by migration from https://trac.sagemath.org/ticket/11962\n\n",
    "created_at": "2011-10-29T15:33:46Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20coercion",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-6.8",
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "mpmath mpc won't coerce to ComplexNumber",
    "type": "issue",
    "updated_at": "2022-04-03T14:24:19Z",
    "url": "https://github.com/sagemath/sage/issues/11962",
    "user": "https://github.com/sagetrac-dsm"
}
```
Came across this working on #1173:

```
sage: version()
'Sage Version 4.7.2.alpha3, Release Date: 2011-09-28'
sage: import mpmath
sage: 
sage: z = mpmath.mpf(2)
sage: z
mpf('2.0')
sage: RR(z)
2.00000000000000
sage: CC(z)
2.00000000000000
sage: 
sage: z = mpmath.mpc(2,3)
sage: z
mpc(real='2.0', imag='3.0')
sage: complex(z)
(2+3j)
sage: CC(z)
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)
[...]
TypeError: unable to coerce to a ComplexNumber: <type 'sage.libs.mpmath.ext_main.mpc'>
```



**Assignee:** @robertwb

**CC:**  @nexttime

Issue created by migration from https://trac.sagemath.org/ticket/11962





---

archive/issue_comments_128978.json:
```json
{
    "body": "**Assignee:** @williamstein",
    "created_at": "2011-10-29T17:07:26Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11962",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11962#issuecomment-128978",
    "user": "https://github.com/nexttime"
}
```

**Assignee:** @williamstein



---

archive/issue_events_096588.json:
```json
{
    "actor": "https://github.com/nexttime",
    "created_at": "2011-10-29T17:07:26Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/11962",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20interfaces",
    "label_color": "08517b",
    "label_name": "component: interfaces",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/11962#event-96588"
}
```



---

archive/issue_events_096589.json:
```json
{
    "actor": "https://github.com/nexttime",
    "created_at": "2011-10-29T17:10:54Z",
    "event": "renamed",
    "issue": "https://github.com/sagemath/sage/issues/11962",
    "rename": {
        "from": "mpc won't coerce to ComplexNumber",
        "to": "mpmath mpc won't coerce to ComplexNumber"
    },
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/11962#event-96589"
}
```



---

archive/issue_comments_128979.json:
```json
{
    "body": "<a id='comment:3'></a>\nA trivial fix would be:\n\n```diff\n\ndiff --git a/sage/rings/complex_number.pyx b/sage/rings/complex_number.pyx\n--- a/sage/rings/complex_number.pyx\n+++ b/sage/rings/complex_number.pyx\n@@ -148,10 +148,11 @@\n             elif isinstance(real, list) or isinstance(real, tuple):\n                 re, imag = real\n                 real = re\n-            elif isinstance(real, complex):\n-                real, imag = real.real, real.imag\n             else:\n-                imag = 0\n+                try:\n+                    real, imag = real.real, real.imag\n+                except AttributeError:\n+                    imag = 0\n         try:\n             R = parent._real_field()\n             rr = R(real)\n```\n\nBut perhaps there are better ways.",
    "created_at": "2011-10-29T19:24:22Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11962",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11962#issuecomment-128979",
    "user": "https://github.com/nexttime"
}
```

<a id='comment:3'></a>
A trivial fix would be:

```diff

diff --git a/sage/rings/complex_number.pyx b/sage/rings/complex_number.pyx
--- a/sage/rings/complex_number.pyx
+++ b/sage/rings/complex_number.pyx
@@ -148,10 +148,11 @@
             elif isinstance(real, list) or isinstance(real, tuple):
                 re, imag = real
                 real = re
-            elif isinstance(real, complex):
-                real, imag = real.real, real.imag
             else:
-                imag = 0
+                try:
+                    real, imag = real.real, real.imag
+                except AttributeError:
+                    imag = 0
         try:
             R = parent._real_field()
             rr = R(real)
```

But perhaps there are better ways.



---

archive/issue_comments_128980.json:
```json
{
    "body": "Milestone sage-4.7.3 deleted",
    "created_at": "2011-11-03T16:14:43Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11962",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11962#issuecomment-128980",
    "user": "https://github.com/jdemeyer"
}
```

Milestone sage-4.7.3 deleted



---

archive/issue_events_096590.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2011-11-03T16:14:43Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/11962",
    "milestone_number": null,
    "milestone_title": "sage-4.8",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/11962#event-96590"
}
```



---

archive/issue_events_096591.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2015-06-23T14:02:06Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/11962",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20interfaces",
    "label_color": "08517b",
    "label_name": "component: interfaces",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/11962#event-96591"
}
```



---

archive/issue_events_096592.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2015-06-23T14:02:06Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/11962",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20coercion",
    "label_color": "08517b",
    "label_name": "component: coercion",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/11962#event-96592"
}
```



---

archive/issue_events_096593.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2015-06-23T14:02:06Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/11962",
    "milestone_number": null,
    "milestone_title": "sage-6.8",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/11962#event-96593"
}
```



---

archive/issue_comments_128981.json:
```json
{
    "body": "**Changing assignee** from @williamstein to @robertwb.",
    "created_at": "2015-06-23T14:02:06Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11962",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11962#issuecomment-128981",
    "user": "https://github.com/jdemeyer"
}
```

**Changing assignee** from @williamstein to @robertwb.



---

archive/issue_comments_128982.json:
```json
{
    "body": "<a id='comment:6'></a>\n\n```diff\n--- a/sage/rings/complex_mpfr.pyx\n+++ b/sage/rings/complex_mpfr.pyx\n@@ -56,6 +56,7 @@\n from sage.libs.gsl.complex cimport *\n \n from sage.libs.mpmath.utils cimport mpfr_to_mpfval\n+from mpmath import mpc as mpmath_extmpc\n from sage.rings.integer_ring import ZZ\n \n from sage.misc.superseded import deprecated_function_alias\n@@ -961,7 +962,7 @@\n             elif isinstance(real, list) or isinstance(real, tuple):\n                 re, imag = real\n                 real = re\n-            elif isinstance(real, complex):\n+            elif isinstance(real, (complex, mpmath_extmpc)):\n                 real, imag = real.real, real.imag\n             elif type(real) is gmpy2.mpc:\n                 real, imag = (<gmpy2.mpc>real).real, (<gmpy2.mpc>real).imag\n```\n\n```\nsage: version()\n'SageMath version 9.6.beta7, Release Date: 2022-04-02'\nsage: import mpmath\nsage: z = mpmath.mpc(2, 3)\n....: z\nmpc(real='2.0', imag='3.0')\nsage: complex(z)\n(2+3j)\nsage: CC(z)\n2.00000000000000 + 3.00000000000000*I\n```",
    "created_at": "2022-04-03T14:24:19Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/11962",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/11962#issuecomment-128982",
    "user": "https://github.com/sheerluck"
}
```

<a id='comment:6'></a>

```diff
--- a/sage/rings/complex_mpfr.pyx
+++ b/sage/rings/complex_mpfr.pyx
@@ -56,6 +56,7 @@
 from sage.libs.gsl.complex cimport *
 
 from sage.libs.mpmath.utils cimport mpfr_to_mpfval
+from mpmath import mpc as mpmath_extmpc
 from sage.rings.integer_ring import ZZ
 
 from sage.misc.superseded import deprecated_function_alias
@@ -961,7 +962,7 @@
             elif isinstance(real, list) or isinstance(real, tuple):
                 re, imag = real
                 real = re
-            elif isinstance(real, complex):
+            elif isinstance(real, (complex, mpmath_extmpc)):
                 real, imag = real.real, real.imag
             elif type(real) is gmpy2.mpc:
                 real, imag = (<gmpy2.mpc>real).real, (<gmpy2.mpc>real).imag
```

```
sage: version()
'SageMath version 9.6.beta7, Release Date: 2022-04-02'
sage: import mpmath
sage: z = mpmath.mpc(2, 3)
....: z
mpc(real='2.0', imag='3.0')
sage: complex(z)
(2+3j)
sage: CC(z)
2.00000000000000 + 3.00000000000000*I
```
