# Issue 13114: Bug in is_isomorphic for multigraphs !

archive/issues_012942.json:
```json
{
    "body": "In order to test for isomorphism of multigraphs, multiple edges are converted to labeled edges whose label encodes the multiplicity.\nYeah. But if, on the other side, we chose to ignore edge labels for isomorphism then the information of multiplicity vanishes !\n\nThe bug has been reported by Stavros Garoufalidis.\n\n```\nsage: g = Graph([(0, 0, 0), (0, 2, 0), (1, 1, 0), (1, 2, 0), (1, 2, 1), (2, 2, 0)])                                                                                                                                                                                  \nsage: gg = Graph([(0, 0, 0), (0, 1, 0), (1, 1, 0), (1, 2, 0), (2, 2, 0), (2, 2, 1)])                                                                                                                                                                                 \nsage: g.is_isomorphic(gg)\nTrue\n```\n\nNathann\n\nAssignee: jason, ncohen, rlm\n\nCC:  @rlmill @dcoudert\n\nReviewer: David Coudert\n\nAuthor: Nathann Cohen\n\nMerged: sage-5.3.beta2\n\nResolution: fixed\n\nIssue created by migration from https://trac.sagemath.org/ticket/13114\n\n",
    "closed_at": "2012-08-14T07:03:52Z",
    "created_at": "2012-06-13T20:55:43Z",
    "labels": [
        "component: graph theory",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-5.3",
    "title": "Bug in is_isomorphic for multigraphs !",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/13114",
    "user": "https://github.com/nathanncohen"
}
```
In order to test for isomorphism of multigraphs, multiple edges are converted to labeled edges whose label encodes the multiplicity.
Yeah. But if, on the other side, we chose to ignore edge labels for isomorphism then the information of multiplicity vanishes !

The bug has been reported by Stavros Garoufalidis.

```
sage: g = Graph([(0, 0, 0), (0, 2, 0), (1, 1, 0), (1, 2, 0), (1, 2, 1), (2, 2, 0)])                                                                                                                                                                                  
sage: gg = Graph([(0, 0, 0), (0, 1, 0), (1, 1, 0), (1, 2, 0), (2, 2, 0), (2, 2, 1)])                                                                                                                                                                                 
sage: g.is_isomorphic(gg)
True
```

Nathann

Assignee: jason, ncohen, rlm

CC:  @rlmill @dcoudert

Reviewer: David Coudert

Author: Nathann Cohen

Merged: sage-5.3.beta2

Resolution: fixed

Issue created by migration from https://trac.sagemath.org/ticket/13114





---

archive/issue_events_049796.json:
```json
{
    "event": "renamed",
    "issue": "https://github.com/sagemath/sagetest/issues/13114",
    "rename": {
        "from": "Bug in is_isomorphic with unlabelled multiple edges !",
        "to": "Bug in is_isomorphic for multigraphs !"
    },
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/13114#event-49796"
}
```



---

archive/issue_comments_190749.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -3,4 +3,11 @@\n \n The bug has been reported by Stavros Garoufalidis.\n \n+```\n+sage: g = Graph([(0, 0, 0), (0, 2, 0), (1, 1, 0), (1, 2, 0), (1, 2, 1), (2, 2, 0)])                                                                                                                                                                                  \n+sage: gg = Graph([(0, 0, 0), (0, 1, 0), (1, 1, 0), (1, 2, 0), (2, 2, 0), (2, 2, 1)])                                                                                                                                                                                 \n+sage: g.is_isomorphic(gg)\n+True\n+```\n+\n Nathann\n``````\n",
    "created_at": "2012-06-13T21:05:44Z",
    "issue": "https://github.com/sagemath/sagetest/issues/13114",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/13114#issuecomment-190749",
    "user": "https://github.com/nathanncohen"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -3,4 +3,11 @@
 
 The bug has been reported by Stavros Garoufalidis.
 
+```
+sage: g = Graph([(0, 0, 0), (0, 2, 0), (1, 1, 0), (1, 2, 0), (1, 2, 1), (2, 2, 0)])                                                                                                                                                                                  
+sage: gg = Graph([(0, 0, 0), (0, 1, 0), (1, 1, 0), (1, 2, 0), (2, 2, 0), (2, 2, 1)])                                                                                                                                                                                 
+sage: g.is_isomorphic(gg)
+True
+```
+
 Nathann
``````




---

archive/issue_comments_190750.json:
```json
{
    "body": "Changing status from new to needs_review.",
    "created_at": "2012-06-13T21:05:44Z",
    "issue": "https://github.com/sagemath/sagetest/issues/13114",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/13114#issuecomment-190750",
    "user": "https://github.com/nathanncohen"
}
```

Changing status from new to needs_review.



---

archive/issue_comments_190751.json:
```json
{
    "body": "<a id='comment:2'></a>\nAttachment [trac_13114.patch](tarball://root/attachments/some-uuid/ticket13114/trac_13114.patch) by @jdemeyer created at 2012-07-27 20:39:23\n\nPlease fill in your real name as Author.",
    "created_at": "2012-07-27T20:39:23Z",
    "issue": "https://github.com/sagemath/sagetest/issues/13114",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/13114#issuecomment-190751",
    "user": "https://github.com/jdemeyer"
}
```

<a id='comment:2'></a>
Attachment [trac_13114.patch](tarball://root/attachments/some-uuid/ticket13114/trac_13114.patch) by @jdemeyer created at 2012-07-27 20:39:23

Please fill in your real name as Author.



---

archive/issue_comments_190752.json:
```json
{
    "body": "<a id='comment:3'></a>\nNathann is far away so I fill it for him.",
    "created_at": "2012-07-27T21:54:59Z",
    "issue": "https://github.com/sagemath/sagetest/issues/13114",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/13114#issuecomment-190752",
    "user": "https://github.com/dcoudert"
}
```

<a id='comment:3'></a>
Nathann is far away so I fill it for him.



---

archive/issue_comments_190753.json:
```json
{
    "body": "Changing author from \"\" to \"Nathann Cohen\"",
    "created_at": "2012-07-27T21:54:59Z",
    "issue": "https://github.com/sagemath/sagetest/issues/13114",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/13114#issuecomment-190753",
    "user": "https://github.com/dcoudert"
}
```

Changing author from "" to "Nathann Cohen"



---

archive/issue_comments_190754.json:
```json
{
    "body": "Changing status from needs_review to positive_review.",
    "created_at": "2012-08-04T10:16:26Z",
    "issue": "https://github.com/sagemath/sagetest/issues/13114",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/13114#issuecomment-190754",
    "user": "https://github.com/dcoudert"
}
```

Changing status from needs_review to positive_review.



---

archive/issue_comments_190755.json:
```json
{
    "body": "<a id='comment:4'></a>\nI did the following test, among others:\n\n```\nsage: g = Graph([(0, 0, 0), (0, 2, 0), (1, 1, 0), (1, 2, 0), (1, 2, 1), (2, 2, 0)])\nsage: gg = Graph([(0, 0, 0), (0, 1, 0), (1, 1, 0), (1, 2, 0), (2, 2, 0), (2, 2, 1)])\nsage: g.is_isomorphic(gg)\nFalse\nsage:\nsage: G = graphs.RandomGNP(10,.2)\nsage: H = Graph()\nsage: H.allow_multiple_edges(True)\nsage: for u,v in G.edges(labels=None):\n    H.add_edge(u,v,{'l':1})\n    H.add_edge(u,v,{'k':2})\n....:     \nsage: I = Graph()\nsage: I.allow_multiple_edges(True)\nsage: for u,v in G.edges(labels=None):\n    I.add_edge(u,v,1)\n    I.add_edge(u,v,2)\n....:     \nsage: I.is_isomorphic(G)\nFalse\nsage: I.is_isomorphic(H)\nTrue\nsage: I.is_isomorphic(H, edge_labels=True)\n(False, False)\nsage: I = H.copy()\nsage: I.is_isomorphic(H, edge_labels=True)\nTrue\nsage: I.edges()\n[(0, 1, {'k': 2}), (0, 1, {'l': 1}), (0, 8, {'k': 2}), (0, 8, {'l': 1}), (1, 4, {'k': 2}), (1, 4, {'l': 1}), (3, 9, {'k': 2}), (3, 9, {'l': 1}), (5, 6, {'k': 2}), (5, 6, {'l': 1}), (6, 8, {'k': 2}), (6, 8, {'l': 1}), (7, 8, {'k': 2}), (7, 8, {'l': 1}), (7, 9, {'k': 2}), (7, 9, {'l': 1})]\nsage: I.delete_edge(0,1)\nsage: I.edges()\n[(0, 1, {'l': 1}), (0, 2, {'k': 2}), (0, 2, {'l': 1}), (0, 8, {'k': 2}), (0, 8, {'l': 1}), (0, 9, {'k': 2}), (0, 9, {'l': 1}), (1, 3, {'k': 2}), (1, 3, {'l': 1}), (1, 4, {'k': 2}), (1, 4, {'l': 1}), (2, 5, {'k': 2}), (2, 5, {'l': 1}), (2, 6, {'k': 2}), (2, 6, {'l': 1}), (2, 8, {'k': 2}), (2, 8, {'l': 1}), (5, 6, {'k': 2}), (5, 6, {'l': 1}), (6, 8, {'k': 2}), (6, 8, {'l': 1})]\nsage: I.add_edge(0,1,{'x':2})\nsage: I.is_isomorphic(H)\nTrue\nsage: I.is_isomorphic(H, edge_labels=True)\n(False, False)\n```\n\nFor me the patch is working correctly. Build OK, functionality OK, long tests OK, docbuild OK.\nSo I give positive review !",
    "created_at": "2012-08-04T10:16:26Z",
    "issue": "https://github.com/sagemath/sagetest/issues/13114",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/13114#issuecomment-190755",
    "user": "https://github.com/dcoudert"
}
```

<a id='comment:4'></a>
I did the following test, among others:

```
sage: g = Graph([(0, 0, 0), (0, 2, 0), (1, 1, 0), (1, 2, 0), (1, 2, 1), (2, 2, 0)])
sage: gg = Graph([(0, 0, 0), (0, 1, 0), (1, 1, 0), (1, 2, 0), (2, 2, 0), (2, 2, 1)])
sage: g.is_isomorphic(gg)
False
sage:
sage: G = graphs.RandomGNP(10,.2)
sage: H = Graph()
sage: H.allow_multiple_edges(True)
sage: for u,v in G.edges(labels=None):
    H.add_edge(u,v,{'l':1})
    H.add_edge(u,v,{'k':2})
....:     
sage: I = Graph()
sage: I.allow_multiple_edges(True)
sage: for u,v in G.edges(labels=None):
    I.add_edge(u,v,1)
    I.add_edge(u,v,2)
....:     
sage: I.is_isomorphic(G)
False
sage: I.is_isomorphic(H)
True
sage: I.is_isomorphic(H, edge_labels=True)
(False, False)
sage: I = H.copy()
sage: I.is_isomorphic(H, edge_labels=True)
True
sage: I.edges()
[(0, 1, {'k': 2}), (0, 1, {'l': 1}), (0, 8, {'k': 2}), (0, 8, {'l': 1}), (1, 4, {'k': 2}), (1, 4, {'l': 1}), (3, 9, {'k': 2}), (3, 9, {'l': 1}), (5, 6, {'k': 2}), (5, 6, {'l': 1}), (6, 8, {'k': 2}), (6, 8, {'l': 1}), (7, 8, {'k': 2}), (7, 8, {'l': 1}), (7, 9, {'k': 2}), (7, 9, {'l': 1})]
sage: I.delete_edge(0,1)
sage: I.edges()
[(0, 1, {'l': 1}), (0, 2, {'k': 2}), (0, 2, {'l': 1}), (0, 8, {'k': 2}), (0, 8, {'l': 1}), (0, 9, {'k': 2}), (0, 9, {'l': 1}), (1, 3, {'k': 2}), (1, 3, {'l': 1}), (1, 4, {'k': 2}), (1, 4, {'l': 1}), (2, 5, {'k': 2}), (2, 5, {'l': 1}), (2, 6, {'k': 2}), (2, 6, {'l': 1}), (2, 8, {'k': 2}), (2, 8, {'l': 1}), (5, 6, {'k': 2}), (5, 6, {'l': 1}), (6, 8, {'k': 2}), (6, 8, {'l': 1})]
sage: I.add_edge(0,1,{'x':2})
sage: I.is_isomorphic(H)
True
sage: I.is_isomorphic(H, edge_labels=True)
(False, False)
```

For me the patch is working correctly. Build OK, functionality OK, long tests OK, docbuild OK.
So I give positive review !



---

archive/issue_comments_190756.json:
```json
{
    "body": "Changing reviewer from \"\" to \"David Coudert\"",
    "created_at": "2012-08-04T10:16:26Z",
    "issue": "https://github.com/sagemath/sagetest/issues/13114",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/13114#issuecomment-190756",
    "user": "https://github.com/dcoudert"
}
```

Changing reviewer from "" to "David Coudert"



---

archive/issue_events_049797.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2012-08-14T07:03:52Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/13114",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/13114#event-49797"
}
```



---

archive/issue_comments_190757.json:
```json
{
    "body": "Resolution: fixed",
    "created_at": "2012-08-14T07:03:52Z",
    "issue": "https://github.com/sagemath/sagetest/issues/13114",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/13114#issuecomment-190757",
    "user": "https://github.com/jdemeyer"
}
```

Resolution: fixed



---

archive/issue_comments_190758.json:
```json
{
    "body": "Changing merged from \"\" to \"sage-5.3.beta2\"",
    "created_at": "2012-08-14T07:03:52Z",
    "issue": "https://github.com/sagemath/sagetest/issues/13114",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/13114#issuecomment-190758",
    "user": "https://github.com/jdemeyer"
}
```

Changing merged from "" to "sage-5.3.beta2"
