# Issue 20089: arc cosine surprising numeric results

archive/issues_019852.json:
```json
{
    "body": "Here under the hood, `RR.acos` gets called. I think this should return meaningful values even if the value is outside the domain.\n\n```\nsage: cos(1.*I)\n1.54308063481524        <--- CC element\nsage: acos(_)\n1.00000000000000*I\nsage: acos(1.54308063481524)\nNaN\nsage: acos(CC(1.54308063481524))\n0.999999999999997*I\nsage: acos(RR(1.54308063481524))\nNaN\n```\nNeither SymPy nor Pari nor Maxima do this: \n\n```\nIn [1]: acos(1.543)\nOut[1]: 0.999931383282944\u22c5\u2148\n? acos(1.543)\n%1 = 0.99993138328294395810833497263866793658*I\n(%i1) acos(1.543);\n(%o1)                        0.9999313832829438 %i\n```\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/20089\n\n",
    "closed_at": "2017-01-21T18:03:11Z",
    "created_at": "2016-02-21T08:13:57Z",
    "labels": [
        "component: symbolics",
        "bug",
        "invalid"
    ],
    "title": "arc cosine surprising numeric results",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/20089",
    "user": "https://github.com/rwst"
}
```
Here under the hood, `RR.acos` gets called. I think this should return meaningful values even if the value is outside the domain.

```
sage: cos(1.*I)
1.54308063481524        <--- CC element
sage: acos(_)
1.00000000000000*I
sage: acos(1.54308063481524)
NaN
sage: acos(CC(1.54308063481524))
0.999999999999997*I
sage: acos(RR(1.54308063481524))
NaN
```
Neither SymPy nor Pari nor Maxima do this: 

```
In [1]: acos(1.543)
Out[1]: 0.999931383282944⋅ⅈ
? acos(1.543)
%1 = 0.99993138328294395810833497263866793658*I
(%i1) acos(1.543);
(%o1)                        0.9999313832829438 %i
```


Issue created by migration from https://trac.sagemath.org/ticket/20089





---

archive/issue_comments_290566.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -12,12 +12,14 @@\n sage: acos(RR(1.54308063481524))\n NaN\n ```\n-Neither SymPy nor Pari do this: \n+Neither SymPy nor Pari nor Maxima do this: \n \n ```\n In [1]: acos(1.543)\n Out[1]: 0.999931383282944\u22c5\u2148\n ? acos(1.543)\n %1 = 0.99993138328294395810833497263866793658*I\n+(%i1) acos(1.543);\n+(%o1)                        0.9999313832829438 %i\n ```\n \n``````\n",
    "created_at": "2016-02-21T08:17:49Z",
    "issue": "https://github.com/sagemath/sagetest/issues/20089",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/20089#issuecomment-290566",
    "user": "https://github.com/rwst"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -12,12 +12,14 @@
 sage: acos(RR(1.54308063481524))
 NaN
 ```
-Neither SymPy nor Pari do this: 
+Neither SymPy nor Pari nor Maxima do this: 
 
 ```
 In [1]: acos(1.543)
 Out[1]: 0.999931383282944⋅ⅈ
 ? acos(1.543)
 %1 = 0.99993138328294395810833497263866793658*I
+(%i1) acos(1.543);
+(%o1)                        0.9999313832829438 %i
 ```
 
``````




---

archive/issue_comments_290567.json:
```json
{
    "body": "Replying to [ticket:20089 rws]:\n> why are floats of type `RR` not `CC`?\n\n\nAre you suggesting\n\n```\nsage: parent(1.0)\nComplex Field with 53 bits of precision\n```",
    "created_at": "2016-02-21T08:36:04Z",
    "issue": "https://github.com/sagemath/sagetest/issues/20089",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/20089#issuecomment-290567",
    "user": "https://github.com/jdemeyer"
}
```

Replying to [ticket:20089 rws]:
> why are floats of type `RR` not `CC`?


Are you suggesting

```
sage: parent(1.0)
Complex Field with 53 bits of precision
```



---

archive/issue_comments_290568.json:
```json
{
    "body": "<a id='comment:3'></a>\nThe alternative would be to return complex in `RR.acos`.",
    "created_at": "2016-02-21T08:58:11Z",
    "issue": "https://github.com/sagemath/sagetest/issues/20089",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/20089#issuecomment-290568",
    "user": "https://github.com/rwst"
}
```

<a id='comment:3'></a>
The alternative would be to return complex in `RR.acos`.



---

archive/issue_comments_290569.json:
```json
{
    "body": "<a id='comment:4'></a>\nIt's also a symptom of inconsistency in `symbolic/pynac.pyx` where we call `RR.function`, i.e. mpfr but also mpmath directly. Do you have a preference? Maybe it's best to use mpmath throughout in `pynac.pyx`.",
    "created_at": "2016-02-21T09:13:33Z",
    "issue": "https://github.com/sagemath/sagetest/issues/20089",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/20089#issuecomment-290569",
    "user": "https://github.com/rwst"
}
```

<a id='comment:4'></a>
It's also a symptom of inconsistency in `symbolic/pynac.pyx` where we call `RR.function`, i.e. mpfr but also mpmath directly. Do you have a preference? Maybe it's best to use mpmath throughout in `pynac.pyx`.



---

archive/issue_comments_290570.json:
```json
{
    "body": "<a id='comment:5'></a>\nI have come to a conclusion, and adapted the ticket description.",
    "created_at": "2016-03-05T07:04:59Z",
    "issue": "https://github.com/sagemath/sagetest/issues/20089",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/20089#issuecomment-290570",
    "user": "https://github.com/rwst"
}
```

<a id='comment:5'></a>
I have come to a conclusion, and adapted the ticket description.



---

archive/issue_comments_290571.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -1,8 +1,8 @@\n-The default `RR` type of input FP numbers is surprising. If we have complex variables as default, why are floats of type `RR` not `CC`?\n+Here under the hood, `RR.acos` gets called. I think this should return meaningful values even if the value is outside the domain.\n \n ```\n sage: cos(1.*I)\n-1.54308063481524\n+1.54308063481524        <--- CC element\n sage: acos(_)\n 1.00000000000000*I\n sage: acos(1.54308063481524)\n``````\n",
    "created_at": "2016-03-05T07:04:59Z",
    "issue": "https://github.com/sagemath/sagetest/issues/20089",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/20089#issuecomment-290571",
    "user": "https://github.com/rwst"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -1,8 +1,8 @@
-The default `RR` type of input FP numbers is surprising. If we have complex variables as default, why are floats of type `RR` not `CC`?
+Here under the hood, `RR.acos` gets called. I think this should return meaningful values even if the value is outside the domain.
 
 ```
 sage: cos(1.*I)
-1.54308063481524
+1.54308063481524        <--- CC element
 sage: acos(_)
 1.00000000000000*I
 sage: acos(1.54308063481524)
``````




---

archive/issue_events_180348.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2016-08-03T08:32:14Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sagetest/issues/20089",
    "label": "needs review",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/20089#event-180348"
}
```



---

archive/issue_events_180349.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2016-08-03T08:32:14Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/20089",
    "milestone": "sage-7.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/20089#event-180349"
}
```



---

archive/issue_comments_290572.json:
```json
{
    "body": "<a id='comment:6'></a>\nOk, since this is at least consistent with arb behaviour I'll file this as oddity not bug. It would be interesting to know what the big Ms return.",
    "created_at": "2016-08-03T08:32:14Z",
    "issue": "https://github.com/sagemath/sagetest/issues/20089",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/20089#issuecomment-290572",
    "user": "https://github.com/rwst"
}
```

<a id='comment:6'></a>
Ok, since this is at least consistent with arb behaviour I'll file this as oddity not bug. It would be interesting to know what the big Ms return.



---

archive/issue_events_180350.json:
```json
{
    "actor": "https://github.com/paulmasson",
    "created_at": "2016-09-20T01:29:09Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sagetest/issues/20089",
    "label": "needs review",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/20089#event-180350"
}
```



---

archive/issue_events_180351.json:
```json
{
    "actor": "https://github.com/paulmasson",
    "created_at": "2016-09-20T01:29:09Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sagetest/issues/20089",
    "label": "positive review",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/20089#event-180351"
}
```



---

archive/issue_events_180352.json:
```json
{
    "actor": "https://github.com/vbraun",
    "created_at": "2017-01-21T18:03:11Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sagetest/issues/20089",
    "label": "positive review",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/20089#event-180352"
}
```



---

archive/issue_events_180353.json:
```json
{
    "actor": "https://github.com/vbraun",
    "created_at": "2017-01-21T18:03:11Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/20089",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/20089#event-180353"
}
```
