# Issue 20746: Pushout for real embedded number fields

archive/issues_020509.json:
```json
{
    "body": "Implement the following pushout\n\n```\nsage: K.<a> = NumberField(x^2 - 3, embedding=AA(3)**(1/2))\nsage: L.<b> = NumberField(x^2 - 2, embedding=AA(2)**(1/2))\nsage: a+b\n3.146264369941973?\nsage: parent(_)\nAlgebraic Real Field\nsage: a < b\nFalse\n```\n\nCC:  @jdemeyer @tscrim\n\nKeywords: days74, days84\n\nBranch/Commit: 4a52745b734543ca8e65f2ac3050c9a73f223edd\n\nReviewer: Jean-Philippe Labb\u00e9\n\nAuthor: Vincent Delecroix\n\nResolution: fixed\n\nIssue created by migration from https://trac.sagemath.org/ticket/20746\n\n",
    "closed_at": "2017-03-08T18:45:56Z",
    "created_at": "2016-06-01T10:28:19Z",
    "labels": [
        "component: number fields"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-7.3",
    "title": "Pushout for real embedded number fields",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/20746",
    "user": "https://github.com/videlec"
}
```
Implement the following pushout

```
sage: K.<a> = NumberField(x^2 - 3, embedding=AA(3)**(1/2))
sage: L.<b> = NumberField(x^2 - 2, embedding=AA(2)**(1/2))
sage: a+b
3.146264369941973?
sage: parent(_)
Algebraic Real Field
sage: a < b
False
```

CC:  @jdemeyer @tscrim

Keywords: days74, days84

Branch/Commit: 4a52745b734543ca8e65f2ac3050c9a73f223edd

Reviewer: Jean-Philippe LabbÃ©

Author: Vincent Delecroix

Resolution: fixed

Issue created by migration from https://trac.sagemath.org/ticket/20746





---

archive/issue_comments_301374.json:
```json
{
    "body": "Changing status from new to needs_review.",
    "created_at": "2016-06-01T10:29:10Z",
    "issue": "https://github.com/sagemath/sagetest/issues/20746",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/20746#issuecomment-301374",
    "user": "https://github.com/videlec"
}
```

Changing status from new to needs_review.



---

archive/issue_comments_301375.json:
```json
{
    "body": "<a id='comment:1'></a>New commits:",
    "created_at": "2016-06-01T10:29:10Z",
    "issue": "https://github.com/sagemath/sagetest/issues/20746",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/20746#issuecomment-301375",
    "user": "https://github.com/videlec"
}
```

<a id='comment:1'></a>New commits:



---

archive/issue_comments_301376.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -7,9 +7,9 @@\n 3.146264369941973?\n sage: parent(_)\n Algebraic Real Field\n+sage: a < b\n+False\n ```\n-\n-Keywords: days74\n \n Author: Vincent Delecroix\n \n``````\n",
    "created_at": "2016-06-01T10:34:13Z",
    "issue": "https://github.com/sagemath/sagetest/issues/20746",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/20746#issuecomment-301376",
    "user": "https://github.com/videlec"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -7,9 +7,9 @@
 3.146264369941973?
 sage: parent(_)
 Algebraic Real Field
+sage: a < b
+False
 ```
-
-Keywords: days74
 
 Author: Vincent Delecroix
 
``````




---

archive/issue_comments_301377.json:
```json
{
    "body": "Changing status from needs_review to needs_work.",
    "created_at": "2016-06-01T11:23:15Z",
    "issue": "https://github.com/sagemath/sagetest/issues/20746",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/20746#issuecomment-301377",
    "user": "https://github.com/pjbruin"
}
```

Changing status from needs_review to needs_work.



---

archive/issue_comments_301378.json:
```json
{
    "body": "<a id='comment:4'></a>Isn't it a bit drastic to declare `AA` to be the pushout rather than to create a suitable number field?  I think a better solution would be to use the existing `composite_fields()` method, which respects embeddings:\n\n```diff\n--- a/src/sage/rings/number_field/number_field_base.pyx\n+++ b/src/sage/rings/number_field/number_field_base.pyx\n@@ -350,3 +350,7 @@ cdef class NumberField(Field):\n         else:\n             raise ValueError(\"No embedding set. You need to specify a a real embedding.\")\n \n+    def _pushout_(self, other):\n+        if (isinstance(other, NumberField) and self._embedded_real and\n+            (<NumberField>other)._embedded_real):\n+            return self.composite_fields(other)[0]\n```\nThis makes the examples in the current branch work just as well (you can see the numerical values after coercing into `AA`).",
    "created_at": "2016-06-01T11:23:15Z",
    "issue": "https://github.com/sagemath/sagetest/issues/20746",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/20746#issuecomment-301378",
    "user": "https://github.com/pjbruin"
}
```

<a id='comment:4'></a>Isn't it a bit drastic to declare `AA` to be the pushout rather than to create a suitable number field?  I think a better solution would be to use the existing `composite_fields()` method, which respects embeddings:

```diff
--- a/src/sage/rings/number_field/number_field_base.pyx
+++ b/src/sage/rings/number_field/number_field_base.pyx
@@ -350,3 +350,7 @@ cdef class NumberField(Field):
         else:
             raise ValueError("No embedding set. You need to specify a a real embedding.")
 
+    def _pushout_(self, other):
+        if (isinstance(other, NumberField) and self._embedded_real and
+            (<NumberField>other)._embedded_real):
+            return self.composite_fields(other)[0]
```
This makes the examples in the current branch work just as well (you can see the numerical values after coercing into `AA`).



---

archive/issue_comments_301379.json:
```json
{
    "body": "<a id='comment:5'></a>Fair enough. Though it is more expensive.",
    "created_at": "2016-06-01T12:00:57Z",
    "issue": "https://github.com/sagemath/sagetest/issues/20746",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/20746#issuecomment-301379",
    "user": "https://github.com/videlec"
}
```

<a id='comment:5'></a>Fair enough. Though it is more expensive.



---

archive/issue_comments_301380.json:
```json
{
    "body": "<a id='comment:6'></a>And this is order dependent\n\n```\nsage: K.<a> = NumberField(x^2 - 3, embedding=AA(3)**(1/2))\nsage: L.<b> = NumberField(x^2 - 2, embedding=AA(2)**(1/2))\nsage: a+b\nab^3 - 10*ab\n```\nversus\n\n```\nsage: K.<a> = NumberField(x^2 - 3, embedding=AA(3)**(1/2))\nsage: L.<b> = NumberField(x^2 - 2, embedding=AA(2)**(1/2))\nsage: b+a\n-ba^3 + 10*ba\n```",
    "created_at": "2016-06-01T12:08:05Z",
    "issue": "https://github.com/sagemath/sagetest/issues/20746",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/20746#issuecomment-301380",
    "user": "https://github.com/videlec"
}
```

<a id='comment:6'></a>And this is order dependent

```
sage: K.<a> = NumberField(x^2 - 3, embedding=AA(3)**(1/2))
sage: L.<b> = NumberField(x^2 - 2, embedding=AA(2)**(1/2))
sage: a+b
ab^3 - 10*ab
```
versus

```
sage: K.<a> = NumberField(x^2 - 3, embedding=AA(3)**(1/2))
sage: L.<b> = NumberField(x^2 - 2, embedding=AA(2)**(1/2))
sage: b+a
-ba^3 + 10*ba
```



---

archive/issue_comments_301381.json:
```json
{
    "body": "Changing status from needs_work to needs_review.",
    "created_at": "2016-06-02T04:20:05Z",
    "issue": "https://github.com/sagemath/sagetest/issues/20746",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/20746#issuecomment-301381",
    "user": "https://github.com/videlec"
}
```

Changing status from needs_work to needs_review.



---

archive/issue_comments_301382.json:
```json
{
    "body": "<a id='comment:8'></a>This coercion has its advantages:\n\n- makes it possible to do arithmetic operations with elements with two different `NumberFields` as parents. Right now returns a TypeError:\n\n```\n    sage: J = NumberField(x^2 - 2,'s')\n    sage: s = J.gens()[0]\n    sage: K = NumberField(x^3 - 2,'t')\n    sage: t = K.gens()[0]\n    sage: s * t\n    Traceback (most recent call last):\n    ...\n    TypeError: unsupported operand parent(s) for *: ...\n```\n- It is lazy, it does have to compute the join.\n\nDepending on the usage, one may want to get the join of the fields using `composite_field`, this introduces another variable and is order dependant. I guess that if one wants to do computations on the long run with that field, one would already use the right field from start.\n\nIMHO, this ticket already fixes an operation that one would naturally want to have at hand. So, I would make this a positive review.",
    "created_at": "2017-03-05T23:33:56Z",
    "issue": "https://github.com/sagemath/sagetest/issues/20746",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/20746#issuecomment-301382",
    "user": "https://github.com/jplab"
}
```

<a id='comment:8'></a>This coercion has its advantages:

- makes it possible to do arithmetic operations with elements with two different `NumberFields` as parents. Right now returns a TypeError:

```
    sage: J = NumberField(x^2 - 2,'s')
    sage: s = J.gens()[0]
    sage: K = NumberField(x^3 - 2,'t')
    sage: t = K.gens()[0]
    sage: s * t
    Traceback (most recent call last):
    ...
    TypeError: unsupported operand parent(s) for *: ...
```
- It is lazy, it does have to compute the join.

Depending on the usage, one may want to get the join of the fields using `composite_field`, this introduces another variable and is order dependant. I guess that if one wants to do computations on the long run with that field, one would already use the right field from start.

IMHO, this ticket already fixes an operation that one would naturally want to have at hand. So, I would make this a positive review.



---

archive/issue_comments_301383.json:
```json
{
    "body": "Changing status from needs_review to positive_review.",
    "created_at": "2017-03-05T23:34:10Z",
    "issue": "https://github.com/sagemath/sagetest/issues/20746",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/20746#issuecomment-301383",
    "user": "https://github.com/jplab"
}
```

Changing status from needs_review to positive_review.



---

archive/issue_comments_301384.json:
```json
{
    "body": "Changing keywords from \"days74\" to \"days74, days84\".",
    "created_at": "2017-03-05T23:35:01Z",
    "issue": "https://github.com/sagemath/sagetest/issues/20746",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/20746#issuecomment-301384",
    "user": "https://github.com/jplab"
}
```

Changing keywords from "days74" to "days74, days84".



---

archive/issue_comments_301385.json:
```json
{
    "body": "Resolution: fixed",
    "created_at": "2017-03-08T18:45:56Z",
    "issue": "https://github.com/sagemath/sagetest/issues/20746",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/20746#issuecomment-301385",
    "user": "https://github.com/vbraun"
}
```

Resolution: fixed



---

archive/issue_events_055744.json:
```json
{
    "actor": "https://github.com/vbraun",
    "created_at": "2017-03-08T18:45:56Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/20746",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/20746#event-55744"
}
```
