# Issue 6428: Large exponents overflow to negative in polydict ring

archive/issues_006428.json:
```json
{
    "body": "Large exponents overflow to negative in polydict ring:\n\n\n```\nsage: from sage.rings.polynomial.multi_polynomial_ring import \\\n...       MPolynomialRing_polydict\nsage: ring = MPolynomialRing_polydict(ZZ, 3, ['a','b','c'], \"lex\")\nsage: a = ring.gens()[0]\n\nsage: a^(2^31-1)\na^2147483647\n\nsage: a^(2^31)\na^-2147483648\n\nsage: a^(2^32)\n1\n\n```\n\n\nAssignee: tbd\n\nResolution: fixed\n\nAuthor: Willem Jan Palenstijn\n\nReviewer: Sebastian Pancratz\n\nMerged: sage-4.3.2.alpha0\n\nIssue created by migration from https://trac.sagemath.org/ticket/6428\n\n",
    "closed_at": "2010-01-23T09:05:39Z",
    "created_at": "2009-06-26T18:26:31Z",
    "labels": [
        "component: commutative algebra",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-4.3.2",
    "title": "Large exponents overflow to negative in polydict ring",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/6428",
    "user": "https://trac.sagemath.org/admin/accounts/users/broune"
}
```
Large exponents overflow to negative in polydict ring:


```
sage: from sage.rings.polynomial.multi_polynomial_ring import \
...       MPolynomialRing_polydict
sage: ring = MPolynomialRing_polydict(ZZ, 3, ['a','b','c'], "lex")
sage: a = ring.gens()[0]

sage: a^(2^31-1)
a^2147483647

sage: a^(2^31)
a^-2147483648

sage: a^(2^32)
1

```


Assignee: tbd

Resolution: fixed

Author: Willem Jan Palenstijn

Reviewer: Sebastian Pancratz

Merged: sage-4.3.2.alpha0

Issue created by migration from https://trac.sagemath.org/ticket/6428





---

archive/issue_comments_053074.json:
```json
{
    "body": "Description changed:\n```diff\n--- \n+++ \n@@ -1,18 +1,23 @@\n Large exponents overflow to negative in polydict ring:\n \n+\n+```\n sage: from sage.rings.polynomial.multi_polynomial_ring import \\\n ...       MPolynomialRing_polydict\n sage: ring = MPolynomialRing_polydict(ZZ, 3, ['a','b','c'], \"lex\")\n sage: a = ring.gens()[0]\n \n-sage: a<sup>(2</sup>31-1)\n+sage: a^(2^31-1)\n a^2147483647\n \n-sage: a<sup>(2</sup>31)\n+sage: a^(2^31)\n a^-2147483648\n \n-sage: a<sup>(2</sup>32)\n+sage: a^(2^32)\n 1\n+\n+```\n+\n \n Comment: 1\n \n```\n",
    "created_at": "2009-06-26T18:29:07Z",
    "issue": "https://github.com/sagemath/sagetest/issues/6428",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/6428#issuecomment-53074",
    "user": "https://trac.sagemath.org/admin/accounts/users/broune"
}
```

Description changed:
```diff
--- 
+++ 
@@ -1,18 +1,23 @@
 Large exponents overflow to negative in polydict ring:
 
+
+```
 sage: from sage.rings.polynomial.multi_polynomial_ring import \
 ...       MPolynomialRing_polydict
 sage: ring = MPolynomialRing_polydict(ZZ, 3, ['a','b','c'], "lex")
 sage: a = ring.gens()[0]
 
-sage: a<sup>(2</sup>31-1)
+sage: a^(2^31-1)
 a^2147483647
 
-sage: a<sup>(2</sup>31)
+sage: a^(2^31)
 a^-2147483648
 
-sage: a<sup>(2</sup>32)
+sage: a^(2^32)
 1
+
+```
+
 
 Comment: 1
 
```




---

archive/issue_comments_053075.json:
```json
{
    "body": "<a id='comment:1'></a>Fixed layout.",
    "created_at": "2009-06-26T18:29:07Z",
    "issue": "https://github.com/sagemath/sagetest/issues/6428",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/6428#issuecomment-53075",
    "user": "https://trac.sagemath.org/admin/accounts/users/broune"
}
```

<a id='comment:1'></a>Fixed layout.



---

archive/issue_events_015154.json:
```json
{
    "actor": "https://github.com/aghitza",
    "created_at": "2009-11-15T13:14:19Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/6428",
    "milestone": "sage-4.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/6428#event-15154"
}
```



---

archive/issue_comments_053076.json:
```json
{
    "body": "Changing component from algebra to commutative algebra.",
    "created_at": "2009-11-15T13:14:19Z",
    "issue": "https://github.com/sagemath/sagetest/issues/6428",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/6428#issuecomment-53076",
    "user": "https://github.com/aghitza"
}
```

Changing component from algebra to commutative algebra.



---

archive/issue_comments_053077.json:
```json
{
    "body": "<a id='comment:3'></a>This is still a bug.   Ick!\n\n```\nsage: R.<y,z> =Frac(QQ['x'])[]\nsage: y^(2^32)\n1\nsage: y^(2^32-1)\ny^-1\nsage: y^(2^31)\ny^-2147483648\n```",
    "created_at": "2010-01-18T01:39:18Z",
    "issue": "https://github.com/sagemath/sagetest/issues/6428",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/6428#issuecomment-53077",
    "user": "https://github.com/williamstein"
}
```

<a id='comment:3'></a>This is still a bug.   Ick!

```
sage: R.<y,z> =Frac(QQ['x'])[]
sage: y^(2^32)
1
sage: y^(2^32-1)
y^-1
sage: y^(2^31)
y^-2147483648
```



---

archive/issue_comments_053078.json:
```json
{
    "body": "<a id='comment:4'></a>Here is better input to replicate what is at the core of the problem:\n\n```\nsage: a = sage.rings.polynomial.polydict.PolyDict({(2147483647r,):1r})\nsage: a*a\nPolyDict with representation {(-2,): 1}\n```",
    "created_at": "2010-01-18T09:59:31Z",
    "issue": "https://github.com/sagemath/sagetest/issues/6428",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/6428#issuecomment-53078",
    "user": "https://github.com/williamstein"
}
```

<a id='comment:4'></a>Here is better input to replicate what is at the core of the problem:

```
sage: a = sage.rings.polynomial.polydict.PolyDict({(2147483647r,):1r})
sage: a*a
PolyDict with representation {(-2,): 1}
```



---

archive/issue_comments_053079.json:
```json
{
    "body": "Attachment [trac_6428.patch](tarball://root/attachments/some-uuid/ticket6428/trac_6428.patch) by @williamstein created at 2010-01-18 10:19:17",
    "created_at": "2010-01-18T10:19:17Z",
    "issue": "https://github.com/sagemath/sagetest/issues/6428",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/6428#issuecomment-53079",
    "user": "https://github.com/williamstein"
}
```

Attachment [trac_6428.patch](tarball://root/attachments/some-uuid/ticket6428/trac_6428.patch) by @williamstein created at 2010-01-18 10:19:17



---

archive/issue_comments_053080.json:
```json
{
    "body": "Changing status from new to needs_review.",
    "created_at": "2010-01-18T10:19:29Z",
    "issue": "https://github.com/sagemath/sagetest/issues/6428",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/6428#issuecomment-53080",
    "user": "https://github.com/williamstein"
}
```

Changing status from new to needs_review.



---

archive/issue_comments_053081.json:
```json
{
    "body": "<a id='comment:6'></a>This patch simply reports an error if this happens. I thought the polydict ring was supposed to allow arbitrary precision exponents.",
    "created_at": "2010-01-18T18:58:53Z",
    "issue": "https://github.com/sagemath/sagetest/issues/6428",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/6428#issuecomment-53081",
    "user": "https://trac.sagemath.org/admin/accounts/users/broune"
}
```

<a id='comment:6'></a>This patch simply reports an error if this happens. I thought the polydict ring was supposed to allow arbitrary precision exponents.



---

archive/issue_comments_053082.json:
```json
{
    "body": "<a id='comment:7'></a>> This patch simply reports an error if this happens. I thought the polydict\n> ring was supposed to allow arbitrary precision exponents. \n\n\nSince in the entire Cython implementation of polydict, the exponents are represented internally as C ints there is no way it is supposed to represent arbitrary precision exponents.   One could write something that does arbitrary exponents, but that ETuple stuff simply isn't such a thing.",
    "created_at": "2010-01-18T22:35:52Z",
    "issue": "https://github.com/sagemath/sagetest/issues/6428",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/6428#issuecomment-53082",
    "user": "https://github.com/williamstein"
}
```

<a id='comment:7'></a>> This patch simply reports an error if this happens. I thought the polydict
> ring was supposed to allow arbitrary precision exponents. 


Since in the entire Cython implementation of polydict, the exponents are represented internally as C ints there is no way it is supposed to represent arbitrary precision exponents.   One could write something that does arbitrary exponents, but that ETuple stuff simply isn't such a thing.



---

archive/issue_comments_053083.json:
```json
{
    "body": "<a id='comment:8'></a>By the way, for basic arithmetic, the symbolic ring supports arbitrary exponents. \n\n```\nsage: var('y')\ny\nsage: y^(2^32)\ny^4294967296\nsage: y^(2^50)\ny^1125899906842624\nsage: y^(2^50+y)\ny^(y + 1125899906842624)\n```",
    "created_at": "2010-01-18T22:37:03Z",
    "issue": "https://github.com/sagemath/sagetest/issues/6428",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/6428#issuecomment-53083",
    "user": "https://github.com/williamstein"
}
```

<a id='comment:8'></a>By the way, for basic arithmetic, the symbolic ring supports arbitrary exponents. 

```
sage: var('y')
y
sage: y^(2^32)
y^4294967296
sage: y^(2^50)
y^1125899906842624
sage: y^(2^50+y)
y^(y + 1125899906842624)
```



---

archive/issue_comments_053084.json:
```json
{
    "body": "<a id='comment:9'></a>Attachment [6428_ETuple_overflow.patch](tarball://root/attachments/some-uuid/ticket6428/6428_ETuple_overflow.patch) by @wjp created at 2010-01-21 00:32:37\n\nI added a new patch (to be applied instead of the old one) that also handles negative exponents. (The previous patch broke LaurentPolynomials).",
    "created_at": "2010-01-21T00:32:37Z",
    "issue": "https://github.com/sagemath/sagetest/issues/6428",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/6428#issuecomment-53084",
    "user": "https://github.com/wjp"
}
```

<a id='comment:9'></a>Attachment [6428_ETuple_overflow.patch](tarball://root/attachments/some-uuid/ticket6428/6428_ETuple_overflow.patch) by @wjp created at 2010-01-21 00:32:37

I added a new patch (to be applied instead of the old one) that also handles negative exponents. (The previous patch broke LaurentPolynomials).



---

archive/issue_events_015155.json:
```json
{
    "actor": "https://github.com/wjp",
    "created_at": "2010-01-21T00:32:37Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/6428",
    "milestone": "sage-4.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/6428#event-15155"
}
```



---

archive/issue_events_015156.json:
```json
{
    "actor": "https://github.com/wjp",
    "created_at": "2010-01-21T00:32:37Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/6428",
    "milestone": "sage-4.3.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/6428#event-15156"
}
```



---

archive/issue_comments_053085.json:
```json
{
    "body": "<a id='comment:10'></a>This now passes all doctests.",
    "created_at": "2010-01-21T00:57:18Z",
    "issue": "https://github.com/sagemath/sagetest/issues/6428",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/6428#issuecomment-53085",
    "user": "https://trac.sagemath.org/admin/accounts/users/spancratz"
}
```

<a id='comment:10'></a>This now passes all doctests.



---

archive/issue_comments_053086.json:
```json
{
    "body": "Changing status from needs_review to positive_review.",
    "created_at": "2010-01-21T01:02:16Z",
    "issue": "https://github.com/sagemath/sagetest/issues/6428",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/6428#issuecomment-53086",
    "user": "https://trac.sagemath.org/admin/accounts/users/spancratz"
}
```

Changing status from needs_review to positive_review.



---

archive/issue_comments_053087.json:
```json
{
    "body": "Resolution: fixed",
    "created_at": "2010-01-23T09:05:39Z",
    "issue": "https://github.com/sagemath/sagetest/issues/6428",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/6428#issuecomment-53087",
    "user": "https://trac.sagemath.org/admin/accounts/users/mvngu"
}
```

Resolution: fixed



---

archive/issue_comments_053088.json:
```json
{
    "body": "<a id='comment:14'></a>Merged [6428_ETuple_overflow.patch](http://trac.sagemath.org/sage_trac/attachment/ticket/6428/6428_ETuple_overflow.patch).",
    "created_at": "2010-01-23T09:05:39Z",
    "issue": "https://github.com/sagemath/sagetest/issues/6428",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/6428#issuecomment-53088",
    "user": "https://trac.sagemath.org/admin/accounts/users/mvngu"
}
```

<a id='comment:14'></a>Merged [6428_ETuple_overflow.patch](http://trac.sagemath.org/sage_trac/attachment/ticket/6428/6428_ETuple_overflow.patch).



---

archive/issue_events_015157.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/mvngu",
    "created_at": "2010-01-23T09:05:39Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/6428",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/6428#event-15157"
}
```
