# Issue 5065: elliptic curve torsion subgroup doesn't know its identity

archive/issues_005065.json:
```json
{
    "body": "The torsion subgroup of an elliptic curve appears to be quite broken -- it barfs when trying to coerce in 0,\n\n```\nsage: E = EllipticCurve(1)\nsage: T = E.torsion_subgroup()\nsage: T(0)\n...\n...\nTypeError: Argument x (= 0) is of wrong type.\n```\n\nfurther, it returns a mysterious 1 when coercing in a 1\n\n```\nsage: a = T(1); a\n1\nsage: b = T.gens()[0]-T.gens()[0]; b\n(0 : 1 : 0)\nsage: a+b\nTypeError: unsupported operand parent(s) for '+': 'Abelian group of points on Elliptic Curve defined by y^2 + x*y + y = x^3 - 19*x + 26 over Rational Field' and 'Torsion Subgroup isomorphic to Multiplicative Abelian Group isomorphic to C6 x C2 associated to the Elliptic Curve defined by y^2 + x*y + y = x^3 - 19*x + 26 over Rational Field'\n```\n\nYet, it's all cool with the original curve.\n\n```\nsage: E(0)\n(0 : 1 : 0)\nsage: E(1)\n...\n...\nTypeError: v (=(1,)) must have 3 components\nsage: \n```\n\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/5065\n\n",
    "closed_at": "2010-08-14T16:47:11Z",
    "created_at": "2009-01-23T08:29:47Z",
    "labels": [
        "component: elliptic curves",
        "minor",
        "bug",
        "duplicate"
    ],
    "title": "elliptic curve torsion subgroup doesn't know its identity",
    "type": "issue",
    "url": "https://github.com/sagemath/sage/issues/5065",
    "user": "https://trac.sagemath.org/admin/accounts/users/boothby"
}
```
The torsion subgroup of an elliptic curve appears to be quite broken -- it barfs when trying to coerce in 0,

```
sage: E = EllipticCurve(1)
sage: T = E.torsion_subgroup()
sage: T(0)
...
...
TypeError: Argument x (= 0) is of wrong type.
```

further, it returns a mysterious 1 when coercing in a 1

```
sage: a = T(1); a
1
sage: b = T.gens()[0]-T.gens()[0]; b
(0 : 1 : 0)
sage: a+b
TypeError: unsupported operand parent(s) for '+': 'Abelian group of points on Elliptic Curve defined by y^2 + x*y + y = x^3 - 19*x + 26 over Rational Field' and 'Torsion Subgroup isomorphic to Multiplicative Abelian Group isomorphic to C6 x C2 associated to the Elliptic Curve defined by y^2 + x*y + y = x^3 - 19*x + 26 over Rational Field'
```

Yet, it's all cool with the original curve.

```
sage: E(0)
(0 : 1 : 0)
sage: E(1)
...
...
TypeError: v (=(1,)) must have 3 components
sage: 
```



Issue created by migration from https://trac.sagemath.org/ticket/5065





---

archive/issue_events_031040.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/boothby",
    "created_at": "2009-01-23T08:29:58Z",
    "event": "renamed",
    "issue": "https://github.com/sagemath/sage/issues/5065",
    "rename": {
        "from": "elliptic curve torsion subgroup doesn't know it's identity",
        "to": "elliptic curve torsion subgroup doesn't know its identity"
    },
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/5065#event-31040"
}
```



---

archive/issue_events_031041.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/mabshoff",
    "created_at": "2009-04-23T08:04:24Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/5065",
    "milestone": "sage-4.0",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/5065#event-31041"
}
```



---

archive/issue_comments_031950.json:
```json
{
    "body": "<a id='comment:3'></a>\nHere is the reason.  the torsion subgroup class is derived from the Abelian group class, which in Sage is always a multiplicative group!  So it can coerce in 1 to give the identity 1, but not 0.\n\nI produced a lovely patch adding proper additive support to the AbelianGroup class months ago, motivated mainly by situations such as this, but nobody else was interested and it never got in.  (To be fair, the patch is on trac labelled \"not for review\" for some reason).\n\nOf course, for this specific group we could easily write a call() function to handle this, but the whole point of my Abeliangroup patch was that if you say that a group is additive on creation then that was all automatic.  Sigh.\n\nI see that this was reported 3 months ago.  Sorry, I never saw it until now!",
    "created_at": "2009-05-07T16:21:15Z",
    "issue": "https://github.com/sagemath/sage/issues/5065",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/5065#issuecomment-31950",
    "user": "https://github.com/JohnCremona"
}
```

<a id='comment:3'></a>
Here is the reason.  the torsion subgroup class is derived from the Abelian group class, which in Sage is always a multiplicative group!  So it can coerce in 1 to give the identity 1, but not 0.

I produced a lovely patch adding proper additive support to the AbelianGroup class months ago, motivated mainly by situations such as this, but nobody else was interested and it never got in.  (To be fair, the patch is on trac labelled "not for review" for some reason).

Of course, for this specific group we could easily write a call() function to handle this, but the whole point of my Abeliangroup patch was that if you say that a group is additive on creation then that was all automatic.  Sigh.

I see that this was reported 3 months ago.  Sorry, I never saw it until now!



---

archive/issue_comments_031951.json:
```json
{
    "body": "**Changing assignee** from @williamstein to @loefflerd.",
    "created_at": "2009-07-20T20:23:37Z",
    "issue": "https://github.com/sagemath/sage/issues/5065",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/5065#issuecomment-31951",
    "user": "https://github.com/loefflerd"
}
```

**Changing assignee** from @williamstein to @loefflerd.



---

archive/issue_events_031042.json:
```json
{
    "actor": "https://github.com/loefflerd",
    "created_at": "2009-07-20T20:23:37Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/5065",
    "label": "component: number theory",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/5065#event-31042"
}
```



---

archive/issue_events_031043.json:
```json
{
    "actor": "https://github.com/loefflerd",
    "created_at": "2009-07-20T20:23:37Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/5065",
    "label": "component: elliptic curves",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/5065#event-31043"
}
```



---

archive/issue_comments_031952.json:
```json
{
    "body": "**Remove assignee** @loefflerd.",
    "created_at": "2009-10-09T09:12:37Z",
    "issue": "https://github.com/sagemath/sage/issues/5065",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/5065#issuecomment-31952",
    "user": "https://github.com/loefflerd"
}
```

**Remove assignee** @loefflerd.



---

archive/issue_events_031044.json:
```json
{
    "actor": "https://github.com/JohnCremona",
    "created_at": "2010-08-14T16:47:11Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/5065",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/5065#event-31044"
}
```



---

archive/issue_comments_031953.json:
```json
{
    "body": "<a id='comment:6'></a>\nIn 4.5.3.alpha3 this works fine:\n\n```\nsage: E = EllipticCurve(j=1)\nsage: T = E.torsion_subgroup()\nsage: T(0)\n(0 : 1 : 0)\n```\nthanks to the new Abelian Groups support.  So this ticket can be closed as fixed.",
    "created_at": "2010-08-14T16:47:11Z",
    "issue": "https://github.com/sagemath/sage/issues/5065",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/5065#issuecomment-31953",
    "user": "https://github.com/JohnCremona"
}
```

<a id='comment:6'></a>
In 4.5.3.alpha3 this works fine:

```
sage: E = EllipticCurve(j=1)
sage: T = E.torsion_subgroup()
sage: T(0)
(0 : 1 : 0)
```
thanks to the new Abelian Groups support.  So this ticket can be closed as fixed.



---

archive/issue_events_031045.json:
```json
{
    "actor": "https://github.com/qed777",
    "created_at": "2010-08-14T21:01:56Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/5065",
    "milestone": "sage-4.5.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/5065#event-31045"
}
```



---

archive/issue_comments_031954.json:
```json
{
    "body": "<a id='comment:7'></a>\nI'm setting the resolution to \"duplicate\" and changing the milestone accordingly.",
    "created_at": "2010-08-14T21:01:56Z",
    "issue": "https://github.com/sagemath/sage/issues/5065",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/5065#issuecomment-31954",
    "user": "https://github.com/qed777"
}
```

<a id='comment:7'></a>
I'm setting the resolution to "duplicate" and changing the milestone accordingly.



---

archive/issue_events_031046.json:
```json
{
    "actor": "https://github.com/qed777",
    "created_at": "2010-08-14T21:01:56Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/5065",
    "label": "duplicate",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/5065#event-31046"
}
```
