# Issue 5068: [with patch; positive review] change_ring fails for polynomials over finite fields in many cases

archive/issues_005068.json:
```json
{
    "body": "```\nsage: R.<x> = GF(9,'a')[]\nsage: x.change_ring(GF(3))\nBOOM!\n\nsage: R.<x,y> = GF(9,'a')[]\nsage: x.change_ring(GF(3))\nBOOM!\nTypeError: unable to coerce <type 'sage.rings.finite_field_givaro.FiniteField_givaroElement'> to an integer\n```\n\nAssignee: @robertwb\n\nResolution: fixed\n\nIssue created by migration from https://trac.sagemath.org/ticket/5068\n\n",
    "closed_at": "2009-01-24T14:48:20Z",
    "created_at": "2009-01-23T10:38:14Z",
    "labels": [
        "component: coercion",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-3.3",
    "title": "[with patch; positive review] change_ring fails for polynomials over finite fields in many cases",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/5068",
    "user": "https://github.com/williamstein"
}
```
```
sage: R.<x> = GF(9,'a')[]
sage: x.change_ring(GF(3))
BOOM!

sage: R.<x,y> = GF(9,'a')[]
sage: x.change_ring(GF(3))
BOOM!
TypeError: unable to coerce <type 'sage.rings.finite_field_givaro.FiniteField_givaroElement'> to an integer
```

Assignee: @robertwb

Resolution: fixed

Issue created by migration from https://trac.sagemath.org/ticket/5068





---

archive/issue_comments_039535.json:
```json
{
    "body": "<a id='comment:1'></a>The generic MPolynomial_polydict poly's work fine as looking at the code shows, but the libsingular ones break:\n\n```\nsage: p = next_prime(10^30); f = GF(p^2,'a')['x,y'].gen()\nsage: type(f)\n<class 'sage.rings.polynomial.multi_polynomial_element.MPolynomial_polydict'>\nsage: f.change_ring(GF(p))\nx\nsage: p = next_prime(20); f = GF(p^2,'a')['x,y'].gen()\nsage: type(f)\n<type 'sage.rings.polynomial.multi_polynomial_libsingular.MPolynomial_libsingular'>\nsage: f.change_ring(GF(p))\n---------------------------------------------------------------------------\nTypeError                                 Traceback (most recent call last)\n\n/Users/wstein/.sage/temp/teragon.local/22907/_Users_wstein__sage_init_sage_0.py in <module>()\n----> 1 \n      2 \n      3 \n      4 \n      5 \n\n/Users/wstein/build/sage-3.3.alpha0/local/lib/python2.5/site-packages/sage/rings/polynomial/multi_polynomial.so in sage.rings.polynomial.multi_polynomial.MPolynomial.change_ring (sage/rings/polynomial/multi_polynomial.c:6691)()\n    661 \n    662 \n--> 663 \n    664 \n    665 \n\n/Users/wstein/build/sage-3.3.alpha0/local/lib/python2.5/site-packages/sage/rings/polynomial/multi_polynomial_libsingular.so in sage.rings.polynomial.multi_polynomial_libsingular.MPolynomialRing_libsingular.__call__ (sage/rings/polynomial/multi_polynomial_libsingular.cpp:6267)()\n    616 \n    617 \n--> 618 \n    619 \n    620 \n\nTypeError: unable to coerce <type 'sage.rings.finite_field_givaro.FiniteField_givaroElement'> to an integer\n```\n\nThis is because the givaro finite field __call__ is wrong:\n\n```\nsage: GF(23)(GF(23^2,'a')(1))\nBOOM!\nTypeError: unable to coerce <type 'sage.rings.finite_field_givaro.FiniteField_givaroElement'> to an integer\n\nbut\n\nsage: GF(next_prime(10^20))(GF(next_prime(10^20)^2,'a')(1))\n1\n```",
    "created_at": "2009-01-23T11:00:13Z",
    "issue": "https://github.com/sagemath/sagetest/issues/5068",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/5068#issuecomment-39535",
    "user": "https://github.com/williamstein"
}
```

<a id='comment:1'></a>The generic MPolynomial_polydict poly's work fine as looking at the code shows, but the libsingular ones break:

```
sage: p = next_prime(10^30); f = GF(p^2,'a')['x,y'].gen()
sage: type(f)
<class 'sage.rings.polynomial.multi_polynomial_element.MPolynomial_polydict'>
sage: f.change_ring(GF(p))
x
sage: p = next_prime(20); f = GF(p^2,'a')['x,y'].gen()
sage: type(f)
<type 'sage.rings.polynomial.multi_polynomial_libsingular.MPolynomial_libsingular'>
sage: f.change_ring(GF(p))
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)

/Users/wstein/.sage/temp/teragon.local/22907/_Users_wstein__sage_init_sage_0.py in <module>()
----> 1 
      2 
      3 
      4 
      5 

/Users/wstein/build/sage-3.3.alpha0/local/lib/python2.5/site-packages/sage/rings/polynomial/multi_polynomial.so in sage.rings.polynomial.multi_polynomial.MPolynomial.change_ring (sage/rings/polynomial/multi_polynomial.c:6691)()
    661 
    662 
--> 663 
    664 
    665 

/Users/wstein/build/sage-3.3.alpha0/local/lib/python2.5/site-packages/sage/rings/polynomial/multi_polynomial_libsingular.so in sage.rings.polynomial.multi_polynomial_libsingular.MPolynomialRing_libsingular.__call__ (sage/rings/polynomial/multi_polynomial_libsingular.cpp:6267)()
    616 
    617 
--> 618 
    619 
    620 

TypeError: unable to coerce <type 'sage.rings.finite_field_givaro.FiniteField_givaroElement'> to an integer
```

This is because the givaro finite field __call__ is wrong:

```
sage: GF(23)(GF(23^2,'a')(1))
BOOM!
TypeError: unable to coerce <type 'sage.rings.finite_field_givaro.FiniteField_givaroElement'> to an integer

but

sage: GF(next_prime(10^20))(GF(next_prime(10^20)^2,'a')(1))
1
```



---

archive/issue_comments_039536.json:
```json
{
    "body": "<a id='comment:2'></a>Attachment [trac_5068.patch](tarball://root/attachments/some-uuid/ticket5068/trac_5068.patch) by @williamstein created at 2009-01-23 12:12:25",
    "created_at": "2009-01-23T12:12:25Z",
    "issue": "https://github.com/sagemath/sagetest/issues/5068",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/5068#issuecomment-39536",
    "user": "https://github.com/williamstein"
}
```

<a id='comment:2'></a>Attachment [trac_5068.patch](tarball://root/attachments/some-uuid/ticket5068/trac_5068.patch) by @williamstein created at 2009-01-23 12:12:25



---

archive/issue_comments_039537.json:
```json
{
    "body": "<a id='comment:3'></a>looks good.",
    "created_at": "2009-01-23T17:31:07Z",
    "issue": "https://github.com/sagemath/sagetest/issues/5068",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/5068#issuecomment-39537",
    "user": "https://github.com/malb"
}
```

<a id='comment:3'></a>looks good.



---

archive/issue_comments_039538.json:
```json
{
    "body": "<a id='comment:4'></a>Merged in Sage 3.3.alpha2",
    "created_at": "2009-01-24T14:48:20Z",
    "issue": "https://github.com/sagemath/sagetest/issues/5068",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/5068#issuecomment-39538",
    "user": "https://trac.sagemath.org/admin/accounts/users/mabshoff"
}
```

<a id='comment:4'></a>Merged in Sage 3.3.alpha2



---

archive/issue_comments_039539.json:
```json
{
    "body": "Resolution: fixed",
    "created_at": "2009-01-24T14:48:20Z",
    "issue": "https://github.com/sagemath/sagetest/issues/5068",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/5068#issuecomment-39539",
    "user": "https://trac.sagemath.org/admin/accounts/users/mabshoff"
}
```

Resolution: fixed



---

archive/issue_events_011686.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/mabshoff",
    "created_at": "2009-01-24T14:48:20Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/5068",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/5068#event-11686"
}
```
