# Issue 5075: Polynomials over inexact rings should not truncate inexact leading zeroes

archive/issues_005075.json:
```json
{
    "body": "The generic polynomial class truncates leading zeroes, and this can cause problems when working over an inexact ring in which is_zero can return True even for an inexact zero (e.g., see #2943). Here is a simple example:\n\n```\nsage: C.<t> = PowerSeriesRing(Integers())\nsage: D.<s> = PolynomialRing(C)\nsage: y = O(t)\nsage: y\nO(t^1)\nsage: z = y*s\nsage: z\n0\nsage: z.list()\n[]\n```\nThis was recognized earlier for p-adics and fixed (I'm not sure which ticket this was):\n\n```\nsage: C = pAdicField(11)\nsage: D.<s> = PolynomialRing(C)\nsage: y = O(11)\nsage: y\nO(11)\nsage: z = y*s\nsage: z\n(O(11))*s\n```\nThe other main class of inexact rings are interval fields, but I believe for those is_zero returns False for an inexact zero, so this doesn't come up.\n\nAssignee: @roed314\n\nCC:  dmharvey @nilesjohnson @categorie\n\nKeywords: polynomials, power series, inexact rings\n\nStopgaps: todo\n\nStatus: new\n\nIssue created by migration from https://trac.sagemath.org/ticket/5075\n\n",
    "created_at": "2009-01-23T19:04:16Z",
    "labels": [
        "component: algebra",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-6.4",
    "title": "Polynomials over inexact rings should not truncate inexact leading zeroes",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/5075",
    "user": "https://github.com/kedlaya"
}
```
The generic polynomial class truncates leading zeroes, and this can cause problems when working over an inexact ring in which is_zero can return True even for an inexact zero (e.g., see #2943). Here is a simple example:

```
sage: C.<t> = PowerSeriesRing(Integers())
sage: D.<s> = PolynomialRing(C)
sage: y = O(t)
sage: y
O(t^1)
sage: z = y*s
sage: z
0
sage: z.list()
[]
```
This was recognized earlier for p-adics and fixed (I'm not sure which ticket this was):

```
sage: C = pAdicField(11)
sage: D.<s> = PolynomialRing(C)
sage: y = O(11)
sage: y
O(11)
sage: z = y*s
sage: z
(O(11))*s
```
The other main class of inexact rings are interval fields, but I believe for those is_zero returns False for an inexact zero, so this doesn't come up.

Assignee: @roed314

CC:  dmharvey @nilesjohnson @categorie

Keywords: polynomials, power series, inexact rings

Stopgaps: todo

Status: new

Issue created by migration from https://trac.sagemath.org/ticket/5075





---

archive/issue_comments_042010.json:
```json
{
    "body": "<a id='comment:2'></a>\nA closely related issue is #3979.",
    "created_at": "2009-01-23T19:56:00Z",
    "issue": "https://github.com/sagemath/sagetest/issues/5075",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/5075#issuecomment-42010",
    "user": "https://github.com/kedlaya"
}
```

<a id='comment:2'></a>
A closely related issue is #3979.



---

archive/issue_comments_042011.json:
```json
{
    "body": "Attachment [trac_5075.patch](tarball://root/attachments/some-uuid/ticket5075/trac_5075.patch) by @roed314 created at 2009-04-26 19:42:28\n\nIn progress.  I think it fixes the problem, but I'm working on a larger project for p-adic polynomials that this is part of.",
    "created_at": "2009-04-26T19:42:28Z",
    "issue": "https://github.com/sagemath/sagetest/issues/5075",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/5075#issuecomment-42011",
    "user": "https://github.com/roed314"
}
```

Attachment [trac_5075.patch](tarball://root/attachments/some-uuid/ticket5075/trac_5075.patch) by @roed314 created at 2009-04-26 19:42:28

In progress.  I think it fixes the problem, but I'm working on a larger project for p-adic polynomials that this is part of.



---

archive/issue_comments_042012.json:
```json
{
    "body": "Attachment [trac_5075.2.patch](tarball://root/attachments/some-uuid/ticket5075/trac_5075.2.patch) by @roed314 created at 2009-06-11 21:04:01\n\nrebased against 4.0",
    "created_at": "2009-06-11T21:04:01Z",
    "issue": "https://github.com/sagemath/sagetest/issues/5075",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/5075#issuecomment-42012",
    "user": "https://github.com/roed314"
}
```

Attachment [trac_5075.2.patch](tarball://root/attachments/some-uuid/ticket5075/trac_5075.2.patch) by @roed314 created at 2009-06-11 21:04:01

rebased against 4.0



---

archive/issue_comments_042013.json:
```json
{
    "body": "Changing upstream from \"\" to \"N/A\"",
    "created_at": "2011-08-01T08:12:00Z",
    "issue": "https://github.com/sagemath/sagetest/issues/5075",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/5075#issuecomment-42013",
    "user": "https://github.com/kedlaya"
}
```

Changing upstream from "" to "N/A"



---

archive/issue_comments_042014.json:
```json
{
    "body": "<a id='comment:3'></a>\nI tried to apply this against 4.7.1.rc1 and got a bunch of merge failures in power_series_poly.pyx. Probably another trivial rebase is needed.",
    "created_at": "2011-08-01T08:12:00Z",
    "issue": "https://github.com/sagemath/sagetest/issues/5075",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/5075#issuecomment-42014",
    "user": "https://github.com/kedlaya"
}
```

<a id='comment:3'></a>
I tried to apply this against 4.7.1.rc1 and got a bunch of merge failures in power_series_poly.pyx. Probably another trivial rebase is needed.



---

archive/issue_events_011706.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2013-08-13T15:35:53Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/5075",
    "milestone": "sage-5.12",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/5075#event-11706"
}
```



---

archive/issue_events_011707.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-01-30T21:20:52Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/5075",
    "milestone": "sage-5.12",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/5075#event-11707"
}
```



---

archive/issue_events_011708.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-01-30T21:20:52Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/5075",
    "milestone": "sage-6.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/5075#event-11708"
}
```



---

archive/issue_comments_042015.json:
```json
{
    "body": "<a id='comment:6'></a>\nDavid, could you give us a rebase for sage 6.1?  I know you're doing a lot of other work for padics, but we're trying to solve a more basic issue with power series comparison at #9457.  Power series over padics are a confusing obstacle there, and we wanted to see if the patch here would help.\n\nHere's the specific bug we're trying to track down (in sage 6.1):  Power series over p-adics are changing inexact zeros to exact zeros -- this looks similar to the problem with polynomials on this ticket, but notice that the problem happens even for p-adics:\n\n```\nsage: Ct.<t> = PowerSeriesRing(Qp(11))\nsage: O(11^2) # inexact zero\nO(11^2)\nsage: Ct(O(11^2)) # coercing to power series ring looses finite precision\n0\nsage: Ct(1+O(11^2)) # finite precision is retained for non-zero elements\n1 + O(11^2)\n```\n\nThere is a problem with multiplication of a p-adic by an element of the power series ring, which might be caused by the problem above:\n\n```\nsage: 1+O(11^2)*t  # finite precision is retained\n1 + O(11^20) + O(11^2)*t  \n\nsage: O(11^2)*t  # finite precision is lost\n0\n```\n\nNote that there is a similar problem for more general power series ring over power series ring:\n\n```\nsage: D.<x> = PowerSeriesRing(QQ)\nsage: Ds.<s> = PowerSeriesRing(D)\nsage: O(x)  # inexact zero\nO(x^1)\nsage: Ds(O(x)) # finite precision is lost\n0\nsage: Ds(1+O(x)) # finite precision is retained\n1 + O(x)\n\nsage: 1+O(x)*s # !! this is different from behavior of power series over padic ring\n1\n```\n\nMy hope is that starting with a rebase of this patch would be a step toward solving this problem.  Perhaps it will have to be extended to power series over inexact rings too.  Unfortunately I don't understand the current status of padics well enough to do this rebase myself.",
    "created_at": "2014-02-03T15:00:28Z",
    "issue": "https://github.com/sagemath/sagetest/issues/5075",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/5075#issuecomment-42015",
    "user": "https://github.com/nilesjohnson"
}
```

<a id='comment:6'></a>
David, could you give us a rebase for sage 6.1?  I know you're doing a lot of other work for padics, but we're trying to solve a more basic issue with power series comparison at #9457.  Power series over padics are a confusing obstacle there, and we wanted to see if the patch here would help.

Here's the specific bug we're trying to track down (in sage 6.1):  Power series over p-adics are changing inexact zeros to exact zeros -- this looks similar to the problem with polynomials on this ticket, but notice that the problem happens even for p-adics:

```
sage: Ct.<t> = PowerSeriesRing(Qp(11))
sage: O(11^2) # inexact zero
O(11^2)
sage: Ct(O(11^2)) # coercing to power series ring looses finite precision
0
sage: Ct(1+O(11^2)) # finite precision is retained for non-zero elements
1 + O(11^2)
```

There is a problem with multiplication of a p-adic by an element of the power series ring, which might be caused by the problem above:

```
sage: 1+O(11^2)*t  # finite precision is retained
1 + O(11^20) + O(11^2)*t  

sage: O(11^2)*t  # finite precision is lost
0
```

Note that there is a similar problem for more general power series ring over power series ring:

```
sage: D.<x> = PowerSeriesRing(QQ)
sage: Ds.<s> = PowerSeriesRing(D)
sage: O(x)  # inexact zero
O(x^1)
sage: Ds(O(x)) # finite precision is lost
0
sage: Ds(1+O(x)) # finite precision is retained
1 + O(x)

sage: 1+O(x)*s # !! this is different from behavior of power series over padic ring
1
```

My hope is that starting with a rebase of this patch would be a step toward solving this problem.  Perhaps it will have to be extended to power series over inexact rings too.  Unfortunately I don't understand the current status of padics well enough to do this rebase myself.



---

archive/issue_events_011709.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-05-06T15:20:58Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/5075",
    "milestone": "sage-6.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/5075#event-11709"
}
```



---

archive/issue_events_011710.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-05-06T15:20:58Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/5075",
    "milestone": "sage-6.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/5075#event-11710"
}
```



---

archive/issue_events_011711.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-08-10T16:51:03Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/5075",
    "milestone": "sage-6.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/5075#event-11711"
}
```



---

archive/issue_events_011712.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/vbraun_spam",
    "created_at": "2014-08-10T16:51:03Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/5075",
    "milestone": "sage-6.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/5075#event-11712"
}
```



---

archive/issue_comments_042016.json:
```json
{
    "body": "Changing stopgaps from \"\" to \"todo\"",
    "created_at": "2015-08-19T23:02:07Z",
    "issue": "https://github.com/sagemath/sagetest/issues/5075",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/5075#issuecomment-42016",
    "user": "https://trac.sagemath.org/admin/accounts/users/jakobkroeker"
}
```

Changing stopgaps from "" to "todo"



---

archive/issue_comments_042017.json:
```json
{
    "body": "<a id='comment:10'></a>\nPing. Is this issue due to be resolved by other developments on p-adics?",
    "created_at": "2016-03-23T23:30:20Z",
    "issue": "https://github.com/sagemath/sagetest/issues/5075",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/5075#issuecomment-42017",
    "user": "https://github.com/kedlaya"
}
```

<a id='comment:10'></a>
Ping. Is this issue due to be resolved by other developments on p-adics?



---

archive/issue_comments_042018.json:
```json
{
    "body": "<a id='comment:11'></a>\nPing again. The original example still behaves the same way in Sage 8.0.",
    "created_at": "2017-09-06T03:24:49Z",
    "issue": "https://github.com/sagemath/sagetest/issues/5075",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/5075#issuecomment-42018",
    "user": "https://github.com/kedlaya"
}
```

<a id='comment:11'></a>
Ping again. The original example still behaves the same way in Sage 8.0.
