# Issue 5312: command line -- bug in preparser and "time"

archive/issues_005312.json:
```json
{
    "assignees": [],
    "body": "There is a weird interaction between time and preparser, almost as if input to time is being preparsed *twice*:\n\n```\nwstein@sage:~/build/sage-3.3.rc1$ ./sage\n----------------------------------------------------------------------\n| Sage Version 3.3.rc1, Release Date: 2009-02-16                     |\n| Type notebook() for the GUI, and license() for information.        |\n----------------------------------------------------------------------\nsage: k = 3r\nsage: type(k)\n<type 'int'>\nsage: time k = 3r\nCPU times: user 0.00 s, sys: 0.00 s, total: 0.00 s\nWall time: 0.00 s\nsage: type(k)\n<type 'sage.rings.integer.Integer'>\nsage: preparse('k = 3r')\n'k = 3'\nsage: preparse('time k = 3r')\n'time k = 3'\n```\n\nIn the above, type(k) should have been int in all cases.  Why isn't it the second time.  WEIRD.\n\n**Assignee:** cwitty\n\n**CC:**  @orlitzky\n\nIssue created by migration from https://trac.sagemath.org/ticket/5312\n\n",
    "closed_at": "2013-07-23T12:21:53Z",
    "created_at": "2009-02-19T08:31:41Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20misc",
        "https://github.com/sagemath/sage/labels/bug",
        "https://github.com/sagemath/sage/labels/invalid"
    ],
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "command line -- bug in preparser and \"time\"",
    "type": "issue",
    "updated_at": "2013-07-23T12:21:53Z",
    "url": "https://github.com/sagemath/sage/issues/5312",
    "user": "https://github.com/williamstein"
}
```
There is a weird interaction between time and preparser, almost as if input to time is being preparsed *twice*:

```
wstein@sage:~/build/sage-3.3.rc1$ ./sage
----------------------------------------------------------------------
| Sage Version 3.3.rc1, Release Date: 2009-02-16                     |
| Type notebook() for the GUI, and license() for information.        |
----------------------------------------------------------------------
sage: k = 3r
sage: type(k)
<type 'int'>
sage: time k = 3r
CPU times: user 0.00 s, sys: 0.00 s, total: 0.00 s
Wall time: 0.00 s
sage: type(k)
<type 'sage.rings.integer.Integer'>
sage: preparse('k = 3r')
'k = 3'
sage: preparse('time k = 3r')
'time k = 3'
```

In the above, type(k) should have been int in all cases.  Why isn't it the second time.  WEIRD.

**Assignee:** cwitty

**CC:**  @orlitzky

Issue created by migration from https://trac.sagemath.org/ticket/5312





---

archive/issue_events_051278.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2009-02-19T08:31:41Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/5312",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20misc",
    "label_color": "08517b",
    "label_name": "component: misc",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/5312#event-51278"
}
```



---

archive/issue_events_051279.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2009-02-19T08:31:41Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/5312",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "008080",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/5312#event-51279"
}
```



---

archive/issue_events_051280.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2009-02-19T08:31:41Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/5312",
    "label": "https://github.com/sagemath/sage/labels/invalid",
    "label_color": "008080",
    "label_name": "invalid",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/5312#event-51280"
}
```



---

archive/issue_comments_034011.json:
```json
{
    "body": "<a id='comment:1'></a>\nThis works now:\n\n```\nsage: k = 3r\nsage: type(k)\n<type 'int'>\nsage: time k = 3r\nTime: CPU 0.00 s, Wall: 0.00 s\nsage: type(k)\n<type 'int'>\n```\n\nWhere's the best place to add a doctest?",
    "created_at": "2012-01-09T02:17:26Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/5312",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/5312#issuecomment-34011",
    "user": "https://github.com/orlitzky"
}
```

<a id='comment:1'></a>
This works now:

```
sage: k = 3r
sage: type(k)
<type 'int'>
sage: time k = 3r
Time: CPU 0.00 s, Wall: 0.00 s
sage: type(k)
<type 'int'>
```

Where's the best place to add a doctest?



---

archive/issue_events_051281.json:
```json
{
    "actor": "https://github.com/mwhansen",
    "created_at": "2013-07-23T12:21:53Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/5312",
    "milestone_number": null,
    "milestone_title": "sage-5.11",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/5312#event-51281"
}
```



---

archive/issue_events_051282.json:
```json
{
    "actor": "https://github.com/mwhansen",
    "created_at": "2013-07-23T12:21:53Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/5312",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/5312#event-51282"
}
```



---

archive/issue_comments_034012.json:
```json
{
    "body": "<a id='comment:2'></a>\nI think we can just mark it as invalid since \"%time\" is now handled by IPython.",
    "created_at": "2013-07-23T12:21:53Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/5312",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/5312#issuecomment-34012",
    "user": "https://github.com/mwhansen"
}
```

<a id='comment:2'></a>
I think we can just mark it as invalid since "%time" is now handled by IPython.
