# Issue 5312: command line -- bug in preparser and "time"

archive/issues_005312.json:
```json
{
    "assignees": [],
    "body": "There is a weird interaction between time and preparser, almost as if input to time is being preparsed *twice*:\n\n```\nwstein@sage:~/build/sage-3.3.rc1$ ./sage\n----------------------------------------------------------------------\n| Sage Version 3.3.rc1, Release Date: 2009-02-16                     |\n| Type notebook() for the GUI, and license() for information.        |\n----------------------------------------------------------------------\nsage: k = 3r\nsage: type(k)\n<type 'int'>\nsage: time k = 3r\nCPU times: user 0.00 s, sys: 0.00 s, total: 0.00 s\nWall time: 0.00 s\nsage: type(k)\n<type 'sage.rings.integer.Integer'>\nsage: preparse('k = 3r')\n'k = 3'\nsage: preparse('time k = 3r')\n'time k = 3'\n```\n\nIn the above, type(k) should have been int in all cases.  Why isn't it the second time.  WEIRD.\n\nAssignee: **cwitty**\n\nCC:  @orlitzky\n\n_Issue created by migration from https://trac.sagemath.org/ticket/5312_\n\n",
    "closed_at": "2013-07-23T12:21:53Z",
    "created_at": "2009-02-19T08:31:41Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/bug",
        "https://github.com/sagemath/sage/labels/invalid"
    ],
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "command line -- bug in preparser and \"time\"",
    "type": "issue",
    "updated_at": "2013-07-23T12:21:53Z",
    "url": "https://github.com/sagemath/sage/issues/5312",
    "user": "https://github.com/williamstein"
}
```
There is a weird interaction between time and preparser, almost as if input to time is being preparsed *twice*:

```
wstein@sage:~/build/sage-3.3.rc1$ ./sage
----------------------------------------------------------------------
| Sage Version 3.3.rc1, Release Date: 2009-02-16                     |
| Type notebook() for the GUI, and license() for information.        |
----------------------------------------------------------------------
sage: k = 3r
sage: type(k)
<type 'int'>
sage: time k = 3r
CPU times: user 0.00 s, sys: 0.00 s, total: 0.00 s
Wall time: 0.00 s
sage: type(k)
<type 'sage.rings.integer.Integer'>
sage: preparse('k = 3r')
'k = 3'
sage: preparse('time k = 3r')
'time k = 3'
```

In the above, type(k) should have been int in all cases.  Why isn't it the second time.  WEIRD.

Assignee: **cwitty**

CC:  @orlitzky

_Issue created by migration from https://trac.sagemath.org/ticket/5312_





---

archive/issue_events_054473.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2009-02-19T08:31:41Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/5312",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "d73a4a",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/5312#event-54473"
}
```



---

archive/issue_events_054474.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2009-02-19T08:31:41Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/5312",
    "label": "https://github.com/sagemath/sage/labels/invalid",
    "label_color": "a6a6a6",
    "label_name": "invalid",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/5312#event-54474"
}
```



---

archive/issue_comments_034017.json:
```json
{
    "body": "<a id='comment:1'>Comment 1:</a>\nThis works now:\n\n```\nsage: k = 3r\nsage: type(k)\n<type 'int'>\nsage: time k = 3r\nTime: CPU 0.00 s, Wall: 0.00 s\nsage: type(k)\n<type 'int'>\n```\n\nWhere's the best place to add a doctest?",
    "created_at": "2012-01-09T02:17:26Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/5312",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/5312#issuecomment-34017",
    "user": "https://github.com/orlitzky"
}
```

<a id='comment:1'>Comment 1:</a>
This works now:

```
sage: k = 3r
sage: type(k)
<type 'int'>
sage: time k = 3r
Time: CPU 0.00 s, Wall: 0.00 s
sage: type(k)
<type 'int'>
```

Where's the best place to add a doctest?



---

archive/issue_events_054475.json:
```json
{
    "actor": "https://github.com/mwhansen",
    "created_at": "2013-07-23T12:21:53Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/5312",
    "milestone_number": null,
    "milestone_title": "sage-5.11",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/5312#event-54475"
}
```



---

archive/issue_events_054476.json:
```json
{
    "actor": "https://github.com/mwhansen",
    "created_at": "2013-07-23T12:21:53Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/5312",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/5312#event-54476"
}
```



---

archive/issue_comments_034018.json:
```json
{
    "body": "<a id='comment:2'>Comment 2:</a>\nI think we can just mark it as invalid since \"%time\" is now handled by IPython.",
    "created_at": "2013-07-23T12:21:53Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/5312",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/5312#issuecomment-34018",
    "user": "https://github.com/mwhansen"
}
```

<a id='comment:2'>Comment 2:</a>
I think we can just mark it as invalid since "%time" is now handled by IPython.
