# Issue 5603: make a .mix() method for Sage color objects

archive/issues_005603.json:
```json
{
    "body": "See the end of http://groups.google.com/group/sage-support/browse_thread/thread/44971aa416574675\n\nWe could also call it .blend() to agree with MMA's terminology:\n\nhttp://reference.wolfram.com/mathematica/ref/Blend.html\n\nRelated tickets:\n\n* #5601 - predefine colors in Sage.\n* #5602 - make .lighter() and .darker() methods for Sage Color objects.\n* #5603 - make a .mix() method for Sage color objects.\n* #5604 - average Color objects when adding them together.\n* #5605 - Construct Color objects using hsl and hsv values.\n\n\n**Assignee:** @williamstein\n\n**CC:**  mvngu\n\nIssue created by migration from https://trac.sagemath.org/ticket/5603\n\n",
    "closed_at": "2010-05-11T20:39:29Z",
    "created_at": "2009-03-24T21:29:56Z",
    "labels": [
        "component: graphics",
        "minor",
        "enhancement"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-4.4.2",
    "title": "make a .mix() method for Sage color objects",
    "type": "issue",
    "url": "https://github.com/sagemath/sage/issues/5603",
    "user": "https://github.com/jasongrout"
}
```
See the end of http://groups.google.com/group/sage-support/browse_thread/thread/44971aa416574675

We could also call it .blend() to agree with MMA's terminology:

http://reference.wolfram.com/mathematica/ref/Blend.html

Related tickets:

* #5601 - predefine colors in Sage.
* #5602 - make .lighter() and .darker() methods for Sage Color objects.
* #5603 - make a .mix() method for Sage color objects.
* #5604 - average Color objects when adding them together.
* #5605 - Construct Color objects using hsl and hsv values.


**Assignee:** @williamstein

**CC:**  mvngu

Issue created by migration from https://trac.sagemath.org/ticket/5603





---

archive/issue_comments_036642.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -3,3 +3,12 @@\n We could also call it .blend() to agree with MMA's terminology:\n \n http://reference.wolfram.com/mathematica/ref/Blend.html\n+\n+Related tickets:\n+\n+* #5601 - predefine colors in Sage.\n+* #5602 - make .lighter() and .darker() methods for Sage Color objects.\n+* #5603 - make a .mix() method for Sage color objects.\n+* #5604 - average Color objects when adding them together.\n+* #5605 - Construct Color objects using hsl and hsv values.\n+\n``````\n",
    "created_at": "2009-11-14T18:42:45Z",
    "issue": "https://github.com/sagemath/sage/issues/5603",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/5603#issuecomment-36642",
    "user": "https://github.com/qed777"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -3,3 +3,12 @@
 We could also call it .blend() to agree with MMA's terminology:
 
 http://reference.wolfram.com/mathematica/ref/Blend.html
+
+Related tickets:
+
+* #5601 - predefine colors in Sage.
+* #5602 - make .lighter() and .darker() methods for Sage Color objects.
+* #5603 - make a .mix() method for Sage color objects.
+* #5604 - average Color objects when adding them together.
+* #5605 - Construct Color objects using hsl and hsv values.
+
``````




---

archive/issue_comments_036643.json:
```json
{
    "body": "<a id='comment:2'></a>\nThis is now implemented as \"blend\":\n\n```\nsage: sage.plot.colors.red.blend(sage.plot.colors.blue)\nRGB color (0.5, 0.0, 0.5)\n\n```\n\nSo this ticket should be closed.",
    "created_at": "2010-05-11T20:33:30Z",
    "issue": "https://github.com/sagemath/sage/issues/5603",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/5603#issuecomment-36643",
    "user": "https://github.com/jasongrout"
}
```

<a id='comment:2'></a>
This is now implemented as "blend":

```
sage: sage.plot.colors.red.blend(sage.plot.colors.blue)
RGB color (0.5, 0.0, 0.5)

```

So this ticket should be closed.



---

archive/issue_comments_036644.json:
```json
{
    "body": "<a id='comment:3'></a>\nClose as fixed:\n\n```\n[mvngu@sage ~]$ sage\n----------------------------------------------------------------------\n| Sage Version 4.4.1, Release Date: 2010-05-02                       |\n| Type notebook() for the GUI, and license() for information.        |\n----------------------------------------------------------------------\nsage: b = sage.plot.colors.blue\nsage: r = sage.plot.colors.red\nsage: g = sage.plot.colors.green\nsage: b.blend(r)\nRGB color (0.5, 0.0, 0.5)\nsage: r.blend(b)\nRGB color (0.5, 0.0, 0.5)\nsage: r.blend(g)\nRGB color (0.5, 0.25098039215686274, 0.0)\nsage: g.blend(r)\nRGB color (0.5, 0.25098039215686274, 0.0)\nsage: g.blend(b)\nRGB color (0.0, 0.25098039215686274, 0.5)\nsage: b.blend(g)\nRGB color (0.0, 0.25098039215686274, 0.5)\n```",
    "created_at": "2010-05-11T20:39:29Z",
    "issue": "https://github.com/sagemath/sage/issues/5603",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/5603#issuecomment-36644",
    "user": "https://trac.sagemath.org/admin/accounts/users/mvngu"
}
```

<a id='comment:3'></a>
Close as fixed:

```
[mvngu@sage ~]$ sage
----------------------------------------------------------------------
| Sage Version 4.4.1, Release Date: 2010-05-02                       |
| Type notebook() for the GUI, and license() for information.        |
----------------------------------------------------------------------
sage: b = sage.plot.colors.blue
sage: r = sage.plot.colors.red
sage: g = sage.plot.colors.green
sage: b.blend(r)
RGB color (0.5, 0.0, 0.5)
sage: r.blend(b)
RGB color (0.5, 0.0, 0.5)
sage: r.blend(g)
RGB color (0.5, 0.25098039215686274, 0.0)
sage: g.blend(r)
RGB color (0.5, 0.25098039215686274, 0.0)
sage: g.blend(b)
RGB color (0.0, 0.25098039215686274, 0.5)
sage: b.blend(g)
RGB color (0.0, 0.25098039215686274, 0.5)
```



---

archive/issue_events_035541.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/mvngu",
    "created_at": "2010-05-11T20:39:29Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/5603",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/5603#event-35541"
}
```
