# Issue 5677: Underscore for repeating output clobbered by symbolic variables

archive/issues_005677.json:
```json
{
    "assignees": [],
    "body": "When creating a function with a statement like\n\n`f(x,y) = x<sup>2+y</sup>2`\n\nthe preparser creates a command to declare the variables and assigns it to underscore.  This renders the underscore unusable for repeating the previous output.\n\nA workaround is to use  \n\n`del _` \n\nto restore the functionality.\n\n**Assignee:** @williamstein\n\n**Keywords:** underscore repeat output\n\nIssue created by migration from https://trac.sagemath.org/ticket/5677\n\n",
    "closed_at": "2013-07-23T12:56:14Z",
    "created_at": "2009-04-03T21:39:51Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20user%20interface",
        "https://github.com/sagemath/sage/labels/bug",
        "https://github.com/sagemath/sage/labels/invalid"
    ],
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "Underscore for repeating output clobbered by symbolic variables",
    "type": "issue",
    "updated_at": "2013-07-23T12:56:14Z",
    "url": "https://github.com/sagemath/sage/issues/5677",
    "user": "https://github.com/rbeezer"
}
```
When creating a function with a statement like

`f(x,y) = x<sup>2+y</sup>2`

the preparser creates a command to declare the variables and assigns it to underscore.  This renders the underscore unusable for repeating the previous output.

A workaround is to use  

`del _` 

to restore the functionality.

**Assignee:** @williamstein

**Keywords:** underscore repeat output

Issue created by migration from https://trac.sagemath.org/ticket/5677





---

archive/issue_events_055547.json:
```json
{
    "actor": "https://github.com/rbeezer",
    "created_at": "2009-04-03T21:39:51Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/5677",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20user%20interface",
    "label_color": "08517b",
    "label_name": "component: user interface",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/5677#event-55547"
}
```



---

archive/issue_events_055548.json:
```json
{
    "actor": "https://github.com/rbeezer",
    "created_at": "2009-04-03T21:39:51Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/5677",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "008080",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/5677#event-55548"
}
```



---

archive/issue_events_055549.json:
```json
{
    "actor": "https://github.com/rbeezer",
    "created_at": "2009-04-03T21:39:51Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/5677",
    "label": "https://github.com/sagemath/sage/labels/invalid",
    "label_color": "008080",
    "label_name": "invalid",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/5677#event-55549"
}
```



---

archive/issue_comments_037295.json:
```json
{
    "body": "<a id='comment:1'>**Comment 1:**</a>\nIs this still valid?  It looks more like `__tmp__` is used, not `_`, these days:\n\n\n```\nsage: preparse(\"f(x,y) = x^2+y^2\")\n'__tmp__=var(\"x,y\"); f = symbolic_expression(x**Integer(2)+y**Integer(2)).function(x,y)'\nsage: 5\n5\nsage: _\n5\nsage: f(x,y) = x^2+y^2\nsage: _\n5\nsage: 7\n7\nsage: _\n7\n```",
    "created_at": "2012-05-25T22:55:53Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/5677",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/5677#issuecomment-37295",
    "user": "https://github.com/sagetrac-dsm"
}
```

<a id='comment:1'>**Comment 1:**</a>
Is this still valid?  It looks more like `__tmp__` is used, not `_`, these days:


```
sage: preparse("f(x,y) = x^2+y^2")
'__tmp__=var("x,y"); f = symbolic_expression(x**Integer(2)+y**Integer(2)).function(x,y)'
sage: 5
5
sage: _
5
sage: f(x,y) = x^2+y^2
sage: _
5
sage: 7
7
sage: _
7
```



---

archive/issue_events_055550.json:
```json
{
    "actor": "https://github.com/mwhansen",
    "created_at": "2013-07-23T12:56:14Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/5677",
    "milestone_number": null,
    "milestone_title": "sage-5.11",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/5677#event-55550"
}
```



---

archive/issue_events_055551.json:
```json
{
    "actor": "https://github.com/mwhansen",
    "created_at": "2013-07-23T12:56:14Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/5677",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/5677#event-55551"
}
```



---

archive/issue_comments_037296.json:
```json
{
    "body": "<a id='comment:2'>**Comment 2:**</a>\nYep, I think this is invalid now.",
    "created_at": "2013-07-23T12:56:14Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/5677",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/5677#issuecomment-37296",
    "user": "https://github.com/mwhansen"
}
```

<a id='comment:2'>**Comment 2:**</a>
Yep, I think this is invalid now.
