# Issue 5677: Underscore for repeating output clobbered by symbolic variables

archive/issues_005677.json:
```json
{
    "assignees": [],
    "body": "When creating a function with a statement like\n\n`f(x,y) = x<sup>2+y</sup>2`\n\nthe preparser creates a command to declare the variables and assigns it to underscore.  This renders the underscore unusable for repeating the previous output.\n\nA workaround is to use  \n\n`del _` \n\nto restore the functionality.\n\nAssignee: **@williamstein**\n\nKeywords: **underscore repeat output**\n\n_Issue created by migration from https://trac.sagemath.org/ticket/5677_\n\n",
    "closed_at": "2013-07-23T12:56:14Z",
    "created_at": "2009-04-03T21:39:51Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/bug",
        "https://github.com/sagemath/sage/labels/component%3A%20user%20interface",
        "https://github.com/sagemath/sage/labels/invalid"
    ],
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "Underscore for repeating output clobbered by symbolic variables",
    "type": "issue",
    "updated_at": "2013-07-23T12:56:14Z",
    "url": "https://github.com/sagemath/sage/issues/5677",
    "user": "https://github.com/rbeezer"
}
```
When creating a function with a statement like

`f(x,y) = x<sup>2+y</sup>2`

the preparser creates a command to declare the variables and assigns it to underscore.  This renders the underscore unusable for repeating the previous output.

A workaround is to use  

`del _` 

to restore the functionality.

Assignee: **@williamstein**

Keywords: **underscore repeat output**

_Issue created by migration from https://trac.sagemath.org/ticket/5677_





---

archive/issue_events_058913.json:
```json
{
    "actor": "https://github.com/rbeezer",
    "created_at": "2009-04-03T21:39:51Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/5677",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "d73a4a",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/5677#event-58913"
}
```



---

archive/issue_events_058914.json:
```json
{
    "actor": "https://github.com/rbeezer",
    "created_at": "2009-04-03T21:39:51Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/5677",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20user%20interface",
    "label_color": "000080",
    "label_name": "component: user interface",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/5677#event-58914"
}
```



---

archive/issue_events_058915.json:
```json
{
    "actor": "https://github.com/rbeezer",
    "created_at": "2009-04-03T21:39:51Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/5677",
    "label": "https://github.com/sagemath/sage/labels/invalid",
    "label_color": "a6a6a6",
    "label_name": "invalid",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/5677#event-58915"
}
```



---

archive/issue_comments_037301.json:
```json
{
    "body": "<a id='comment:1'>Comment 1:</a>\nIs this still valid?  It looks more like `__tmp__` is used, not `_`, these days:\n\n\n```\nsage: preparse(\"f(x,y) = x^2+y^2\")\n'__tmp__=var(\"x,y\"); f = symbolic_expression(x**Integer(2)+y**Integer(2)).function(x,y)'\nsage: 5\n5\nsage: _\n5\nsage: f(x,y) = x^2+y^2\nsage: _\n5\nsage: 7\n7\nsage: _\n7\n```",
    "created_at": "2012-05-25T22:55:53Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/5677",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/5677#issuecomment-37301",
    "user": "https://github.com/sagetrac-dsm"
}
```

<a id='comment:1'>Comment 1:</a>
Is this still valid?  It looks more like `__tmp__` is used, not `_`, these days:


```
sage: preparse("f(x,y) = x^2+y^2")
'__tmp__=var("x,y"); f = symbolic_expression(x**Integer(2)+y**Integer(2)).function(x,y)'
sage: 5
5
sage: _
5
sage: f(x,y) = x^2+y^2
sage: _
5
sage: 7
7
sage: _
7
```



---

archive/issue_events_058916.json:
```json
{
    "actor": "https://github.com/mwhansen",
    "created_at": "2013-07-23T12:56:14Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/5677",
    "milestone_number": null,
    "milestone_title": "sage-5.11",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/5677#event-58916"
}
```



---

archive/issue_events_058917.json:
```json
{
    "actor": "https://github.com/mwhansen",
    "created_at": "2013-07-23T12:56:14Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/5677",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/5677#event-58917"
}
```



---

archive/issue_comments_037302.json:
```json
{
    "body": "<a id='comment:2'>Comment 2:</a>\nYep, I think this is invalid now.",
    "created_at": "2013-07-23T12:56:14Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/5677",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/5677#issuecomment-37302",
    "user": "https://github.com/mwhansen"
}
```

<a id='comment:2'>Comment 2:</a>
Yep, I think this is invalid now.
