# Issue 17197: document Polyhedron defined over number field

archive/issues_016960.json:
```json
{
    "assignees": [],
    "body": "As reported in this google group (https://groups.google.com/forum/#!topic/sage-support/ew0bnGzjm98), it was not possible to create Polyhedron defined over number fields. Now that #17830 is merged it does work and it should be documented and even advertised in the documentation!\n\n---\nfrom the previous report:\n\nTo create polyhedra quickly, the final suggestion in the Polyhedron documentation (http://www.sagemath.org/doc/reference/geometry/sage/geometry/polyhedron/constructor.html#base-rings) is to work in a set number field. Although this appears to work for setting vertices, it does not appear to work for lines (or rays).\n\nFor example:\n\n```\nsage: var('x')\nx\nsage: K.<sqrt3> = NumberField(x^2-3, embedding=1.732)\nsage: P = Polyhedron(lines=[(1,sqrt3)])\nsage: P\nA 1-dimensional polyhedron in (Number Field in sqrt3 with defining polynomial x^10 + x^2 - 3)^2 defined as the convex hull of 1 vertex and 2 rays\nsage: P.rays()\n(A ray in the direction (0, -sqrt3), A ray in the direction (1, sqrt3))\n```\n\nThis should be compared with:\n\n```\nsage: P = Polyhedron(lines=[(1, sqrt(3))])\nsage: P\nA 1-dimensional polyhedron in (Symbolic Ring)^2 defined as the convex hull of 1 vertex and 1 line\n```\nand\n\n```\nsage: P = Polyhedron(lines=[(1, sqrt(3))], base_ring=AA)\nsage: P\nA 1-dimensional polyhedron in AA^2 defined as the convex hull of 1 vertex and 1 line\n```\n\n\nAdditionally, how can a \"1-dimensional polyhedron\" be \"defined as the convex hull of 1 vertex and 2 rays\"?\n\nAs pointed out below this is an issue with Polyhedron using a number fields < comparison\n\n```\nsage: K.<x> = NumberField(x^3 - 1001, embedding=10)\nsage: x > x + 1\nTrue\n```\n\nDepends on #21105\n\n**CC:**  @fchapoton @jplab jakobkroeker\n\n**Keywords:** Polyhedron, Number field\n\nIssue created by migration from https://trac.sagemath.org/ticket/17197\n\n",
    "created_at": "2014-10-22T14:09:47Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20number%20theory",
        "https://github.com/sagemath/sage/labels/bug",
        "https://github.com/sagemath/sage/labels/needs%20work"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-7.4",
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "document Polyhedron defined over number field",
    "type": "issue",
    "updated_at": "2019-07-22T16:29:49Z",
    "url": "https://github.com/sagemath/sage/issues/17197",
    "user": "https://github.com/sagetrac-mbell"
}
```
As reported in this google group (https://groups.google.com/forum/#!topic/sage-support/ew0bnGzjm98), it was not possible to create Polyhedron defined over number fields. Now that #17830 is merged it does work and it should be documented and even advertised in the documentation!

---
from the previous report:

To create polyhedra quickly, the final suggestion in the Polyhedron documentation (http://www.sagemath.org/doc/reference/geometry/sage/geometry/polyhedron/constructor.html#base-rings) is to work in a set number field. Although this appears to work for setting vertices, it does not appear to work for lines (or rays).

For example:

```
sage: var('x')
x
sage: K.<sqrt3> = NumberField(x^2-3, embedding=1.732)
sage: P = Polyhedron(lines=[(1,sqrt3)])
sage: P
A 1-dimensional polyhedron in (Number Field in sqrt3 with defining polynomial x^10 + x^2 - 3)^2 defined as the convex hull of 1 vertex and 2 rays
sage: P.rays()
(A ray in the direction (0, -sqrt3), A ray in the direction (1, sqrt3))
```

This should be compared with:

```
sage: P = Polyhedron(lines=[(1, sqrt(3))])
sage: P
A 1-dimensional polyhedron in (Symbolic Ring)^2 defined as the convex hull of 1 vertex and 1 line
```
and

```
sage: P = Polyhedron(lines=[(1, sqrt(3))], base_ring=AA)
sage: P
A 1-dimensional polyhedron in AA^2 defined as the convex hull of 1 vertex and 1 line
```


Additionally, how can a "1-dimensional polyhedron" be "defined as the convex hull of 1 vertex and 2 rays"?

As pointed out below this is an issue with Polyhedron using a number fields < comparison

```
sage: K.<x> = NumberField(x^3 - 1001, embedding=10)
sage: x > x + 1
True
```

Depends on #21105

**CC:**  @fchapoton @jplab jakobkroeker

**Keywords:** Polyhedron, Number field

Issue created by migration from https://trac.sagemath.org/ticket/17197





---

archive/issue_comments_230992.json:
```json
{
    "body": "<a id='comment:1'></a>\nWith 6.4.beta6 I get \n\n```\nsage: Polyhedron(lines=[(1,sqrt3)])\nA 1-dimensional polyhedron in (Number Field in sqrt3 with defining polynomial x^2 - 3)^2 defined as the convex hull of 1 vertex and 1 line\n```",
    "created_at": "2014-10-22T16:03:45Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/17197",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/17197#issuecomment-230992",
    "user": "https://github.com/vbraun"
}
```

<a id='comment:1'></a>
With 6.4.beta6 I get 

```
sage: Polyhedron(lines=[(1,sqrt3)])
A 1-dimensional polyhedron in (Number Field in sqrt3 with defining polynomial x^2 - 3)^2 defined as the convex hull of 1 vertex and 1 line
```



---

archive/issue_comments_230993.json:
```json
{
    "body": "<a id='comment:2'></a>\nThough the original example fails:\n\n```\nsage: K.<L> = NumberField(x^3 + 3*x^2 - 83*x - 1022, embedding=11.6515)\nsage: Polyhedron(eqns=[[0, -L - 2, -8, 2], [0, -2, -L + 6, 9], [0, -9, 5, -L - 7]])\nA 3-dimensional polyhedron in (Number Field in L with defining polynomial x^3 + 3*x^2 - 83*x - 1022)^3 defined as the convex hull of 1 vertex, 2 rays, 1 line\n```\n\nSlightly simpler failure:\n\n```\nsage: Polyhedron(eqns=[[0, -L - 2, -8], [0, -2, -L + 6], [0, -9, 5]])\nA 2-dimensional polyhedron in (Number Field in L with defining polynomial x^3 + 3*x^2 - 83*x - 1022)^2 defined as the convex hull of 1 vertex and 2 rays\n```",
    "created_at": "2014-10-22T16:09:51Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/17197",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/17197#issuecomment-230993",
    "user": "https://github.com/vbraun"
}
```

<a id='comment:2'></a>
Though the original example fails:

```
sage: K.<L> = NumberField(x^3 + 3*x^2 - 83*x - 1022, embedding=11.6515)
sage: Polyhedron(eqns=[[0, -L - 2, -8, 2], [0, -2, -L + 6, 9], [0, -9, 5, -L - 7]])
A 3-dimensional polyhedron in (Number Field in L with defining polynomial x^3 + 3*x^2 - 83*x - 1022)^3 defined as the convex hull of 1 vertex, 2 rays, 1 line
```

Slightly simpler failure:

```
sage: Polyhedron(eqns=[[0, -L - 2, -8], [0, -2, -L + 6], [0, -9, 5]])
A 2-dimensional polyhedron in (Number Field in L with defining polynomial x^3 + 3*x^2 - 83*x - 1022)^2 defined as the convex hull of 1 vertex and 2 rays
```



---

archive/issue_comments_230994.json:
```json
{
    "body": "<a id='comment:3'></a>\nThis originates at the following comparison:\n\n```\nsage: v = -1/392*L^2 - 45/392*L - 239/392\nsage: v > 0\nTrue\nsage: v.n()\n-2.29356924372991\n```",
    "created_at": "2014-10-22T17:01:24Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/17197",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/17197#issuecomment-230994",
    "user": "https://github.com/vbraun"
}
```

<a id='comment:3'></a>
This originates at the following comparison:

```
sage: v = -1/392*L^2 - 45/392*L - 239/392
sage: v > 0
True
sage: v.n()
-2.29356924372991
```



---

archive/issue_comments_230995.json:
```json
{
    "body": "<a id='comment:4'></a>\nThanks for tracking this down. Should I file a separate ticket for this under the number theory?",
    "created_at": "2014-10-23T21:09:34Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/17197",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/17197#issuecomment-230995",
    "user": "https://github.com/sagetrac-mbell"
}
```

<a id='comment:4'></a>
Thanks for tracking this down. Should I file a separate ticket for this under the number theory?



---

archive/issue_comments_230996.json:
```json
{
    "body": "<a id='comment:5'></a>\nYou can just change the description and use this ticket. I think we agree that this is not a bug in polyhedra. See also the discussion on sage-devel.",
    "created_at": "2014-10-24T16:36:23Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/17197",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/17197#issuecomment-230996",
    "user": "https://github.com/vbraun"
}
```

<a id='comment:5'></a>
You can just change the description and use this ticket. I think we agree that this is not a bug in polyhedra. See also the discussion on sage-devel.



---

archive/issue_comments_230997.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -32,3 +32,13 @@\n \n \n Additionally, how can a \"1-dimensional polyhedron\" be \"defined as the convex hull of 1 vertex and 2 rays\"?\n+\n+---\n+\n+As pointed out below this is an issue with Polyhedron using a number fields < comparison\n+\n+```\n+sage: K.<x> = NumberField(x^3 - 1001, embedding=10)\n+sage: x > x + 1\n+True\n+```\n``````\n",
    "created_at": "2014-10-24T16:51:03Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/17197",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/17197#issuecomment-230997",
    "user": "https://github.com/sagetrac-mbell"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -32,3 +32,13 @@
 
 
 Additionally, how can a "1-dimensional polyhedron" be "defined as the convex hull of 1 vertex and 2 rays"?
+
+---
+
+As pointed out below this is an issue with Polyhedron using a number fields < comparison
+
+```
+sage: K.<x> = NumberField(x^3 - 1001, embedding=10)
+sage: x > x + 1
+True
+```
``````




---

archive/issue_events_154327.json:
```json
{
    "actor": "https://github.com/sagetrac-mbell",
    "created_at": "2014-10-24T16:51:03Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/17197",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20geometry",
    "label_color": "08517b",
    "label_name": "component: geometry",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/17197#event-154327"
}
```



---

archive/issue_events_154328.json:
```json
{
    "actor": "https://github.com/sagetrac-mbell",
    "created_at": "2014-10-24T16:51:03Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/17197",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20number%20theory",
    "label_color": "08517b",
    "label_name": "component: number theory",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/17197#event-154328"
}
```



---

archive/issue_comments_230998.json:
```json
{
    "body": "<a id='comment:7'></a>\nComparison is fixed for quadratic fields since #13213. To have it working on higher degree number field you could review #17830.\n\nVincent",
    "created_at": "2015-04-15T22:57:50Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/17197",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/17197#issuecomment-230998",
    "user": "https://github.com/videlec"
}
```

<a id='comment:7'></a>
Comparison is fixed for quadratic fields since #13213. To have it working on higher degree number field you could review #17830.

Vincent



---

archive/issue_comments_230999.json:
```json
{
    "body": "<a id='comment:8'></a>\nAll of these tests in description and comments seem to working in 7.3.beta9.",
    "created_at": "2016-07-26T22:38:35Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/17197",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/17197#issuecomment-230999",
    "user": "https://github.com/mkoeppe"
}
```

<a id='comment:8'></a>
All of these tests in description and comments seem to working in 7.3.beta9.



---

archive/issue_events_154329.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2016-07-26T22:38:35Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/17197",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "008080",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/17197#event-154329"
}
```



---

archive/issue_events_154330.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2016-07-26T22:38:35Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/17197",
    "milestone_number": null,
    "milestone_title": "sage-6.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/17197#event-154330"
}
```



---

archive/issue_events_154331.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2016-07-26T22:38:35Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/17197",
    "label": "https://github.com/sagemath/sage/labels/invalid",
    "label_color": "008080",
    "label_name": "invalid",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/17197#event-154331"
}
```



---

archive/issue_comments_231000.json:
```json
{
    "body": "<a id='comment:9'></a>\nyes because comparison in number fields is now working... (#17830). Instead of making it invalid, it would be much better to add doctests!",
    "created_at": "2016-07-26T22:40:13Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/17197",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/17197#issuecomment-231000",
    "user": "https://github.com/videlec"
}
```

<a id='comment:9'></a>
yes because comparison in number fields is now working... (#17830). Instead of making it invalid, it would be much better to add doctests!



---

archive/issue_events_154332.json:
```json
{
    "actor": "https://github.com/videlec",
    "created_at": "2016-07-26T22:40:13Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/17197",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "008080",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/17197#event-154332"
}
```



---

archive/issue_events_154333.json:
```json
{
    "actor": "https://github.com/videlec",
    "created_at": "2016-07-26T22:40:13Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/17197",
    "label": "https://github.com/sagemath/sage/labels/needs%20work",
    "label_color": "008080",
    "label_name": "needs work",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/17197#event-154333"
}
```



---

archive/issue_events_154334.json:
```json
{
    "actor": "https://github.com/videlec",
    "created_at": "2016-07-26T22:40:13Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/17197",
    "milestone_number": null,
    "milestone_title": "sage-7.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/17197#event-154334"
}
```



---

archive/issue_events_154335.json:
```json
{
    "actor": "https://github.com/videlec",
    "created_at": "2016-07-26T22:49:18Z",
    "event": "renamed",
    "issue": "https://github.com/sagemath/sage/issues/17197",
    "rename": {
        "from": "Bug creating Polyhedron from lines in number field",
        "to": "document Polyhedron defined over number field"
    },
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/17197#event-154335"
}
```



---

archive/issue_comments_231001.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -1,4 +1,7 @@\n-I reported this to the google group (https://groups.google.com/forum/#!topic/sage-support/ew0bnGzjm98) but was told to repeat it here.\n+As reported in this google group (https://groups.google.com/forum/#!topic/sage-support/ew0bnGzjm98), it was not possible to create Polyhedron defined over number fields. Now that #17830 is merged it does work and it should be documented and even advertised in the documentation!\n+\n+---\n+from the previous report:\n \n To create polyhedra quickly, the final suggestion in the Polyhedron documentation (http://www.sagemath.org/doc/reference/geometry/sage/geometry/polyhedron/constructor.html#base-rings) is to work in a set number field. Although this appears to work for setting vertices, it does not appear to work for lines (or rays).\n \n@@ -33,8 +36,6 @@\n \n Additionally, how can a \"1-dimensional polyhedron\" be \"defined as the convex hull of 1 vertex and 2 rays\"?\n \n----\n-\n As pointed out below this is an issue with Polyhedron using a number fields < comparison\n \n ```\n``````\n",
    "created_at": "2016-07-26T22:49:18Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/17197",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/17197#issuecomment-231001",
    "user": "https://github.com/videlec"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -1,4 +1,7 @@
-I reported this to the google group (https://groups.google.com/forum/#!topic/sage-support/ew0bnGzjm98) but was told to repeat it here.
+As reported in this google group (https://groups.google.com/forum/#!topic/sage-support/ew0bnGzjm98), it was not possible to create Polyhedron defined over number fields. Now that #17830 is merged it does work and it should be documented and even advertised in the documentation!
+
+---
+from the previous report:
 
 To create polyhedra quickly, the final suggestion in the Polyhedron documentation (http://www.sagemath.org/doc/reference/geometry/sage/geometry/polyhedron/constructor.html#base-rings) is to work in a set number field. Although this appears to work for setting vertices, it does not appear to work for lines (or rays).
 
@@ -33,8 +36,6 @@
 
 Additionally, how can a "1-dimensional polyhedron" be "defined as the convex hull of 1 vertex and 2 rays"?
 
----
-
 As pointed out below this is an issue with Polyhedron using a number fields < comparison
 
 ```
``````




---

archive/issue_comments_231002.json:
```json
{
    "body": "**Dependencies:** #21105",
    "created_at": "2016-08-03T23:39:46Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/17197",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/17197#issuecomment-231002",
    "user": "https://github.com/mkoeppe"
}
```

**Dependencies:** #21105



---

archive/issue_events_154336.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2016-08-17T19:54:23Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/17197",
    "milestone_number": null,
    "milestone_title": "sage-7.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/17197#event-154336"
}
```



---

archive/issue_events_154337.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2016-08-17T19:54:23Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/17197",
    "milestone_number": null,
    "milestone_title": "sage-7.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/17197#event-154337"
}
```



---

archive/issue_comments_231003.json:
```json
{
    "body": "<a id='comment:15'></a>\nSince the Polyhedron evolved quite a bit in the last year, here is an update on Sage8.2.rc1:\n\n```\nsage: var('x')\nx\nsage: K.<sqrt3> = NumberField(x^2-3, embedding=1.732)\nsage: P = Polyhedron(lines=[(1,sqrt3)])\nsage: P.rays()\n()\nsage: P.lines()\n(A line in the direction (1, sqrt3),)\n\nsage: P = Polyhedron(lines=[(1, sqrt(3))])\nTraceback (most recent call last):\n...\nValueError: for polyhedra with floating point numbers, the only allowed ring is RDF with backend 'cdd'\n\nsage: P = Polyhedron(lines=[(1, sqrt(3))], base_ring=AA)\nsage: P\nA 1-dimensional polyhedron in AA^2 defined as the convex hull of 1 vertex and 1 line\n```\n\nThe value error above will be changed in #24835 to a more appropriate error message, for which:\n\n```\nsage: P = Polyhedron(lines=[(1, sqrt(3))],backend='cdd',base_ring=RDF)\nsage: P\nA 1-dimensional polyhedron in RDF^2 defined as the convex hull of 1 vertex and 1 line\n```\n\nis the only way to get a symbolic expression to pass on to the constructor of Polyhedron.\n\nConcerning documenting the Polyhedron class usage through NumberFields, I believe that #22572 does the job.\n\nHence, once #22572 is merged, I would set this ticket to won't fix: the bug is fixed.",
    "created_at": "2018-04-12T00:14:14Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/17197",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/17197#issuecomment-231003",
    "user": "https://github.com/jplab"
}
```

<a id='comment:15'></a>
Since the Polyhedron evolved quite a bit in the last year, here is an update on Sage8.2.rc1:

```
sage: var('x')
x
sage: K.<sqrt3> = NumberField(x^2-3, embedding=1.732)
sage: P = Polyhedron(lines=[(1,sqrt3)])
sage: P.rays()
()
sage: P.lines()
(A line in the direction (1, sqrt3),)

sage: P = Polyhedron(lines=[(1, sqrt(3))])
Traceback (most recent call last):
...
ValueError: for polyhedra with floating point numbers, the only allowed ring is RDF with backend 'cdd'

sage: P = Polyhedron(lines=[(1, sqrt(3))], base_ring=AA)
sage: P
A 1-dimensional polyhedron in AA^2 defined as the convex hull of 1 vertex and 1 line
```

The value error above will be changed in #24835 to a more appropriate error message, for which:

```
sage: P = Polyhedron(lines=[(1, sqrt(3))],backend='cdd',base_ring=RDF)
sage: P
A 1-dimensional polyhedron in RDF^2 defined as the convex hull of 1 vertex and 1 line
```

is the only way to get a symbolic expression to pass on to the constructor of Polyhedron.

Concerning documenting the Polyhedron class usage through NumberFields, I believe that #22572 does the job.

Hence, once #22572 is merged, I would set this ticket to won't fix: the bug is fixed.



---

archive/issue_comments_231004.json:
```json
{
    "body": "<a id='comment:16'></a>\nAn improvement of the doc is posted on #26077, where I also point out that\nit is not sufficient to have a tutorial doc: the docstring of Polyhedron should have a real example with NF entries.",
    "created_at": "2018-08-18T08:46:30Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/17197",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/17197#issuecomment-231004",
    "user": "https://github.com/dimpase"
}
```

<a id='comment:16'></a>
An improvement of the doc is posted on #26077, where I also point out that
it is not sufficient to have a tutorial doc: the docstring of Polyhedron should have a real example with NF entries.



---

archive/issue_comments_231005.json:
```json
{
    "body": "<a id='comment:17'></a>\nJust an update of the current situation in `8.9beta3`:\n\n```\nsage: var('x')\nx\nsage: K.<sqrt3> = NumberField(x^2-3, embedding=1.732)\nsage: P = Polyhedron(lines=[(1,sqrt3)])\nsage: P.rays()\n()\nsage: P.lines()\n(A line in the direction (1, sqrt3),)\nsage: P = Polyhedron(lines=[(1, sqrt(3))])\nTraceback (most recent call last):\n...\nValueError: no default backend for computations with Symbolic Ring\nsage: P = Polyhedron(lines=[(1, sqrt(3))], base_ring=AA); P\nA 1-dimensional polyhedron in AA^2 defined as the convex hull of 1 vertex and 1 line\nsage: Q = Polyhedron(lines=[(1, sqrt(3))], backend='normaliz'); Q\nA 1-dimensional polyhedron in (Symbolic Ring)^2 defined as the convex hull of 1 vertex and 1 line\n```\n\nand it is still possible to do:\n\n```\nsage: R = Polyhedron(lines=[(1, sqrt(3))],backend='cdd',base_ring=RDF);R\nA 1-dimensional polyhedron in RDF^2 defined as the convex hull of 1 vertex and 1 line\n```\n\nSimilar examples should now complete the docstring, now that #25097 is merged.",
    "created_at": "2019-07-22T16:29:49Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/17197",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/17197#issuecomment-231005",
    "user": "https://github.com/jplab"
}
```

<a id='comment:17'></a>
Just an update of the current situation in `8.9beta3`:

```
sage: var('x')
x
sage: K.<sqrt3> = NumberField(x^2-3, embedding=1.732)
sage: P = Polyhedron(lines=[(1,sqrt3)])
sage: P.rays()
()
sage: P.lines()
(A line in the direction (1, sqrt3),)
sage: P = Polyhedron(lines=[(1, sqrt(3))])
Traceback (most recent call last):
...
ValueError: no default backend for computations with Symbolic Ring
sage: P = Polyhedron(lines=[(1, sqrt(3))], base_ring=AA); P
A 1-dimensional polyhedron in AA^2 defined as the convex hull of 1 vertex and 1 line
sage: Q = Polyhedron(lines=[(1, sqrt(3))], backend='normaliz'); Q
A 1-dimensional polyhedron in (Symbolic Ring)^2 defined as the convex hull of 1 vertex and 1 line
```

and it is still possible to do:

```
sage: R = Polyhedron(lines=[(1, sqrt(3))],backend='cdd',base_ring=RDF);R
A 1-dimensional polyhedron in RDF^2 defined as the convex hull of 1 vertex and 1 line
```

Similar examples should now complete the docstring, now that #25097 is merged.
