# Issue 17197: document Polyhedron defined over number field

archive/issues_016960.json:
```json
{
    "body": "As reported in this google group (https://groups.google.com/forum/#!topic/sage-support/ew0bnGzjm98), it was not possible to create Polyhedron defined over number fields. Now that #17830 is merged it does work and it should be documented and even advertised in the documentation!\n\n---\nfrom the previous report:\n\nTo create polyhedra quickly, the final suggestion in the Polyhedron documentation (http://www.sagemath.org/doc/reference/geometry/sage/geometry/polyhedron/constructor.html#base-rings) is to work in a set number field. Although this appears to work for setting vertices, it does not appear to work for lines (or rays).\n\nFor example:\n\n```\nsage: var('x')\nx\nsage: K.<sqrt3> = NumberField(x^2-3, embedding=1.732)\nsage: P = Polyhedron(lines=[(1,sqrt3)])\nsage: P\nA 1-dimensional polyhedron in (Number Field in sqrt3 with defining polynomial x^10 + x^2 - 3)^2 defined as the convex hull of 1 vertex and 2 rays\nsage: P.rays()\n(A ray in the direction (0, -sqrt3), A ray in the direction (1, sqrt3))\n```\n\nThis should be compared with:\n\n```\nsage: P = Polyhedron(lines=[(1, sqrt(3))])\nsage: P\nA 1-dimensional polyhedron in (Symbolic Ring)^2 defined as the convex hull of 1 vertex and 1 line\n```\nand\n\n```\nsage: P = Polyhedron(lines=[(1, sqrt(3))], base_ring=AA)\nsage: P\nA 1-dimensional polyhedron in AA^2 defined as the convex hull of 1 vertex and 1 line\n```\n\n\nAdditionally, how can a \"1-dimensional polyhedron\" be \"defined as the convex hull of 1 vertex and 2 rays\"?\n\nAs pointed out below this is an issue with Polyhedron using a number fields < comparison\n\n```\nsage: K.<x> = NumberField(x^3 - 1001, embedding=10)\nsage: x > x + 1\nTrue\n```\n\nCC:  @fchapoton @jplab jakobkroeker\n\nKeywords: Polyhedron, Number field\n\nStatus: needs_work\n\nDependencies: #21105\n\nIssue created by migration from https://trac.sagemath.org/ticket/17197\n\n",
    "created_at": "2014-10-22T14:09:47Z",
    "labels": [
        "component: number theory",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-7.4",
    "title": "document Polyhedron defined over number field",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/17197",
    "user": "https://trac.sagemath.org/admin/accounts/users/mbell"
}
```
As reported in this google group (https://groups.google.com/forum/#!topic/sage-support/ew0bnGzjm98), it was not possible to create Polyhedron defined over number fields. Now that #17830 is merged it does work and it should be documented and even advertised in the documentation!

---
from the previous report:

To create polyhedra quickly, the final suggestion in the Polyhedron documentation (http://www.sagemath.org/doc/reference/geometry/sage/geometry/polyhedron/constructor.html#base-rings) is to work in a set number field. Although this appears to work for setting vertices, it does not appear to work for lines (or rays).

For example:

```
sage: var('x')
x
sage: K.<sqrt3> = NumberField(x^2-3, embedding=1.732)
sage: P = Polyhedron(lines=[(1,sqrt3)])
sage: P
A 1-dimensional polyhedron in (Number Field in sqrt3 with defining polynomial x^10 + x^2 - 3)^2 defined as the convex hull of 1 vertex and 2 rays
sage: P.rays()
(A ray in the direction (0, -sqrt3), A ray in the direction (1, sqrt3))
```

This should be compared with:

```
sage: P = Polyhedron(lines=[(1, sqrt(3))])
sage: P
A 1-dimensional polyhedron in (Symbolic Ring)^2 defined as the convex hull of 1 vertex and 1 line
```
and

```
sage: P = Polyhedron(lines=[(1, sqrt(3))], base_ring=AA)
sage: P
A 1-dimensional polyhedron in AA^2 defined as the convex hull of 1 vertex and 1 line
```


Additionally, how can a "1-dimensional polyhedron" be "defined as the convex hull of 1 vertex and 2 rays"?

As pointed out below this is an issue with Polyhedron using a number fields < comparison

```
sage: K.<x> = NumberField(x^3 - 1001, embedding=10)
sage: x > x + 1
True
```

CC:  @fchapoton @jplab jakobkroeker

Keywords: Polyhedron, Number field

Status: needs_work

Dependencies: #21105

Issue created by migration from https://trac.sagemath.org/ticket/17197





---

archive/issue_comments_239269.json:
```json
{
    "body": "<a id='comment:1'></a>With 6.4.beta6 I get \n\n```\nsage: Polyhedron(lines=[(1,sqrt3)])\nA 1-dimensional polyhedron in (Number Field in sqrt3 with defining polynomial x^2 - 3)^2 defined as the convex hull of 1 vertex and 1 line\n```",
    "created_at": "2014-10-22T16:03:45Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17197",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17197#issuecomment-239269",
    "user": "https://github.com/vbraun"
}
```

<a id='comment:1'></a>With 6.4.beta6 I get 

```
sage: Polyhedron(lines=[(1,sqrt3)])
A 1-dimensional polyhedron in (Number Field in sqrt3 with defining polynomial x^2 - 3)^2 defined as the convex hull of 1 vertex and 1 line
```



---

archive/issue_comments_239270.json:
```json
{
    "body": "<a id='comment:2'></a>Though the original example fails:\n\n```\nsage: K.<L> = NumberField(x^3 + 3*x^2 - 83*x - 1022, embedding=11.6515)\nsage: Polyhedron(eqns=[[0, -L - 2, -8, 2], [0, -2, -L + 6, 9], [0, -9, 5, -L - 7]])\nA 3-dimensional polyhedron in (Number Field in L with defining polynomial x^3 + 3*x^2 - 83*x - 1022)^3 defined as the convex hull of 1 vertex, 2 rays, 1 line\n```\n\nSlightly simpler failure:\n\n```\nsage: Polyhedron(eqns=[[0, -L - 2, -8], [0, -2, -L + 6], [0, -9, 5]])\nA 2-dimensional polyhedron in (Number Field in L with defining polynomial x^3 + 3*x^2 - 83*x - 1022)^2 defined as the convex hull of 1 vertex and 2 rays\n```",
    "created_at": "2014-10-22T16:09:51Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17197",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17197#issuecomment-239270",
    "user": "https://github.com/vbraun"
}
```

<a id='comment:2'></a>Though the original example fails:

```
sage: K.<L> = NumberField(x^3 + 3*x^2 - 83*x - 1022, embedding=11.6515)
sage: Polyhedron(eqns=[[0, -L - 2, -8, 2], [0, -2, -L + 6, 9], [0, -9, 5, -L - 7]])
A 3-dimensional polyhedron in (Number Field in L with defining polynomial x^3 + 3*x^2 - 83*x - 1022)^3 defined as the convex hull of 1 vertex, 2 rays, 1 line
```

Slightly simpler failure:

```
sage: Polyhedron(eqns=[[0, -L - 2, -8], [0, -2, -L + 6], [0, -9, 5]])
A 2-dimensional polyhedron in (Number Field in L with defining polynomial x^3 + 3*x^2 - 83*x - 1022)^2 defined as the convex hull of 1 vertex and 2 rays
```



---

archive/issue_comments_239271.json:
```json
{
    "body": "<a id='comment:3'></a>This originates at the following comparison:\n\n```\nsage: v = -1/392*L^2 - 45/392*L - 239/392\nsage: v > 0\nTrue\nsage: v.n()\n-2.29356924372991\n```",
    "created_at": "2014-10-22T17:01:24Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17197",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17197#issuecomment-239271",
    "user": "https://github.com/vbraun"
}
```

<a id='comment:3'></a>This originates at the following comparison:

```
sage: v = -1/392*L^2 - 45/392*L - 239/392
sage: v > 0
True
sage: v.n()
-2.29356924372991
```



---

archive/issue_comments_239272.json:
```json
{
    "body": "<a id='comment:4'></a>Thanks for tracking this down. Should I file a separate ticket for this under the number theory?",
    "created_at": "2014-10-23T21:09:34Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17197",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17197#issuecomment-239272",
    "user": "https://trac.sagemath.org/admin/accounts/users/mbell"
}
```

<a id='comment:4'></a>Thanks for tracking this down. Should I file a separate ticket for this under the number theory?



---

archive/issue_comments_239273.json:
```json
{
    "body": "<a id='comment:5'></a>You can just change the description and use this ticket. I think we agree that this is not a bug in polyhedra. See also the discussion on sage-devel.",
    "created_at": "2014-10-24T16:36:23Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17197",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17197#issuecomment-239273",
    "user": "https://github.com/vbraun"
}
```

<a id='comment:5'></a>You can just change the description and use this ticket. I think we agree that this is not a bug in polyhedra. See also the discussion on sage-devel.



---

archive/issue_comments_239274.json:
```json
{
    "body": "Description changed:\n```diff\n--- \n+++ \n@@ -33,6 +33,16 @@\n \n Additionally, how can a \"1-dimensional polyhedron\" be \"defined as the convex hull of 1 vertex and 2 rays\"?\n \n+---\n+\n+As pointed out below this is an issue with Polyhedron using a number fields < comparison\n+\n+\\`\\`\\`\n+sage: K.<x> = NumberField(x^3 - 1001, embedding=10)\n+sage: x > x + 1\n+True\n+\\`\\`\\`\n+\n Comment: 1\n \n Component: geometry\n```\n",
    "created_at": "2014-10-24T16:51:03Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17197",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17197#issuecomment-239274",
    "user": "https://trac.sagemath.org/admin/accounts/users/mbell"
}
```

Description changed:
```diff
--- 
+++ 
@@ -33,6 +33,16 @@
 
 Additionally, how can a "1-dimensional polyhedron" be "defined as the convex hull of 1 vertex and 2 rays"?
 
+---
+
+As pointed out below this is an issue with Polyhedron using a number fields < comparison
+
+\`\`\`
+sage: K.<x> = NumberField(x^3 - 1001, embedding=10)
+sage: x > x + 1
+True
+\`\`\`
+
 Comment: 1
 
 Component: geometry
```




---

archive/issue_comments_239275.json:
```json
{
    "body": "Changing component from geometry to number theory.",
    "created_at": "2014-10-24T16:51:03Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17197",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17197#issuecomment-239275",
    "user": "https://trac.sagemath.org/admin/accounts/users/mbell"
}
```

Changing component from geometry to number theory.



---

archive/issue_comments_239276.json:
```json
{
    "body": "<a id='comment:7'></a>Comparison is fixed for quadratic fields since #13213. To have it working on higher degree number field you could review #17830.\n\nVincent",
    "created_at": "2015-04-15T22:57:50Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17197",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17197#issuecomment-239276",
    "user": "https://github.com/videlec"
}
```

<a id='comment:7'></a>Comparison is fixed for quadratic fields since #13213. To have it working on higher degree number field you could review #17830.

Vincent



---

archive/issue_comments_239277.json:
```json
{
    "body": "<a id='comment:8'></a>All of these tests in description and comments seem to working in 7.3.beta9.",
    "created_at": "2016-07-26T22:38:35Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17197",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17197#issuecomment-239277",
    "user": "https://github.com/mkoeppe"
}
```

<a id='comment:8'></a>All of these tests in description and comments seem to working in 7.3.beta9.



---

archive/issue_comments_239278.json:
```json
{
    "body": "Changing status from new to needs_review.",
    "created_at": "2016-07-26T22:38:35Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17197",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17197#issuecomment-239278",
    "user": "https://github.com/mkoeppe"
}
```

Changing status from new to needs_review.



---

archive/issue_events_049824.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2016-07-26T22:38:35Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/17197",
    "milestone": "sage-duplicate/invalid/wontfix",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/17197#event-49824"
}
```



---

archive/issue_comments_239279.json:
```json
{
    "body": "<a id='comment:9'></a>yes because comparison in number fields is now working... (#17830). Instead of making it invalid, it would be much better to add doctests!",
    "created_at": "2016-07-26T22:40:13Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17197",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17197#issuecomment-239279",
    "user": "https://github.com/videlec"
}
```

<a id='comment:9'></a>yes because comparison in number fields is now working... (#17830). Instead of making it invalid, it would be much better to add doctests!



---

archive/issue_comments_239280.json:
```json
{
    "body": "Changing status from needs_review to needs_work.",
    "created_at": "2016-07-26T22:40:13Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17197",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17197#issuecomment-239280",
    "user": "https://github.com/videlec"
}
```

Changing status from needs_review to needs_work.



---

archive/issue_events_049825.json:
```json
{
    "actor": "https://github.com/videlec",
    "created_at": "2016-07-26T22:40:13Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/17197",
    "milestone": "sage-duplicate/invalid/wontfix",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/17197#event-49825"
}
```



---

archive/issue_events_049826.json:
```json
{
    "actor": "https://github.com/videlec",
    "created_at": "2016-07-26T22:40:13Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/17197",
    "milestone": "sage-7.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/17197#event-49826"
}
```



---

archive/issue_comments_239281.json:
```json
{
    "body": "Description changed:\n```diff\n--- \n+++ \n@@ -1,4 +1,48 @@\n+As reported in this google group (https://groups.google.com/forum/#!topic/sage-support/ew0bnGzjm98), it was not possible to create Polyhedron defined over number fields. Now that #17830 is merged it does work and it should be documented and even advertised in the documentation!\n \n+---\n+from the previous report:\n+\n+To create polyhedra quickly, the final suggestion in the Polyhedron documentation (http://www.sagemath.org/doc/reference/geometry/sage/geometry/polyhedron/constructor.html#base-rings) is to work in a set number field. Although this appears to work for setting vertices, it does not appear to work for lines (or rays).\n+\n+For example:\n+\n+\\`\\`\\`\n+sage: var('x')\n+x\n+sage: K.<sqrt3> = NumberField(x^2-3, embedding=1.732)\n+sage: P = Polyhedron(lines=[(1,sqrt3)])\n+sage: P\n+A 1-dimensional polyhedron in (Number Field in sqrt3 with defining polynomial x^10 + x^2 - 3)^2 defined as the convex hull of 1 vertex and 2 rays\n+sage: P.rays()\n+(A ray in the direction (0, -sqrt3), A ray in the direction (1, sqrt3))\n+\\`\\`\\`\n+\n+This should be compared with:\n+\n+\\`\\`\\`\n+sage: P = Polyhedron(lines=[(1, sqrt(3))])\n+sage: P\n+A 1-dimensional polyhedron in (Symbolic Ring)^2 defined as the convex hull of 1 vertex and 1 line\n+\\`\\`\\`\n+and\n+\n+\\`\\`\\`\n+sage: P = Polyhedron(lines=[(1, sqrt(3))], base_ring=AA)\n+sage: P\n+A 1-dimensional polyhedron in AA^2 defined as the convex hull of 1 vertex and 1 line\n+\\`\\`\\`\n+\n+\n+Additionally, how can a \"1-dimensional polyhedron\" be \"defined as the convex hull of 1 vertex and 2 rays\"?\n+\n+As pointed out below this is an issue with Polyhedron using a number fields < comparison\n+\n+\\`\\`\\`\n+sage: K.<x> = NumberField(x^3 - 1001, embedding=10)\n+sage: x > x + 1\n+True\n+\\`\\`\\`\n \n Comment: 1\n \n```\n",
    "created_at": "2016-07-26T22:49:18Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17197",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17197#issuecomment-239281",
    "user": "https://github.com/videlec"
}
```

Description changed:
```diff
--- 
+++ 
@@ -1,4 +1,48 @@
+As reported in this google group (https://groups.google.com/forum/#!topic/sage-support/ew0bnGzjm98), it was not possible to create Polyhedron defined over number fields. Now that #17830 is merged it does work and it should be documented and even advertised in the documentation!
 
+---
+from the previous report:
+
+To create polyhedra quickly, the final suggestion in the Polyhedron documentation (http://www.sagemath.org/doc/reference/geometry/sage/geometry/polyhedron/constructor.html#base-rings) is to work in a set number field. Although this appears to work for setting vertices, it does not appear to work for lines (or rays).
+
+For example:
+
+\`\`\`
+sage: var('x')
+x
+sage: K.<sqrt3> = NumberField(x^2-3, embedding=1.732)
+sage: P = Polyhedron(lines=[(1,sqrt3)])
+sage: P
+A 1-dimensional polyhedron in (Number Field in sqrt3 with defining polynomial x^10 + x^2 - 3)^2 defined as the convex hull of 1 vertex and 2 rays
+sage: P.rays()
+(A ray in the direction (0, -sqrt3), A ray in the direction (1, sqrt3))
+\`\`\`
+
+This should be compared with:
+
+\`\`\`
+sage: P = Polyhedron(lines=[(1, sqrt(3))])
+sage: P
+A 1-dimensional polyhedron in (Symbolic Ring)^2 defined as the convex hull of 1 vertex and 1 line
+\`\`\`
+and
+
+\`\`\`
+sage: P = Polyhedron(lines=[(1, sqrt(3))], base_ring=AA)
+sage: P
+A 1-dimensional polyhedron in AA^2 defined as the convex hull of 1 vertex and 1 line
+\`\`\`
+
+
+Additionally, how can a "1-dimensional polyhedron" be "defined as the convex hull of 1 vertex and 2 rays"?
+
+As pointed out below this is an issue with Polyhedron using a number fields < comparison
+
+\`\`\`
+sage: K.<x> = NumberField(x^3 - 1001, embedding=10)
+sage: x > x + 1
+True
+\`\`\`
 
 Comment: 1
 
```




---

archive/issue_events_049827.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2016-08-17T19:54:23Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/17197",
    "milestone": "sage-7.3",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/17197#event-49827"
}
```



---

archive/issue_events_049828.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2016-08-17T19:54:23Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/17197",
    "milestone": "sage-7.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/17197#event-49828"
}
```



---

archive/issue_comments_239282.json:
```json
{
    "body": "<a id='comment:15'></a>Since the Polyhedron evolved quite a bit in the last year, here is an update on Sage8.2.rc1:\n\n```\nsage: var('x')\nx\nsage: K.<sqrt3> = NumberField(x^2-3, embedding=1.732)\nsage: P = Polyhedron(lines=[(1,sqrt3)])\nsage: P.rays()\n()\nsage: P.lines()\n(A line in the direction (1, sqrt3),)\n\nsage: P = Polyhedron(lines=[(1, sqrt(3))])\nTraceback (most recent call last):\n...\nValueError: for polyhedra with floating point numbers, the only allowed ring is RDF with backend 'cdd'\n\nsage: P = Polyhedron(lines=[(1, sqrt(3))], base_ring=AA)\nsage: P\nA 1-dimensional polyhedron in AA^2 defined as the convex hull of 1 vertex and 1 line\n```\n\nThe value error above will be changed in #24835 to a more appropriate error message, for which:\n\n```\nsage: P = Polyhedron(lines=[(1, sqrt(3))],backend='cdd',base_ring=RDF)\nsage: P\nA 1-dimensional polyhedron in RDF^2 defined as the convex hull of 1 vertex and 1 line\n```\n\nis the only way to get a symbolic expression to pass on to the constructor of Polyhedron.\n\nConcerning documenting the Polyhedron class usage through NumberFields, I believe that #22572 does the job.\n\nHence, once #22572 is merged, I would set this ticket to won't fix: the bug is fixed.",
    "created_at": "2018-04-12T00:14:14Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17197",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17197#issuecomment-239282",
    "user": "https://github.com/jplab"
}
```

<a id='comment:15'></a>Since the Polyhedron evolved quite a bit in the last year, here is an update on Sage8.2.rc1:

```
sage: var('x')
x
sage: K.<sqrt3> = NumberField(x^2-3, embedding=1.732)
sage: P = Polyhedron(lines=[(1,sqrt3)])
sage: P.rays()
()
sage: P.lines()
(A line in the direction (1, sqrt3),)

sage: P = Polyhedron(lines=[(1, sqrt(3))])
Traceback (most recent call last):
...
ValueError: for polyhedra with floating point numbers, the only allowed ring is RDF with backend 'cdd'

sage: P = Polyhedron(lines=[(1, sqrt(3))], base_ring=AA)
sage: P
A 1-dimensional polyhedron in AA^2 defined as the convex hull of 1 vertex and 1 line
```

The value error above will be changed in #24835 to a more appropriate error message, for which:

```
sage: P = Polyhedron(lines=[(1, sqrt(3))],backend='cdd',base_ring=RDF)
sage: P
A 1-dimensional polyhedron in RDF^2 defined as the convex hull of 1 vertex and 1 line
```

is the only way to get a symbolic expression to pass on to the constructor of Polyhedron.

Concerning documenting the Polyhedron class usage through NumberFields, I believe that #22572 does the job.

Hence, once #22572 is merged, I would set this ticket to won't fix: the bug is fixed.



---

archive/issue_comments_239283.json:
```json
{
    "body": "<a id='comment:16'></a>An improvement of the doc is posted on #26077, where I also point out that\nit is not sufficient to have a tutorial doc: the docstring of Polyhedron should have a real example with NF entries.",
    "created_at": "2018-08-18T08:46:30Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17197",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17197#issuecomment-239283",
    "user": "https://github.com/dimpase"
}
```

<a id='comment:16'></a>An improvement of the doc is posted on #26077, where I also point out that
it is not sufficient to have a tutorial doc: the docstring of Polyhedron should have a real example with NF entries.



---

archive/issue_comments_239284.json:
```json
{
    "body": "<a id='comment:17'></a>Just an update of the current situation in `8.9beta3`:\n\n```\nsage: var('x')\nx\nsage: K.<sqrt3> = NumberField(x^2-3, embedding=1.732)\nsage: P = Polyhedron(lines=[(1,sqrt3)])\nsage: P.rays()\n()\nsage: P.lines()\n(A line in the direction (1, sqrt3),)\nsage: P = Polyhedron(lines=[(1, sqrt(3))])\nTraceback (most recent call last):\n...\nValueError: no default backend for computations with Symbolic Ring\nsage: P = Polyhedron(lines=[(1, sqrt(3))], base_ring=AA); P\nA 1-dimensional polyhedron in AA^2 defined as the convex hull of 1 vertex and 1 line\nsage: Q = Polyhedron(lines=[(1, sqrt(3))], backend='normaliz'); Q\nA 1-dimensional polyhedron in (Symbolic Ring)^2 defined as the convex hull of 1 vertex and 1 line\n```\n\nand it is still possible to do:\n\n```\nsage: R = Polyhedron(lines=[(1, sqrt(3))],backend='cdd',base_ring=RDF);R\nA 1-dimensional polyhedron in RDF^2 defined as the convex hull of 1 vertex and 1 line\n```\n\nSimilar examples should now complete the docstring, now that #25097 is merged.",
    "created_at": "2019-07-22T16:29:49Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17197",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17197#issuecomment-239284",
    "user": "https://github.com/jplab"
}
```

<a id='comment:17'></a>Just an update of the current situation in `8.9beta3`:

```
sage: var('x')
x
sage: K.<sqrt3> = NumberField(x^2-3, embedding=1.732)
sage: P = Polyhedron(lines=[(1,sqrt3)])
sage: P.rays()
()
sage: P.lines()
(A line in the direction (1, sqrt3),)
sage: P = Polyhedron(lines=[(1, sqrt(3))])
Traceback (most recent call last):
...
ValueError: no default backend for computations with Symbolic Ring
sage: P = Polyhedron(lines=[(1, sqrt(3))], base_ring=AA); P
A 1-dimensional polyhedron in AA^2 defined as the convex hull of 1 vertex and 1 line
sage: Q = Polyhedron(lines=[(1, sqrt(3))], backend='normaliz'); Q
A 1-dimensional polyhedron in (Symbolic Ring)^2 defined as the convex hull of 1 vertex and 1 line
```

and it is still possible to do:

```
sage: R = Polyhedron(lines=[(1, sqrt(3))],backend='cdd',base_ring=RDF);R
A 1-dimensional polyhedron in RDF^2 defined as the convex hull of 1 vertex and 1 line
```

Similar examples should now complete the docstring, now that #25097 is merged.
