# Issue 17239: lcalc returning incorrect values

archive/issues_017002.json:
```json
{
    "assignees": [],
    "body": "\n```\nsage: from sage.libs.lcalc.lcalc_Lfunction import *\nsage: Z = Lfunction_Zeta() #Riemann zeta function\nsage: Z.value(100*I)\nNaN - NaN*I\nsage: CDF(100*I).zeta() #the correct value\n6.51721042625 + 0.181288425338*I\nsage: Z.value(99*I) #very large\n-1.05677035996952e16 - 1.77185752069124e15*I\nsage: Z.value(102*I) #very large\n8.96446660698985e16 - 7.32159572862776e16*I\nsage: \nsage: chi = DirichletGroup(7).gens()[0]\nsage: L = Lfunction_from_character(chi) #this one seems to work\nsage: L.value(100*I)\n5.91365407523633 - 3.18382625901338*I\nsage: L = Lfunction_from_character(chi**2) #this one does not\nsage: L.value(100*I)\n1.21202136552168e15 - 7.03760325879769e16*I\n```\n\nNote: this was done with sage 6.2. My apologies if this has been fixed since.\n\n**CC:**  jakobkroeker\n\n**Keywords:** lcalc\n\n**Stopgaps:** wrongAnswerMarker\n\nIssue created by migration from https://trac.sagemath.org/ticket/17239\n\n",
    "created_at": "2014-10-28T08:26:23Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20packages%3A%20standard",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-6.4",
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "lcalc returning incorrect values",
    "type": "issue",
    "updated_at": "2017-03-04T01:58:12Z",
    "url": "https://github.com/sagemath/sage/issues/17239",
    "user": "https://github.com/sagetrac-alexc"
}
```

```
sage: from sage.libs.lcalc.lcalc_Lfunction import *
sage: Z = Lfunction_Zeta() #Riemann zeta function
sage: Z.value(100*I)
NaN - NaN*I
sage: CDF(100*I).zeta() #the correct value
6.51721042625 + 0.181288425338*I
sage: Z.value(99*I) #very large
-1.05677035996952e16 - 1.77185752069124e15*I
sage: Z.value(102*I) #very large
8.96446660698985e16 - 7.32159572862776e16*I
sage: 
sage: chi = DirichletGroup(7).gens()[0]
sage: L = Lfunction_from_character(chi) #this one seems to work
sage: L.value(100*I)
5.91365407523633 - 3.18382625901338*I
sage: L = Lfunction_from_character(chi**2) #this one does not
sage: L.value(100*I)
1.21202136552168e15 - 7.03760325879769e16*I
```

Note: this was done with sage 6.2. My apologies if this has been fixed since.

**CC:**  jakobkroeker

**Keywords:** lcalc

**Stopgaps:** wrongAnswerMarker

Issue created by migration from https://trac.sagemath.org/ticket/17239





---

archive/issue_events_210951.json:
```json
{
    "actor": "https://github.com/sagetrac-alexc",
    "created_at": "2014-10-28T08:26:23Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/17239",
    "milestone_number": null,
    "milestone_title": "sage-6.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/17239#event-210951"
}
```



---

archive/issue_events_210952.json:
```json
{
    "actor": "https://github.com/sagetrac-alexc",
    "created_at": "2014-10-28T08:26:23Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/17239",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20number%20theory",
    "label_color": "08517b",
    "label_name": "component: number theory",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/17239#event-210952"
}
```



---

archive/issue_events_210953.json:
```json
{
    "actor": "https://github.com/sagetrac-alexc",
    "created_at": "2014-10-28T08:26:23Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/17239",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "008080",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/17239#event-210953"
}
```



---

archive/issue_comments_231854.json:
```json
{
    "body": "<a id='comment:1'>**Comment 1:**</a>\nThis is a pure upstream issue with lcalc, nothing to do with Sage. This ticket should be reported upstream.",
    "created_at": "2014-10-28T09:22:12Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/17239",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/17239#issuecomment-231854",
    "user": "https://github.com/jdemeyer"
}
```

<a id='comment:1'>**Comment 1:**</a>
This is a pure upstream issue with lcalc, nothing to do with Sage. This ticket should be reported upstream.



---

archive/issue_events_210954.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2014-10-28T09:22:21Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/17239",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20number%20theory",
    "label_color": "08517b",
    "label_name": "component: number theory",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/17239#event-210954"
}
```



---

archive/issue_events_210955.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2014-10-28T09:22:21Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/17239",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20packages%3A%20standard",
    "label_color": "08517b",
    "label_name": "component: packages: standard",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/17239#event-210955"
}
```



---

archive/issue_comments_231855.json:
```json
{
    "body": "<a id='comment:3'>**Comment 3:**</a>\nWhat's more, in Sage 6.4 I get *different* values.\n\n```\nsage: sage: L = Lfunction_from_character(chi**2) #this one does not\nsage: sage: L.value(100*I)\n-3.39759949284668e16 - 7.09820432707377e16*I\nsage: sage: Z.value(99*I) #very large\n-1.02176956945931e16 - 3.52220370693934e15*I\n```",
    "created_at": "2014-11-20T21:42:13Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/17239",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/17239#issuecomment-231855",
    "user": "https://github.com/kcrisman"
}
```

<a id='comment:3'>**Comment 3:**</a>
What's more, in Sage 6.4 I get *different* values.

```
sage: sage: L = Lfunction_from_character(chi**2) #this one does not
sage: sage: L.value(100*I)
-3.39759949284668e16 - 7.09820432707377e16*I
sage: sage: Z.value(99*I) #very large
-1.02176956945931e16 - 3.52220370693934e15*I
```



---

archive/issue_comments_231856.json:
```json
{
    "body": "**Stopgaps:** wrongAnswerMarker",
    "created_at": "2017-03-04T01:58:12Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/17239",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/17239#issuecomment-231856",
    "user": "https://github.com/sagetrac-jakobkroeker"
}
```

**Stopgaps:** wrongAnswerMarker
