# Issue 17428: wrong limit in derivative

archive/issues_017191.json:
```json
{
    "body": "I'm seeing this behavior in sage 6.4, just built from git:\n\n```\n$ ./sage\n\u250c\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2510\n\u2502 Sage Version 6.4, Release Date: 2014-11-14                         \u2502\n\u2502 Type \"notebook()\" for the browser-based notebook interface.        \u2502\n\u2502 Type \"help()\" for help.                                            \u2502\n\u2514\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2518\nsage: e = SR('a*f(x)+g(x)')\nsage: e\na*f(x) + g(x)\nsage: e.limit(x=0)\nlimit(a*f(x) + g(x), x, 0)\nsage: e.limit(x=0).limit(a=0)\nlimit(g(x), x, 0)\nsage: de = diff(e,SR('x'))\nsage: de\na*D[0](f)(x) + D[0](g)(x)\nsage: de.limit(x=0)\nlimit(a*D[0](f)(x) + D[0](g)(x), x, 0)\nsage: de.limit(x=0).limit(a=0)\nD[0](g)(x)\n```\nThe last result should be `limit(D[0](g)(x), x, 0)`.\n\nFor reference, this report was also [posted to sage-devel](https://groups.google.com/forum/#!topic/sage-devel/9NcuLzIUNXY).\n\n**CC:**  @kcrisman @nbruin jakobkroeker\n\n**Keywords:** derivative limit\n\n**Upstream:** Reported upstream. No feedback yet.\n\n**Stopgaps:** wrongAnswerMarker\n\nIssue created by migration from https://trac.sagemath.org/ticket/17428\n\n",
    "created_at": "2014-12-01T21:05:33Z",
    "labels": [
        "component: symbolics",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-6.5",
    "title": "wrong limit in derivative",
    "type": "issue",
    "url": "https://github.com/sagemath/sage/issues/17428",
    "user": "https://trac.sagemath.org/admin/accounts/users/wonder"
}
```
I'm seeing this behavior in sage 6.4, just built from git:

```
$ ./sage
┌────────────────────────────────────────────────────────────────────┐
│ Sage Version 6.4, Release Date: 2014-11-14                         │
│ Type "notebook()" for the browser-based notebook interface.        │
│ Type "help()" for help.                                            │
└────────────────────────────────────────────────────────────────────┘
sage: e = SR('a*f(x)+g(x)')
sage: e
a*f(x) + g(x)
sage: e.limit(x=0)
limit(a*f(x) + g(x), x, 0)
sage: e.limit(x=0).limit(a=0)
limit(g(x), x, 0)
sage: de = diff(e,SR('x'))
sage: de
a*D[0](f)(x) + D[0](g)(x)
sage: de.limit(x=0)
limit(a*D[0](f)(x) + D[0](g)(x), x, 0)
sage: de.limit(x=0).limit(a=0)
D[0](g)(x)
```
The last result should be `limit(D[0](g)(x), x, 0)`.

For reference, this report was also [posted to sage-devel](https://groups.google.com/forum/#!topic/sage-devel/9NcuLzIUNXY).

**CC:**  @kcrisman @nbruin jakobkroeker

**Keywords:** derivative limit

**Upstream:** Reported upstream. No feedback yet.

**Stopgaps:** wrongAnswerMarker

Issue created by migration from https://trac.sagemath.org/ticket/17428





---

archive/issue_comments_235523.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -3,9 +3,9 @@\n ```\n $ ./sage\n \u250c\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2510\n-\u2502 Sage Version 6.4, Release Date: 2014-11-14 \u2502\n-\u2502 Type \"notebook()\" for the browser-based notebook interface. \u2502\n-\u2502 Type \"help()\" for help. \u2502\n+\u2502 Sage Version 6.4, Release Date: 2014-11-14                         \u2502\n+\u2502 Type \"notebook()\" for the browser-based notebook interface.        \u2502\n+\u2502 Type \"help()\" for help.                                            \u2502\n \u2514\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2518\n sage: e = SR('a*f(x)+g(x)')\n sage: e\n@@ -24,4 +24,4 @@\n ```\n The last result should be `limit(D[0](g)(x), x, 0)`.\n \n-For reference, this report was also\u00a0[posted to sage-devel](https://groups.google.com/forum/#!topic/sage-devel/9NcuLzIUNXY).\n+For reference, this report was also [posted to sage-devel](https://groups.google.com/forum/#!topic/sage-devel/9NcuLzIUNXY).\n``````\n",
    "created_at": "2014-12-01T21:07:08Z",
    "issue": "https://github.com/sagemath/sage/issues/17428",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/17428#issuecomment-235523",
    "user": "https://trac.sagemath.org/admin/accounts/users/wonder"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -3,9 +3,9 @@
 ```
 $ ./sage
 ┌────────────────────────────────────────────────────────────────────┐
-│ Sage Version 6.4, Release Date: 2014-11-14 │
-│ Type "notebook()" for the browser-based notebook interface. │
-│ Type "help()" for help. │
+│ Sage Version 6.4, Release Date: 2014-11-14                         │
+│ Type "notebook()" for the browser-based notebook interface.        │
+│ Type "help()" for help.                                            │
 └────────────────────────────────────────────────────────────────────┘
 sage: e = SR('a*f(x)+g(x)')
 sage: e
@@ -24,4 +24,4 @@
 ```
 The last result should be `limit(D[0](g)(x), x, 0)`.
 
-For reference, this report was also [posted to sage-devel](https://groups.google.com/forum/#!topic/sage-devel/9NcuLzIUNXY).
+For reference, this report was also [posted to sage-devel](https://groups.google.com/forum/#!topic/sage-devel/9NcuLzIUNXY).
``````




---

archive/issue_events_156337.json:
```json
{
    "actor": "https://github.com/pjbruin",
    "created_at": "2014-12-02T13:36:11Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/17428",
    "label": "bug",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/17428#event-156337"
}
```



---

archive/issue_comments_235524.json:
```json
{
    "body": "**Changing keywords** from \"\" to \"derivative limit\".",
    "created_at": "2014-12-02T13:36:11Z",
    "issue": "https://github.com/sagemath/sage/issues/17428",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/17428#issuecomment-235524",
    "user": "https://github.com/pjbruin"
}
```

**Changing keywords** from "" to "derivative limit".



---

archive/issue_comments_235525.json:
```json
{
    "body": "**Upstream:** Not yet reported upstream; Will do shortly.",
    "created_at": "2014-12-02T13:36:11Z",
    "issue": "https://github.com/sagemath/sage/issues/17428",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/17428#issuecomment-235525",
    "user": "https://github.com/pjbruin"
}
```

**Upstream:** Not yet reported upstream; Will do shortly.



---

archive/issue_events_156338.json:
```json
{
    "actor": "https://github.com/pjbruin",
    "created_at": "2014-12-02T13:36:11Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/17428",
    "label": "component: symbolics",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/17428#event-156338"
}
```



---

archive/issue_comments_235526.json:
```json
{
    "body": "<a id='comment:2'></a>\nThe same happens in Maxima:\n\n```\nMaxima 5.34.1 http://maxima.sourceforge.net\nusing Lisp ECL 13.5.1\nDistributed under the GNU Public License. See the file COPYING.\nDedicated to the memory of William Schelter.\nThe function bug_report() provides bug reporting information.\n(%i1) e: a*f(x) + g(x);\n(%o1)                            g(x) + a f(x)\n(%i2) limit(e, x, 0);\n(%o2)                       limit  (g(x) + a f(x))\n                            x -> 0\n(%i3) limit(limit(e, x, 0), a, 0);\n(%o3)                             limit  g(x)\n                                  x -> 0\n(%i4) de: diff(e, x);\n                           d              d\n(%o4)                      -- (g(x)) + a (-- (f(x)))\n                           dx             dx\n(%i5) limit(de, x, 0);\n                              d              d\n(%o5)                 limit  (-- (g(x)) + a (-- (f(x))))\n                      x -> 0  dx             dx\n(%i6) limit(limit(de, x, 0), a, 0);\n                                   d\n(%o6)                              -- (g(x))\n                                   dx\n```\nPossibly related: #7401 [edit: it is not]",
    "created_at": "2014-12-02T13:36:11Z",
    "issue": "https://github.com/sagemath/sage/issues/17428",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/17428#issuecomment-235526",
    "user": "https://github.com/pjbruin"
}
```

<a id='comment:2'></a>
The same happens in Maxima:

```
Maxima 5.34.1 http://maxima.sourceforge.net
using Lisp ECL 13.5.1
Distributed under the GNU Public License. See the file COPYING.
Dedicated to the memory of William Schelter.
The function bug_report() provides bug reporting information.
(%i1) e: a*f(x) + g(x);
(%o1)                            g(x) + a f(x)
(%i2) limit(e, x, 0);
(%o2)                       limit  (g(x) + a f(x))
                            x -> 0
(%i3) limit(limit(e, x, 0), a, 0);
(%o3)                             limit  g(x)
                                  x -> 0
(%i4) de: diff(e, x);
                           d              d
(%o4)                      -- (g(x)) + a (-- (f(x)))
                           dx             dx
(%i5) limit(de, x, 0);
                              d              d
(%o5)                 limit  (-- (g(x)) + a (-- (f(x))))
                      x -> 0  dx             dx
(%i6) limit(limit(de, x, 0), a, 0);
                                   d
(%o6)                              -- (g(x))
                                   dx
```
Possibly related: #7401 [edit: it is not]



---

archive/issue_comments_235527.json:
```json
{
    "body": "<a id='comment:3'></a>\nA slightly simpler example:\n\n```\n(%i1) dg: diff(g(x), x);\n                                   d\n(%o1)                              -- (g(x))\n                                   dx\n(%i2) lim: limit(dg, x, 0);\n                                      d\n(%o2)                          limit  -- (g(x))\n                               x -> 0 dx\n(%i3) limit(lim, x, 0);\n                                          d\n(%o3)                      limit  (limit  -- (g(x)))\n                           x -> 0  x -> 0 dx\n(%i4) limit(lim, a, 0);\n                                   d\n(%o4)                              -- (g(x))\n                                   dx\n```\nIn `%i3` the double limit over `x` is not simplified (this might be a different problem); in `%i4` taking the limit over `a` (which does not occur in the expression at all) removes the limit over `x`.",
    "created_at": "2014-12-05T08:30:38Z",
    "issue": "https://github.com/sagemath/sage/issues/17428",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/17428#issuecomment-235527",
    "user": "https://github.com/pjbruin"
}
```

<a id='comment:3'></a>
A slightly simpler example:

```
(%i1) dg: diff(g(x), x);
                                   d
(%o1)                              -- (g(x))
                                   dx
(%i2) lim: limit(dg, x, 0);
                                      d
(%o2)                          limit  -- (g(x))
                               x -> 0 dx
(%i3) limit(lim, x, 0);
                                          d
(%o3)                      limit  (limit  -- (g(x)))
                           x -> 0  x -> 0 dx
(%i4) limit(lim, a, 0);
                                   d
(%o4)                              -- (g(x))
                                   dx
```
In `%i3` the double limit over `x` is not simplified (this might be a different problem); in `%i4` taking the limit over `a` (which does not occur in the expression at all) removes the limit over `x`.



---

archive/issue_comments_235528.json:
```json
{
    "body": "<a id='comment:4'></a>\nWell, that is definitely a problem.  Did you report upstream yet?",
    "created_at": "2014-12-05T14:06:37Z",
    "issue": "https://github.com/sagemath/sage/issues/17428",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/17428#issuecomment-235528",
    "user": "https://github.com/kcrisman"
}
```

<a id='comment:4'></a>
Well, that is definitely a problem.  Did you report upstream yet?



---

archive/issue_comments_235529.json:
```json
{
    "body": "<a id='comment:5'></a>\nReplying to [kcrisman](#comment%3A4):\n> Well, that is definitely a problem.  Did you report upstream yet?\n\nI just opened https://sourceforge.net/p/maxima/bugs/2877/ for this.",
    "created_at": "2015-01-07T10:26:19Z",
    "issue": "https://github.com/sagemath/sage/issues/17428",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/17428#issuecomment-235529",
    "user": "https://github.com/pjbruin"
}
```

<a id='comment:5'></a>
Replying to [kcrisman](#comment%3A4):
> Well, that is definitely a problem.  Did you report upstream yet?

I just opened https://sourceforge.net/p/maxima/bugs/2877/ for this.



---

archive/issue_comments_235530.json:
```json
{
    "body": "**Changing upstream** from \"Not yet reported upstream; Will do shortly.\" to \"Reported upstream. No feedback yet.\".",
    "created_at": "2015-01-07T14:09:48Z",
    "issue": "https://github.com/sagemath/sage/issues/17428",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/17428#issuecomment-235530",
    "user": "https://github.com/pjbruin"
}
```

**Changing upstream** from "Not yet reported upstream; Will do shortly." to "Reported upstream. No feedback yet.".



---

archive/issue_comments_235531.json:
```json
{
    "body": "**Stopgaps:** wrongAnswerMarker",
    "created_at": "2017-03-04T02:11:05Z",
    "issue": "https://github.com/sagemath/sage/issues/17428",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/17428#issuecomment-235531",
    "user": "https://trac.sagemath.org/admin/accounts/users/jakobkroeker"
}
```

**Stopgaps:** wrongAnswerMarker
