# Issue 17504: solve() breaks substitute_function()

archive/issues_017267.json:
```json
{
    "assignees": [],
    "body": "Seems like this should work differently:\n\n```\n$ sage\n\u250c\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2510\n\u2502 Sage Version 6.4.1, Release Date: 2014-11-23                       \u2502\n\u2502 Type \"notebook()\" for the browser-based notebook interface.        \u2502\n\u2502 Type \"help()\" for help.                                            \u2502\n\u2514\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2518\nsage: z = sage.symbolic.function_factory.function('z',nargs=1)\nsage: z_eq = ( z(x) == x/(1-x) )\nsage: z_eq.substitute_function( z, (x^2).function(x) )\nx^2 == -x/(x - 1)\nsage: x_expr = solve( z_eq, x )[0].rhs()\nsage: x_expr\nz(x)/(z(x) + 1)\nsage: x_expr.substitute_function( z, (x^2).function(x) )\nz(x)/(z(x) + 1)\n```\n\nI believe it should replace `z(x)` with `x^2` in the last result.\n\n\n**CC:**  jakobkroeker\n\nIssue created by migration from https://trac.sagemath.org/ticket/17504\n\n",
    "created_at": "2014-12-14T21:02:40Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20symbolics",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-6.4",
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "solve() breaks substitute_function()",
    "type": "issue",
    "updated_at": "2017-03-04T02:26:18Z",
    "url": "https://github.com/sagemath/sage/issues/17504",
    "user": "https://github.com/sagetrac-wonder"
}
```
Seems like this should work differently:

```
$ sage
┌────────────────────────────────────────────────────────────────────┐
│ Sage Version 6.4.1, Release Date: 2014-11-23                       │
│ Type "notebook()" for the browser-based notebook interface.        │
│ Type "help()" for help.                                            │
└────────────────────────────────────────────────────────────────────┘
sage: z = sage.symbolic.function_factory.function('z',nargs=1)
sage: z_eq = ( z(x) == x/(1-x) )
sage: z_eq.substitute_function( z, (x^2).function(x) )
x^2 == -x/(x - 1)
sage: x_expr = solve( z_eq, x )[0].rhs()
sage: x_expr
z(x)/(z(x) + 1)
sage: x_expr.substitute_function( z, (x^2).function(x) )
z(x)/(z(x) + 1)
```

I believe it should replace `z(x)` with `x^2` in the last result.


**CC:**  jakobkroeker

Issue created by migration from https://trac.sagemath.org/ticket/17504





---

archive/issue_events_214070.json:
```json
{
    "actor": "https://github.com/sagetrac-wonder",
    "created_at": "2014-12-14T21:02:40Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/17504",
    "milestone_number": null,
    "milestone_title": "sage-6.4",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/17504#event-214070"
}
```



---

archive/issue_events_214071.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2014-12-15T07:25:20Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/17504",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20symbolics",
    "label_color": "08517b",
    "label_name": "component: symbolics",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/17504#event-214071"
}
```



---

archive/issue_events_214072.json:
```json
{
    "actor": "https://github.com/rwst",
    "created_at": "2014-12-15T07:25:20Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/17504",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "008080",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/17504#event-214072"
}
```



---

archive/issue_comments_237131.json:
```json
{
    "body": "<a id='comment:2'>**Comment 2:**</a>\nI think the problem here is that we can't really support/recognize the \"nargs\" argument, but we do have:\n\n```\nsage: sage.symbolic.function_factory.function('z') == sage.symbolic.function_factory.function('z',nargs=1)\nFalse\n```\nWhen we see the symbol appear on the maxima side, we have no idea whether it's a variadic function or one with a fixed number of arguments. Apparently, the interface presently chooses to go with variadic, since that is most generic. Indeed, if you change the first line to\n\n```\nsage: z= sage.symbolic.function_factory.function('z')\n```\nthere is no problem.\n\nFurther problems arise with bare functions, because that concept doesn't exist in the maxima interface and/or maxima itself:\n\n```\nsage: f= sage.symbolic.function_factory.function('f',nargs=2)\nsage: maxima_calculus(f)._sage_()(x)\nx\nsage: maxima_calculus(f)._sage_()(f=x)\nx\nsage: maxima_calculus(f)._sage_()(x,x)\nValueError: the number of arguments must be less than or equal to 1\n```",
    "created_at": "2014-12-15T11:37:10Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/17504",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/17504#issuecomment-237131",
    "user": "https://github.com/nbruin"
}
```

<a id='comment:2'>**Comment 2:**</a>
I think the problem here is that we can't really support/recognize the "nargs" argument, but we do have:

```
sage: sage.symbolic.function_factory.function('z') == sage.symbolic.function_factory.function('z',nargs=1)
False
```
When we see the symbol appear on the maxima side, we have no idea whether it's a variadic function or one with a fixed number of arguments. Apparently, the interface presently chooses to go with variadic, since that is most generic. Indeed, if you change the first line to

```
sage: z= sage.symbolic.function_factory.function('z')
```
there is no problem.

Further problems arise with bare functions, because that concept doesn't exist in the maxima interface and/or maxima itself:

```
sage: f= sage.symbolic.function_factory.function('f',nargs=2)
sage: maxima_calculus(f)._sage_()(x)
x
sage: maxima_calculus(f)._sage_()(f=x)
x
sage: maxima_calculus(f)._sage_()(x,x)
ValueError: the number of arguments must be less than or equal to 1
```



---

archive/issue_comments_237132.json:
```json
{
    "body": "<a id='comment:3'>**Comment 3:**</a>\nWouldn't it be best to record what symbols sage is sending to maxima, and translate symbols in maxima's output back to the same things they corresponded to in the input?",
    "created_at": "2014-12-17T02:07:38Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/17504",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/17504#issuecomment-237132",
    "user": "https://github.com/sagetrac-wonder"
}
```

<a id='comment:3'>**Comment 3:**</a>
Wouldn't it be best to record what symbols sage is sending to maxima, and translate symbols in maxima's output back to the same things they corresponded to in the input?



---

archive/issue_comments_237133.json:
```json
{
    "body": "<a id='comment:4'>**Comment 4:**</a>\nReplying to [wonder](#comment%3A3):\n> Wouldn't it be best to record what symbols sage is sending to maxima, and translate symbols in maxima's output back to the same things they corresponded to in the input?\n\nWe do that to some extent, but lack of scoping makes this unpredictable:\n\n```\nsage: f=function('f')\nsage: F1=maxima_calculus(f(x))\nsage: f=function('f',nargs=2)\nsage: F2=maxima_calculus(f(x,x))\n```\nSince we're already mangling names for variables, one possibility would be to mangle any attributes into the names of functions, in which we'd get something along the lines:\n\n```\nsage: f=function('f',nargs=2)\nsage: maxima_calculus(f(x,x)) #we could do it like this:\n'_SAGE_FUNCTION_NARGS_2_f(_SAGE_VAR_x,_SAGE_VAR_x)\n```",
    "created_at": "2014-12-17T11:31:20Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/17504",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/17504#issuecomment-237133",
    "user": "https://github.com/nbruin"
}
```

<a id='comment:4'>**Comment 4:**</a>
Replying to [wonder](#comment%3A3):
> Wouldn't it be best to record what symbols sage is sending to maxima, and translate symbols in maxima's output back to the same things they corresponded to in the input?

We do that to some extent, but lack of scoping makes this unpredictable:

```
sage: f=function('f')
sage: F1=maxima_calculus(f(x))
sage: f=function('f',nargs=2)
sage: F2=maxima_calculus(f(x,x))
```
Since we're already mangling names for variables, one possibility would be to mangle any attributes into the names of functions, in which we'd get something along the lines:

```
sage: f=function('f',nargs=2)
sage: maxima_calculus(f(x,x)) #we could do it like this:
'_SAGE_FUNCTION_NARGS_2_f(_SAGE_VAR_x,_SAGE_VAR_x)
```



---

archive/issue_comments_237134.json:
```json
{
    "body": "<a id='comment:5'>**Comment 5:**</a>\nI see, yeah.\n\n> one possibility would be to mangle any attributes into the names of functions\n\nMaybe streamlined by only using mangled names for non-variadic functions.  Or only when a function comes up whose simple name is already in use...",
    "created_at": "2014-12-17T23:30:27Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/17504",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/17504#issuecomment-237134",
    "user": "https://github.com/sagetrac-wonder"
}
```

<a id='comment:5'>**Comment 5:**</a>
I see, yeah.

> one possibility would be to mangle any attributes into the names of functions

Maybe streamlined by only using mangled names for non-variadic functions.  Or only when a function comes up whose simple name is already in use...
