# Issue 17553: substitute_function() can leave limits unevaluated

archive/issues_017316.json:
```json
{
    "body": "Here is an example:\n\n```\n\u250c\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2510\n\u2502 Sage Version 6.4.1, Release Date: 2014-11-23                       \u2502\n\u2502 Type \"notebook()\" for the browser-based notebook interface.        \u2502\n\u2502 Type \"help()\" for help.                                            \u2502\n\u2514\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2500\u2518\nsage: l = limit( function('f')(x), x=1 )\nsage: l\nlimit(f(x), x, 1)\nsage: ls = l.substitute_function( function('f'), (1+x).function(x) )\nsage: ls\nlimit(x + 1, x, 1)\nsage: simplify(ls)\nlimit(x + 1, x, 1)\nsage: maxima(repr(ls))\n2\n```\n\nThis is a simplified case of a situation that's been biting me in an expression that's passed to odeint() after being computed: it breaks the integration because it fails to evaluate to a float expression.\n\n\nIssue created by migration from https://trac.sagemath.org/ticket/17553\n\n",
    "created_at": "2014-12-27T02:03:18Z",
    "labels": [
        "component: symbolics",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-6.4",
    "title": "substitute_function() can leave limits unevaluated",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/17553",
    "user": "https://trac.sagemath.org/admin/accounts/users/wonder"
}
```
Here is an example:

```
┌────────────────────────────────────────────────────────────────────┐
│ Sage Version 6.4.1, Release Date: 2014-11-23                       │
│ Type "notebook()" for the browser-based notebook interface.        │
│ Type "help()" for help.                                            │
└────────────────────────────────────────────────────────────────────┘
sage: l = limit( function('f')(x), x=1 )
sage: l
limit(f(x), x, 1)
sage: ls = l.substitute_function( function('f'), (1+x).function(x) )
sage: ls
limit(x + 1, x, 1)
sage: simplify(ls)
limit(x + 1, x, 1)
sage: maxima(repr(ls))
2
```

This is a simplified case of a situation that's been biting me in an expression that's passed to odeint() after being computed: it breaks the integration because it fails to evaluate to a float expression.


Issue created by migration from https://trac.sagemath.org/ticket/17553





---

archive/issue_comments_230394.json:
```json
{
    "body": "<a id='comment:1'></a>Unfortunately that workaround doesn't work when exponentials are involved.  The `repr` stage causes the constant `e` to be replaced by an unbound variable `e`:\n\n```\nsage: l = limit( function('f')(x), x=0.1 )\nsage: ls = l.substitute_function( function('f'), (1 - exp(x)).function(x) )\nsage: ls\nlimit(-e^x + 1, x, 0.1)\nsage: mls = maxima(repr(ls))\nsage: mls\n1-e^0.1\nsage: N(mls)\n---------------------------------------------------------------------------\nTypeError                                 Traceback (most recent call last)\n<ipython-input-22-518484fcab94> in <module>()\n----> 1 N(mls)\n\n/usr/local/sage/local/lib/python2.7/site-packages/sage/misc/functional.pyc in numerical_approx(x, prec, digits, algorithm)\n   1466             except (TypeError, ValueError):\n   1467                 pass\n-> 1468         return sage.rings.complex_field.ComplexField(prec)(x)\n   1469 \n   1470 n = numerical_approx\n\n/usr/local/sage/local/lib/python2.7/site-packages/sage/rings/complex_field.pyc in __call__(self, x, im)\n    349         if im is not None:\n    350             x = x, im\n--> 351         return Parent.__call__(self, x)\n    352 \n    353     def _element_constructor_(self, x):\n\n/usr/local/sage/local/lib/python2.7/site-packages/sage/structure/parent.so in sage.structure.parent.Parent.__call__ (build/cythonized/sage/structure/parent.c:9666)()\n\n/usr/local/sage/local/lib/python2.7/site-packages/sage/structure/coerce_maps.so in sage.structure.coerce_maps.DefaultConvertMap_unique._call_ (build/cythonized/sage/structure/coerce_maps.c:4263)()\n\n/usr/local/sage/local/lib/python2.7/site-packages/sage/structure/coerce_maps.so in sage.structure.coerce_maps.DefaultConvertMap_unique._call_ (build/cythonized/sage/structure/coerce_maps.c:4170)()\n\n/usr/local/sage/local/lib/python2.7/site-packages/sage/rings/complex_field.pyc in _element_constructor_(self, x)\n    388                 pass\n    389             try:\n--> 390                 return x._complex_mpfr_field_( self )\n    391             except AttributeError:\n    392                 pass\n\n/usr/local/sage/local/lib/python2.7/site-packages/sage/interfaces/maxima_abstract.pyc in _complex_mpfr_field_(self, C)\n   1287             8.0751148893563733350506651837615871941533119425962889089783e-62 + 1.4142135623730950488016887242096980785696718753769480731767*I\n   1288         \"\"\"\n-> 1289         return C(self._sage_())\n   1290 \n   1291     def _mpfr_(self, R):\n\n/usr/local/sage/local/lib/python2.7/site-packages/sage/rings/complex_field.pyc in __call__(self, x, im)\n    349         if im is not None:\n    350             x = x, im\n--> 351         return Parent.__call__(self, x)\n    352 \n    353     def _element_constructor_(self, x):\n\n/usr/local/sage/local/lib/python2.7/site-packages/sage/structure/parent.so in sage.structure.parent.Parent.__call__ (build/cythonized/sage/structure/parent.c:9666)()\n\n/usr/local/sage/local/lib/python2.7/site-packages/sage/structure/coerce_maps.so in sage.structure.coerce_maps.DefaultConvertMap_unique._call_ (build/cythonized/sage/structure/coerce_maps.c:4263)()\n\n/usr/local/sage/local/lib/python2.7/site-packages/sage/structure/coerce_maps.so in sage.structure.coerce_maps.DefaultConvertMap_unique._call_ (build/cythonized/sage/structure/coerce_maps.c:4170)()\n\n/usr/local/sage/local/lib/python2.7/site-packages/sage/rings/complex_field.pyc in _element_constructor_(self, x)\n    388                 pass\n    389             try:\n--> 390                 return x._complex_mpfr_field_( self )\n    391             except AttributeError:\n    392                 pass\n\n/usr/local/sage/local/lib/python2.7/site-packages/sage/symbolic/expression.so in sage.symbolic.expression.Expression._complex_mpfr_field_ (build/cythonized/sage/symbolic/expression.cpp:8185)()\n\n/usr/local/sage/local/lib/python2.7/site-packages/sage/symbolic/expression.so in sage.symbolic.expression.Expression._eval_self (build/cythonized/sage/symbolic/expression.cpp:7521)()\n\nTypeError: Cannot evaluate symbolic expression to a numeric value.\nsage: maxima(ls)\n'limit(1-%e^_SAGE_VAR_x,_SAGE_VAR_x,0.1)\nsage: maxima(SR(mls))\n1-_SAGE_VAR__e^0.1\n```\n\nHere's what I'm trying out to work around this:\n\n```\nsage: srls = SR(maxima(repr(ls)))\nsage: srls\n-_e^0.1 + 1\nsage: srls.subs( { SR.symbol('_e'): e } )\n-e^0.1 + 1\nsage: N(srls.subs( { SR.symbol('_e'): e } ))\n-0.105170918075648\n```\n\nI've tried poking around the maxima_lib module for a more straightforward way to ask Maxima to evaluate the limit without the data loss involved in the `repr` step, but so far I haven't found my way.  Advice would be welcome.  Thanks for this wonderfully useful package and for all the bug fixes!",
    "created_at": "2015-01-01T21:44:08Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17553",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17553#issuecomment-230394",
    "user": "https://trac.sagemath.org/admin/accounts/users/wonder"
}
```

<a id='comment:1'></a>Unfortunately that workaround doesn't work when exponentials are involved.  The `repr` stage causes the constant `e` to be replaced by an unbound variable `e`:

```
sage: l = limit( function('f')(x), x=0.1 )
sage: ls = l.substitute_function( function('f'), (1 - exp(x)).function(x) )
sage: ls
limit(-e^x + 1, x, 0.1)
sage: mls = maxima(repr(ls))
sage: mls
1-e^0.1
sage: N(mls)
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)
<ipython-input-22-518484fcab94> in <module>()
----> 1 N(mls)

/usr/local/sage/local/lib/python2.7/site-packages/sage/misc/functional.pyc in numerical_approx(x, prec, digits, algorithm)
   1466             except (TypeError, ValueError):
   1467                 pass
-> 1468         return sage.rings.complex_field.ComplexField(prec)(x)
   1469 
   1470 n = numerical_approx

/usr/local/sage/local/lib/python2.7/site-packages/sage/rings/complex_field.pyc in __call__(self, x, im)
    349         if im is not None:
    350             x = x, im
--> 351         return Parent.__call__(self, x)
    352 
    353     def _element_constructor_(self, x):

/usr/local/sage/local/lib/python2.7/site-packages/sage/structure/parent.so in sage.structure.parent.Parent.__call__ (build/cythonized/sage/structure/parent.c:9666)()

/usr/local/sage/local/lib/python2.7/site-packages/sage/structure/coerce_maps.so in sage.structure.coerce_maps.DefaultConvertMap_unique._call_ (build/cythonized/sage/structure/coerce_maps.c:4263)()

/usr/local/sage/local/lib/python2.7/site-packages/sage/structure/coerce_maps.so in sage.structure.coerce_maps.DefaultConvertMap_unique._call_ (build/cythonized/sage/structure/coerce_maps.c:4170)()

/usr/local/sage/local/lib/python2.7/site-packages/sage/rings/complex_field.pyc in _element_constructor_(self, x)
    388                 pass
    389             try:
--> 390                 return x._complex_mpfr_field_( self )
    391             except AttributeError:
    392                 pass

/usr/local/sage/local/lib/python2.7/site-packages/sage/interfaces/maxima_abstract.pyc in _complex_mpfr_field_(self, C)
   1287             8.0751148893563733350506651837615871941533119425962889089783e-62 + 1.4142135623730950488016887242096980785696718753769480731767*I
   1288         """
-> 1289         return C(self._sage_())
   1290 
   1291     def _mpfr_(self, R):

/usr/local/sage/local/lib/python2.7/site-packages/sage/rings/complex_field.pyc in __call__(self, x, im)
    349         if im is not None:
    350             x = x, im
--> 351         return Parent.__call__(self, x)
    352 
    353     def _element_constructor_(self, x):

/usr/local/sage/local/lib/python2.7/site-packages/sage/structure/parent.so in sage.structure.parent.Parent.__call__ (build/cythonized/sage/structure/parent.c:9666)()

/usr/local/sage/local/lib/python2.7/site-packages/sage/structure/coerce_maps.so in sage.structure.coerce_maps.DefaultConvertMap_unique._call_ (build/cythonized/sage/structure/coerce_maps.c:4263)()

/usr/local/sage/local/lib/python2.7/site-packages/sage/structure/coerce_maps.so in sage.structure.coerce_maps.DefaultConvertMap_unique._call_ (build/cythonized/sage/structure/coerce_maps.c:4170)()

/usr/local/sage/local/lib/python2.7/site-packages/sage/rings/complex_field.pyc in _element_constructor_(self, x)
    388                 pass
    389             try:
--> 390                 return x._complex_mpfr_field_( self )
    391             except AttributeError:
    392                 pass

/usr/local/sage/local/lib/python2.7/site-packages/sage/symbolic/expression.so in sage.symbolic.expression.Expression._complex_mpfr_field_ (build/cythonized/sage/symbolic/expression.cpp:8185)()

/usr/local/sage/local/lib/python2.7/site-packages/sage/symbolic/expression.so in sage.symbolic.expression.Expression._eval_self (build/cythonized/sage/symbolic/expression.cpp:7521)()

TypeError: Cannot evaluate symbolic expression to a numeric value.
sage: maxima(ls)
'limit(1-%e^_SAGE_VAR_x,_SAGE_VAR_x,0.1)
sage: maxima(SR(mls))
1-_SAGE_VAR__e^0.1
```

Here's what I'm trying out to work around this:

```
sage: srls = SR(maxima(repr(ls)))
sage: srls
-_e^0.1 + 1
sage: srls.subs( { SR.symbol('_e'): e } )
-e^0.1 + 1
sage: N(srls.subs( { SR.symbol('_e'): e } ))
-0.105170918075648
```

I've tried poking around the maxima_lib module for a more straightforward way to ask Maxima to evaluate the limit without the data loss involved in the `repr` step, but so far I haven't found my way.  Advice would be welcome.  Thanks for this wonderfully useful package and for all the bug fixes!



---

archive/issue_comments_230395.json:
```json
{
    "body": "<a id='comment:2'></a>It seems that the inert form of \"limit\" isn't easily transformed back into one that is considered for evaluation, so once the limit is sitting there as an unevaluated one, substituting into it doesn't give you a limit that is attempted to be evaluated. Perhaps we need a \"simplify_limit\" that substitutes all the \"%LIMIT\" symbols for \"$LIMIT\" in a maxima expression:\n\n```\nsage: l = limit( function('f')(x), x=1 )\nsage: ls = l.substitute_function( function('f'), (1+x).function(x) )\nsage: from sage.libs.ecl import EclObject\nsage: from sage.interfaces.maxima_lib import max_limit\nsage: \nsage: A=maxima_calculus(ls).ecl()\nsage: B=EclObject([max_limit]).cons(A.cdr()) #the SIMP doesn't matter\nsage: A\n<ECL: ((%LIMIT SIMP) ((MPLUS SIMP) 1 |$_SAGE_VAR_x|) |$_SAGE_VAR_x| 1)>\nsage: B\n<ECL: (($LIMIT) ((MPLUS SIMP) 1 |$_SAGE_VAR_x|) |$_SAGE_VAR_x| 1)>\nsage: maxima_calculus(B)\n2\n```\nAlternatively, perhaps we should change the translation of the \"limit\" operator to be \"$LIMIT\" instead of \"%LIMIT\" (at the cost of re-evaluating any limits when they pass from sage to maxima). I don't know where exactly that conversion happens, because it does seem to be partially in place already:\n\n```\nsage: maxima_calculus(ls).ecl()\n<ECL: ((%LIMIT SIMP) ((MPLUS SIMP) 1 |$_SAGE_VAR_x|) |$_SAGE_VAR_x| 1)>\nsage: maxima_calculus(ls.operator()).ecl()\n<ECL: $LIMIT>\n```\nI suspect that this is the culprit:\n\n```\nsage: L=ls.operator()\nsage: L._maxima_lib_init_()\n\"'limit\"\n```\n(note the explicit \"'\" there: it's the inert limit). We also have \nSee `sage.symbolic.function_factory.function_factory` which defines the class `NewSymbolicFunction` (is that really a good idea to have that class closed over?) with the relevant `_maxima_init_`.\n\n```\nsage: sage.interfaces.maxima_lib.sage_op_dict[L]\n<ECL: %LIMIT>\n```\nwhich gets picked up because the first encounter of the limit symbol is the inert \"%limit\" on the maxima side, which primes the dict with that translation. This is easily overridden if desired. However, \"simplify\" and friends don't use `sr_to_max` yet, so it wouldn't make much of a difference here.\n\nIn short, we may need to instantiate our own \"limit\" operator in ginac to accommodate the different translation options, unless we're happy with a \"simplify_limit\" routine instead.",
    "created_at": "2015-01-01T23:12:02Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17553",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17553#issuecomment-230395",
    "user": "https://github.com/nbruin"
}
```

<a id='comment:2'></a>It seems that the inert form of "limit" isn't easily transformed back into one that is considered for evaluation, so once the limit is sitting there as an unevaluated one, substituting into it doesn't give you a limit that is attempted to be evaluated. Perhaps we need a "simplify_limit" that substitutes all the "%LIMIT" symbols for "$LIMIT" in a maxima expression:

```
sage: l = limit( function('f')(x), x=1 )
sage: ls = l.substitute_function( function('f'), (1+x).function(x) )
sage: from sage.libs.ecl import EclObject
sage: from sage.interfaces.maxima_lib import max_limit
sage: 
sage: A=maxima_calculus(ls).ecl()
sage: B=EclObject([max_limit]).cons(A.cdr()) #the SIMP doesn't matter
sage: A
<ECL: ((%LIMIT SIMP) ((MPLUS SIMP) 1 |$_SAGE_VAR_x|) |$_SAGE_VAR_x| 1)>
sage: B
<ECL: (($LIMIT) ((MPLUS SIMP) 1 |$_SAGE_VAR_x|) |$_SAGE_VAR_x| 1)>
sage: maxima_calculus(B)
2
```
Alternatively, perhaps we should change the translation of the "limit" operator to be "$LIMIT" instead of "%LIMIT" (at the cost of re-evaluating any limits when they pass from sage to maxima). I don't know where exactly that conversion happens, because it does seem to be partially in place already:

```
sage: maxima_calculus(ls).ecl()
<ECL: ((%LIMIT SIMP) ((MPLUS SIMP) 1 |$_SAGE_VAR_x|) |$_SAGE_VAR_x| 1)>
sage: maxima_calculus(ls.operator()).ecl()
<ECL: $LIMIT>
```
I suspect that this is the culprit:

```
sage: L=ls.operator()
sage: L._maxima_lib_init_()
"'limit"
```
(note the explicit "'" there: it's the inert limit). We also have 
See `sage.symbolic.function_factory.function_factory` which defines the class `NewSymbolicFunction` (is that really a good idea to have that class closed over?) with the relevant `_maxima_init_`.

```
sage: sage.interfaces.maxima_lib.sage_op_dict[L]
<ECL: %LIMIT>
```
which gets picked up because the first encounter of the limit symbol is the inert "%limit" on the maxima side, which primes the dict with that translation. This is easily overridden if desired. However, "simplify" and friends don't use `sr_to_max` yet, so it wouldn't make much of a difference here.

In short, we may need to instantiate our own "limit" operator in ginac to accommodate the different translation options, unless we're happy with a "simplify_limit" routine instead.



---

archive/issue_comments_230396.json:
```json
{
    "body": "<a id='comment:3'></a>Yes, thank you.  I was just converging on the same conclusions about `'limit` and using a python function to force re-evaluation.\n\nI've been assuming that when I see \"limit( ..., x, 0.1 )\" in a result, it's going to be passed back to maxima in a form that'll re-evaluate the limit.  I'd vote for implementing it that way rather than requiring the user to do \"simplify_limit\" manually at the appropriate times.  But I'm sure other users are doing infinite sums and such things that are better not to re-evaluate...",
    "created_at": "2015-01-01T23:37:04Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17553",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17553#issuecomment-230396",
    "user": "https://trac.sagemath.org/admin/accounts/users/wonder"
}
```

<a id='comment:3'></a>Yes, thank you.  I was just converging on the same conclusions about `'limit` and using a python function to force re-evaluation.

I've been assuming that when I see "limit( ..., x, 0.1 )" in a result, it's going to be passed back to maxima in a form that'll re-evaluate the limit.  I'd vote for implementing it that way rather than requiring the user to do "simplify_limit" manually at the appropriate times.  But I'm sure other users are doing infinite sums and such things that are better not to re-evaluate...



---

archive/issue_comments_230397.json:
```json
{
    "body": "<a id='comment:4'></a>Hmm, I didn't realize you could use python functions in `substitute_function`.  Just noticed that when looking through `expression_conversions.py`.  Given that, this seems to work:\n\n```\nsage: l = limit( function('f')(x), x=0.1 )\nsage: ls = l.substitute_function( function('f'), (1 - exp(-x)).function(x) )\nsage: ls\nlimit(-e^(-x) + 1, x, 0.1)\nsage: def eval_limit( ex, var, val ):\n    kv = { str(var):val }\n    return limit( ex, **kv )\n....: \nsage: ls.substitute_function( l.operator(), eval_limit )\n0.09516258196404048\n```\n\n:-)\n\nNote using `sage.symbolic.function_factory.function('limit')` in place of `l.operator()` does not work.\n\nUpdate: here it is in `simplify_limits` form:\n\n```\nlimop = limit( SR('f(x)'), x=0 ).operator()\ndef simplify_limits( expr ):\n    def eval_limit( expr, var, val ):\n        kv = { str(var):val }\n        return limit( expr, **kv ) \n    return expr.substitute_function( limop, eval_limit )\n```",
    "created_at": "2015-01-02T00:35:26Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17553",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17553#issuecomment-230397",
    "user": "https://trac.sagemath.org/admin/accounts/users/wonder"
}
```

<a id='comment:4'></a>Hmm, I didn't realize you could use python functions in `substitute_function`.  Just noticed that when looking through `expression_conversions.py`.  Given that, this seems to work:

```
sage: l = limit( function('f')(x), x=0.1 )
sage: ls = l.substitute_function( function('f'), (1 - exp(-x)).function(x) )
sage: ls
limit(-e^(-x) + 1, x, 0.1)
sage: def eval_limit( ex, var, val ):
    kv = { str(var):val }
    return limit( ex, **kv )
....: 
sage: ls.substitute_function( l.operator(), eval_limit )
0.09516258196404048
```

:-)

Note using `sage.symbolic.function_factory.function('limit')` in place of `l.operator()` does not work.

Update: here it is in `simplify_limits` form:

```
limop = limit( SR('f(x)'), x=0 ).operator()
def simplify_limits( expr ):
    def eval_limit( expr, var, val ):
        kv = { str(var):val }
        return limit( expr, **kv ) 
    return expr.substitute_function( limop, eval_limit )
```



---

archive/issue_comments_230398.json:
```json
{
    "body": "<a id='comment:5'></a>Replying to [comment:4 wonder]:\n> {{{\n> limop = limit( SR('f(x)'), x=0 ).operator()\n> def simplify_limits( expr ):\n>     def eval_limit( expr, var, val ):\n>         kv = { str(var):val }\n>         return limit( expr, **kv ) \n>     return expr.substitute_function( limop, eval_limit )\n> }}}\n\nSmart solution. There is an `eval_limit` with the right interface already available, though:\n\n```\nlimop = limit( SR('f(x)'), x=0 ).operator()\ndef simplify_limits( expr ):\n    return expr.substitute_function( limop, maxima_calculus.sr_limit )\n```\nshould do the trick. The fact that\n\n```\nsage: limsym=sage.symbolic.function_factory.function('limit')\nsage: limsym == limop\nFalse\n```\nindicates that we really should be making a symbol for \"limit\" beforehand (and equip it with the right translations)\n\n**CORRECTION:** The symbol to use is `sage.calculus.calculus._limit` and the reason for the inequality is an extra attribute for proper latex representation of limits:\n\n```\nsage: limsym=sage.symbolic.function_factory.function('limit',print_latex_func=sage.calculus.calculus._limit_latex_)\nsage: limsym == limop\nTrue\n```",
    "created_at": "2015-01-02T01:21:00Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17553",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17553#issuecomment-230398",
    "user": "https://github.com/nbruin"
}
```

<a id='comment:5'></a>Replying to [comment:4 wonder]:
> {{{
> limop = limit( SR('f(x)'), x=0 ).operator()
> def simplify_limits( expr ):
>     def eval_limit( expr, var, val ):
>         kv = { str(var):val }
>         return limit( expr, **kv ) 
>     return expr.substitute_function( limop, eval_limit )
> }}}

Smart solution. There is an `eval_limit` with the right interface already available, though:

```
limop = limit( SR('f(x)'), x=0 ).operator()
def simplify_limits( expr ):
    return expr.substitute_function( limop, maxima_calculus.sr_limit )
```
should do the trick. The fact that

```
sage: limsym=sage.symbolic.function_factory.function('limit')
sage: limsym == limop
False
```
indicates that we really should be making a symbol for "limit" beforehand (and equip it with the right translations)

**CORRECTION:** The symbol to use is `sage.calculus.calculus._limit` and the reason for the inequality is an extra attribute for proper latex representation of limits:

```
sage: limsym=sage.symbolic.function_factory.function('limit',print_latex_func=sage.calculus.calculus._limit_latex_)
sage: limsym == limop
True
```



---

archive/issue_comments_230399.json:
```json
{
    "body": "<a id='comment:6'></a>Replying to [comment:5 nbruin]:\n> {{{\n>     return expr.substitute_function( limop, maxima_calculus.sr_limit )\n> }}}\n\n\nThanks! Yes, that also works.",
    "created_at": "2015-01-02T01:27:04Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17553",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17553#issuecomment-230399",
    "user": "https://trac.sagemath.org/admin/accounts/users/wonder"
}
```

<a id='comment:6'></a>Replying to [comment:5 nbruin]:
> {{{
>     return expr.substitute_function( limop, maxima_calculus.sr_limit )
> }}}


Thanks! Yes, that also works.
