# Issue 17696: Polynomials over fraction fields incorrectly converted to Singular

archive/issues_017459.json:
```json
{
    "body": "Currently, we sometimes lose entries in the denominator when converting to Singular:\n\n```\nsage: k.<a> = GF(11^5)\nsage: R.<t> = k[]\nsage: R.<x> = R.fraction_field()[]\nsage: f = x^4 + 1/(a*t)\nsage: f._singular_()\nx^4\nsage: g = x^4 + 1/a * 1/t\nsage: f == g\nTrue\nsage: g._singular_()\nx^4 + (6*a^4 + 5*a)/t\n```\nThe issue seems to be with elements in the denominator that are subject to a quotient, i.e., an `a` in the denominator in the above example.\n\nCC:  simonking @malb swewers\n\nKeywords: Singular polynomial interface\n\nStopgaps: #23644\n\nStatus: new\n\nIssue created by migration from https://trac.sagemath.org/ticket/17696\n\n",
    "created_at": "2015-01-30T14:30:01Z",
    "labels": [
        "component: interfaces",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-6.5",
    "title": "Polynomials over fraction fields incorrectly converted to Singular",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/17696",
    "user": "https://trac.sagemath.org/admin/accounts/users/jakobkroeker"
}
```
Currently, we sometimes lose entries in the denominator when converting to Singular:

```
sage: k.<a> = GF(11^5)
sage: R.<t> = k[]
sage: R.<x> = R.fraction_field()[]
sage: f = x^4 + 1/(a*t)
sage: f._singular_()
x^4
sage: g = x^4 + 1/a * 1/t
sage: f == g
True
sage: g._singular_()
x^4 + (6*a^4 + 5*a)/t
```
The issue seems to be with elements in the denominator that are subject to a quotient, i.e., an `a` in the denominator in the above example.

CC:  simonking @malb swewers

Keywords: Singular polynomial interface

Stopgaps: #23644

Status: new

Issue created by migration from https://trac.sagemath.org/ticket/17696





---

archive/issue_comments_303029.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -10,7 +10,6 @@\n sage: L=FractionField(R1)\n sage: R.<x>=L[]\n sage: f=x^4+1/(b*zzz)\n-True\n sage: f._singular_()  #  where is the fraction 1/(b*zzz)  ?\n x^4\n sage: g = R(x^4)\n@@ -49,6 +48,8 @@\n `@`Simon, `@`Martin:\n should I Ccing someone else or remove you from Cc?\n \n+\n+\n Comment: 1\n \n Summary: bug in polynomial interface to Singular (in special rings)\n``````\n",
    "created_at": "2015-01-30T14:36:05Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17696",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17696#issuecomment-303029",
    "user": "https://trac.sagemath.org/admin/accounts/users/jakobkroeker"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -10,7 +10,6 @@
 sage: L=FractionField(R1)
 sage: R.<x>=L[]
 sage: f=x^4+1/(b*zzz)
-True
 sage: f._singular_()  #  where is the fraction 1/(b*zzz)  ?
 x^4
 sage: g = R(x^4)
@@ -49,6 +48,8 @@
 `@`Simon, `@`Martin:
 should I Ccing someone else or remove you from Cc?
 
+
+
 Comment: 1
 
 Summary: bug in polynomial interface to Singular (in special rings)
``````




---

archive/issue_comments_303030.json:
```json
{
    "body": "Changing stopgaps from \"\" to \"todo\"",
    "created_at": "2015-01-30T15:24:21Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17696",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17696#issuecomment-303030",
    "user": "https://trac.sagemath.org/admin/accounts/users/jakobkroeker"
}
```

Changing stopgaps from "" to "todo"



---

archive/issue_comments_303031.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -1,4 +1,16 @@\n-\n+```\n+sage: k.<a> = GF(11^5)\n+sage: R.<t> = k[]\n+sage: R.<x> = R.fraction_field()[]\n+sage: f = x^4 + 1/(a*t)\n+sage: f._singular_()\n+x^4\n+sage: g = x^4 + 1/a * 1/t\n+sage: f == g\n+True\n+sage: g._singular_()\n+x^4 + (6*a^4 + 5*a)/t\n+```\n \n Comment: 1\n \n``````\n",
    "created_at": "2017-08-18T11:39:45Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17696",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17696#issuecomment-303031",
    "user": "https://github.com/saraedum"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -1,4 +1,16 @@
-
+```
+sage: k.<a> = GF(11^5)
+sage: R.<t> = k[]
+sage: R.<x> = R.fraction_field()[]
+sage: f = x^4 + 1/(a*t)
+sage: f._singular_()
+x^4
+sage: g = x^4 + 1/a * 1/t
+sage: f == g
+True
+sage: g._singular_()
+x^4 + (6*a^4 + 5*a)/t
+```
 
 Comment: 1
 
``````




---

archive/issue_comments_303032.json:
```json
{
    "body": "Changing stopgaps from \"todo\" to \"#23644\"",
    "created_at": "2017-08-18T11:45:19Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17696",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17696#issuecomment-303032",
    "user": "https://github.com/saraedum"
}
```

Changing stopgaps from "todo" to "#23644"



---

archive/issue_comments_303033.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -1,4 +1,19 @@\n+Currently, we sometimes lose entries in the denominator when converting to Singular:\n \n+```\n+sage: k.<a> = GF(11^5)\n+sage: R.<t> = k[]\n+sage: R.<x> = R.fraction_field()[]\n+sage: f = x^4 + 1/(a*t)\n+sage: f._singular_()\n+x^4\n+sage: g = x^4 + 1/a * 1/t\n+sage: f == g\n+True\n+sage: g._singular_()\n+x^4 + (6*a^4 + 5*a)/t\n+```\n+The issue seems to be with elements in the denominator that are subject to a quotient, i.e., an `a` in the denominator in the above example.\n \n Comment: 1\n \n``````\n",
    "created_at": "2017-08-18T12:09:05Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17696",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17696#issuecomment-303033",
    "user": "https://github.com/saraedum"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -1,4 +1,19 @@
+Currently, we sometimes lose entries in the denominator when converting to Singular:
 
+```
+sage: k.<a> = GF(11^5)
+sage: R.<t> = k[]
+sage: R.<x> = R.fraction_field()[]
+sage: f = x^4 + 1/(a*t)
+sage: f._singular_()
+x^4
+sage: g = x^4 + 1/a * 1/t
+sage: f == g
+True
+sage: g._singular_()
+x^4 + (6*a^4 + 5*a)/t
+```
+The issue seems to be with elements in the denominator that are subject to a quotient, i.e., an `a` in the denominator in the above example.
 
 Comment: 1
 
``````

