# Issue 17696: Polynomials over fraction fields incorrectly converted to Singular

archive/issues_017459.json:
```json
{
    "assignees": [],
    "body": "Currently, we sometimes lose entries in the denominator when converting to Singular:\n\n```\nsage: k.<a> = GF(11^5)\nsage: R.<t> = k[]\nsage: R.<x> = R.fraction_field()[]\nsage: f = x^4 + 1/(a*t)\nsage: f._singular_()\nx^4\nsage: g = x^4 + 1/a * 1/t\nsage: f == g\nTrue\nsage: g._singular_()\nx^4 + (6*a^4 + 5*a)/t\n```\nThe issue seems to be with elements in the denominator that are subject to a quotient, i.e., an `a` in the denominator in the above example.\n\nCC:  @simon-king-jena @malb @sagetrac-swewers\n\nKeywords: **Singular polynomial interface**\n\nStopgaps: **#23644**\n\nComponent: **interfaces**\n\n_Issue created by migration from https://trac.sagemath.org/ticket/17696_\n\n",
    "created_at": "2015-01-30T14:30:01Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/c%3A%20interfaces",
        "https://github.com/sagemath/sage/labels/p%3A%203%20%E2%80%93%20major",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "Polynomials over fraction fields incorrectly converted to Singular",
    "type": "issue",
    "updated_at": "2022-12-29T01:30:11Z",
    "url": "https://github.com/sagemath/sage/issues/17696",
    "user": "https://github.com/sagetrac-jakobkroeker"
}
```
Currently, we sometimes lose entries in the denominator when converting to Singular:

```
sage: k.<a> = GF(11^5)
sage: R.<t> = k[]
sage: R.<x> = R.fraction_field()[]
sage: f = x^4 + 1/(a*t)
sage: f._singular_()
x^4
sage: g = x^4 + 1/a * 1/t
sage: f == g
True
sage: g._singular_()
x^4 + (6*a^4 + 5*a)/t
```
The issue seems to be with elements in the denominator that are subject to a quotient, i.e., an `a` in the denominator in the above example.

CC:  @simon-king-jena @malb @sagetrac-swewers

Keywords: **Singular polynomial interface**

Stopgaps: **#23644**

Component: **interfaces**

_Issue created by migration from https://trac.sagemath.org/ticket/17696_





---

archive/issue_events_253346.json:
```json
{
    "actor": "https://github.com/sagetrac-jakobkroeker",
    "created_at": "2015-01-30T14:30:01Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/17696",
    "milestone_number": null,
    "milestone_title": "sage-6.5",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/17696#event-253346"
}
```



---

archive/issue_events_253347.json:
```json
{
    "actor": "https://github.com/sagetrac-jakobkroeker",
    "created_at": "2015-01-30T14:30:01Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/17696",
    "label": "https://github.com/sagemath/sage/labels/c%3A%20interfaces",
    "label_color": "0000ff",
    "label_name": "c: interfaces",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/17696#event-253347"
}
```



---

archive/issue_events_253348.json:
```json
{
    "actor": "https://github.com/sagetrac-jakobkroeker",
    "created_at": "2015-01-30T14:30:01Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/17696",
    "label": "https://github.com/sagemath/sage/labels/p%3A%203%20%E2%80%93%20major",
    "label_color": "ffbb00",
    "label_name": "p: 3 \u2013 major",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/17696#event-253348"
}
```



---

archive/issue_events_253349.json:
```json
{
    "actor": "https://github.com/sagetrac-jakobkroeker",
    "created_at": "2015-01-30T14:30:01Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/17696",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "d73a4a",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/17696#event-253349"
}
```



---

archive/issue_comments_238994.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -10,7 +10,6 @@\n sage: L=FractionField(R1)\n sage: R.<x>=L[]\n sage: f=x^4+1/(b*zzz)\n-True\n sage: f._singular_()  #  where is the fraction 1/(b*zzz)  ?\n x^4\n sage: g = R(x^4)\n``````\n",
    "created_at": "2015-01-30T14:36:05Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/17696",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/17696#issuecomment-238994",
    "user": "https://github.com/sagetrac-jakobkroeker"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -10,7 +10,6 @@
 sage: L=FractionField(R1)
 sage: R.<x>=L[]
 sage: f=x^4+1/(b*zzz)
-True
 sage: f._singular_()  #  where is the fraction 1/(b*zzz)  ?
 x^4
 sage: g = R(x^4)
``````




---

archive/issue_comments_238995.json:
```json
{
    "body": "Stopgaps: **todo**",
    "created_at": "2015-01-30T15:24:21Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/17696",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/17696#issuecomment-238995",
    "user": "https://github.com/sagetrac-jakobkroeker"
}
```

Stopgaps: **todo**



---

archive/issue_events_253350.json:
```json
{
    "actor": "https://github.com/saraedum",
    "created_at": "2017-08-18T11:39:45Z",
    "event": "renamed",
    "issue": "https://github.com/sagemath/sage/issues/17696",
    "title_is": "Polynomials over fraction fields incorrectly converted to Singular",
    "title_was": "bug in polynomial interface to Singular (in special rings)",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/17696#event-253350"
}
```



---

archive/issue_comments_238996.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -1,51 +1,14 @@\n-It seems that the interface to Singular has a bug,\n-see example:\n \n ```\n-sage: K0=GF(11)\n-sage: #K0=QQ\n-sage: R0.<b>=K0[]\n-sage: K.<b>=K0.extension(b^5+4)\n-sage: R1.<zzz>=K[]\n-sage: L=FractionField(R1)\n-sage: R.<x>=L[]\n-sage: f=x^4+1/(b*zzz)\n-sage: f._singular_()  #  where is the fraction 1/(b*zzz)  ?\n+sage: k.<a> = GF(11^5)\n+sage: R.<t> = k[]\n+sage: R.<x> = R.fraction_field()[]\n+sage: f = x^4 + 1/(a*t)\n+sage: f._singular_()\n x^4\n-sage: g = R(x^4)\n-sage: f==g\n-False\n-\n+sage: g = x^4 + 1/a * 1/t\n+sage: f == g\n+True\n+sage: g._singular_()\n+x^4 + (6*a^4 + 5*a)/t\n ```\n-\n-Note that already\n-\n-```\n-sage: (1/(b*zzz))._singular_()\n-0 \n-```\n-\n-Remarkable is that `f = x^4+1/(b)*(1/zzz) ` is correctly translated to Singular:\n-\n-```\n-sage: K0=GF(11)\n-sage: #K0=QQ\n-sage: R0.<b>=K0[]\n-sage: K.<b>=K0.extension(b^5+4)\n-sage: R1.<zzz>=K[]\n-sage: L=FractionField(R1)\n-sage: R.<x>=L[]\n-sage: f=x^4+1/(b)*(1/zzz)\n-sage: f._singular_() \n--1/(4*zzz)*b^4+x^4\n-sage: g = -1/(4*zzz)*b^4+x^4\n-sage: f == g \n-True\n-```\n-\n-Please check  if there is a similar issue in other rings than in the example above.\n-\n-@sagetrac-Simon, @mantepse:\n-should I Ccing someone else or remove you from Cc?\n-\n-\n``````\n",
    "created_at": "2017-08-18T11:39:45Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/17696",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/17696#issuecomment-238996",
    "user": "https://github.com/saraedum"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -1,51 +1,14 @@
-It seems that the interface to Singular has a bug,
-see example:
 
 ```
-sage: K0=GF(11)
-sage: #K0=QQ
-sage: R0.<b>=K0[]
-sage: K.<b>=K0.extension(b^5+4)
-sage: R1.<zzz>=K[]
-sage: L=FractionField(R1)
-sage: R.<x>=L[]
-sage: f=x^4+1/(b*zzz)
-sage: f._singular_()  #  where is the fraction 1/(b*zzz)  ?
+sage: k.<a> = GF(11^5)
+sage: R.<t> = k[]
+sage: R.<x> = R.fraction_field()[]
+sage: f = x^4 + 1/(a*t)
+sage: f._singular_()
 x^4
-sage: g = R(x^4)
-sage: f==g
-False
-
+sage: g = x^4 + 1/a * 1/t
+sage: f == g
+True
+sage: g._singular_()
+x^4 + (6*a^4 + 5*a)/t
 ```
-
-Note that already
-
-```
-sage: (1/(b*zzz))._singular_()
-0 
-```
-
-Remarkable is that `f = x^4+1/(b)*(1/zzz) ` is correctly translated to Singular:
-
-```
-sage: K0=GF(11)
-sage: #K0=QQ
-sage: R0.<b>=K0[]
-sage: K.<b>=K0.extension(b^5+4)
-sage: R1.<zzz>=K[]
-sage: L=FractionField(R1)
-sage: R.<x>=L[]
-sage: f=x^4+1/(b)*(1/zzz)
-sage: f._singular_() 
--1/(4*zzz)*b^4+x^4
-sage: g = -1/(4*zzz)*b^4+x^4
-sage: f == g 
-True
-```
-
-Please check  if there is a similar issue in other rings than in the example above.
-
-@sagetrac-Simon, @mantepse:
-should I Ccing someone else or remove you from Cc?
-
-
``````




---

archive/issue_comments_238997.json:
```json
{
    "body": "Changed stopgaps from **todo** to **#23644**",
    "created_at": "2017-08-18T11:45:19Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/17696",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/17696#issuecomment-238997",
    "user": "https://github.com/saraedum"
}
```

Changed stopgaps from **todo** to **#23644**



---

archive/issue_comments_238998.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -1,3 +1,4 @@\n+Currently, we sometimes lose entries in the denominator when converting to Singular:\n \n ```\n sage: k.<a> = GF(11^5)\n@@ -12,3 +13,4 @@\n sage: g._singular_()\n x^4 + (6*a^4 + 5*a)/t\n ```\n+The issue seems to be with elements in the denominator that are subject to a quotient, i.e., an `a` in the denominator in the above example.\n``````\n",
    "created_at": "2017-08-18T12:09:05Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/17696",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/17696#issuecomment-238998",
    "user": "https://github.com/saraedum"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -1,3 +1,4 @@
+Currently, we sometimes lose entries in the denominator when converting to Singular:
 
 ```
 sage: k.<a> = GF(11^5)
@@ -12,3 +13,4 @@
 sage: g._singular_()
 x^4 + (6*a^4 + 5*a)/t
 ```
+The issue seems to be with elements in the denominator that are subject to a quotient, i.e., an `a` in the denominator in the above example.
``````




---

archive/issue_events_253351.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-12-29T01:30:11Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/17696",
    "milestone_number": null,
    "milestone_title": "sage-6.5",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/17696#event-253351"
}
```
