# Issue 17696: Polynomials over fraction fields incorrectly converted to Singular

archive/issues_017459.json:
```json
{
    "body": "Currently, we sometimes lose entries in the denominator when converting to Singular:\n\n```\nsage: k.<a> = GF(11^5)\nsage: R.<t> = k[]\nsage: R.<x> = R.fraction_field()[]\nsage: f = x^4 + 1/(a*t)\nsage: f._singular_()\nx^4\nsage: g = x^4 + 1/a * 1/t\nsage: f == g\nTrue\nsage: g._singular_()\nx^4 + (6*a^4 + 5*a)/t\n```\nThe issue seems to be with elements in the denominator that are subject to a quotient, i.e., an `a` in the denominator in the above example.\n\nCC:  simonking @malb swewers\n\nKeywords: Singular polynomial interface\n\nStopgaps: #23644\n\nStatus: new\n\nIssue created by migration from https://trac.sagemath.org/ticket/17696\n\n",
    "created_at": "2015-01-30T14:30:01Z",
    "labels": [
        "component: interfaces",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-6.5",
    "title": "Polynomials over fraction fields incorrectly converted to Singular",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/17696",
    "user": "https://trac.sagemath.org/admin/accounts/users/jakobkroeker"
}
```
Currently, we sometimes lose entries in the denominator when converting to Singular:

```
sage: k.<a> = GF(11^5)
sage: R.<t> = k[]
sage: R.<x> = R.fraction_field()[]
sage: f = x^4 + 1/(a*t)
sage: f._singular_()
x^4
sage: g = x^4 + 1/a * 1/t
sage: f == g
True
sage: g._singular_()
x^4 + (6*a^4 + 5*a)/t
```
The issue seems to be with elements in the denominator that are subject to a quotient, i.e., an `a` in the denominator in the above example.

CC:  simonking @malb swewers

Keywords: Singular polynomial interface

Stopgaps: #23644

Status: new

Issue created by migration from https://trac.sagemath.org/ticket/17696





---

archive/issue_comments_303029.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -10,7 +10,6 @@\n sage: L=FractionField(R1)\n sage: R.<x>=L[]\n sage: f=x^4+1/(b*zzz)\n-True\n sage: f._singular_()  #  where is the fraction 1/(b*zzz)  ?\n x^4\n sage: g = R(x^4)\n``````\n",
    "created_at": "2015-01-30T14:36:05Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17696",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17696#issuecomment-303029",
    "user": "https://trac.sagemath.org/admin/accounts/users/jakobkroeker"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -10,7 +10,6 @@
 sage: L=FractionField(R1)
 sage: R.<x>=L[]
 sage: f=x^4+1/(b*zzz)
-True
 sage: f._singular_()  #  where is the fraction 1/(b*zzz)  ?
 x^4
 sage: g = R(x^4)
``````




---

archive/issue_comments_303030.json:
```json
{
    "body": "Changing stopgaps from \"\" to \"todo\"",
    "created_at": "2015-01-30T15:24:21Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17696",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17696#issuecomment-303030",
    "user": "https://trac.sagemath.org/admin/accounts/users/jakobkroeker"
}
```

Changing stopgaps from "" to "todo"



---

archive/issue_comments_303031.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -1,51 +1,14 @@\n-It seems that the interface to Singular has a bug,\n-see example:\n \n ```\n-sage: K0=GF(11)\n-sage: #K0=QQ\n-sage: R0.<b>=K0[]\n-sage: K.<b>=K0.extension(b^5+4)\n-sage: R1.<zzz>=K[]\n-sage: L=FractionField(R1)\n-sage: R.<x>=L[]\n-sage: f=x^4+1/(b*zzz)\n-sage: f._singular_()  #  where is the fraction 1/(b*zzz)  ?\n+sage: k.<a> = GF(11^5)\n+sage: R.<t> = k[]\n+sage: R.<x> = R.fraction_field()[]\n+sage: f = x^4 + 1/(a*t)\n+sage: f._singular_()\n x^4\n-sage: g = R(x^4)\n-sage: f==g\n-False\n-\n+sage: g = x^4 + 1/a * 1/t\n+sage: f == g\n+True\n+sage: g._singular_()\n+x^4 + (6*a^4 + 5*a)/t\n ```\n-\n-Note that already\n-\n-```\n-sage: (1/(b*zzz))._singular_()\n-0 \n-```\n-\n-Remarkable is that `f = x^4+1/(b)*(1/zzz) ` is correctly translated to Singular:\n-\n-```\n-sage: K0=GF(11)\n-sage: #K0=QQ\n-sage: R0.<b>=K0[]\n-sage: K.<b>=K0.extension(b^5+4)\n-sage: R1.<zzz>=K[]\n-sage: L=FractionField(R1)\n-sage: R.<x>=L[]\n-sage: f=x^4+1/(b)*(1/zzz)\n-sage: f._singular_() \n--1/(4*zzz)*b^4+x^4\n-sage: g = -1/(4*zzz)*b^4+x^4\n-sage: f == g \n-True\n-```\n-\n-Please check  if there is a similar issue in other rings than in the example above.\n-\n-`@`Simon, `@`Martin:\n-should I Ccing someone else or remove you from Cc?\n-\n-\n``````\n",
    "created_at": "2017-08-18T11:39:45Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17696",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17696#issuecomment-303031",
    "user": "https://github.com/saraedum"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -1,51 +1,14 @@
-It seems that the interface to Singular has a bug,
-see example:
 
 ```
-sage: K0=GF(11)
-sage: #K0=QQ
-sage: R0.<b>=K0[]
-sage: K.<b>=K0.extension(b^5+4)
-sage: R1.<zzz>=K[]
-sage: L=FractionField(R1)
-sage: R.<x>=L[]
-sage: f=x^4+1/(b*zzz)
-sage: f._singular_()  #  where is the fraction 1/(b*zzz)  ?
+sage: k.<a> = GF(11^5)
+sage: R.<t> = k[]
+sage: R.<x> = R.fraction_field()[]
+sage: f = x^4 + 1/(a*t)
+sage: f._singular_()
 x^4
-sage: g = R(x^4)
-sage: f==g
-False
-
+sage: g = x^4 + 1/a * 1/t
+sage: f == g
+True
+sage: g._singular_()
+x^4 + (6*a^4 + 5*a)/t
 ```
-
-Note that already
-
-```
-sage: (1/(b*zzz))._singular_()
-0 
-```
-
-Remarkable is that `f = x^4+1/(b)*(1/zzz) ` is correctly translated to Singular:
-
-```
-sage: K0=GF(11)
-sage: #K0=QQ
-sage: R0.<b>=K0[]
-sage: K.<b>=K0.extension(b^5+4)
-sage: R1.<zzz>=K[]
-sage: L=FractionField(R1)
-sage: R.<x>=L[]
-sage: f=x^4+1/(b)*(1/zzz)
-sage: f._singular_() 
--1/(4*zzz)*b^4+x^4
-sage: g = -1/(4*zzz)*b^4+x^4
-sage: f == g 
-True
-```
-
-Please check  if there is a similar issue in other rings than in the example above.
-
-`@`Simon, `@`Martin:
-should I Ccing someone else or remove you from Cc?
-
-
``````




---

archive/issue_comments_303032.json:
```json
{
    "body": "Changing stopgaps from \"todo\" to \"#23644\"",
    "created_at": "2017-08-18T11:45:19Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17696",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17696#issuecomment-303032",
    "user": "https://github.com/saraedum"
}
```

Changing stopgaps from "todo" to "#23644"



---

archive/issue_comments_303033.json:
```json
{
    "body": "Description changed:\n``````diff\n--- \n+++ \n@@ -1,3 +1,4 @@\n+Currently, we sometimes lose entries in the denominator when converting to Singular:\n \n ```\n sage: k.<a> = GF(11^5)\n@@ -12,3 +13,4 @@\n sage: g._singular_()\n x^4 + (6*a^4 + 5*a)/t\n ```\n+The issue seems to be with elements in the denominator that are subject to a quotient, i.e., an `a` in the denominator in the above example.\n``````\n",
    "created_at": "2017-08-18T12:09:05Z",
    "issue": "https://github.com/sagemath/sagetest/issues/17696",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/17696#issuecomment-303033",
    "user": "https://github.com/saraedum"
}
```

Description changed:
``````diff
--- 
+++ 
@@ -1,3 +1,4 @@
+Currently, we sometimes lose entries in the denominator when converting to Singular:
 
 ```
 sage: k.<a> = GF(11^5)
@@ -12,3 +13,4 @@
 sage: g._singular_()
 x^4 + (6*a^4 + 5*a)/t
 ```
+The issue seems to be with elements in the denominator that are subject to a quotient, i.e., an `a` in the denominator in the above example.
``````

