# Issue 17891: rational powers of real interval field element (containing 0) give NaN

archive/issues_017654.json:
```json
{
    "assignees": [],
    "body": "We have\n\n```\nsage: RIF(-1,1)^QQ(1)\n[.. NaN ..]\nsage: RIF(-1,1)^RIF(1)\n[.. NaN ..]\n```\nwhereas\n\n```\nsage: RIF(-1,1)^ZZ(1)\n0.?\n```\nMore generally, we it works for integers\n\n```\nsage: RIF(-1,1)^ZZ(123456)\n0.?\n```\nas well as for the rational or RIF-element 2\n\n```\nsage: RIF(-1,1)^QQ(2)\n1.?\nsage: RIF(-1,1)^RIF(2)\n1.?\n```\nbut not for any other rational or RIF-element, e.g.\n\n```\nsage: RIF(-1,1)^QQ(3)                              \n[.. NaN ..]\nsage: RIF(-1,1)^QQ(4)\n[.. NaN ..]\n```\n\nThe reason seems to be\n\n```\nsage: log(RIF(-1,1))\n[.. NaN ..]\n```\n\nThe NaN-answer can be considered as wrong, since the true result is a number and can be calculated; it's a limitation of the algorithm.\n\n_Issue created by migration from https://trac.sagemath.org/ticket/17891_\n\n",
    "created_at": "2015-03-03T15:53:07Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/p3%20%E2%80%93%20major",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "rational powers of real interval field element (containing 0) give NaN",
    "type": "issue",
    "updated_at": "2022-12-29T01:31:15Z",
    "url": "https://github.com/sagemath/sage/issues/17891",
    "user": "https://github.com/dkrenn"
}
```
We have

```
sage: RIF(-1,1)^QQ(1)
[.. NaN ..]
sage: RIF(-1,1)^RIF(1)
[.. NaN ..]
```
whereas

```
sage: RIF(-1,1)^ZZ(1)
0.?
```
More generally, we it works for integers

```
sage: RIF(-1,1)^ZZ(123456)
0.?
```
as well as for the rational or RIF-element 2

```
sage: RIF(-1,1)^QQ(2)
1.?
sage: RIF(-1,1)^RIF(2)
1.?
```
but not for any other rational or RIF-element, e.g.

```
sage: RIF(-1,1)^QQ(3)                              
[.. NaN ..]
sage: RIF(-1,1)^QQ(4)
[.. NaN ..]
```

The reason seems to be

```
sage: log(RIF(-1,1))
[.. NaN ..]
```

The NaN-answer can be considered as wrong, since the true result is a number and can be calculated; it's a limitation of the algorithm.

_Issue created by migration from https://trac.sagemath.org/ticket/17891_





---

archive/issue_events_228351.json:
```json
{
    "actor": "https://github.com/dkrenn",
    "created_at": "2015-03-03T15:53:07Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/17891",
    "label": "https://github.com/sagemath/sage/labels/p3%20%E2%80%93%20major",
    "label_color": "ffbb00",
    "label_name": "p3 \u2013 major",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/17891#event-228351"
}
```



---

archive/issue_events_228352.json:
```json
{
    "actor": "https://github.com/dkrenn",
    "created_at": "2015-03-03T15:53:07Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/17891",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "d73a4a",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/17891#event-228352"
}
```



---

archive/issue_events_228353.json:
```json
{
    "actor": "https://github.com/mkoeppe",
    "created_at": "2022-12-29T01:31:15Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/17891",
    "milestone_number": null,
    "milestone_title": "sage-6.6",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/17891#event-228353"
}
```
