# Issue 4116: 3.1.2.rc2 doctest failure: sage/interfaces/sage0.py (part II)

archive/issues_004116.json:
```json
{
    "body": "Even with the patches at #4112, the following ends up happening on a 32-bit machine running ubuntu:\n\n```\nghitza@artin:/opt/sage/devel/sage/sage/interfaces$ sage -t sage0.py\nsage -t  3.1.2.rc2/devel/sage-main/sage/interfaces/sage0.py **********************************************************************\nFile \"/opt/sage/tmp/sage0.py\", line 47:\n    sage: a^3\nExpected:\n    8\nGot:\n    <BLANKLINE>\n**********************************************************************\nFile \"/opt/sage/tmp/sage0.py\", line 52:\n    sage: V.gens()\nExpected:\n    ((1, 0, 0, 0), (0, 1, 0, 0), (0, 0, 1, 0), (0, 0, 0, 1))\nGot:\n    <BLANKLINE>\n**********************************************************************\nFile \"/opt/sage/tmp/sage0.py\", line 62:\n    sage: g = V.0;  g\nExpected:\n    (1, 0, 0, 0)\nGot:\n    <BLANKLINE>\n**********************************************************************\nFile \"/opt/sage/tmp/sage0.py\", line 69:\n    sage: s('%s.parent()'%g.name())\nExpected:\n    Vector space of dimension 4 over Rational Field\nGot:\n    (1, 0, 0, 0)\n**********************************************************************\nFile \"/opt/sage/tmp/sage0.py\", line 74:\n    sage: s('x = 5')\nExpected:\n    5\nGot:\n    <BLANKLINE>\n**********************************************************************\nFile \"/opt/sage/tmp/sage0.py\", line 78:\n    sage: s('x')\nExpected:\n    5\nGot:\n    <BLANKLINE>\n**********************************************************************\nFile \"/opt/sage/tmp/sage0.py\", line 85:\n    sage: a\nExpected:\n    10\nGot:\n    <BLANKLINE>\n**********************************************************************\nFile \"/opt/sage/tmp/sage0.py\", line 91:\n    sage: s3('\"x\"')\nExpected:\n    8\nGot:\n    <BLANKLINE>\n**********************************************************************\nFile \"/opt/sage/tmp/sage0.py\", line 93:\n    sage: s('x')\nExpected:\n    5\nGot:\n    <BLANKLINE>\n**********************************************************************\nFile \"/opt/sage/tmp/sage0.py\", line 276:\n    sage: sage0.eval('2+2')\nExpected:\n    '4'\nGot:\n    '\\x1b[0m'\n**********************************************************************\nFile \"/opt/sage/tmp/sage0.py\", line 289:\n    sage: sage0.get('x')\nExpected:\n    '2'\nGot:\n    '4'\n**********************************************************************\nFile \"/opt/sage/tmp/sage0.py\", line 317:\n    sage: sage0.get('x')\nExpected:\n    \"...NameError: name 'x' is not defined\"\nGot:\n    '2'\n**********************************************************************\nFile \"/opt/sage/tmp/sage0.py\", line 326:\n    sage: sage0._contains('2', 'QQ')\nExpected:\n    True\nGot:\n    False\n**********************************************************************\nFile \"/opt/sage/tmp/sage0.py\", line 348:\n    sage: sage0.version()\nException raised:\n    Traceback (most recent call last):\n      File \"/opt/sage/local/lib/python/doctest.py\", line 1228, in __run\n        compileflags, 1) in test.globs\n      File \"<doctest __main__.example_16[2]>\", line 1, in <module>\n        sage0.version()###line 348:\n    sage: sage0.version()\n      File \"/opt/sage/local/lib/python2.5/site-packages/sage/interfaces/sage0.py\", line 353, in version\n        return sage0_version()\n      File \"/opt/sage/local/lib/python2.5/site-packages/sage/interfaces/sage0.py\", line 490, in sage0_version\n        return str(sage0('version()'))\n      File \"/opt/sage/local/lib/python2.5/site-packages/sage/interfaces/sage0.py\", line 225, in __call__\n        return SageElement(self, x)\n      File \"/opt/sage/local/lib/python2.5/site-packages/sage/interfaces/expect.py\", line 1281, in __init__\n        raise TypeError, x\n    TypeError: Error executing code in SAGE\n    CODE:\n    sage0=version()\n    SAGE ERROR:\n    ---------------------------------------------------------------------------\n    NameError                                 Traceback (most recent call last)\n\n    /opt/sage-3.1.2.rc2/data/extcode/sage/<ipython console> in <module>()\n\n    NameError: name 'x' is not defined\n**********************************************************************\nFile \"/opt/sage/tmp/sage0.py\", line 350:\n    sage: sage0.version() == version()\nExpected:\n    True\nGot:\n    False\n**********************************************************************\nFile \"/opt/sage/tmp/sage0.py\", line 366:\n    sage: sage0.new(2)\nExpected:\n    2\nGot:\n    <BLANKLINE>\n**********************************************************************\nFile \"/opt/sage/tmp/sage0.py\", line 393:\n    sage: F == sage0(F)._sage_()\nException raised:\n    Traceback (most recent call last):\n      File \"/opt/sage/local/lib/python/doctest.py\", line 1228, in __run\n        compileflags, 1) in test.globs\n      File \"<doctest __main__.example_20[4]>\", line 1, in <module>\n        F == sage0(F)._sage_()###line 393:\n    sage: F == sage0(F)._sage_()\n      File \"/opt/sage/local/lib/python2.5/site-packages/sage/interfaces/sage0.py\", line 403, in _sage_\n        return load(P._local_tmpfile())\n      File \"sage_object.pyx\", line 448, in sage.structure.sage_object.load (sage/structure/sage_object.c:4541)\n    IOError: [Errno 2] No such file or directory: '/home/ghitza/.sage//temp/artin/22488//interface//tmp22488.sobj'\n**********************************************************************\nFile \"/opt/sage/tmp/sage0.py\", line 410:\n    sage: four_gcd(6)\nExpected:\n    2\nGot:\n    <BLANKLINE>\n**********************************************************************\nFile \"/opt/sage/tmp/sage0.py\", line 432:\n    sage: sage0(4).gcd\nExpected:\n    <built-in method gcd of sage.rings.integer.Integer object at 0x...>\nGot:\n    <BLANKLINE>\n**********************************************************************\nFile \"/opt/sage/tmp/sage0.py\", line 457:\n    sage: half = reduce_load_element(s); half\nExpected:\n    1/2\nGot:\n    <BLANKLINE>\n**********************************************************************\nFile \"/opt/sage/tmp/sage0.py\", line 487:\n    sage: sage0_version() == version()\nExpected:\n    True\nGot:\n    False\n**********************************************************************\nFile \"/opt/sage/tmp/sage0.py\", line 148:\n    sage: print \"ignore this\";  sage0.cputime()     # random output\nException raised:\n    Traceback (most recent call last):\n      File \"/opt/sage/local/lib/python/doctest.py\", line 1228, in __run\n        compileflags, 1) in test.globs\n      File \"<doctest __main__.example_3[2]>\", line 1, in <module>\n        print \"ignore this\";  sage0.cputime()     # random output###line 148:\n    sage: print \"ignore this\";  sage0.cputime()     # random output\n      File \"/opt/sage/local/lib/python2.5/site-packages/sage/interfaces/sage0.py\", line 159, in cputime\n        return float(s)\n    ValueError: invalid literal for float(): SAGE Version 3.1.2.rc2, Release Date: 2008-09-12\n**********************************************************************\nFile \"/opt/sage/tmp/sage0.py\", line 150:\n    sage: sage0('factor(2^157-1)')\nExpected:\n    852133201 * 60726444167 * 1654058017289 * 2134387368610417\nGot:\n    1.1760729999999999\n**********************************************************************\nFile \"/opt/sage/tmp/sage0.py\", line 152:\n    sage: print \"ignore this\";  sage0.cputime()     # random output\nException raised:\n    Traceback (most recent call last):\n      File \"/opt/sage/local/lib/python/doctest.py\", line 1228, in __run\n        compileflags, 1) in test.globs\n      File \"<doctest __main__.example_3[4]>\", line 1, in <module>\n        print \"ignore this\";  sage0.cputime()     # random output###line 152:\n    sage: print \"ignore this\";  sage0.cputime()     # random output\n      File \"/opt/sage/local/lib/python2.5/site-packages/sage/interfaces/sage0.py\", line 159, in cputime\n        return float(s)\n    ValueError: empty string for float()\n**********************************************************************\nFile \"/opt/sage/tmp/sage0.py\", line 165:\n    sage: len(t) > 100\nException raised:\n    Traceback (most recent call last):\n      File \"/opt/sage/local/lib/python/doctest.py\", line 1228, in __run\n        compileflags, 1) in test.globs\n      File \"<doctest __main__.example_4[3]>\", line 1, in <module>\n        len(t) > Integer(100)###line 165:\n    sage: len(t) > 100\n    TypeError: object of type 'long' has no len()\n**********************************************************************\nFile \"/opt/sage/tmp/sage0.py\", line 167:\n    sage: 'gcd' in t\nException raised:\n    Traceback (most recent call last):\n      File \"/opt/sage/local/lib/python/doctest.py\", line 1228, in __run\n        compileflags, 1) in test.globs\n      File \"<doctest __main__.example_4[4]>\", line 1, in <module>\n        'gcd' in t###line 167:\n    sage: 'gcd' in t\n    TypeError: argument of type 'long' is not iterable\n**********************************************************************\nFile \"/opt/sage/tmp/sage0.py\", line 177:\n    sage: s.eval('2+2')\nExpected:\n    '4'\nGot:\n    '\\x1b[0m'\n**********************************************************************\n15 items had failures:\n   9 of  23 in __main__.example_1\n   1 of   3 in __main__.example_10\n   1 of   4 in __main__.example_11\n   1 of   6 in __main__.example_13\n   1 of   3 in __main__.example_14\n   2 of   4 in __main__.example_16\n   1 of   4 in __main__.example_18\n   1 of   5 in __main__.example_20\n   1 of   4 in __main__.example_21\n   1 of   3 in __main__.example_22\n   1 of   6 in __main__.example_24\n   1 of   4 in __main__.example_26\n   3 of   5 in __main__.example_3\n   2 of   5 in __main__.example_4\n   1 of   5 in __main__.example_5\n***Test Failed*** 27 failures.\nFor whitespace errors, see the file /opt/sage/tmp/.doctest_sage0.py\n [5.1 s]\nexit code: 1024\n \n----------------------------------------------------------------------\nThe following tests failed:\n\n\nsage -t  3.1.2.rc2/devel/sage-main/sage/interfaces/sage0.py\nTotal time for all tests: 5.1 seconds\n```\n\n**Assignee:** @williamstein\n\nIssue created by migration from https://trac.sagemath.org/ticket/4116\n\n",
    "closed_at": "2008-09-16T06:21:46Z",
    "created_at": "2008-09-14T09:36:38Z",
    "labels": [
        "component: interfaces",
        "blocker",
        "bug",
        "invalid"
    ],
    "title": "3.1.2.rc2 doctest failure: sage/interfaces/sage0.py (part II)",
    "type": "issue",
    "url": "https://github.com/sagemath/sage/issues/4116",
    "user": "https://github.com/aghitza"
}
```
Even with the patches at #4112, the following ends up happening on a 32-bit machine running ubuntu:

```
ghitza@artin:/opt/sage/devel/sage/sage/interfaces$ sage -t sage0.py
sage -t  3.1.2.rc2/devel/sage-main/sage/interfaces/sage0.py **********************************************************************
File "/opt/sage/tmp/sage0.py", line 47:
    sage: a^3
Expected:
    8
Got:
    <BLANKLINE>
**********************************************************************
File "/opt/sage/tmp/sage0.py", line 52:
    sage: V.gens()
Expected:
    ((1, 0, 0, 0), (0, 1, 0, 0), (0, 0, 1, 0), (0, 0, 0, 1))
Got:
    <BLANKLINE>
**********************************************************************
File "/opt/sage/tmp/sage0.py", line 62:
    sage: g = V.0;  g
Expected:
    (1, 0, 0, 0)
Got:
    <BLANKLINE>
**********************************************************************
File "/opt/sage/tmp/sage0.py", line 69:
    sage: s('%s.parent()'%g.name())
Expected:
    Vector space of dimension 4 over Rational Field
Got:
    (1, 0, 0, 0)
**********************************************************************
File "/opt/sage/tmp/sage0.py", line 74:
    sage: s('x = 5')
Expected:
    5
Got:
    <BLANKLINE>
**********************************************************************
File "/opt/sage/tmp/sage0.py", line 78:
    sage: s('x')
Expected:
    5
Got:
    <BLANKLINE>
**********************************************************************
File "/opt/sage/tmp/sage0.py", line 85:
    sage: a
Expected:
    10
Got:
    <BLANKLINE>
**********************************************************************
File "/opt/sage/tmp/sage0.py", line 91:
    sage: s3('"x"')
Expected:
    8
Got:
    <BLANKLINE>
**********************************************************************
File "/opt/sage/tmp/sage0.py", line 93:
    sage: s('x')
Expected:
    5
Got:
    <BLANKLINE>
**********************************************************************
File "/opt/sage/tmp/sage0.py", line 276:
    sage: sage0.eval('2+2')
Expected:
    '4'
Got:
    '\x1b[0m'
**********************************************************************
File "/opt/sage/tmp/sage0.py", line 289:
    sage: sage0.get('x')
Expected:
    '2'
Got:
    '4'
**********************************************************************
File "/opt/sage/tmp/sage0.py", line 317:
    sage: sage0.get('x')
Expected:
    "...NameError: name 'x' is not defined"
Got:
    '2'
**********************************************************************
File "/opt/sage/tmp/sage0.py", line 326:
    sage: sage0._contains('2', 'QQ')
Expected:
    True
Got:
    False
**********************************************************************
File "/opt/sage/tmp/sage0.py", line 348:
    sage: sage0.version()
Exception raised:
    Traceback (most recent call last):
      File "/opt/sage/local/lib/python/doctest.py", line 1228, in __run
        compileflags, 1) in test.globs
      File "<doctest __main__.example_16[2]>", line 1, in <module>
        sage0.version()###line 348:
    sage: sage0.version()
      File "/opt/sage/local/lib/python2.5/site-packages/sage/interfaces/sage0.py", line 353, in version
        return sage0_version()
      File "/opt/sage/local/lib/python2.5/site-packages/sage/interfaces/sage0.py", line 490, in sage0_version
        return str(sage0('version()'))
      File "/opt/sage/local/lib/python2.5/site-packages/sage/interfaces/sage0.py", line 225, in __call__
        return SageElement(self, x)
      File "/opt/sage/local/lib/python2.5/site-packages/sage/interfaces/expect.py", line 1281, in __init__
        raise TypeError, x
    TypeError: Error executing code in SAGE
    CODE:
    sage0=version()
    SAGE ERROR:
    ---------------------------------------------------------------------------
    NameError                                 Traceback (most recent call last)

    /opt/sage-3.1.2.rc2/data/extcode/sage/<ipython console> in <module>()

    NameError: name 'x' is not defined
**********************************************************************
File "/opt/sage/tmp/sage0.py", line 350:
    sage: sage0.version() == version()
Expected:
    True
Got:
    False
**********************************************************************
File "/opt/sage/tmp/sage0.py", line 366:
    sage: sage0.new(2)
Expected:
    2
Got:
    <BLANKLINE>
**********************************************************************
File "/opt/sage/tmp/sage0.py", line 393:
    sage: F == sage0(F)._sage_()
Exception raised:
    Traceback (most recent call last):
      File "/opt/sage/local/lib/python/doctest.py", line 1228, in __run
        compileflags, 1) in test.globs
      File "<doctest __main__.example_20[4]>", line 1, in <module>
        F == sage0(F)._sage_()###line 393:
    sage: F == sage0(F)._sage_()
      File "/opt/sage/local/lib/python2.5/site-packages/sage/interfaces/sage0.py", line 403, in _sage_
        return load(P._local_tmpfile())
      File "sage_object.pyx", line 448, in sage.structure.sage_object.load (sage/structure/sage_object.c:4541)
    IOError: [Errno 2] No such file or directory: '/home/ghitza/.sage//temp/artin/22488//interface//tmp22488.sobj'
**********************************************************************
File "/opt/sage/tmp/sage0.py", line 410:
    sage: four_gcd(6)
Expected:
    2
Got:
    <BLANKLINE>
**********************************************************************
File "/opt/sage/tmp/sage0.py", line 432:
    sage: sage0(4).gcd
Expected:
    <built-in method gcd of sage.rings.integer.Integer object at 0x...>
Got:
    <BLANKLINE>
**********************************************************************
File "/opt/sage/tmp/sage0.py", line 457:
    sage: half = reduce_load_element(s); half
Expected:
    1/2
Got:
    <BLANKLINE>
**********************************************************************
File "/opt/sage/tmp/sage0.py", line 487:
    sage: sage0_version() == version()
Expected:
    True
Got:
    False
**********************************************************************
File "/opt/sage/tmp/sage0.py", line 148:
    sage: print "ignore this";  sage0.cputime()     # random output
Exception raised:
    Traceback (most recent call last):
      File "/opt/sage/local/lib/python/doctest.py", line 1228, in __run
        compileflags, 1) in test.globs
      File "<doctest __main__.example_3[2]>", line 1, in <module>
        print "ignore this";  sage0.cputime()     # random output###line 148:
    sage: print "ignore this";  sage0.cputime()     # random output
      File "/opt/sage/local/lib/python2.5/site-packages/sage/interfaces/sage0.py", line 159, in cputime
        return float(s)
    ValueError: invalid literal for float(): SAGE Version 3.1.2.rc2, Release Date: 2008-09-12
**********************************************************************
File "/opt/sage/tmp/sage0.py", line 150:
    sage: sage0('factor(2^157-1)')
Expected:
    852133201 * 60726444167 * 1654058017289 * 2134387368610417
Got:
    1.1760729999999999
**********************************************************************
File "/opt/sage/tmp/sage0.py", line 152:
    sage: print "ignore this";  sage0.cputime()     # random output
Exception raised:
    Traceback (most recent call last):
      File "/opt/sage/local/lib/python/doctest.py", line 1228, in __run
        compileflags, 1) in test.globs
      File "<doctest __main__.example_3[4]>", line 1, in <module>
        print "ignore this";  sage0.cputime()     # random output###line 152:
    sage: print "ignore this";  sage0.cputime()     # random output
      File "/opt/sage/local/lib/python2.5/site-packages/sage/interfaces/sage0.py", line 159, in cputime
        return float(s)
    ValueError: empty string for float()
**********************************************************************
File "/opt/sage/tmp/sage0.py", line 165:
    sage: len(t) > 100
Exception raised:
    Traceback (most recent call last):
      File "/opt/sage/local/lib/python/doctest.py", line 1228, in __run
        compileflags, 1) in test.globs
      File "<doctest __main__.example_4[3]>", line 1, in <module>
        len(t) > Integer(100)###line 165:
    sage: len(t) > 100
    TypeError: object of type 'long' has no len()
**********************************************************************
File "/opt/sage/tmp/sage0.py", line 167:
    sage: 'gcd' in t
Exception raised:
    Traceback (most recent call last):
      File "/opt/sage/local/lib/python/doctest.py", line 1228, in __run
        compileflags, 1) in test.globs
      File "<doctest __main__.example_4[4]>", line 1, in <module>
        'gcd' in t###line 167:
    sage: 'gcd' in t
    TypeError: argument of type 'long' is not iterable
**********************************************************************
File "/opt/sage/tmp/sage0.py", line 177:
    sage: s.eval('2+2')
Expected:
    '4'
Got:
    '\x1b[0m'
**********************************************************************
15 items had failures:
   9 of  23 in __main__.example_1
   1 of   3 in __main__.example_10
   1 of   4 in __main__.example_11
   1 of   6 in __main__.example_13
   1 of   3 in __main__.example_14
   2 of   4 in __main__.example_16
   1 of   4 in __main__.example_18
   1 of   5 in __main__.example_20
   1 of   4 in __main__.example_21
   1 of   3 in __main__.example_22
   1 of   6 in __main__.example_24
   1 of   4 in __main__.example_26
   3 of   5 in __main__.example_3
   2 of   5 in __main__.example_4
   1 of   5 in __main__.example_5
***Test Failed*** 27 failures.
For whitespace errors, see the file /opt/sage/tmp/.doctest_sage0.py
 [5.1 s]
exit code: 1024
 
----------------------------------------------------------------------
The following tests failed:


sage -t  3.1.2.rc2/devel/sage-main/sage/interfaces/sage0.py
Total time for all tests: 5.1 seconds
```

**Assignee:** @williamstein

Issue created by migration from https://trac.sagemath.org/ticket/4116





---

archive/issue_comments_024288.json:
```json
{
    "body": "<a id='comment:1'></a>\nSame outcome with rc3.  I just noticed that there are related failures in misc/randstate.pyx:\n\n```\nsage -t  devel/sage/sage/misc/randstate.pyx                 **********************************************************************\nFile \"/opt/sage-3.1.2.rc3/tmp/randstate.py\", line 124:\n    : s = ZZ(subsage('initial_seed()'))\nException raised:\n    Traceback (most recent call last):\n      File \"/opt/sage-3.1.2.rc3/local/lib/python2.5/doctest.py\", line 1228, in __run\n        compileflags, 1) in test.globs\n      File \"<doctest __main__.example_0[32]>\", line 1, in <module>\n        s = ZZ(subsage('initial_seed()'))###line 124:\n    : s = ZZ(subsage('initial_seed()'))\n      File \"integer_ring.pyx\", line 278, in sage.rings.integer_ring.IntegerRing_class.__call__ (sage/rings/integer_ring.c:5028)\n      File \"/opt/sage-3.1.2.rc3/local/lib/python2.5/site-packages/sage/interfaces/sage0.py\", line 425, in __call__\n        z = SageElement(P, callstr)\n      File \"/opt/sage-3.1.2.rc3/local/lib/python2.5/site-packages/sage/interfaces/expect.py\", line 1281, in __init__\n        raise TypeError, x\n    TypeError: Error executing code in SAGE\n    CODE:\n    \tsage2=sage1.get_as_sage_int()\n    SAGE ERROR:\n    \t---------------------------------------------------------------------------\n    AttributeError                            Traceback (most recent call last)\n\n    /opt/sage-3.1.2.rc3/data/extcode/sage/<ipython console> in <module>()\n\n    AttributeError: 'long' object has no attribute 'lift'\n**********************************************************************\nFile \"/opt/sage-3.1.2.rc3/tmp/randstate.py\", line 125:\n    : r = ZZ(subsage('ZZ.random_element(2^200)'))\nException raised:\n    Traceback (most recent call last):\n      File \"/opt/sage-3.1.2.rc3/local/lib/python2.5/doctest.py\", line 1228, in __run\n        compileflags, 1) in test.globs\n      File \"<doctest __main__.example_0[33]>\", line 1, in <module>\n        r = ZZ(subsage('ZZ.random_element(2^200)'))###line 125:\n    : r = ZZ(subsage('ZZ.random_element(2^200)'))\n      File \"/opt/sage-3.1.2.rc3/local/lib/python2.5/site-packages/sage/interfaces/sage0.py\", line 225, in __call__\n        return SageElement(self, x)\n      File \"/opt/sage-3.1.2.rc3/local/lib/python2.5/site-packages/sage/interfaces/expect.py\", line 1281, in __init__\n        raise TypeError, x\n    TypeError: Error executing code in SAGE\n    CODE:\n    \tsage3=ZZ.random_element(2^200)\n    SAGE ERROR:\n    \t---------------------------------------------------------------------------\n    NameError                                 Traceback (most recent call last)\n\n    /opt/sage-3.1.2.rc3/data/extcode/sage/<ipython console> in <module>()\n\n    NameError: name 'sage1' is not defined\n**********************************************************************\nFile \"/opt/sage-3.1.2.rc3/tmp/randstate.py\", line 131:\n    : r == ZZ.random_element(2^200)\nExpected:\n    True\nGot:\n    False\n**********************************************************************\n1 items had failures:\n   3 of  62 in __main__.example_0\n***Test Failed*** 3 failures.\nFor whitespace errors, see the file /opt/sage-3.1.2.rc3/tmp/.doctest_randstate.py\n\t [14.0 s]\nexit code: 1024\n \n----------------------------------------------------------------------\nThe following tests failed:\n\n\n\tsage -t  devel/sage/sage/misc/randstate.pyx\nTotal time for all tests: 14.0 seconds\n```",
    "created_at": "2008-09-15T02:05:12Z",
    "issue": "https://github.com/sagemath/sage/issues/4116",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/4116#issuecomment-24288",
    "user": "https://github.com/aghitza"
}
```

<a id='comment:1'></a>
Same outcome with rc3.  I just noticed that there are related failures in misc/randstate.pyx:

```
sage -t  devel/sage/sage/misc/randstate.pyx                 **********************************************************************
File "/opt/sage-3.1.2.rc3/tmp/randstate.py", line 124:
    : s = ZZ(subsage('initial_seed()'))
Exception raised:
    Traceback (most recent call last):
      File "/opt/sage-3.1.2.rc3/local/lib/python2.5/doctest.py", line 1228, in __run
        compileflags, 1) in test.globs
      File "<doctest __main__.example_0[32]>", line 1, in <module>
        s = ZZ(subsage('initial_seed()'))###line 124:
    : s = ZZ(subsage('initial_seed()'))
      File "integer_ring.pyx", line 278, in sage.rings.integer_ring.IntegerRing_class.__call__ (sage/rings/integer_ring.c:5028)
      File "/opt/sage-3.1.2.rc3/local/lib/python2.5/site-packages/sage/interfaces/sage0.py", line 425, in __call__
        z = SageElement(P, callstr)
      File "/opt/sage-3.1.2.rc3/local/lib/python2.5/site-packages/sage/interfaces/expect.py", line 1281, in __init__
        raise TypeError, x
    TypeError: Error executing code in SAGE
    CODE:
    	sage2=sage1.get_as_sage_int()
    SAGE ERROR:
    	---------------------------------------------------------------------------
    AttributeError                            Traceback (most recent call last)

    /opt/sage-3.1.2.rc3/data/extcode/sage/<ipython console> in <module>()

    AttributeError: 'long' object has no attribute 'lift'
**********************************************************************
File "/opt/sage-3.1.2.rc3/tmp/randstate.py", line 125:
    : r = ZZ(subsage('ZZ.random_element(2^200)'))
Exception raised:
    Traceback (most recent call last):
      File "/opt/sage-3.1.2.rc3/local/lib/python2.5/doctest.py", line 1228, in __run
        compileflags, 1) in test.globs
      File "<doctest __main__.example_0[33]>", line 1, in <module>
        r = ZZ(subsage('ZZ.random_element(2^200)'))###line 125:
    : r = ZZ(subsage('ZZ.random_element(2^200)'))
      File "/opt/sage-3.1.2.rc3/local/lib/python2.5/site-packages/sage/interfaces/sage0.py", line 225, in __call__
        return SageElement(self, x)
      File "/opt/sage-3.1.2.rc3/local/lib/python2.5/site-packages/sage/interfaces/expect.py", line 1281, in __init__
        raise TypeError, x
    TypeError: Error executing code in SAGE
    CODE:
    	sage3=ZZ.random_element(2^200)
    SAGE ERROR:
    	---------------------------------------------------------------------------
    NameError                                 Traceback (most recent call last)

    /opt/sage-3.1.2.rc3/data/extcode/sage/<ipython console> in <module>()

    NameError: name 'sage1' is not defined
**********************************************************************
File "/opt/sage-3.1.2.rc3/tmp/randstate.py", line 131:
    : r == ZZ.random_element(2^200)
Expected:
    True
Got:
    False
**********************************************************************
1 items had failures:
   3 of  62 in __main__.example_0
***Test Failed*** 3 failures.
For whitespace errors, see the file /opt/sage-3.1.2.rc3/tmp/.doctest_randstate.py
	 [14.0 s]
exit code: 1024
 
----------------------------------------------------------------------
The following tests failed:


	sage -t  devel/sage/sage/misc/randstate.pyx
Total time for all tests: 14.0 seconds
```



---

archive/issue_comments_024289.json:
```json
{
    "body": "<a id='comment:2'></a>\nActually, I just noticed that I get the same failures with 3.1.1.",
    "created_at": "2008-09-16T03:40:45Z",
    "issue": "https://github.com/sagemath/sage/issues/4116",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/4116#issuecomment-24289",
    "user": "https://github.com/aghitza"
}
```

<a id='comment:2'></a>
Actually, I just noticed that I get the same failures with 3.1.1.



---

archive/issue_events_023644.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/mabshoff",
    "created_at": "2008-09-16T06:21:46Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/4116",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/4116#event-23644"
}
```



---

archive/issue_events_023645.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/mabshoff",
    "created_at": "2008-09-16T06:21:46Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/4116",
    "milestone": "sage-3.1.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/4116#event-23645"
}
```



---

archive/issue_comments_024290.json:
```json
{
    "body": "<a id='comment:3'></a>\nThis turned out to be a problem with a stale .sage directory. So make this invalied.\n\nCheers,\n\nMichael",
    "created_at": "2008-09-16T06:21:46Z",
    "issue": "https://github.com/sagemath/sage/issues/4116",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/4116#issuecomment-24290",
    "user": "https://trac.sagemath.org/admin/accounts/users/mabshoff"
}
```

<a id='comment:3'></a>
This turned out to be a problem with a stale .sage directory. So make this invalied.

Cheers,

Michael



---

archive/issue_comments_024291.json:
```json
{
    "body": "**Description changed:**\n``````diff\n--- \n+++ \n@@ -113,9 +113,9 @@\n         raise TypeError, x\n     TypeError: Error executing code in SAGE\n     CODE:\n-    \tsage0=version()\n+    sage0=version()\n     SAGE ERROR:\n-    \t---------------------------------------------------------------------------\n+    ---------------------------------------------------------------------------\n     NameError                                 Traceback (most recent call last)\n \n     /opt/sage-3.1.2.rc2/data/extcode/sage/<ipython console> in <module>()\n@@ -258,13 +258,13 @@\n    1 of   5 in __main__.example_5\n ***Test Failed*** 27 failures.\n For whitespace errors, see the file /opt/sage/tmp/.doctest_sage0.py\n-\t [5.1 s]\n+ [5.1 s]\n exit code: 1024\n  \n ----------------------------------------------------------------------\n The following tests failed:\n \n \n-\tsage -t  3.1.2.rc2/devel/sage-main/sage/interfaces/sage0.py\n+sage -t  3.1.2.rc2/devel/sage-main/sage/interfaces/sage0.py\n Total time for all tests: 5.1 seconds\n ```\n``````\n",
    "created_at": "2015-09-06T15:02:02Z",
    "issue": "https://github.com/sagemath/sage/issues/4116",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/4116#issuecomment-24291",
    "user": "https://github.com/fchapoton"
}
```

**Description changed:**
``````diff
--- 
+++ 
@@ -113,9 +113,9 @@
         raise TypeError, x
     TypeError: Error executing code in SAGE
     CODE:
-    	sage0=version()
+    sage0=version()
     SAGE ERROR:
-    	---------------------------------------------------------------------------
+    ---------------------------------------------------------------------------
     NameError                                 Traceback (most recent call last)
 
     /opt/sage-3.1.2.rc2/data/extcode/sage/<ipython console> in <module>()
@@ -258,13 +258,13 @@
    1 of   5 in __main__.example_5
 ***Test Failed*** 27 failures.
 For whitespace errors, see the file /opt/sage/tmp/.doctest_sage0.py
-	 [5.1 s]
+ [5.1 s]
 exit code: 1024
  
 ----------------------------------------------------------------------
 The following tests failed:
 
 
-	sage -t  3.1.2.rc2/devel/sage-main/sage/interfaces/sage0.py
+sage -t  3.1.2.rc2/devel/sage-main/sage/interfaces/sage0.py
 Total time for all tests: 5.1 seconds
 ```
``````

