# Issue 4193: [fixed by #5508] Coercion between relative and absolute number fields

archive/issues_004193.json:
```json
{
    "body": "Is there supposed to be a canonical coercion map between a relative number field and its associated absolute field?\n\nAt the moment (in 3.1.2) there apparently isn't, and trying to force one raises a TypeError:\n\n```\nsage: K1.<a> = NumberField(x^3 - 2)\nsage: R.<y> = PolynomialRing(K1)\nsage: K2.<b> = K1.extension(y^2 - a)\nsage: K2abs = K2.absolute_field('w')\nsage: K2abs(b)\nTypeError: Cannot coerce element into this number field\n```\n\nI suppose it's sort of fair enough as there exist multiple K1-linear embeddings from K2 into K2abs, but shouldn't the definition of K2abs give a distinguished element of this set, sending the generator b of K2 to the generator w of K2abs?\n\nThis causes problems elsewhere, as the code for relative orders in number fields relies on having such a coercion to do basic element-creation and membership-testing routines, and these are all broken as a result:\n\n```\nsage: R = K2.order(b)\nsage: b in R\nFalse\nsage: bb = R.gens()[1] # b by any other name\nsage: bb == b\nTrue\nsage: bb.parent() is R\nTrue\nsage: bb in R\nFalse\nsage: R(bb) # trying to coerce something into its own parent!\nTypeError: Cannot coerce element into this number field\n```\n\nI uncovered this last problem first while trying to fix #4190, or more precisely while trying to write a doctest for a fix that I'd already written. (I have a fix which works for absolute orders and should work for relative orders too, but there's no way it can work given the above general brokenness.)\n\nDavid\n\n\nAssignee: @williamstein\n\nCC:  fwclarke\n\nResolution: fixed\n\nIssue created by migration from https://trac.sagemath.org/ticket/4193\n\n",
    "closed_at": "2009-04-24T08:44:29Z",
    "created_at": "2008-09-25T10:15:29Z",
    "labels": [
        "component: number theory",
        "bug"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-3.4.2",
    "title": "[fixed by #5508] Coercion between relative and absolute number fields",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/4193",
    "user": "https://github.com/loefflerd"
}
```
Is there supposed to be a canonical coercion map between a relative number field and its associated absolute field?

At the moment (in 3.1.2) there apparently isn't, and trying to force one raises a TypeError:

```
sage: K1.<a> = NumberField(x^3 - 2)
sage: R.<y> = PolynomialRing(K1)
sage: K2.<b> = K1.extension(y^2 - a)
sage: K2abs = K2.absolute_field('w')
sage: K2abs(b)
TypeError: Cannot coerce element into this number field
```

I suppose it's sort of fair enough as there exist multiple K1-linear embeddings from K2 into K2abs, but shouldn't the definition of K2abs give a distinguished element of this set, sending the generator b of K2 to the generator w of K2abs?

This causes problems elsewhere, as the code for relative orders in number fields relies on having such a coercion to do basic element-creation and membership-testing routines, and these are all broken as a result:

```
sage: R = K2.order(b)
sage: b in R
False
sage: bb = R.gens()[1] # b by any other name
sage: bb == b
True
sage: bb.parent() is R
True
sage: bb in R
False
sage: R(bb) # trying to coerce something into its own parent!
TypeError: Cannot coerce element into this number field
```

I uncovered this last problem first while trying to fix #4190, or more precisely while trying to write a doctest for a fix that I'd already written. (I have a fix which works for absolute orders and should work for relative orders too, but there's no way it can work given the above general brokenness.)

David


Assignee: @williamstein

CC:  fwclarke

Resolution: fixed

Issue created by migration from https://trac.sagemath.org/ticket/4193





---

archive/issue_comments_031148.json:
```json
{
    "body": "Description changed:\n```diff\n--- \n+++ \n@@ -4,7 +4,7 @@\n \n ```\n sage: K1.<a> = NumberField(x^3 - 2)\n-sage: R.<y> = PolynomialRing(K1).gen()\n+sage: R.<y> = PolynomialRing(K1)\n sage: K2.<b> = K1.extension(y^2 - a)\n sage: K2abs = K2.absolute_field('w')\n sage: K2abs(b)\n@@ -34,6 +34,7 @@\n \n David\n \n+\n Comment: 1\n \n Summary: Coercion between relative and absolute number fields\n```\n",
    "created_at": "2009-03-17T10:06:13Z",
    "issue": "https://github.com/sagemath/sagetest/issues/4193",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/4193#issuecomment-31148",
    "user": "https://github.com/loefflerd"
}
```

Description changed:
```diff
--- 
+++ 
@@ -4,7 +4,7 @@
 
 ```
 sage: K1.<a> = NumberField(x^3 - 2)
-sage: R.<y> = PolynomialRing(K1).gen()
+sage: R.<y> = PolynomialRing(K1)
 sage: K2.<b> = K1.extension(y^2 - a)
 sage: K2abs = K2.absolute_field('w')
 sage: K2abs(b)
@@ -34,6 +34,7 @@
 
 David
 
+
 Comment: 1
 
 Summary: Coercion between relative and absolute number fields
```




---

archive/issue_comments_031149.json:
```json
{
    "body": "<a id='comment:1'></a>I'm pleased to report that this seems to be fixed by fwclarke's patch for #5508. There isn't  automatic coercion between relative + absolute fields but it's debatable whether there should be; the more severe issue was the problems with orders assuming that there was in their coercion code, which is now fixed. Well done that man.",
    "created_at": "2009-03-17T10:06:13Z",
    "issue": "https://github.com/sagemath/sagetest/issues/4193",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/4193#issuecomment-31149",
    "user": "https://github.com/loefflerd"
}
```

<a id='comment:1'></a>I'm pleased to report that this seems to be fixed by fwclarke's patch for #5508. There isn't  automatic coercion between relative + absolute fields but it's debatable whether there should be; the more severe issue was the problems with orders assuming that there was in their coercion code, which is now fixed. Well done that man.



---

archive/issue_comments_031150.json:
```json
{
    "body": "<a id='comment:2'></a>To close this we would need a doctest.\n\nCheers,\n\nMichael",
    "created_at": "2009-03-25T08:54:58Z",
    "issue": "https://github.com/sagemath/sagetest/issues/4193",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/4193#issuecomment-31150",
    "user": "https://trac.sagemath.org/admin/accounts/users/mabshoff"
}
```

<a id='comment:2'></a>To close this we would need a doctest.

Cheers,

Michael



---

archive/issue_events_009509.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/mabshoff",
    "created_at": "2009-03-25T08:56:04Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/4193",
    "milestone": "sage-3.4.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/4193#event-9509"
}
```



---

archive/issue_comments_031151.json:
```json
{
    "body": "<a id='comment:4'></a>I have added a doctest that checks this is corrected to my latest patch at #5159. This also includes another patch to catch a doctest failure arising from #5508 on 32-bit machines.",
    "created_at": "2009-03-27T10:39:14Z",
    "issue": "https://github.com/sagemath/sagetest/issues/4193",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/4193#issuecomment-31151",
    "user": "https://github.com/loefflerd"
}
```

<a id='comment:4'></a>I have added a doctest that checks this is corrected to my latest patch at #5159. This also includes another patch to catch a doctest failure arising from #5508 on 32-bit machines.



---

archive/issue_comments_031152.json:
```json
{
    "body": "<a id='comment:5'></a>Michael: can we close this ticket now, as with 5508 and 5159 merged, the code contains both a fix and a doctest to prove the fix works?\n\nRegards,\n\nDavid",
    "created_at": "2009-04-24T08:39:03Z",
    "issue": "https://github.com/sagemath/sagetest/issues/4193",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/4193#issuecomment-31152",
    "user": "https://github.com/loefflerd"
}
```

<a id='comment:5'></a>Michael: can we close this ticket now, as with 5508 and 5159 merged, the code contains both a fix and a doctest to prove the fix works?

Regards,

David



---

archive/issue_events_009510.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/mabshoff",
    "created_at": "2009-04-24T08:44:29Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/4193",
    "milestone": "sage-3.4.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/4193#event-9510"
}
```



---

archive/issue_events_009511.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/mabshoff",
    "created_at": "2009-04-24T08:44:29Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/4193",
    "milestone": "sage-3.4.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/4193#event-9511"
}
```



---

archive/issue_events_009512.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/mabshoff",
    "created_at": "2009-04-24T08:44:29Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/4193",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/4193#event-9512"
}
```



---

archive/issue_comments_031153.json:
```json
{
    "body": "<a id='comment:6'></a>Fixed in Sage 3.4.2.alpha0 by #5508.\n\nCheers,\n\nMichael",
    "created_at": "2009-04-24T08:44:29Z",
    "issue": "https://github.com/sagemath/sagetest/issues/4193",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/4193#issuecomment-31153",
    "user": "https://trac.sagemath.org/admin/accounts/users/mabshoff"
}
```

<a id='comment:6'></a>Fixed in Sage 3.4.2.alpha0 by #5508.

Cheers,

Michael



---

archive/issue_comments_031154.json:
```json
{
    "body": "Resolution: fixed",
    "created_at": "2009-04-24T08:44:29Z",
    "issue": "https://github.com/sagemath/sagetest/issues/4193",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/4193#issuecomment-31154",
    "user": "https://trac.sagemath.org/admin/accounts/users/mabshoff"
}
```

Resolution: fixed
