# Issue 4325: CC() fails on Mathematica output

archive/issues_004325.json:
```json
{
    "assignees": [],
    "body": "Using 3.1.2 on sage.math:\n\n```\nsage: mathematica.eval('N[BesselK[1+I, 2+ 3*I], 20]')\n         -0.105203133241753451256 + 0.017589014615189905553 I\n```\nNow say I want to get a CC element out of that:\n\n```\nsage: CC(mathematica.eval('N[BesselK[1+I, 2+ 3*I], 20]'))\n------------------------------------------------------------\n   File \"<string>\", line 1\n     -RealNumber('0.105203133241753451256')+RealNumber('0.017589014615189905553')I\n                                                                                 ^\nSyntaxError: unexpected EOF while parsing\n\n```\nIt's confused because Mathematica uses a space between the number and I; a workaround is to put in an asterisk:\n\n```\nsage: CC(mathematica.eval('N[BesselK[1+I, 2+ 3*I], 20]').replace(' I', '*I'))\n-0.105203133241753 + 0.0175890146151899*I\n```\nI understand that this kind of parsing can get difficult and complicated, but it seems like something we should aim for.\n\n**Assignee:** @williamstein\n\n**Keywords:** mathematica\n\nIssue created by migration from https://trac.sagemath.org/ticket/4325\n\n",
    "closed_at": "2009-04-22T07:34:52Z",
    "created_at": "2008-10-20T02:17:29Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20interfaces",
        "https://github.com/sagemath/sage/labels/bug",
        "https://github.com/sagemath/sage/labels/wontfix"
    ],
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "CC() fails on Mathematica output",
    "type": "issue",
    "updated_at": "2009-04-22T07:34:52Z",
    "url": "https://github.com/sagemath/sage/issues/4325",
    "user": "https://github.com/dandrake"
}
```
Using 3.1.2 on sage.math:

```
sage: mathematica.eval('N[BesselK[1+I, 2+ 3*I], 20]')
         -0.105203133241753451256 + 0.017589014615189905553 I
```
Now say I want to get a CC element out of that:

```
sage: CC(mathematica.eval('N[BesselK[1+I, 2+ 3*I], 20]'))
------------------------------------------------------------
   File "<string>", line 1
     -RealNumber('0.105203133241753451256')+RealNumber('0.017589014615189905553')I
                                                                                 ^
SyntaxError: unexpected EOF while parsing

```
It's confused because Mathematica uses a space between the number and I; a workaround is to put in an asterisk:

```
sage: CC(mathematica.eval('N[BesselK[1+I, 2+ 3*I], 20]').replace(' I', '*I'))
-0.105203133241753 + 0.0175890146151899*I
```
I understand that this kind of parsing can get difficult and complicated, but it seems like something we should aim for.

**Assignee:** @williamstein

**Keywords:** mathematica

Issue created by migration from https://trac.sagemath.org/ticket/4325





---

archive/issue_events_039784.json:
```json
{
    "actor": "https://github.com/dandrake",
    "created_at": "2008-10-20T02:17:29Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/4325",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20interfaces",
    "label_color": "08517b",
    "label_name": "component: interfaces",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/4325#event-39784"
}
```



---

archive/issue_events_039785.json:
```json
{
    "actor": "https://github.com/dandrake",
    "created_at": "2008-10-20T02:17:29Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/4325",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "008080",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/4325#event-39785"
}
```



---

archive/issue_events_039786.json:
```json
{
    "actor": "https://github.com/dandrake",
    "created_at": "2008-10-20T02:17:29Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/4325",
    "label": "https://github.com/sagemath/sage/labels/invalid",
    "label_color": "008080",
    "label_name": "invalid",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/4325#event-39786"
}
```



---

archive/issue_comments_025915.json:
```json
{
    "body": "<a id='comment:1'>**Comment 1:**</a>\nHere's another problem:\n\n```\nsage: mathematica.eval('N[BesselK[I-1, I], 30]')\n\n         -0.190193056011529041190471623406 - \n \n>    0.470313413807477232703205350275 I\n```\nTrying to `CC()` that fails because of the newlines and the `>` in the middle. This may be another ticket entirely, so let me know if I should open another.",
    "created_at": "2008-10-20T05:42:19Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/4325",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/4325#issuecomment-25915",
    "user": "https://github.com/dandrake"
}
```

<a id='comment:1'>**Comment 1:**</a>
Here's another problem:

```
sage: mathematica.eval('N[BesselK[I-1, I], 30]')

         -0.190193056011529041190471623406 - 
 
>    0.470313413807477232703205350275 I
```
Trying to `CC()` that fails because of the newlines and the `>` in the middle. This may be another ticket entirely, so let me know if I should open another.



---

archive/issue_comments_025916.json:
```json
{
    "body": "<a id='comment:2'>**Comment 2:**</a>\nIn Mathematica, we can set the output to automatically be wrapped in a certain function.  We ought to just write a function that first calls InputForm.\n\n```\nsage: CC(mathematica.eval('N[BesselK[1+I, 2+ 3*I], 20]//InputForm[#,NumberMarks->False]&'))\n-0.105203133241753 + 0.0175890146151899*I\nsage: CC(mathematica.eval('N[BesselK[I-1, I], 30]//InputForm[#,NumberMarks->False]&'))\n-0.190193056011529 - 0.470313413807477*I\n```\n\nI put the NumberMarks->False option since Sage doesn't know how to deal with the precision information returned from Mathematica.  It would be nice if there was a way to use that in constructing Sage objects.  My guess is it would be fairly easy in Mathematica to write a function that generates Sage output, given that you easily have access to the full parse tree of the function in Mathematica.\n\n\nAnother way to get rid of the precision information is to set $NumberMarks = False:\n\n```\nsage: mathematica.eval('$NumberMarks=False')\n         False\nsage: CC(mathematica.eval('N[BesselK[I-1, I], 30]//InputForm'))-0.190193056011529 - 0.470313413807477*I\n```\n\nWe can automatically apply the InputForm to any printed output by setting the $PrePrint hook:\n\n```\nsage: mathematica.eval('$NumberMarks=False')\n         False\nsage: mathematica.eval('$PrePrint = InputForm')\n         InputForm\nsage: CC(mathematica.eval('N[BesselK[I-1, I], 30]'))\n-0.190193056011529 - 0.470313413807477*I\nsage: CC(mathematica.eval('N[BesselK[1+I, 2+ 3*I], 20]'))\n-0.105203133241753 + 0.0175890146151899*I\n```",
    "created_at": "2008-10-20T10:46:41Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/4325",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/4325#issuecomment-25916",
    "user": "https://github.com/jasongrout"
}
```

<a id='comment:2'>**Comment 2:**</a>
In Mathematica, we can set the output to automatically be wrapped in a certain function.  We ought to just write a function that first calls InputForm.

```
sage: CC(mathematica.eval('N[BesselK[1+I, 2+ 3*I], 20]//InputForm[#,NumberMarks->False]&'))
-0.105203133241753 + 0.0175890146151899*I
sage: CC(mathematica.eval('N[BesselK[I-1, I], 30]//InputForm[#,NumberMarks->False]&'))
-0.190193056011529 - 0.470313413807477*I
```

I put the NumberMarks->False option since Sage doesn't know how to deal with the precision information returned from Mathematica.  It would be nice if there was a way to use that in constructing Sage objects.  My guess is it would be fairly easy in Mathematica to write a function that generates Sage output, given that you easily have access to the full parse tree of the function in Mathematica.


Another way to get rid of the precision information is to set $NumberMarks = False:

```
sage: mathematica.eval('$NumberMarks=False')
         False
sage: CC(mathematica.eval('N[BesselK[I-1, I], 30]//InputForm'))-0.190193056011529 - 0.470313413807477*I
```

We can automatically apply the InputForm to any printed output by setting the $PrePrint hook:

```
sage: mathematica.eval('$NumberMarks=False')
         False
sage: mathematica.eval('$PrePrint = InputForm')
         InputForm
sage: CC(mathematica.eval('N[BesselK[I-1, I], 30]'))
-0.190193056011529 - 0.470313413807477*I
sage: CC(mathematica.eval('N[BesselK[1+I, 2+ 3*I], 20]'))
-0.105203133241753 + 0.0175890146151899*I
```



---

archive/issue_comments_025917.json:
```json
{
    "body": "<a id='comment:3'>**Comment 3:**</a>\nThe output of mathematica.eval (or in general FOO.eval) must be the string that *system* outputs. There is absolutely no reason any coercion, e.g., CC(FOO.eval(...)) should ever work.  This ticket as is is definitely invalid.\n\nHowever, it is fair game to want to make something like CC(FOO(...)) work. Note that there is no eval.  So this is the only thing that should work:\n\n```\nsage: CC(mathematica('N[BesselK[1+I, 2+ 3*I], 20]'))\n```\nUnfortunately, due to stuff not being implemented, this doesn't work either.\nAnother thing that should work is \n\n```\nsage: a = mathematica('N[BesselK[1+I, 2+ 3*I], 20]')\nsage: CC((a.Re(), a.Im()))\n```\nIt doesn't, because of #4330.",
    "created_at": "2008-10-20T15:40:29Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/4325",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/4325#issuecomment-25917",
    "user": "https://github.com/williamstein"
}
```

<a id='comment:3'>**Comment 3:**</a>
The output of mathematica.eval (or in general FOO.eval) must be the string that *system* outputs. There is absolutely no reason any coercion, e.g., CC(FOO.eval(...)) should ever work.  This ticket as is is definitely invalid.

However, it is fair game to want to make something like CC(FOO(...)) work. Note that there is no eval.  So this is the only thing that should work:

```
sage: CC(mathematica('N[BesselK[1+I, 2+ 3*I], 20]'))
```
Unfortunately, due to stuff not being implemented, this doesn't work either.
Another thing that should work is 

```
sage: a = mathematica('N[BesselK[1+I, 2+ 3*I], 20]')
sage: CC((a.Re(), a.Im()))
```
It doesn't, because of #4330.



---

archive/issue_comments_025918.json:
```json
{
    "body": "<a id='comment:4'>**Comment 4:**</a>\nReplying to [@jasongrout](#comment%3A2):\n> In Mathematica, we can set the output to automatically be wrapped in a certain function.  We ought to just write a function that first calls InputForm.\n\nThose are good ideas. I wish I had known that when I was using Mathematica a lot more! I spent a *lot* of time manually editing wonky output from Mathematica's primitive command line interface.\n\nReplying to [@williamstein](#comment%3A3):\n> The output of mathematica.eval (or in general FOO.eval) must be the string that *system* outputs. There is absolutely no reason any coercion, e.g., CC(FOO.eval(...)) should ever work. This ticket as is is definitely invalid. \n\nOkay, it's no problem if this is an invalid ticket. Looks like #4330 will fix the true problem here.",
    "created_at": "2008-10-21T00:19:34Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/4325",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/4325#issuecomment-25918",
    "user": "https://github.com/dandrake"
}
```

<a id='comment:4'>**Comment 4:**</a>
Replying to [@jasongrout](#comment%3A2):
> In Mathematica, we can set the output to automatically be wrapped in a certain function.  We ought to just write a function that first calls InputForm.

Those are good ideas. I wish I had known that when I was using Mathematica a lot more! I spent a *lot* of time manually editing wonky output from Mathematica's primitive command line interface.

Replying to [@williamstein](#comment%3A3):
> The output of mathematica.eval (or in general FOO.eval) must be the string that *system* outputs. There is absolutely no reason any coercion, e.g., CC(FOO.eval(...)) should ever work. This ticket as is is definitely invalid. 

Okay, it's no problem if this is an invalid ticket. Looks like #4330 will fix the true problem here.



---

archive/issue_comments_025919.json:
```json
{
    "body": "<a id='comment:5'>**Comment 5:**</a>\nWith #4330 being fixed I'm closing this ticket as fixed. The suggestion given above ([was](#comment%3A3)) works now with 3.4.1.rc4:\n\n```\nsage: a = mathematica('N[BesselK[1+I, 2+ 3*I], 30]')\nsage: CC((a.Re(), a.Im()))\n-0.105203133241753 + 0.0175890146151899*I\n```\nYou lose a bit of precision, there, so you can use RealField and so on:\n\n```\nsage: a.Re()\n-0.10520313324175345125609254499068\nsage: RealField(100)(a.Re())\n-0.10520313324175345125609254499\nsage: RealField(110)(a.Re())\n-0.10520313324175345125609254499070\n```\n\nSince this works now, and my original usage of `mathematica.eval` isn't supposed to work, I say this is fixed.",
    "created_at": "2009-04-22T07:24:06Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/4325",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/4325#issuecomment-25919",
    "user": "https://github.com/dandrake"
}
```

<a id='comment:5'>**Comment 5:**</a>
With #4330 being fixed I'm closing this ticket as fixed. The suggestion given above ([was](#comment%3A3)) works now with 3.4.1.rc4:

```
sage: a = mathematica('N[BesselK[1+I, 2+ 3*I], 30]')
sage: CC((a.Re(), a.Im()))
-0.105203133241753 + 0.0175890146151899*I
```
You lose a bit of precision, there, so you can use RealField and so on:

```
sage: a.Re()
-0.10520313324175345125609254499068
sage: RealField(100)(a.Re())
-0.10520313324175345125609254499
sage: RealField(110)(a.Re())
-0.10520313324175345125609254499070
```

Since this works now, and my original usage of `mathematica.eval` isn't supposed to work, I say this is fixed.



---

archive/issue_events_039787.json:
```json
{
    "actor": "https://github.com/dandrake",
    "created_at": "2009-04-22T07:24:06Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/4325",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/4325#event-39787"
}
```



---

archive/issue_comments_025920.json:
```json
{
    "body": "<a id='comment:6'>**Comment 6:**</a>\nThis ticket should only be closed when a proper doctest has been added. I skimmed #4330 and did not see such a doctest.\n\nThoughts?\n\nCheers,\n\nMichael",
    "created_at": "2009-04-22T07:33:17Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/4325",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/4325#issuecomment-25920",
    "user": "https://github.com/sagetrac-mabshoff"
}
```

<a id='comment:6'>**Comment 6:**</a>
This ticket should only be closed when a proper doctest has been added. I skimmed #4330 and did not see such a doctest.

Thoughts?

Cheers,

Michael



---

archive/issue_events_039788.json:
```json
{
    "actor": "https://github.com/sagetrac-mabshoff",
    "created_at": "2009-04-22T07:34:52Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/4325",
    "label": "https://github.com/sagemath/sage/labels/wontfix",
    "label_color": "008080",
    "label_name": "wontfix",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/4325#event-39788"
}
```



---

archive/issue_events_039789.json:
```json
{
    "actor": "https://github.com/sagetrac-mabshoff",
    "created_at": "2009-04-22T07:34:52Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/4325",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/4325#event-39789"
}
```



---

archive/issue_comments_025921.json:
```json
{
    "body": "<a id='comment:7'>**Comment 7:**</a>\nAnd to close this it should be \"wontfix\" or \"invalid\" depending on taste. I think that since this is bogus/an abuse of eval we don't need a doctest in this case :).\n\nCheers,\n\nMichael",
    "created_at": "2009-04-22T07:34:52Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/4325",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/4325#issuecomment-25921",
    "user": "https://github.com/sagetrac-mabshoff"
}
```

<a id='comment:7'>**Comment 7:**</a>
And to close this it should be "wontfix" or "invalid" depending on taste. I think that since this is bogus/an abuse of eval we don't need a doctest in this case :).

Cheers,

Michael



---

archive/issue_events_039790.json:
```json
{
    "actor": "https://github.com/sagetrac-mabshoff",
    "created_at": "2009-04-22T07:34:52Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/4325",
    "milestone_number": null,
    "milestone_title": "sage-4.0",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/4325#event-39790"
}
```
