# Issue 4419: conversion of Permutations to GAP not implemented

archive/issues_004419.json:
```json
{
    "assignees": [],
    "body": "The following fails \n\n```\nsage: p = gap(Permutation('(1,2,3)'))\nsage: q = gap(Permutation([()]))\nsage: gap.Group([p, q])\n```\nbecause \n\n```\nsage: gap(Permutation((1,2,3)))\n[ 2 3 1 ]\n```\n\n**Assignee:** @mwhansen\n\n**CC:**  sage-combinat\n\nIssue created by migration from https://trac.sagemath.org/ticket/4419\n\n",
    "closed_at": "2008-11-21T10:56:12Z",
    "created_at": "2008-11-02T00:17:11Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20combinatorics",
        "https://github.com/sagemath/sage/labels/minor",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-3.2.1",
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "conversion of Permutations to GAP not implemented",
    "type": "issue",
    "updated_at": "2009-04-14T04:03:38Z",
    "url": "https://github.com/sagemath/sage/issues/4419",
    "user": "https://github.com/mwhansen"
}
```
The following fails 

```
sage: p = gap(Permutation('(1,2,3)'))
sage: q = gap(Permutation([()]))
sage: gap.Group([p, q])
```
because 

```
sage: gap(Permutation((1,2,3)))
[ 2 3 1 ]
```

**Assignee:** @mwhansen

**CC:**  sage-combinat

Issue created by migration from https://trac.sagemath.org/ticket/4419





---

archive/issue_events_040807.json:
```json
{
    "actor": "https://github.com/mwhansen",
    "created_at": "2008-11-02T00:17:11Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/4419",
    "milestone_number": null,
    "milestone_title": "sage-3.2.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/4419#event-40807"
}
```



---

archive/issue_events_040808.json:
```json
{
    "actor": "https://github.com/mwhansen",
    "created_at": "2008-11-02T00:17:11Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/4419",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20combinatorics",
    "label_color": "08517b",
    "label_name": "component: combinatorics",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/4419#event-40808"
}
```



---

archive/issue_events_040809.json:
```json
{
    "actor": "https://github.com/mwhansen",
    "created_at": "2008-11-02T00:17:11Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/4419",
    "label": "https://github.com/sagemath/sage/labels/minor",
    "label_color": "ff0000",
    "label_name": "minor",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/4419#event-40809"
}
```



---

archive/issue_events_040810.json:
```json
{
    "actor": "https://github.com/mwhansen",
    "created_at": "2008-11-02T00:17:11Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/4419",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "008080",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/4419#event-40810"
}
```



---

archive/issue_events_040811.json:
```json
{
    "actor": "https://github.com/mwhansen",
    "created_at": "2008-11-02T00:17:11Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/4419",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "008080",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/4419#event-40811"
}
```



---

archive/issue_comments_026627.json:
```json
{
    "body": "<a id='comment:1'>**Comment 1:**</a>\n**Attachment:** [trac_4419.patch.gz](https://github.com/sagemath/sage/files/ticket4419/trac_4419.patch.gz)\n\nI don't see how this fixes the original problem. I get this:\n\n```\nsage: p = gap(Permutation('(1,2,3)'))                                                                                              \nsage: q = gap(Permutation('()'))                                                                                       \n---------------------------------------------------------------------------                                            \nValueError                                Traceback (most recent call last)\n<snip>\n\n\nValueError: invalid literal for int() with base 10: ''\n```\n\nand this:\n\n```\nsage: q = gap(Permutation(()))\n---------------------------------------------------------------------------\nTypeError                                 Traceback (most recent call last)\n<snip>\n\nTypeError: not enough arguments for format string\n```\n\nIt seems to me you want Permutation to work like\nPermutationGroupElement does here:\n\n```\nsage: p = gap(PermutationGroupElement('(1,2,3)'))\nsage: q = gap(PermutationGroupElement('()'))\nsage: gap.Group([p, q])\nGroup( [ (1,2,3), () ] )\nsage: gap.Group([p]) == gap.Group([p, q])\nTrue\n```\nIs that correct?",
    "created_at": "2008-11-02T01:57:42Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/4419",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/4419#issuecomment-26627",
    "user": "https://github.com/wdjoyner"
}
```

<a id='comment:1'>**Comment 1:**</a>
**Attachment:** [trac_4419.patch.gz](https://github.com/sagemath/sage/files/ticket4419/trac_4419.patch.gz)

I don't see how this fixes the original problem. I get this:

```
sage: p = gap(Permutation('(1,2,3)'))                                                                                              
sage: q = gap(Permutation('()'))                                                                                       
---------------------------------------------------------------------------                                            
ValueError                                Traceback (most recent call last)
<snip>


ValueError: invalid literal for int() with base 10: ''
```

and this:

```
sage: q = gap(Permutation(()))
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)
<snip>

TypeError: not enough arguments for format string
```

It seems to me you want Permutation to work like
PermutationGroupElement does here:

```
sage: p = gap(PermutationGroupElement('(1,2,3)'))
sage: q = gap(PermutationGroupElement('()'))
sage: gap.Group([p, q])
Group( [ (1,2,3), () ] )
sage: gap.Group([p]) == gap.Group([p, q])
True
```
Is that correct?



---

archive/issue_comments_026628.json:
```json
{
    "body": "<a id='comment:2'>**Comment 2:**</a>\nActually, the original issue was this:\n\n```\nsage: p = gap(Permutation('(1,2,3)'))\nsage: q = gap(Permutation([()]))\nsage: gap.Group([p, q])\n---------------------------------------------------------------------------\nTypeError                                 Traceback (most recent call last)\n```\n\nThose things that you encountered are \"bugs\" in the constructor of Permutation.  I always construct Permutations from their list notation.",
    "created_at": "2008-11-02T03:07:06Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/4419",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/4419#issuecomment-26628",
    "user": "https://github.com/mwhansen"
}
```

<a id='comment:2'>**Comment 2:**</a>
Actually, the original issue was this:

```
sage: p = gap(Permutation('(1,2,3)'))
sage: q = gap(Permutation([()]))
sage: gap.Group([p, q])
---------------------------------------------------------------------------
TypeError                                 Traceback (most recent call last)
```

Those things that you encountered are "bugs" in the constructor of Permutation.  I always construct Permutations from their list notation.



---

archive/issue_comments_026629.json:
```json
{
    "body": "<a id='comment:3'>**Comment 3:**</a>\nThis patch should get a positive review because it fixes the conversion to gap problem:\n\n```\nsage: p = Permutation('(1,2,3)')\nsage: q = Permutation([()])\nsage: gap.Group([p,q])\nGroup( [ (1,2,3), () ] )\n```\n\nThe other issues noticed by wdj are problems with the Permutations constructor function, and I will open a new ticket for them.",
    "created_at": "2008-11-20T20:41:28Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/4419",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/4419#issuecomment-26629",
    "user": "https://github.com/saliola"
}
```

<a id='comment:3'>**Comment 3:**</a>
This patch should get a positive review because it fixes the conversion to gap problem:

```
sage: p = Permutation('(1,2,3)')
sage: q = Permutation([()])
sage: gap.Group([p,q])
Group( [ (1,2,3), () ] )
```

The other issues noticed by wdj are problems with the Permutations constructor function, and I will open a new ticket for them.



---

archive/issue_events_040812.json:
```json
{
    "actor": "https://github.com/saliola",
    "created_at": "2008-11-20T20:41:28Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/4419",
    "label": "https://github.com/sagemath/sage/labels/positive%20review",
    "label_color": "008080",
    "label_name": "positive review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/4419#event-40812"
}
```



---

archive/issue_comments_026630.json:
```json
{
    "body": "<a id='comment:4'>**Comment 4:**</a>\nThe new ticket is here: #4569",
    "created_at": "2008-11-20T20:47:59Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/4419",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/4419#issuecomment-26630",
    "user": "https://github.com/saliola"
}
```

<a id='comment:4'>**Comment 4:**</a>
The new ticket is here: #4569



---

archive/issue_events_040813.json:
```json
{
    "actor": "https://github.com/sagetrac-mabshoff",
    "created_at": "2008-11-21T10:56:12Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/4419",
    "label": "https://github.com/sagemath/sage/labels/positive%20review",
    "label_color": "008080",
    "label_name": "positive review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/4419#event-40813"
}
```



---

archive/issue_events_040814.json:
```json
{
    "actor": "https://github.com/sagetrac-mabshoff",
    "created_at": "2008-11-21T10:56:12Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/4419",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/4419#event-40814"
}
```



---

archive/issue_comments_026631.json:
```json
{
    "body": "<a id='comment:5'>**Comment 5:**</a>\nMerged in Sage 3.2.1.alpha0",
    "created_at": "2008-11-21T10:56:12Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/4419",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/4419#issuecomment-26631",
    "user": "https://github.com/sagetrac-mabshoff"
}
```

<a id='comment:5'>**Comment 5:**</a>
Merged in Sage 3.2.1.alpha0
