# Issue 4487: [with patch; positive review] add method to evaluate characters of permutation and matrix groups

archive/issues_004487.json:
```json
{
    "body": "Currently to evaluate a character, you have to use\nsomething indirect like \n\n```\nsage: G = GL(2,7)\nsage: z = G.center().an_element()\nsage: reps = [x.Representative() for x in gap(G).ConjugacyClasses()]\nsage: reps.index(gap(z))\n8\nsage: table = gap(G).CharacterTable().Irr()\nsage: chi = table[2]\nsage: chi[8]\n1\n```\n\nMartin Mereb asked\n\n```\nis it possible to imlpement something like\nchi(z) or chi.eval(z) or something like that?\n```\n\nThis should be implemented.\n\nAssignee: joyner\n\nResolution: fixed\n\nIssue created by migration from https://trac.sagemath.org/ticket/4487\n\n",
    "closed_at": "2008-11-21T19:15:22Z",
    "created_at": "2008-11-10T00:12:42Z",
    "labels": [
        "component: group theory"
    ],
    "milestone": "https://github.com/sagemath/sagetest/milestones/sage-3.2.1",
    "title": "[with patch; positive review] add method to evaluate characters of permutation and matrix groups",
    "type": "issue",
    "url": "https://github.com/sagemath/sagetest/issues/4487",
    "user": "https://github.com/wdjoyner"
}
```
Currently to evaluate a character, you have to use
something indirect like 

```
sage: G = GL(2,7)
sage: z = G.center().an_element()
sage: reps = [x.Representative() for x in gap(G).ConjugacyClasses()]
sage: reps.index(gap(z))
8
sage: table = gap(G).CharacterTable().Irr()
sage: chi = table[2]
sage: chi[8]
1
```

Martin Mereb asked

```
is it possible to imlpement something like
chi(z) or chi.eval(z) or something like that?
```

This should be implemented.

Assignee: joyner

Resolution: fixed

Issue created by migration from https://trac.sagemath.org/ticket/4487





---

archive/issue_comments_033068.json:
```json
{
    "body": "Attachment [group_character_4487.patch](tarball://root/attachments/some-uuid/ticket4487/group_character_4487.patch) by @saliola created at 2008-11-13 17:01:01\n\npatch against version 3.2.rc0",
    "created_at": "2008-11-13T17:01:01Z",
    "issue": "https://github.com/sagemath/sagetest/issues/4487",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/4487#issuecomment-33068",
    "user": "https://github.com/saliola"
}
```

Attachment [group_character_4487.patch](tarball://root/attachments/some-uuid/ticket4487/group_character_4487.patch) by @saliola created at 2008-11-13 17:01:01

patch against version 3.2.rc0



---

archive/issue_comments_033069.json:
```json
{
    "body": "<a id='comment:1'></a>I'm attaching a patch that adds a GroupCharacter class that wraps GAP's Character function. The above can now be achieved by doing the following:\n\n```\nsage: G = GL(2,7)\nsage: z = G.center().an_element()\nsage: chi = G.irreducible_characters()[1]\nsage: chi(z)\n1\n```\n\n\nOne problem: I don't know how to coerce the values of the characters into Sage. Is there a standard datatype for this?",
    "created_at": "2008-11-13T17:06:58Z",
    "issue": "https://github.com/sagemath/sagetest/issues/4487",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/4487#issuecomment-33069",
    "user": "https://github.com/saliola"
}
```

<a id='comment:1'></a>I'm attaching a patch that adds a GroupCharacter class that wraps GAP's Character function. The above can now be achieved by doing the following:

```
sage: G = GL(2,7)
sage: z = G.center().an_element()
sage: chi = G.irreducible_characters()[1]
sage: chi(z)
1
```


One problem: I don't know how to coerce the values of the characters into Sage. Is there a standard datatype for this?



---

archive/issue_comments_033070.json:
```json
{
    "body": "<a id='comment:2'></a>Thank you so much for adding this patch. It is wonderful!\n\nI probably will not have time in the next day or so to referee it but can this weekend  definitely and possibly tomorrow night. However, I see a few problems. First, you are returning GAP values, but this is easy to fix:\n\n```\n\nsage: from sage.interfaces.gap import gfq_gap_to_sage\nsage: gfq_gap_to_sage(\"E(7)\",GF(7))\n3\nsage: gfq_gap_to_sage(\"E(8)\",GF(8,\"a\"))\na\n```\n\nSecond, and this is a matter of taste, I would name your Python class ClassFunction instead of GroupCharacter. Of course, they are the same vector space, but you can define orbital integrals and other invariants without regard to the characters, so it is just a more general name.\n\nThird, I wonder if it would be any more work to allow any Sage ring and the value-ring of an instance of this class? (For example, polynomial-valued class functions?)\n\nFinally, I wonder if you could also create a much more general class of ring-valued functions on a group? I don't know what use this would be off-hand but maybe one could use it in case one if not sure if the function is a class function or not?\n\nAnyway, just a few ideas to think about if you want, but thanks again for the very useful addition.",
    "created_at": "2008-11-13T20:41:02Z",
    "issue": "https://github.com/sagemath/sagetest/issues/4487",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/4487#issuecomment-33070",
    "user": "https://github.com/wdjoyner"
}
```

<a id='comment:2'></a>Thank you so much for adding this patch. It is wonderful!

I probably will not have time in the next day or so to referee it but can this weekend  definitely and possibly tomorrow night. However, I see a few problems. First, you are returning GAP values, but this is easy to fix:

```

sage: from sage.interfaces.gap import gfq_gap_to_sage
sage: gfq_gap_to_sage("E(7)",GF(7))
3
sage: gfq_gap_to_sage("E(8)",GF(8,"a"))
a
```

Second, and this is a matter of taste, I would name your Python class ClassFunction instead of GroupCharacter. Of course, they are the same vector space, but you can define orbital integrals and other invariants without regard to the characters, so it is just a more general name.

Third, I wonder if it would be any more work to allow any Sage ring and the value-ring of an instance of this class? (For example, polynomial-valued class functions?)

Finally, I wonder if you could also create a much more general class of ring-valued functions on a group? I don't know what use this would be off-hand but maybe one could use it in case one if not sure if the function is a class function or not?

Anyway, just a few ideas to think about if you want, but thanks again for the very useful addition.



---

archive/issue_comments_033071.json:
```json
{
    "body": "<a id='comment:3'></a>Right now the code just wraps GAPs commands, but it can be made to do a lot of things natively and resort to GAP for some of the more complicated stuff. I was uncertain about how to implement a few things, but I thought that this would be a good way to start the discussion. I look forward to your review.\n\nI've been reading more about GAP's implementation, and it heavily relies on character tables. So we are probably going to want to implement those as well. In fact, every character stores the whole character table of the group (as UnderlyingCharacterTable). Should we stick closely to the GAP implementation and do the same? Arguably, this is what we should do if we want to use GAP for the heavy lifting, but I am open to suggestions.",
    "created_at": "2008-11-14T00:31:38Z",
    "issue": "https://github.com/sagemath/sagetest/issues/4487",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/4487#issuecomment-33071",
    "user": "https://github.com/saliola"
}
```

<a id='comment:3'></a>Right now the code just wraps GAPs commands, but it can be made to do a lot of things natively and resort to GAP for some of the more complicated stuff. I was uncertain about how to implement a few things, but I thought that this would be a good way to start the discussion. I look forward to your review.

I've been reading more about GAP's implementation, and it heavily relies on character tables. So we are probably going to want to implement those as well. In fact, every character stores the whole character table of the group (as UnderlyingCharacterTable). Should we stick closely to the GAP implementation and do the same? Arguably, this is what we should do if we want to use GAP for the heavy lifting, but I am open to suggestions.



---

archive/issue_events_010156.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/mabshoff",
    "created_at": "2008-11-14T05:41:23Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sagetest/issues/4487",
    "milestone": "sage-3.2.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/4487#event-10156"
}
```



---

archive/issue_comments_033072.json:
```json
{
    "body": "<a id='comment:5'></a>First, I am running sage on ubuntu 8.10 where doctesting seems to be broken, so I have not tested this.\n\nI like this addition so much, I am going to give it a positive review once one important change is made.\n\nThis output:\n\n```\nsage: G = GL(2,3)\nsage: irrs = G.irreducible_characters()\nsage: chi1 = irrs[3]; chi1\nCharacter of General Linear Group of degree 2 over Finite Field of size 3\nsage: g = G.conjugacy_class_representatives()[6]\nsage: chi1(g)\nE(8)+E(8)^3\n```\nis unacceptable, IMHO, because it is easy to fix and (as the author himself noted) should be a Sage value.\n\nIn addition to the things I noted above which might be changed but don't have to be (yet or ever), is the following somewhat odd behaviour:\n\n```\nsage: len(G.conjugacy_class_representatives())\n8\nsage: chi2 = GroupCharacter(G, [-1, -1, -1, -1, -1, 1, -1, -1])\nsage: chi2.irreducible_constituents()\n[]\nsage: chi2 = GroupCharacter(G, [1, 1, 1, 1, 1,1, 1, 1])\nsage: chi2.irreducible_constituents()\n[Character of General Linear Group of degree 2 over Finite Field of size 3]\nsage: chi2 = GroupCharacter(G, [2, 2, 2, 2, 2, 2, 2, 2])\nsage: chi2.irreducible_constituents()\n[Character of General Linear Group of degree 2 over Finite Field of size 3]\n```\nIt seems to be a coefficient is missing somewhere here. (I agree that this simply interfaces with GAP, but still!) Anyway, this can be fixed later and I want to minimize the required work so this can be included in Sage ASAP.",
    "created_at": "2008-11-15T00:53:03Z",
    "issue": "https://github.com/sagemath/sagetest/issues/4487",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/4487#issuecomment-33072",
    "user": "https://github.com/wdjoyner"
}
```

<a id='comment:5'></a>First, I am running sage on ubuntu 8.10 where doctesting seems to be broken, so I have not tested this.

I like this addition so much, I am going to give it a positive review once one important change is made.

This output:

```
sage: G = GL(2,3)
sage: irrs = G.irreducible_characters()
sage: chi1 = irrs[3]; chi1
Character of General Linear Group of degree 2 over Finite Field of size 3
sage: g = G.conjugacy_class_representatives()[6]
sage: chi1(g)
E(8)+E(8)^3
```
is unacceptable, IMHO, because it is easy to fix and (as the author himself noted) should be a Sage value.

In addition to the things I noted above which might be changed but don't have to be (yet or ever), is the following somewhat odd behaviour:

```
sage: len(G.conjugacy_class_representatives())
8
sage: chi2 = GroupCharacter(G, [-1, -1, -1, -1, -1, 1, -1, -1])
sage: chi2.irreducible_constituents()
[]
sage: chi2 = GroupCharacter(G, [1, 1, 1, 1, 1,1, 1, 1])
sage: chi2.irreducible_constituents()
[Character of General Linear Group of degree 2 over Finite Field of size 3]
sage: chi2 = GroupCharacter(G, [2, 2, 2, 2, 2, 2, 2, 2])
sage: chi2.irreducible_constituents()
[Character of General Linear Group of degree 2 over Finite Field of size 3]
```
It seems to be a coefficient is missing somewhere here. (I agree that this simply interfaces with GAP, but still!) Anyway, this can be fixed later and I want to minimize the required work so this can be included in Sage ASAP.



---

archive/issue_comments_033073.json:
```json
{
    "body": "<a id='comment:6'></a>* As suggested, I switched from GroupCharacter to ClassFunction. Note that this also changes the function being wrapped: GAP's ClassFunction instead of Character. Besides being more general, it also eliminates the odd behaviour you noticed above:\n\n```\nsage: G = GL(2,3)\nsage: sage: len(G.conjugacy_class_representatives())\n8\nsage: chi2 = ClassFunction(G, [-1, -1, -1, -1, -1, 1, -1, -1])\nsage: chi2.irreducible_constituents()\n[Character of General Linear Group of degree 2 over Finite Field of size 3,\n Character of General Linear Group of degree 2 over Finite Field of size 3,\n Character of General Linear Group of degree 2 over Finite Field of size 3,\n Character of General Linear Group of degree 2 over Finite Field of size 3,\n Character of General Linear Group of degree 2 over Finite Field of size 3,\n Character of General Linear Group of degree 2 over Finite Field of size 3]\nsage: chi2 = ClassFunction(G, [1, 1, 1, 1, 1,1, 1, 1])\nsage: chi2.irreducible_constituents()\n[Character of General Linear Group of degree 2 over Finite Field of size 3]\nsage: chi2 = ClassFunction(G, [2, 2, 2, 2, 2, 2, 2, 2])\nsage: chi2.irreducible_constituents()\n[Character of General Linear Group of degree 2 over Finite Field of size 3]\n```\n\n* I also fixed it so that Sage values are output instead of GAP elements. Thanks for pointing out gfq_gap_to_sage. I fixed this by adding a _base_ring data attribute that is set to the appropriate Cyclotomic Field (like is done in the character_table method). This should also make it possible to extend the code to work with values in arbitrary sage rings.\n\n```\nsage: G = GL(2,3)\nsage: chi = G.irreducible_characters()[3]\nsage: g = G.conjugacy_class_representatives()[6]\nsage: chi(g)\nzeta8^3 + zeta8\n```\n\n* Unfortunately, though, it seems that Cyclotomic field elements aren't converted to GAP elements correctly, so using them as values won't work.\n\n```\nsage: G = GL(2,3)\nsage: z = CyclotomicField(8).an_element; z\nzeta8\nsage: values = [2, 1, -2, -1, 0, -z^3 - z, z^3 + z, 0]\nsage: xi = gap.ClassFunction(G, values); xi\nClassFunction( CharacterTable( GL(2,3) ),\n[ 2, 1, -2, -1, 0, (-1*zeta8-1*zeta8^3), (zeta8+zeta8^3), 0 ] )\nsage: ClassFunction(G, values)\nTraceback: ...\n```\nI think this might be a bug:\n\n```\nsage: K = CyclotomicField(8)\nsage: z = K.an_element; z\nzeta8\nsage: K(gap.E(8))\nzeta8\nsage: K(gap.E(8)) == z\nTrue\nsage: gap(z)\n(zeta8)\nsage: gap.E(8) == gap(z)\nFalse\nsage: gap(z)**4\n!-1\n```\nI'm not sure what !-1 means. Any ideas?",
    "created_at": "2008-11-17T10:38:41Z",
    "issue": "https://github.com/sagemath/sagetest/issues/4487",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/4487#issuecomment-33073",
    "user": "https://github.com/saliola"
}
```

<a id='comment:6'></a>* As suggested, I switched from GroupCharacter to ClassFunction. Note that this also changes the function being wrapped: GAP's ClassFunction instead of Character. Besides being more general, it also eliminates the odd behaviour you noticed above:

```
sage: G = GL(2,3)
sage: sage: len(G.conjugacy_class_representatives())
8
sage: chi2 = ClassFunction(G, [-1, -1, -1, -1, -1, 1, -1, -1])
sage: chi2.irreducible_constituents()
[Character of General Linear Group of degree 2 over Finite Field of size 3,
 Character of General Linear Group of degree 2 over Finite Field of size 3,
 Character of General Linear Group of degree 2 over Finite Field of size 3,
 Character of General Linear Group of degree 2 over Finite Field of size 3,
 Character of General Linear Group of degree 2 over Finite Field of size 3,
 Character of General Linear Group of degree 2 over Finite Field of size 3]
sage: chi2 = ClassFunction(G, [1, 1, 1, 1, 1,1, 1, 1])
sage: chi2.irreducible_constituents()
[Character of General Linear Group of degree 2 over Finite Field of size 3]
sage: chi2 = ClassFunction(G, [2, 2, 2, 2, 2, 2, 2, 2])
sage: chi2.irreducible_constituents()
[Character of General Linear Group of degree 2 over Finite Field of size 3]
```

* I also fixed it so that Sage values are output instead of GAP elements. Thanks for pointing out gfq_gap_to_sage. I fixed this by adding a _base_ring data attribute that is set to the appropriate Cyclotomic Field (like is done in the character_table method). This should also make it possible to extend the code to work with values in arbitrary sage rings.

```
sage: G = GL(2,3)
sage: chi = G.irreducible_characters()[3]
sage: g = G.conjugacy_class_representatives()[6]
sage: chi(g)
zeta8^3 + zeta8
```

* Unfortunately, though, it seems that Cyclotomic field elements aren't converted to GAP elements correctly, so using them as values won't work.

```
sage: G = GL(2,3)
sage: z = CyclotomicField(8).an_element; z
zeta8
sage: values = [2, 1, -2, -1, 0, -z^3 - z, z^3 + z, 0]
sage: xi = gap.ClassFunction(G, values); xi
ClassFunction( CharacterTable( GL(2,3) ),
[ 2, 1, -2, -1, 0, (-1*zeta8-1*zeta8^3), (zeta8+zeta8^3), 0 ] )
sage: ClassFunction(G, values)
Traceback: ...
```
I think this might be a bug:

```
sage: K = CyclotomicField(8)
sage: z = K.an_element; z
zeta8
sage: K(gap.E(8))
zeta8
sage: K(gap.E(8)) == z
True
sage: gap(z)
(zeta8)
sage: gap.E(8) == gap(z)
False
sage: gap(z)**4
!-1
```
I'm not sure what !-1 means. Any ideas?



---

archive/issue_comments_033074.json:
```json
{
    "body": "Attachment [class_functions_4487.patch](tarball://root/attachments/some-uuid/ticket4487/class_functions_4487.patch) by @saliola created at 2008-11-17 10:39:26\n\ndo NOT apply group_characters_4487.patch",
    "created_at": "2008-11-17T10:39:26Z",
    "issue": "https://github.com/sagemath/sagetest/issues/4487",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/4487#issuecomment-33074",
    "user": "https://github.com/saliola"
}
```

Attachment [class_functions_4487.patch](tarball://root/attachments/some-uuid/ticket4487/class_functions_4487.patch) by @saliola created at 2008-11-17 10:39:26

do NOT apply group_characters_4487.patch



---

archive/issue_comments_033075.json:
```json
{
    "body": "<a id='comment:7'></a>Only apply the latest patch (class_functions_4487.patch).",
    "created_at": "2008-11-17T10:40:52Z",
    "issue": "https://github.com/sagemath/sagetest/issues/4487",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/4487#issuecomment-33075",
    "user": "https://github.com/saliola"
}
```

<a id='comment:7'></a>Only apply the latest patch (class_functions_4487.patch).



---

archive/issue_comments_033076.json:
```json
{
    "body": "<a id='comment:8'></a>Applies cleanly to 3.2.rc1, passes sage -testall. Code looks good. Thanks Franco!",
    "created_at": "2008-11-18T19:37:52Z",
    "issue": "https://github.com/sagemath/sagetest/issues/4487",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/4487#issuecomment-33076",
    "user": "https://github.com/wdjoyner"
}
```

<a id='comment:8'></a>Applies cleanly to 3.2.rc1, passes sage -testall. Code looks good. Thanks Franco!



---

archive/issue_comments_033077.json:
```json
{
    "body": "<a id='comment:9'></a>This patch does not pass doctests with 3.2:\n\n```\nmabshoff@sage:/scratch/mabshoff/release-cycle/sage-3.2.1.alpha0$ ./sage -t -long devel/sage/sage/groups/class_function.py \nsage -t -long devel/sage/sage/groups/class_function.py      \n**********************************************************************\nFile \"/scratch/mabshoff/release-cycle/sage-3.2.1.alpha0/devel/sage/sage/groups/class_function.py\", line 335:\n    sage: chi.restrict(H)\nExpected:\n    Character of Subgroup of SymmetricGroup(5) generated by [(1,2,3), (1,2), (4,5)]\nGot:\n    Character of Subgroup of SymmetricGroup(5) generated by [(4,5), (1,2), (1,2,3)]\n**********************************************************************\nFile \"/scratch/mabshoff/release-cycle/sage-3.2.1.alpha0/devel/sage/sage/groups/class_function.py\", line 348:\n    sage: xi = H.trivial_character(); xi\nExpected:\n    Character of Subgroup of SymmetricGroup(5) generated by [(1,2,3), (1,2), (4,5)]\nGot:\n    Character of Subgroup of SymmetricGroup(5) generated by [(4,5), (1,2), (1,2,3)]\n**********************************************************************\n2 items had failures:\n   1 of   7 in __main__.example_21\n   1 of   7 in __main__.example_22\n***Test Failed*** 2 failures.\nFor whitespace errors, see the file /scratch/mabshoff/release-cycle/sage-3.2.1.alpha0/tmp/.doctest_class_function.py\n         [6.8 s]\nexit code: 1024\n```\n\nI am not quite sure what is going on here, but I guess we need to sort the generators at some point.\n\nCheers,\n\nMichael",
    "created_at": "2008-11-21T09:36:09Z",
    "issue": "https://github.com/sagemath/sagetest/issues/4487",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/4487#issuecomment-33077",
    "user": "https://trac.sagemath.org/admin/accounts/users/mabshoff"
}
```

<a id='comment:9'></a>This patch does not pass doctests with 3.2:

```
mabshoff@sage:/scratch/mabshoff/release-cycle/sage-3.2.1.alpha0$ ./sage -t -long devel/sage/sage/groups/class_function.py 
sage -t -long devel/sage/sage/groups/class_function.py      
**********************************************************************
File "/scratch/mabshoff/release-cycle/sage-3.2.1.alpha0/devel/sage/sage/groups/class_function.py", line 335:
    sage: chi.restrict(H)
Expected:
    Character of Subgroup of SymmetricGroup(5) generated by [(1,2,3), (1,2), (4,5)]
Got:
    Character of Subgroup of SymmetricGroup(5) generated by [(4,5), (1,2), (1,2,3)]
**********************************************************************
File "/scratch/mabshoff/release-cycle/sage-3.2.1.alpha0/devel/sage/sage/groups/class_function.py", line 348:
    sage: xi = H.trivial_character(); xi
Expected:
    Character of Subgroup of SymmetricGroup(5) generated by [(1,2,3), (1,2), (4,5)]
Got:
    Character of Subgroup of SymmetricGroup(5) generated by [(4,5), (1,2), (1,2,3)]
**********************************************************************
2 items had failures:
   1 of   7 in __main__.example_21
   1 of   7 in __main__.example_22
***Test Failed*** 2 failures.
For whitespace errors, see the file /scratch/mabshoff/release-cycle/sage-3.2.1.alpha0/tmp/.doctest_class_function.py
         [6.8 s]
exit code: 1024
```

I am not quite sure what is going on here, but I guess we need to sort the generators at some point.

Cheers,

Michael



---

archive/issue_comments_033078.json:
```json
{
    "body": "fixes the broken doctests; apply on top of class_functions_4487.patch",
    "created_at": "2008-11-21T13:55:51Z",
    "issue": "https://github.com/sagemath/sagetest/issues/4487",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/4487#issuecomment-33078",
    "user": "https://github.com/saliola"
}
```

fixes the broken doctests; apply on top of class_functions_4487.patch



---

archive/issue_comments_033079.json:
```json
{
    "body": "<a id='comment:10'></a>Attachment [class_functions_4487-part2.patch](tarball://root/attachments/some-uuid/ticket4487/class_functions_4487-part2.patch) by @saliola created at 2008-11-21 14:03:41\n\nHello Michael,\n\nThe __repr__ for this class just returns \"Character of\" plus the string representation of the group. So perhaps something changed in subgroup between 3.2.rc1 and 3.2?\n\nAnyhow, I posted a patch to correct the docstring. Apply on top of class_functions_4487.patch.\n\nFranco",
    "created_at": "2008-11-21T14:03:41Z",
    "issue": "https://github.com/sagemath/sagetest/issues/4487",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/4487#issuecomment-33079",
    "user": "https://github.com/saliola"
}
```

<a id='comment:10'></a>Attachment [class_functions_4487-part2.patch](tarball://root/attachments/some-uuid/ticket4487/class_functions_4487-part2.patch) by @saliola created at 2008-11-21 14:03:41

Hello Michael,

The __repr__ for this class just returns "Character of" plus the string representation of the group. So perhaps something changed in subgroup between 3.2.rc1 and 3.2?

Anyhow, I posted a patch to correct the docstring. Apply on top of class_functions_4487.patch.

Franco



---

archive/issue_comments_033080.json:
```json
{
    "body": "<a id='comment:11'></a>Yep, William added a patch late in the 3.2 game which adds some canonicalization of the generators of a permutation group (by default).  So, just changing the doctests is all that's needed.\n\n+1",
    "created_at": "2008-11-21T15:46:18Z",
    "issue": "https://github.com/sagemath/sagetest/issues/4487",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/4487#issuecomment-33080",
    "user": "https://github.com/mwhansen"
}
```

<a id='comment:11'></a>Yep, William added a patch late in the 3.2 game which adds some canonicalization of the generators of a permutation group (by default).  So, just changing the doctests is all that's needed.

+1



---

archive/issue_events_010157.json:
```json
{
    "actor": "https://trac.sagemath.org/admin/accounts/users/mabshoff",
    "created_at": "2008-11-21T19:15:22Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sagetest/issues/4487",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sagetest/issues/4487#event-10157"
}
```



---

archive/issue_comments_033081.json:
```json
{
    "body": "Resolution: fixed",
    "created_at": "2008-11-21T19:15:22Z",
    "issue": "https://github.com/sagemath/sagetest/issues/4487",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/4487#issuecomment-33081",
    "user": "https://trac.sagemath.org/admin/accounts/users/mabshoff"
}
```

Resolution: fixed



---

archive/issue_comments_033082.json:
```json
{
    "body": "<a id='comment:12'></a>Merged class_functions_4487.patch and class_functions_4487-part2.patch in Sage 3.2.1.alpha0",
    "created_at": "2008-11-21T19:15:22Z",
    "issue": "https://github.com/sagemath/sagetest/issues/4487",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sagetest/issues/4487#issuecomment-33082",
    "user": "https://trac.sagemath.org/admin/accounts/users/mabshoff"
}
```

<a id='comment:12'></a>Merged class_functions_4487.patch and class_functions_4487-part2.patch in Sage 3.2.1.alpha0
