# Issue 4514: Equality test fails for element coerced back into GL(2,7)

archive/issues_004514.json:
```json
{
    "assignees": [],
    "body": "The element below is constructed as an element of GL(2,7), but when converted into an element in GL(2,7) it is not equal to itself.\n\n```\nsage: G = GL(2,7)\nsage: z = G.center().an_element()\nsage: z\n[3 0]\n[0 3]\nsage: z in G\nTrue\nsage: G(z)\n[3 0]\n[0 3]\nsage: G(z) == z\nFalse\nsage: G(G(z)) == G(z)\nTrue\n```\n\nIssue created by migration from https://trac.sagemath.org/ticket/4514\n\n",
    "closed_at": "2008-11-14T17:49:08Z",
    "created_at": "2008-11-13T17:20:00Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20algebra",
        "https://github.com/sagemath/sage/labels/bug",
        "https://github.com/sagemath/sage/labels/invalid"
    ],
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "Equality test fails for element coerced back into GL(2,7)",
    "type": "issue",
    "updated_at": "2008-11-14T17:50:47Z",
    "url": "https://github.com/sagemath/sage/issues/4514",
    "user": "https://github.com/saliola"
}
```
The element below is constructed as an element of GL(2,7), but when converted into an element in GL(2,7) it is not equal to itself.

```
sage: G = GL(2,7)
sage: z = G.center().an_element()
sage: z
[3 0]
[0 3]
sage: z in G
True
sage: G(z)
[3 0]
[0 3]
sage: G(z) == z
False
sage: G(G(z)) == G(z)
True
```

Issue created by migration from https://trac.sagemath.org/ticket/4514





---

archive/issue_events_041996.json:
```json
{
    "actor": "https://github.com/saliola",
    "created_at": "2008-11-13T17:20:00Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/4514",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20algebra",
    "label_color": "08517b",
    "label_name": "component: algebra",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/4514#event-41996"
}
```



---

archive/issue_events_041997.json:
```json
{
    "actor": "https://github.com/saliola",
    "created_at": "2008-11-13T17:20:00Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/4514",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "008080",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/4514#event-41997"
}
```



---

archive/issue_events_041998.json:
```json
{
    "actor": "https://github.com/saliola",
    "created_at": "2008-11-13T17:20:00Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/4514",
    "label": "https://github.com/sagemath/sage/labels/invalid",
    "label_color": "008080",
    "label_name": "invalid",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/4514#event-41998"
}
```



---

archive/issue_comments_027478.json:
```json
{
    "body": "<a id='comment:1'>**Comment 1:**</a>\nHmm. Maybe this isn't a bug afterall: the element z isn't really from G, but from G.center().",
    "created_at": "2008-11-13T17:31:51Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/4514",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/4514#issuecomment-27478",
    "user": "https://github.com/saliola"
}
```

<a id='comment:1'>**Comment 1:**</a>
Hmm. Maybe this isn't a bug afterall: the element z isn't really from G, but from G.center().



---

archive/issue_comments_027479.json:
```json
{
    "body": "<a id='comment:2'>**Comment 2:**</a>\nSo: let's close this as invalid?\n\nCheers,\n\nMichael",
    "created_at": "2008-11-14T05:06:55Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/4514",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/4514#issuecomment-27479",
    "user": "https://github.com/sagetrac-mabshoff"
}
```

<a id='comment:2'>**Comment 2:**</a>
So: let's close this as invalid?

Cheers,

Michael



---

archive/issue_comments_027480.json:
```json
{
    "body": "<a id='comment:3'>**Comment 3:**</a>\nThat's fine with me. I left it as is in case someone else might have something to say, but I think it has been long enough.",
    "created_at": "2008-11-14T17:49:08Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/4514",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/4514#issuecomment-27480",
    "user": "https://github.com/saliola"
}
```

<a id='comment:3'>**Comment 3:**</a>
That's fine with me. I left it as is in case someone else might have something to say, but I think it has been long enough.



---

archive/issue_events_041999.json:
```json
{
    "actor": "https://github.com/saliola",
    "created_at": "2008-11-14T17:49:08Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/4514",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/4514#event-41999"
}
```



---

archive/issue_events_042000.json:
```json
{
    "actor": "https://github.com/sagetrac-mabshoff",
    "created_at": "2008-11-14T17:50:47Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/4514",
    "milestone_number": null,
    "milestone_title": "sage-3.2.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/4514#event-42000"
}
```
