# Issue 4533: divisors function slow for integers

archive/issues_004533.json:
```json
{
    "assignees": [],
    "body": "There's *tons* of room for optimization for the divisors function in sage/rings/arith.py. This should probably be generalized to do more than integers, with a specialized divisors method on Integer. \n\nCC:  @craigcitro\n\n_Issue created by migration from https://trac.sagemath.org/ticket/4533_\n\n",
    "closed_at": "2008-11-21T08:47:47Z",
    "created_at": "2008-11-16T08:21:30Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20algebra",
        "https://github.com/sagemath/sage/labels/p3%20%E2%80%93%20major",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-3.2.1",
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "divisors function slow for integers",
    "type": "issue",
    "updated_at": "2008-11-21T08:47:47Z",
    "url": "https://github.com/sagemath/sage/issues/4533",
    "user": "https://github.com/robertwb"
}
```
There's *tons* of room for optimization for the divisors function in sage/rings/arith.py. This should probably be generalized to do more than integers, with a specialized divisors method on Integer. 

CC:  @craigcitro

_Issue created by migration from https://trac.sagemath.org/ticket/4533_





---

archive/issue_events_046128.json:
```json
{
    "actor": "https://github.com/robertwb",
    "created_at": "2008-11-16T08:21:30Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/4533",
    "milestone_number": null,
    "milestone_title": "sage-3.2.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/4533#event-46128"
}
```



---

archive/issue_events_046129.json:
```json
{
    "actor": "https://github.com/robertwb",
    "created_at": "2008-11-16T08:21:30Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/4533",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20algebra",
    "label_color": "0000ff",
    "label_name": "component: algebra",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/4533#event-46129"
}
```



---

archive/issue_events_046130.json:
```json
{
    "actor": "https://github.com/robertwb",
    "created_at": "2008-11-16T08:21:30Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/4533",
    "label": "https://github.com/sagemath/sage/labels/p3%20%E2%80%93%20major",
    "label_color": "ffbb00",
    "label_name": "p3 \u2013 major",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/4533#event-46130"
}
```



---

archive/issue_events_046131.json:
```json
{
    "actor": "https://github.com/robertwb",
    "created_at": "2008-11-16T08:21:30Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/4533",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "d73a4a",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/4533#event-46131"
}
```



---

archive/issue_comments_027743.json:
```json
{
    "body": "<div id=\"comment:1\" align=\"right\">Comment 1</div>\n\nA comparison\n\n```\nsage: n = odd_part(factorial(31))\nsage: time _ = divisors(n)\nCPU times: user 2.27 s, sys: 0.05 s, total: 2.32 s\nWall time: 2.33 s\nsage: nn = gp(n)\nsage: time _ = nn.divisors()\nCPU times: user 0.00 s, sys: 0.00 s, total: 0.00 s\nWall time: 0.15 s\nsage: 2.33 / .15\n15.5333333333333\n```",
    "created_at": "2008-11-16T08:28:17Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/4533",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/4533#issuecomment-27743",
    "user": "https://github.com/robertwb"
}
```

<div id="comment:1" align="right">Comment 1</div>

A comparison

```
sage: n = odd_part(factorial(31))
sage: time _ = divisors(n)
CPU times: user 2.27 s, sys: 0.05 s, total: 2.32 s
Wall time: 2.33 s
sage: nn = gp(n)
sage: time _ = nn.divisors()
CPU times: user 0.00 s, sys: 0.00 s, total: 0.00 s
Wall time: 0.15 s
sage: 2.33 / .15
15.5333333333333
```



---

archive/issue_comments_027744.json:
```json
{
    "body": "<div id=\"comment:2\" align=\"right\">Comment 2</div>\n\nA much simpler and faster algorithm. I'm sure there's a faster, balanced algorithm, but this is a huge improvement over what is there.",
    "created_at": "2008-11-16T08:51:16Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/4533",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/4533#issuecomment-27744",
    "user": "https://github.com/robertwb"
}
```

<div id="comment:2" align="right">Comment 2</div>

A much simpler and faster algorithm. I'm sure there's a faster, balanced algorithm, but this is a huge improvement over what is there.



---

archive/issue_events_046132.json:
```json
{
    "actor": "https://github.com/robertwb",
    "created_at": "2008-11-16T08:51:16Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/4533",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "7fff00",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/4533#event-46132"
}
```



---

archive/issue_comments_027745.json:
```json
{
    "body": "<div id=\"comment:3\" align=\"right\">Comment 3</div>\n\nNote that this works for more than integers now too:\n\n```\nsage: K.<a> = QuadraticField(7)\nsage: divisors(K.ideal(7))\n[1, Fractional ideal (-a), Fractional ideal (7)]\nsage: divisors(K.ideal(3))\n[1, Fractional ideal (a - 2), Fractional ideal (-a - 2), Fractional ideal (3)]\nsage: divisors(K.ideal(35))\n[1, Fractional ideal (5), Fractional ideal (-a), Fractional ideal (-5*a), Fractional ideal (7), Fractional ideal (35)]\n```",
    "created_at": "2008-11-16T09:27:13Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/4533",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/4533#issuecomment-27745",
    "user": "https://github.com/robertwb"
}
```

<div id="comment:3" align="right">Comment 3</div>

Note that this works for more than integers now too:

```
sage: K.<a> = QuadraticField(7)
sage: divisors(K.ideal(7))
[1, Fractional ideal (-a), Fractional ideal (7)]
sage: divisors(K.ideal(3))
[1, Fractional ideal (a - 2), Fractional ideal (-a - 2), Fractional ideal (3)]
sage: divisors(K.ideal(35))
[1, Fractional ideal (5), Fractional ideal (-a), Fractional ideal (-5*a), Fractional ideal (7), Fractional ideal (35)]
```



---

archive/issue_comments_027746.json:
```json
{
    "body": "<div id=\"comment:4\" align=\"right\">Comment 4</div>\n\nReplying to [@robertwb](#comment%3A3):\n> Note that this works for more than integers now too:\n\nShouldn't that example then be added to the docstrings, too? :)\n\nCheers,\n\nMichael",
    "created_at": "2008-11-16T09:51:45Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/4533",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/4533#issuecomment-27746",
    "user": "https://github.com/sagetrac-mabshoff"
}
```

<div id="comment:4" align="right">Comment 4</div>

Replying to [@robertwb](#comment%3A3):
> Note that this works for more than integers now too:

Shouldn't that example then be added to the docstrings, too? :)

Cheers,

Michael



---

archive/issue_comments_027747.json:
```json
{
    "body": "<div id=\"comment:5\" align=\"right\">Comment 5</div>\n\nOf course :). I've posted an updated patch.",
    "created_at": "2008-11-16T09:56:55Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/4533",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/4533#issuecomment-27747",
    "user": "https://github.com/robertwb"
}
```

<div id="comment:5" align="right">Comment 5</div>

Of course :). I've posted an updated patch.



---

archive/issue_events_046133.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2008-11-16T19:37:37Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/4533",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "7fff00",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/4533#event-46133"
}
```



---

archive/issue_events_046134.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2008-11-16T19:37:37Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/4533",
    "label": "https://github.com/sagemath/sage/labels/needs%20work",
    "label_color": "ffff00",
    "label_name": "needs work",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/4533#event-46134"
}
```



---

archive/issue_comments_027748.json:
```json
{
    "body": "<div id=\"comment:6\" align=\"right\">Comment 6</div>\n\n1. The new code isn't much faster, but it is certainly better.  Here are some before and after speed comparisons (core2 2.6Ghz 32-bit osx)\n\nBefore:\n\n```\nsage: n = odd_part(factorial(31))\nsage: time _ = divisors(n)\nCPU times: user 1.66 s, sys: 0.03 s, total: 1.70 s\nWall time: 1.73 s\nsage: n = 928304029834092384082304982093480293849028349823948\nsage: time _ = divisors(n)\nCPU times: user 0.30 s, sys: 0.06 s, total: 0.35 s\nWall time: 0.46 s\nsage: n = 9283040298340\nsage: timeit('divisors(n)')\n125 loops, best of 3: 1.75 ms per loop\n```\n\n\nAfter:\n\n```\nsage: n = odd_part(factorial(31))\nsage: time _ = divisors(n)\nCPU times: user 0.90 s, sys: 0.06 s, total: 0.96 s\nWall time: 0.98 s\nsage: time a = gp(n).divisors()\nCPU times: user 0.00 s, sys: 0.00 s, total: 0.00 s\nWall time: 0.21 s\nsage: n = 928304029834092384082304982093480293849028349823948\nsage: time _ = divisors(n)\nCPU times: user 0.31 s, sys: 0.06 s, total: 0.37 s\nWall time: 0.40 s\nsage: n = 9283040298340\nsage: timeit('divisors(n)')\n625 loops, best of 3: 341 \u00b5s per loop\n```\n\n2. It no longer works on int's, which is a serious problem (this used to work fine):\n\n```\nsage: divisors(int(5))\nTraceback (most recent call last):\n...\nAttributeError: 'int' object has no attribute 'parent'\n```\n\nThere should be a doctest about that.\n\nFor a positive review fix the code to work on int/long as input, and add a doctest about that.   Regarding speeding it up to be on par with pari, that should be another ticket that *must* be opened before closing this one.  Ideas regarding speed:\n\n* you can easily precompute the length of the output list as \n\n```\nprod(e+1 for _,e in f)\n```\n* If the input is an int < long long (or long), could do all arithmetic with\nmachine says data types, since you know a priori the biggest number that will appear.   This should be special cased.   \n* Interestingly, I changed two lines of the function so it uses Python int's instead of Sage MPFR ints everywhere and the function speeds up dramatically so it is almost as fast as pari:\n\n```\n    one = int(1)\n    all = [one]\n    for p, e in f:\n        p = int(p)\n\n...\n\nsage: time d = divisors(n)\nCPU times: user 0.23 s, sys: 0.02 s, total: 0.24 s\nWall time: 0.25 s\nsage: time w = [ZZ(a) for a in d]\nCPU times: user 0.24 s, sys: 0.01 s, total: 0.25 s\nWall time: 0.26 s\nsage: time w = gp(n).divisors()\nCPU times: user 0.00 s, sys: 0.01 s, total: 0.01 s\nWall time: 0.18 s\n```\n\nInterestingly, as you can see above, doing everything with python ints, then converting all the python ints back to sage ints, results in something that is *twice* as fast as your code on the same input. \n\n\n3. Other remarks: \n\n   * pari(n).divisors() gives an AttributeError, so I guess we never wrapped that. \n\n   * Why is odd_part(factorial(31)) a RATIONAL?  This seems really weird.\n\n```\nsage: n = odd_part(factorial(31))\nsage: type(n)\n<type 'sage.rings.rational.Rational'>\nsage: type(factorial(31))\n<type 'sage.rings.integer.Integer'>\n```",
    "created_at": "2008-11-16T19:37:37Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/4533",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/4533#issuecomment-27748",
    "user": "https://github.com/williamstein"
}
```

<div id="comment:6" align="right">Comment 6</div>

1. The new code isn't much faster, but it is certainly better.  Here are some before and after speed comparisons (core2 2.6Ghz 32-bit osx)

Before:

```
sage: n = odd_part(factorial(31))
sage: time _ = divisors(n)
CPU times: user 1.66 s, sys: 0.03 s, total: 1.70 s
Wall time: 1.73 s
sage: n = 928304029834092384082304982093480293849028349823948
sage: time _ = divisors(n)
CPU times: user 0.30 s, sys: 0.06 s, total: 0.35 s
Wall time: 0.46 s
sage: n = 9283040298340
sage: timeit('divisors(n)')
125 loops, best of 3: 1.75 ms per loop
```


After:

```
sage: n = odd_part(factorial(31))
sage: time _ = divisors(n)
CPU times: user 0.90 s, sys: 0.06 s, total: 0.96 s
Wall time: 0.98 s
sage: time a = gp(n).divisors()
CPU times: user 0.00 s, sys: 0.00 s, total: 0.00 s
Wall time: 0.21 s
sage: n = 928304029834092384082304982093480293849028349823948
sage: time _ = divisors(n)
CPU times: user 0.31 s, sys: 0.06 s, total: 0.37 s
Wall time: 0.40 s
sage: n = 9283040298340
sage: timeit('divisors(n)')
625 loops, best of 3: 341 µs per loop
```

2. It no longer works on int's, which is a serious problem (this used to work fine):

```
sage: divisors(int(5))
Traceback (most recent call last):
...
AttributeError: 'int' object has no attribute 'parent'
```

There should be a doctest about that.

For a positive review fix the code to work on int/long as input, and add a doctest about that.   Regarding speeding it up to be on par with pari, that should be another ticket that *must* be opened before closing this one.  Ideas regarding speed:

* you can easily precompute the length of the output list as 

```
prod(e+1 for _,e in f)
```
* If the input is an int < long long (or long), could do all arithmetic with
machine says data types, since you know a priori the biggest number that will appear.   This should be special cased.   
* Interestingly, I changed two lines of the function so it uses Python int's instead of Sage MPFR ints everywhere and the function speeds up dramatically so it is almost as fast as pari:

```
    one = int(1)
    all = [one]
    for p, e in f:
        p = int(p)

...

sage: time d = divisors(n)
CPU times: user 0.23 s, sys: 0.02 s, total: 0.24 s
Wall time: 0.25 s
sage: time w = [ZZ(a) for a in d]
CPU times: user 0.24 s, sys: 0.01 s, total: 0.25 s
Wall time: 0.26 s
sage: time w = gp(n).divisors()
CPU times: user 0.00 s, sys: 0.01 s, total: 0.01 s
Wall time: 0.18 s
```

Interestingly, as you can see above, doing everything with python ints, then converting all the python ints back to sage ints, results in something that is *twice* as fast as your code on the same input. 


3. Other remarks: 

   * pari(n).divisors() gives an AttributeError, so I guess we never wrapped that. 

   * Why is odd_part(factorial(31)) a RATIONAL?  This seems really weird.

```
sage: n = odd_part(factorial(31))
sage: type(n)
<type 'sage.rings.rational.Rational'>
sage: type(factorial(31))
<type 'sage.rings.integer.Integer'>
```



---

archive/issue_comments_027749.json:
```json
{
    "body": "<div id=\"comment:7\" align=\"right\">Comment 7</div>\n\nThe new code looks very like my C++ functions in eclib (there for the taking!) which include various other options such as \n* only poitive divisors vs. both signs\n* only divisors d such that `d^2|n`\nwhich I did once need, and so on.\n\nJust a comment.",
    "created_at": "2008-11-17T09:57:16Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/4533",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/4533#issuecomment-27749",
    "user": "https://github.com/JohnCremona"
}
```

<div id="comment:7" align="right">Comment 7</div>

The new code looks very like my C++ functions in eclib (there for the taking!) which include various other options such as 
* only poitive divisors vs. both signs
* only divisors d such that `d^2|n`
which I did once need, and so on.

Just a comment.



---

archive/issue_comments_027750.json:
```json
{
    "body": "<div id=\"comment:8\" align=\"right\">Comment 8</div>\n\nI'll make those fixes, and write a special case for word-sized integers. It should be noted that *sorting* the output often takes the majority of the time\n\n```\nsage: sage: n = ZZ(odd_part(factorial(31)))\nsage: sage: time _ = divisors(n)\nCPU times: user 0.53 s, sys: 0.02 s, total: 0.54 s\nWall time: 0.55 s\nsage: sage: time _ = divisors(n, sorted=False)\nCPU times: user 0.15 s, sys: 0.02 s, total: 0.17 s\nWall time: 0.17 s\n\nsage: n = factorial(25)\nsage: time _ = divisors(n)\nCPU times: user 1.07 s, sys: 0.05 s, total: 1.12 s\nWall time: 1.12 s\nsage: time _ = divisors(n, sorted=False)\nCPU times: user 0.33 s, sys: 0.05 s, total: 0.38 s\nWall time: 0.38 s\n```\n\nOriginally I wasn't sorting the output, which was why I thought I was so much faster. (The original code sorted the output too, but it was slow enough that the sorting didn't dominate.)",
    "created_at": "2008-11-17T17:55:43Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/4533",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/4533#issuecomment-27750",
    "user": "https://github.com/robertwb"
}
```

<div id="comment:8" align="right">Comment 8</div>

I'll make those fixes, and write a special case for word-sized integers. It should be noted that *sorting* the output often takes the majority of the time

```
sage: sage: n = ZZ(odd_part(factorial(31)))
sage: sage: time _ = divisors(n)
CPU times: user 0.53 s, sys: 0.02 s, total: 0.54 s
Wall time: 0.55 s
sage: sage: time _ = divisors(n, sorted=False)
CPU times: user 0.15 s, sys: 0.02 s, total: 0.17 s
Wall time: 0.17 s

sage: n = factorial(25)
sage: time _ = divisors(n)
CPU times: user 1.07 s, sys: 0.05 s, total: 1.12 s
Wall time: 1.12 s
sage: time _ = divisors(n, sorted=False)
CPU times: user 0.33 s, sys: 0.05 s, total: 0.38 s
Wall time: 0.38 s
```

Originally I wasn't sorting the output, which was why I thought I was so much faster. (The original code sorted the output too, but it was slow enough that the sorting didn't dominate.)



---

archive/issue_comments_027751.json:
```json
{
    "body": "<div id=\"comment:9\" align=\"right\">Comment 9</div>\n\n> It should be noted that *sorting* the output often takes the majority of the time \n\nThis is perhaps partly because sorting lists of GMP integers is slower than Python ints, i.e., it takes about twice as long to do a comparison:\n\n```\nsage: n = ZZ(odd_part(factorial(31)))\nsage: \nsage: m = divisors(n, sorted=False)\nsage: m2 = [int(j) for j in m]\nsage: time m.sort()\nCPU times: user 0.33 s, sys: 0.00 s, total: 0.34 s\nWall time: 0.34 s\nsage: time m2.sort()\nCPU times: user 0.16 s, sys: 0.00 s, total: 0.17 s\nWall time: 0.17 s\nsage: a = 349; b = 678\nsage: timeit('a < b')\n625 loops, best of 3: 389 ns per loop\nsage: a = int(349); b = int(678)\nsage: timeit('a < b')\n625 loops, best of 3: 213 ns per loop\n```\n\nIn the timeits at the bottom, probably 100ns is spent just looking up a and b in the globals...\n\nAnyway, some of the ints for the divisors of n above are beyond long long, so this word size discussion doesn't apply.  However, if we consider 25, notice that sorted\ntakes twice as long as computing the divisors:\n\n```\nsage: n = ZZ(odd_part(factorial(25)))\nsage: time m = divisors(n,sorted=False)\nCPU times: user 0.01 s, sys: 0.00 s, total: 0.01 s\nWall time: 0.01 s\nsage: v = [int(a) for a in m]\nsage: time v.sort()    # no better (see below).\nCPU times: user 0.02 s, sys: 0.00 s, total: 0.02 s\nWall time: 0.02 s\nsage: v = numpy.array(m).astype(numpy.int64)\nsage: time v.sort()\nCPU times: user 0.00 s, sys: 0.00 s, total: 0.00 s\nWall time: 0.00 s\nsage: time m.sort()\nCPU times: user 0.02 s, sys: 0.00 s, total: 0.02 s\nWall time: 0.02 s\n```\n\nHowever, sorting using an numpy int64 array seems to be much faster than sorting a list of GMP ints.  So if we just use some straightforward sort on a Cython long long* we should get good results. \n\nUnrelated: I noticed that n.divisors(...) doesn't have a sorted option.  So maybe some code in integer.pyx should be slightly changed.",
    "created_at": "2008-11-18T06:29:55Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/4533",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/4533#issuecomment-27751",
    "user": "https://github.com/williamstein"
}
```

<div id="comment:9" align="right">Comment 9</div>

> It should be noted that *sorting* the output often takes the majority of the time 

This is perhaps partly because sorting lists of GMP integers is slower than Python ints, i.e., it takes about twice as long to do a comparison:

```
sage: n = ZZ(odd_part(factorial(31)))
sage: 
sage: m = divisors(n, sorted=False)
sage: m2 = [int(j) for j in m]
sage: time m.sort()
CPU times: user 0.33 s, sys: 0.00 s, total: 0.34 s
Wall time: 0.34 s
sage: time m2.sort()
CPU times: user 0.16 s, sys: 0.00 s, total: 0.17 s
Wall time: 0.17 s
sage: a = 349; b = 678
sage: timeit('a < b')
625 loops, best of 3: 389 ns per loop
sage: a = int(349); b = int(678)
sage: timeit('a < b')
625 loops, best of 3: 213 ns per loop
```

In the timeits at the bottom, probably 100ns is spent just looking up a and b in the globals...

Anyway, some of the ints for the divisors of n above are beyond long long, so this word size discussion doesn't apply.  However, if we consider 25, notice that sorted
takes twice as long as computing the divisors:

```
sage: n = ZZ(odd_part(factorial(25)))
sage: time m = divisors(n,sorted=False)
CPU times: user 0.01 s, sys: 0.00 s, total: 0.01 s
Wall time: 0.01 s
sage: v = [int(a) for a in m]
sage: time v.sort()    # no better (see below).
CPU times: user 0.02 s, sys: 0.00 s, total: 0.02 s
Wall time: 0.02 s
sage: v = numpy.array(m).astype(numpy.int64)
sage: time v.sort()
CPU times: user 0.00 s, sys: 0.00 s, total: 0.00 s
Wall time: 0.00 s
sage: time m.sort()
CPU times: user 0.02 s, sys: 0.00 s, total: 0.02 s
Wall time: 0.02 s
```

However, sorting using an numpy int64 array seems to be much faster than sorting a list of GMP ints.  So if we just use some straightforward sort on a Cython long long* we should get good results. 

Unrelated: I noticed that n.divisors(...) doesn't have a sorted option.  So maybe some code in integer.pyx should be slightly changed.



---

archive/issue_comments_027752.json:
```json
{
    "body": "<div id=\"comment:10\" align=\"right\">Comment 10</div>\n\nYep. I plan to specialize Integer.divisors() and attempt to call that in the top-level divisors function. It will have a much faster sort. \n\nI'm wondering though if the default should be sorted, or if one should use `sorted(divisors(n))` if one wants them in order.",
    "created_at": "2008-11-18T06:42:07Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/4533",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/4533#issuecomment-27752",
    "user": "https://github.com/robertwb"
}
```

<div id="comment:10" align="right">Comment 10</div>

Yep. I plan to specialize Integer.divisors() and attempt to call that in the top-level divisors function. It will have a much faster sort. 

I'm wondering though if the default should be sorted, or if one should use `sorted(divisors(n))` if one wants them in order.



---

archive/issue_comments_027753.json:
```json
{
    "body": "<div id=\"comment:11\" align=\"right\">Comment 11</div>\n\nOK, here's another patch that should resolve all of the above issues. One of the doctests depends on #4534 (odd_part returning an integer rather than a rational).",
    "created_at": "2008-11-18T23:40:09Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/4533",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/4533#issuecomment-27753",
    "user": "https://github.com/robertwb"
}
```

<div id="comment:11" align="right">Comment 11</div>

OK, here's another patch that should resolve all of the above issues. One of the doctests depends on #4534 (odd_part returning an integer rather than a rational).



---

archive/issue_events_046135.json:
```json
{
    "actor": "https://github.com/robertwb",
    "created_at": "2008-11-18T23:44:42Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/4533",
    "label": "https://github.com/sagemath/sage/labels/needs%20work",
    "label_color": "ffff00",
    "label_name": "needs work",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/4533#event-46135"
}
```



---

archive/issue_events_046136.json:
```json
{
    "actor": "https://github.com/robertwb",
    "created_at": "2008-11-18T23:44:42Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/4533",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "7fff00",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/4533#event-46136"
}
```



---

archive/issue_comments_027754.json:
```json
{
    "body": "<div id=\"comment:13\" align=\"right\">Comment 13</div>\n\nI updated the patch, now its faster than pari. \n\nThere is a dependancy on #4564 for long long -> mpz_t.",
    "created_at": "2008-11-20T13:04:51Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/4533",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/4533#issuecomment-27754",
    "user": "https://github.com/robertwb"
}
```

<div id="comment:13" align="right">Comment 13</div>

I updated the patch, now its faster than pari. 

There is a dependancy on #4564 for long long -> mpz_t.



---

archive/issue_comments_027755.json:
```json
{
    "body": "<div id=\"comment:14\" align=\"right\">Comment 14</div>\n\nIs it \"faster than Magma\" too?    Could you do some timings?",
    "created_at": "2008-11-20T17:40:37Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/4533",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/4533#issuecomment-27755",
    "user": "https://github.com/williamstein"
}
```

<div id="comment:14" align="right">Comment 14</div>

Is it "faster than Magma" too?    Could you do some timings?



---

archive/issue_comments_027756.json:
```json
{
    "body": "<div id=\"comment:15\" align=\"right\">Comment 15</div>\n\nSurprisingly, magma isn't super good at this problem. All timings on sage.math\n\n```\nsage: n = factorial(20)\nsage: %timeit v = n.divisors()\n100 loops, best of 3: 15.6 ms per loop\n\nsage: pari_n = gp(n)\nsage: %timeit v = pari_n.divisors()\n10 loops, best of 3: 57.2 ms per loop\n\nsage: magma_n = magma(n)\nsage: %timeit v = magma_n.Divisors()\n10 loops, best of 3: 43.5 ms per loop\n\n\nsage: n = factorial(31) // 2^26\nsage: %timeit v = n.divisors()\n10 loops, best of 3: 145 ms per loop\n\nsage: pari_n = gp(n)\nsage: %timeit v = pari_n.divisors()\n10 loops, best of 3: 408 ms per loop\n\nsage: magma_n = magma(n)\nsage: %timeit v = magma_n.Divisors()\n10 loops, best of 3: 684 ms per loop\n```",
    "created_at": "2008-11-20T20:26:20Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/4533",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/4533#issuecomment-27756",
    "user": "https://github.com/robertwb"
}
```

<div id="comment:15" align="right">Comment 15</div>

Surprisingly, magma isn't super good at this problem. All timings on sage.math

```
sage: n = factorial(20)
sage: %timeit v = n.divisors()
100 loops, best of 3: 15.6 ms per loop

sage: pari_n = gp(n)
sage: %timeit v = pari_n.divisors()
10 loops, best of 3: 57.2 ms per loop

sage: magma_n = magma(n)
sage: %timeit v = magma_n.Divisors()
10 loops, best of 3: 43.5 ms per loop


sage: n = factorial(31) // 2^26
sage: %timeit v = n.divisors()
10 loops, best of 3: 145 ms per loop

sage: pari_n = gp(n)
sage: %timeit v = pari_n.divisors()
10 loops, best of 3: 408 ms per loop

sage: magma_n = magma(n)
sage: %timeit v = magma_n.Divisors()
10 loops, best of 3: 684 ms per loop
```



---

archive/issue_comments_027757.json:
```json
{
    "body": "Attachment: **[4533-divisors-final.patch.gz](https://github.com/sagemath/sage/files/ticket4533/4533-divisors-final.patch.gz)**",
    "created_at": "2008-11-20T23:54:47Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/4533",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/4533#issuecomment-27757",
    "user": "https://github.com/robertwb"
}
```

Attachment: **[4533-divisors-final.patch.gz](https://github.com/sagemath/sage/files/ticket4533/4533-divisors-final.patch.gz)**



---

archive/issue_events_046137.json:
```json
{
    "actor": "https://github.com/craigcitro",
    "created_at": "2008-11-20T23:57:40Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/4533",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "7fff00",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/4533#event-46137"
}
```



---

archive/issue_events_046138.json:
```json
{
    "actor": "https://github.com/craigcitro",
    "created_at": "2008-11-20T23:57:40Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/4533",
    "label": "https://github.com/sagemath/sage/labels/positive%20review",
    "label_color": "dfffc0",
    "label_name": "positive review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/4533#event-46138"
}
```



---

archive/issue_events_046139.json:
```json
{
    "actor": "https://github.com/sagetrac-mabshoff",
    "created_at": "2008-11-21T07:48:13Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/4533",
    "label": "https://github.com/sagemath/sage/labels/positive%20review",
    "label_color": "dfffc0",
    "label_name": "positive review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/4533#event-46139"
}
```



---

archive/issue_events_046140.json:
```json
{
    "actor": "https://github.com/sagetrac-mabshoff",
    "created_at": "2008-11-21T07:48:13Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/4533",
    "label": "https://github.com/sagemath/sage/labels/needs%20work",
    "label_color": "ffff00",
    "label_name": "needs work",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/4533#event-46140"
}
```



---

archive/issue_comments_027758.json:
```json
{
    "body": "<div id=\"comment:17\" align=\"right\">Comment 17</div>\n\nAnother oops:\n\n```\nsage -t -long devel/sage/sage/combinat/species/species.py\n**********************************************************************\nFile \"/scratch/mabshoff/release-cycle/sage-3.2.1.alpha0/devel/sage-main/sage/combinat/species/species.py\", line 292:\n    sage: G.isotype_generating_series().coefficients(5)\nException raised:\n    Traceback (most recent call last):\n      File \"/scratch/mabshoff/release-cycle/sage-3.2.1.alpha0/local/bin/ncadoctest.py\", line 1231, in run_one_test\n        self.run_one_example(test, example, filename, compileflags)\n      File \"/scratch/mabshoff/release-cycle/sage-3.2.1.alpha0/local/bin/sagedoctest.py\", line 38, in run_one_example\n        OrigDocTestRunner.run_one_example(self, test, example, filename, compileflags)\n      File \"/scratch/mabshoff/release-cycle/sage-3.2.1.alpha0/local/bin/ncadoctest.py\", line 1172, in run_one_example\n        compileflags, 1) in test.globs\n      File \"<doctest __main__.example_12[7]>\", line 1, in <module>\n        G.isotype_generating_series().coefficients(Integer(5))###line 292:\n    sage: G.isotype_generating_series().coefficients(5)\n      File \"/scratch/mabshoff/release-cycle/sage-3.2.1.alpha0/local/lib/python2.5/site-packages/sage/combinat/species/series.py\", line 668, in coefficients\n        return [self.coefficient(i) for i in range(n)]\n      File \"/scratch/mabshoff/release-cycle/sage-3.2.1.alpha0/local/lib/python2.5/site-packages/sage/combinat/species/series.py\", line 830, in coefficient\n        return self._stream[n]\n      File \"/scratch/mabshoff/release-cycle/sage-3.2.1.alpha0/local/lib/python2.5/site-packages/sage/combinat/species/stream.py\", line 311, in __getitem__\n        self._list.append(self._gen.next())\n      File \"/scratch/mabshoff/release-cycle/sage-3.2.1.alpha0/local/lib/python2.5/site-packages/sage/combinat/species/generating_series.py\", line 428, in _ogs_gen\n        yield sum( self.coefficient(i).coefficients() )\n      File \"/scratch/mabshoff/release-cycle/sage-3.2.1.alpha0/local/lib/python2.5/site-packages/sage/combinat/species/series.py\", line 830, in coefficient\n        return self._stream[n]\n      File \"/scratch/mabshoff/release-cycle/sage-3.2.1.alpha0/local/lib/python2.5/site-packages/sage/combinat/species/stream.py\", line 311, in __getitem__\n        self._list.append(self._gen.next())\n      File \"/scratch/mabshoff/release-cycle/sage-3.2.1.alpha0/local/lib/python2.5/site-packages/sage/combinat/species/generating_series.py\", line 506, in _functorial_compose_gen\n        t = g._cycle_type(s)\n      File \"/scratch/mabshoff/release-cycle/sage-3.2.1.alpha0/local/lib/python2.5/site-packages/sage/combinat/species/generating_series.py\", line 530, in _cycle_type\n        for d in divisors(k):\n      File \"/scratch/mabshoff/release-cycle/sage-3.2.1.alpha0/local/lib/python2.5/site-packages/sage/rings/arith.py\", line 924, in divisors\n        n = integer_ring.ZZ(n) # we have specalized code for this case, make sure it gets used\n    NameError: global name 'integer_ring' is not defined\n**********************************************************************\n```\nThe problem pops up in a lot of places.\n\nCheers,\n\nMichael",
    "created_at": "2008-11-21T07:48:13Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/4533",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/4533#issuecomment-27758",
    "user": "https://github.com/sagetrac-mabshoff"
}
```

<div id="comment:17" align="right">Comment 17</div>

Another oops:

```
sage -t -long devel/sage/sage/combinat/species/species.py
**********************************************************************
File "/scratch/mabshoff/release-cycle/sage-3.2.1.alpha0/devel/sage-main/sage/combinat/species/species.py", line 292:
    sage: G.isotype_generating_series().coefficients(5)
Exception raised:
    Traceback (most recent call last):
      File "/scratch/mabshoff/release-cycle/sage-3.2.1.alpha0/local/bin/ncadoctest.py", line 1231, in run_one_test
        self.run_one_example(test, example, filename, compileflags)
      File "/scratch/mabshoff/release-cycle/sage-3.2.1.alpha0/local/bin/sagedoctest.py", line 38, in run_one_example
        OrigDocTestRunner.run_one_example(self, test, example, filename, compileflags)
      File "/scratch/mabshoff/release-cycle/sage-3.2.1.alpha0/local/bin/ncadoctest.py", line 1172, in run_one_example
        compileflags, 1) in test.globs
      File "<doctest __main__.example_12[7]>", line 1, in <module>
        G.isotype_generating_series().coefficients(Integer(5))###line 292:
    sage: G.isotype_generating_series().coefficients(5)
      File "/scratch/mabshoff/release-cycle/sage-3.2.1.alpha0/local/lib/python2.5/site-packages/sage/combinat/species/series.py", line 668, in coefficients
        return [self.coefficient(i) for i in range(n)]
      File "/scratch/mabshoff/release-cycle/sage-3.2.1.alpha0/local/lib/python2.5/site-packages/sage/combinat/species/series.py", line 830, in coefficient
        return self._stream[n]
      File "/scratch/mabshoff/release-cycle/sage-3.2.1.alpha0/local/lib/python2.5/site-packages/sage/combinat/species/stream.py", line 311, in __getitem__
        self._list.append(self._gen.next())
      File "/scratch/mabshoff/release-cycle/sage-3.2.1.alpha0/local/lib/python2.5/site-packages/sage/combinat/species/generating_series.py", line 428, in _ogs_gen
        yield sum( self.coefficient(i).coefficients() )
      File "/scratch/mabshoff/release-cycle/sage-3.2.1.alpha0/local/lib/python2.5/site-packages/sage/combinat/species/series.py", line 830, in coefficient
        return self._stream[n]
      File "/scratch/mabshoff/release-cycle/sage-3.2.1.alpha0/local/lib/python2.5/site-packages/sage/combinat/species/stream.py", line 311, in __getitem__
        self._list.append(self._gen.next())
      File "/scratch/mabshoff/release-cycle/sage-3.2.1.alpha0/local/lib/python2.5/site-packages/sage/combinat/species/generating_series.py", line 506, in _functorial_compose_gen
        t = g._cycle_type(s)
      File "/scratch/mabshoff/release-cycle/sage-3.2.1.alpha0/local/lib/python2.5/site-packages/sage/combinat/species/generating_series.py", line 530, in _cycle_type
        for d in divisors(k):
      File "/scratch/mabshoff/release-cycle/sage-3.2.1.alpha0/local/lib/python2.5/site-packages/sage/rings/arith.py", line 924, in divisors
        n = integer_ring.ZZ(n) # we have specalized code for this case, make sure it gets used
    NameError: global name 'integer_ring' is not defined
**********************************************************************
```
The problem pops up in a lot of places.

Cheers,

Michael



---

archive/issue_comments_027759.json:
```json
{
    "body": "<div id=\"comment:18\" align=\"right\">Comment 18</div>\n\n\n```\n[11:56pm] craigcitro: mabshoff: there's an easy fix for the problem in #4533\n[11:56pm] craigcitro: it's a rebase issue\n[11:56pm] mabshoff_: mk\n[11:56pm] mabshoff_: if you can rebase the patch it would be cool.\n[11:56pm] craigcitro: integer_ring. occurs in the patch\n[11:56pm] craigcitro: just delete that.\n[11:56pm] mabshoff_: I didn't even look yet\n[11:56pm] mabshoff_: ?\n[11:56pm] mabshoff_: Let me see\n[11:56pm] craigcitro: it refers to\n[11:56pm] craigcitro: integer_ring.ZZ\n[11:57pm] craigcitro: it should just be ZZ\n[11:57pm] craigcitro: it's something i cleaned up when i did stuff to arith.py\n[11:57pm] craigcitro: but rob was using 3.1.4 when he wrote the patch\n[11:57pm] craigcitro: and it's hitting a case we didn't think to try once it was rebased, probably\n[11:57pm] mabshoff_: mk\n[11:58pm] craigcitro: actually, i also just spotted a minor issue in that file\n[11:58pm] craigcitro: where memory is only freed in one case ...\n[11:58pm] mabshoff_: ok:\n[11:58pm] mabshoff_: +    if R in [int, long]:\n[11:58pm] mabshoff_: +        n = ZZ(n) # we have specalized code for this case, make sure it gets used\n[11:58pm] mabshoff_: +    try:\n[11:58pm] craigcitro: yep\n[11:58pm] mabshoff_: Well, post a new patch and I will test it.\n[11:58pm] craigcitro: that should fix the problem you were hitting\n[11:59pm] craigcitro: it's just outdenting one line \n[11:59pm] craigcitro: the sage_free(ptr)\n[11:59pm] craigcitro: should be one level back\n[11:59pm] craigcitro: oh, wait\n[11:59pm] craigcitro: nevermind\n[11:59pm] craigcitro: he already takes care of it somewhere else in the code.\n[12:00am] craigcitro: so that's not an issue.\n[12:00am] mabshoff_: Arrg, I just deleted the edited patch \n[12:00am] craigcitro: doh\n[12:02am] mabshoff_: Well, I can fix it.\n```",
    "created_at": "2008-11-21T08:09:15Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/4533",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/4533#issuecomment-27759",
    "user": "https://github.com/sagetrac-mabshoff"
}
```

<div id="comment:18" align="right">Comment 18</div>


```
[11:56pm] craigcitro: mabshoff: there's an easy fix for the problem in #4533
[11:56pm] craigcitro: it's a rebase issue
[11:56pm] mabshoff_: mk
[11:56pm] mabshoff_: if you can rebase the patch it would be cool.
[11:56pm] craigcitro: integer_ring. occurs in the patch
[11:56pm] craigcitro: just delete that.
[11:56pm] mabshoff_: I didn't even look yet
[11:56pm] mabshoff_: ?
[11:56pm] mabshoff_: Let me see
[11:56pm] craigcitro: it refers to
[11:56pm] craigcitro: integer_ring.ZZ
[11:57pm] craigcitro: it should just be ZZ
[11:57pm] craigcitro: it's something i cleaned up when i did stuff to arith.py
[11:57pm] craigcitro: but rob was using 3.1.4 when he wrote the patch
[11:57pm] craigcitro: and it's hitting a case we didn't think to try once it was rebased, probably
[11:57pm] mabshoff_: mk
[11:58pm] craigcitro: actually, i also just spotted a minor issue in that file
[11:58pm] craigcitro: where memory is only freed in one case ...
[11:58pm] mabshoff_: ok:
[11:58pm] mabshoff_: +    if R in [int, long]:
[11:58pm] mabshoff_: +        n = ZZ(n) # we have specalized code for this case, make sure it gets used
[11:58pm] mabshoff_: +    try:
[11:58pm] craigcitro: yep
[11:58pm] mabshoff_: Well, post a new patch and I will test it.
[11:58pm] craigcitro: that should fix the problem you were hitting
[11:59pm] craigcitro: it's just outdenting one line 
[11:59pm] craigcitro: the sage_free(ptr)
[11:59pm] craigcitro: should be one level back
[11:59pm] craigcitro: oh, wait
[11:59pm] craigcitro: nevermind
[11:59pm] craigcitro: he already takes care of it somewhere else in the code.
[12:00am] craigcitro: so that's not an issue.
[12:00am] mabshoff_: Arrg, I just deleted the edited patch 
[12:00am] craigcitro: doh
[12:02am] mabshoff_: Well, I can fix it.
```



---

archive/issue_events_046141.json:
```json
{
    "actor": "https://github.com/sagetrac-mabshoff",
    "created_at": "2008-11-21T08:47:47Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/4533",
    "label": "https://github.com/sagemath/sage/labels/needs%20work",
    "label_color": "ffff00",
    "label_name": "needs work",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/4533#event-46141"
}
```



---

archive/issue_events_046142.json:
```json
{
    "actor": "https://github.com/sagetrac-mabshoff",
    "created_at": "2008-11-21T08:47:47Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/4533",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/4533#event-46142"
}
```



---

archive/issue_comments_027760.json:
```json
{
    "body": "<div id=\"comment:19\" align=\"right\">Comment 19</div>\n\nMerged the edited patch in Sage 3.2.1.alpha0",
    "created_at": "2008-11-21T08:47:47Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/4533",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/4533#issuecomment-27760",
    "user": "https://github.com/sagetrac-mabshoff"
}
```

<div id="comment:19" align="right">Comment 19</div>

Merged the edited patch in Sage 3.2.1.alpha0
