# Issue 4630: bug in functions real() and imag().

archive/issues_004630.json:
```json
{
    "assignees": [],
    "body": "Using sage-3.2 (compiled with make), but the same behaviour also happens on sage-3.1.4,\nOS:Debian on a 32-bit Core-Duo machine,\n\nthe examples where I use 'a' as variable work well,\nthe examples where I use 'b' as variable ('I' is substituted by 'CDF(I)') are buggy:\n\n```\ngeorg@HILBERT:~/Daten/Sync/Phd/Code/sde$ sage\n----------------------------------------------------------------------\n| Sage Version 3.2, Release Date: 2008-11-20                         |\n| Type notebook() for the GUI, and license() for information.        |\n----------------------------------------------------------------------\n\nsage: a = exp(I*0.2*pi); a; type(a); real(a); real(a).n()\ne^(0.200000000000000*I*pi)\n<class 'sage.calculus.calculus.SymbolicComposition'>\ncos(0.200000000000000*pi)\n0.809016994374947\nsage: b = exp(CDF(I)*0.2*pi); b; type(b); real(b); real(b).n()\ne^(0.200000000000000*pi*I)\n<class 'sage.calculus.calculus.SymbolicComposition'>\ne^(0.200000000000000*pi*I)\n0.809016994374947 + 0.587785252292473*I\nsage: a = exp(I*0.2*pi); a; type(a); imag(a); imag(a).n()\ne^(0.200000000000000*I*pi)\n<class 'sage.calculus.calculus.SymbolicComposition'>\nsin(0.200000000000000*pi)\n0.587785252292473\nsage: b = exp(CDF(I)*0.2*pi); b; type(b); imag(b); imag(b).n()\ne^(0.200000000000000*pi*I)\n<class 'sage.calculus.calculus.SymbolicComposition'>\n0\n0.000000000000000\nsage: n(exp(CDF(I)*0.2*pi))\n0.809016994374947 + 0.587785252292473*I\n```\n\nGeorg\n\nIssue created by migration from https://trac.sagemath.org/ticket/4630\n\n",
    "closed_at": "2009-07-26T03:33:48Z",
    "created_at": "2008-11-26T23:39:46Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20basic%20arithmetic",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-4.1.1",
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "bug in functions real() and imag().",
    "type": "issue",
    "updated_at": "2009-07-26T03:33:48Z",
    "url": "https://github.com/sagemath/sage/issues/4630",
    "user": "https://github.com/sagetrac-ggrafendorfer"
}
```
Using sage-3.2 (compiled with make), but the same behaviour also happens on sage-3.1.4,
OS:Debian on a 32-bit Core-Duo machine,

the examples where I use 'a' as variable work well,
the examples where I use 'b' as variable ('I' is substituted by 'CDF(I)') are buggy:

```
georg@HILBERT:~/Daten/Sync/Phd/Code/sde$ sage
----------------------------------------------------------------------
| Sage Version 3.2, Release Date: 2008-11-20                         |
| Type notebook() for the GUI, and license() for information.        |
----------------------------------------------------------------------

sage: a = exp(I*0.2*pi); a; type(a); real(a); real(a).n()
e^(0.200000000000000*I*pi)
<class 'sage.calculus.calculus.SymbolicComposition'>
cos(0.200000000000000*pi)
0.809016994374947
sage: b = exp(CDF(I)*0.2*pi); b; type(b); real(b); real(b).n()
e^(0.200000000000000*pi*I)
<class 'sage.calculus.calculus.SymbolicComposition'>
e^(0.200000000000000*pi*I)
0.809016994374947 + 0.587785252292473*I
sage: a = exp(I*0.2*pi); a; type(a); imag(a); imag(a).n()
e^(0.200000000000000*I*pi)
<class 'sage.calculus.calculus.SymbolicComposition'>
sin(0.200000000000000*pi)
0.587785252292473
sage: b = exp(CDF(I)*0.2*pi); b; type(b); imag(b); imag(b).n()
e^(0.200000000000000*pi*I)
<class 'sage.calculus.calculus.SymbolicComposition'>
0
0.000000000000000
sage: n(exp(CDF(I)*0.2*pi))
0.809016994374947 + 0.587785252292473*I
```

Georg

Issue created by migration from https://trac.sagemath.org/ticket/4630





---

archive/issue_events_043357.json:
```json
{
    "actor": "https://github.com/sagetrac-ggrafendorfer",
    "created_at": "2008-11-26T23:39:46Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/4630",
    "milestone_number": null,
    "milestone_title": "sage-4.1.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/4630#event-43357"
}
```



---

archive/issue_events_043358.json:
```json
{
    "actor": "https://github.com/sagetrac-ggrafendorfer",
    "created_at": "2008-11-26T23:39:46Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/4630",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20basic%20arithmetic",
    "label_color": "08517b",
    "label_name": "component: basic arithmetic",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/4630#event-43358"
}
```



---

archive/issue_events_043359.json:
```json
{
    "actor": "https://github.com/sagetrac-ggrafendorfer",
    "created_at": "2008-11-26T23:39:46Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/4630",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "008080",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/4630#event-43359"
}
```



---

archive/issue_events_043360.json:
```json
{
    "actor": "https://github.com/aghitza",
    "created_at": "2009-06-03T07:43:38Z",
    "event": "renamed",
    "issue": "https://github.com/sagemath/sage/issues/4630",
    "rename": {
        "from": "bug in functions real() and imag().",
        "to": "[already fixed?] bug in functions real() and imag()."
    },
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/4630#event-43360"
}
```



---

archive/issue_comments_028729.json:
```json
{
    "body": "<a id='comment:1'></a>\nThis appears to be fixed in sage-4.0.1.alpha0:\n\n```\n----------------------------------------------------------------------\n| Sage Version 4.0.1.alpha0, Release Date: 2009-05-31                |\n| Type notebook() for the GUI, and license() for information.        |\n----------------------------------------------------------------------\nsage: a = exp(I*0.2*pi); a; type(a); real(a); real(a).n()\ne^(0.200000000000000*I*pi)\n<type 'sage.symbolic.expression.Expression'>\ncos(0.200000000000000*pi)\n0.809016994374947\nsage: b = exp(CDF(I)*0.2*pi); b; type(b); real(b); real(b).n()\ne^(0.2*I*pi)\n<type 'sage.symbolic.expression.Expression'>\ncos(0.2*pi)\n0.809016994375\nsage: a = exp(I*0.2*pi); a; type(a); imag(a); imag(a).n()\ne^(0.200000000000000*I*pi)\n<type 'sage.symbolic.expression.Expression'>\nsin(0.200000000000000*pi)\n0.587785252292473\nsage: b = exp(CDF(I)*0.2*pi); b; type(b); imag(b); imag(b).n()\ne^(0.2*I*pi)\n<type 'sage.symbolic.expression.Expression'>\nsin(0.2*pi)\n0.587785252292\nsage: n(exp(CDF(I)*0.2*pi))\n0.809016994375 + 0.587785252292*I\n```",
    "created_at": "2009-06-03T07:43:38Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/4630",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/4630#issuecomment-28729",
    "user": "https://github.com/aghitza"
}
```

<a id='comment:1'></a>
This appears to be fixed in sage-4.0.1.alpha0:

```
----------------------------------------------------------------------
| Sage Version 4.0.1.alpha0, Release Date: 2009-05-31                |
| Type notebook() for the GUI, and license() for information.        |
----------------------------------------------------------------------
sage: a = exp(I*0.2*pi); a; type(a); real(a); real(a).n()
e^(0.200000000000000*I*pi)
<type 'sage.symbolic.expression.Expression'>
cos(0.200000000000000*pi)
0.809016994374947
sage: b = exp(CDF(I)*0.2*pi); b; type(b); real(b); real(b).n()
e^(0.2*I*pi)
<type 'sage.symbolic.expression.Expression'>
cos(0.2*pi)
0.809016994375
sage: a = exp(I*0.2*pi); a; type(a); imag(a); imag(a).n()
e^(0.200000000000000*I*pi)
<type 'sage.symbolic.expression.Expression'>
sin(0.200000000000000*pi)
0.587785252292473
sage: b = exp(CDF(I)*0.2*pi); b; type(b); imag(b); imag(b).n()
e^(0.2*I*pi)
<type 'sage.symbolic.expression.Expression'>
sin(0.2*pi)
0.587785252292
sage: n(exp(CDF(I)*0.2*pi))
0.809016994375 + 0.587785252292*I
```



---

archive/issue_events_043361.json:
```json
{
    "actor": "https://github.com/sagetrac-mvngu",
    "created_at": "2009-07-26T03:33:48Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/4630",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/4630#event-43361"
}
```



---

archive/issue_events_043362.json:
```json
{
    "actor": "https://github.com/sagetrac-mvngu",
    "created_at": "2009-07-26T03:33:48Z",
    "event": "renamed",
    "issue": "https://github.com/sagemath/sage/issues/4630",
    "rename": {
        "from": "[already fixed?] bug in functions real() and imag().",
        "to": "bug in functions real() and imag()."
    },
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/4630#event-43362"
}
```



---

archive/issue_comments_028730.json:
```json
{
    "body": "<a id='comment:2'></a>\nIt looks like this is fixed in Sage 4.1:\n\n```\n----------------------------------------------------------------------\n| Sage Version 4.1, Release Date: 2009-07-09                         |\n| Type notebook() for the GUI, and license() for information.        |\n----------------------------------------------------------------------\nsage: a = exp(I*0.2*pi); a; type(a); real(a); real(a).n()\ne^(0.200000000000000*I*pi)\n<type 'sage.symbolic.expression.Expression'>\ncos(0.200000000000000*pi)\n0.809016994374947\nsage: b = exp(CDF(I)*0.2*pi); b; type(b); real(b); real(b).n()\ne^(0.2*I*pi)\n<type 'sage.symbolic.expression.Expression'>\ncos(0.2*pi)\n0.809016994375\nsage: a = exp(I*0.2*pi); a; type(a); imag(a); imag(a).n()\ne^(0.200000000000000*I*pi)\n<type 'sage.symbolic.expression.Expression'>\nsin(0.200000000000000*pi)\n0.587785252292473\nsage: b = exp(CDF(I)*0.2*pi); b; type(b); imag(b); imag(b).n()\ne^(0.2*I*pi)\n<type 'sage.symbolic.expression.Expression'>\nsin(0.2*pi)\n0.587785252292\nsage: n(exp(CDF(I)*0.2*pi))\n0.809016994375 + 0.587785252292*I\n```\nI'm closing this ticket as fixed.",
    "created_at": "2009-07-26T03:33:48Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/4630",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/4630#issuecomment-28730",
    "user": "https://github.com/sagetrac-mvngu"
}
```

<a id='comment:2'></a>
It looks like this is fixed in Sage 4.1:

```
----------------------------------------------------------------------
| Sage Version 4.1, Release Date: 2009-07-09                         |
| Type notebook() for the GUI, and license() for information.        |
----------------------------------------------------------------------
sage: a = exp(I*0.2*pi); a; type(a); real(a); real(a).n()
e^(0.200000000000000*I*pi)
<type 'sage.symbolic.expression.Expression'>
cos(0.200000000000000*pi)
0.809016994374947
sage: b = exp(CDF(I)*0.2*pi); b; type(b); real(b); real(b).n()
e^(0.2*I*pi)
<type 'sage.symbolic.expression.Expression'>
cos(0.2*pi)
0.809016994375
sage: a = exp(I*0.2*pi); a; type(a); imag(a); imag(a).n()
e^(0.200000000000000*I*pi)
<type 'sage.symbolic.expression.Expression'>
sin(0.200000000000000*pi)
0.587785252292473
sage: b = exp(CDF(I)*0.2*pi); b; type(b); imag(b); imag(b).n()
e^(0.2*I*pi)
<type 'sage.symbolic.expression.Expression'>
sin(0.2*pi)
0.587785252292
sage: n(exp(CDF(I)*0.2*pi))
0.809016994375 + 0.587785252292*I
```
I'm closing this ticket as fixed.
