# Issue 8198: p-adic precision in vector multiplication

archive/issues_008198.json:
```json
{
    "assignees": [],
    "body": "Trying to resolve #4656, I found the following unpleasant bug.\n\nthis looks good :\n\n```\nsage: R = Qp(5,5)\nsage: x = R(5).add_bigoh(1)\nsage: x\nO(5)\nsage: x*R(1)\nO(5)\n```\n\nBut when multiplied with the identity matrix the precision is lost\n\n```\nsage: I = matrix(R, [[1,0],[0,1]])\nsage: v = vector([R(1),x])\nsage: v\n(1 + O(5^5), O(5))\nsage: v*I\n(1 + O(5^5), 0)\nsage: v[0]*I[1,0] + v[1]*I[1,1]\nO(5)\n```\n\nThis causes things like\n\n```\nsage: M = matrix(R,[[1,2],[3,4]])\nsage: M*v\n(1 + O(5^5), 3 + O(5^5))\nsage: v[0]*M[0,0] + v[1]*M[0,1]\n1 + O(5)\nsage: v[0]*M[1,0] + v[1]*M[1,1]\n3 + O(5)\n```\n\nThis is an even worse example, which could be a different bug\n\n```\nsage: vv = vector(x)\nsage: vv\n(0)\nsage: vv[0]\n0\nsage: x\nO(5)\n```\n\nAssignee: **@roed314**\n\nCC:  @nilesjohnson @sagetrac-jpflori\n\nKeywords: **padics vector**\n\nBranch/Commit: **[41cbe4c](https://github.com/sagemath/sagetrac-mirror/commit/41cbe4c6b418b2ed9e3e0175ddce0393cc21611e)**\n\nReviewer: **Chris Wuthrich**\n\nAuthor: **Peter Bruin**\n\n_Issue created by migration from https://trac.sagemath.org/ticket/8198_\n\n",
    "closed_at": "2014-04-13T19:33:32Z",
    "created_at": "2010-02-05T22:52:30Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20linear%20algebra",
        "https://github.com/sagemath/sage/labels/p3%20%E2%80%93%20major",
        "https://github.com/sagemath/sage/labels/bug"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-6.2",
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "p-adic precision in vector multiplication",
    "type": "issue",
    "updated_at": "2014-04-13T19:33:32Z",
    "url": "https://github.com/sagemath/sage/issues/8198",
    "user": "https://github.com/categorie"
}
```
Trying to resolve #4656, I found the following unpleasant bug.

this looks good :

```
sage: R = Qp(5,5)
sage: x = R(5).add_bigoh(1)
sage: x
O(5)
sage: x*R(1)
O(5)
```

But when multiplied with the identity matrix the precision is lost

```
sage: I = matrix(R, [[1,0],[0,1]])
sage: v = vector([R(1),x])
sage: v
(1 + O(5^5), O(5))
sage: v*I
(1 + O(5^5), 0)
sage: v[0]*I[1,0] + v[1]*I[1,1]
O(5)
```

This causes things like

```
sage: M = matrix(R,[[1,2],[3,4]])
sage: M*v
(1 + O(5^5), 3 + O(5^5))
sage: v[0]*M[0,0] + v[1]*M[0,1]
1 + O(5)
sage: v[0]*M[1,0] + v[1]*M[1,1]
3 + O(5)
```

This is an even worse example, which could be a different bug

```
sage: vv = vector(x)
sage: vv
(0)
sage: vv[0]
0
sage: x
O(5)
```

Assignee: **@roed314**

CC:  @nilesjohnson @sagetrac-jpflori

Keywords: **padics vector**

Branch/Commit: **[41cbe4c](https://github.com/sagemath/sagetrac-mirror/commit/41cbe4c6b418b2ed9e3e0175ddce0393cc21611e)**

Reviewer: **Chris Wuthrich**

Author: **Peter Bruin**

_Issue created by migration from https://trac.sagemath.org/ticket/8198_





---

archive/issue_events_092943.json:
```json
{
    "actor": "https://github.com/categorie",
    "created_at": "2010-02-05T22:52:30Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/8198",
    "milestone_number": null,
    "milestone_title": "sage-5.11",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/8198#event-92943"
}
```



---

archive/issue_events_092944.json:
```json
{
    "actor": "https://github.com/categorie",
    "created_at": "2010-02-05T22:52:30Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/8198",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20padics",
    "label_color": "0000ff",
    "label_name": "component: padics",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/8198#event-92944"
}
```



---

archive/issue_events_092945.json:
```json
{
    "actor": "https://github.com/categorie",
    "created_at": "2010-02-05T22:52:30Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/8198",
    "label": "https://github.com/sagemath/sage/labels/p3%20%E2%80%93%20major",
    "label_color": "ffbb00",
    "label_name": "p3 \u2013 major",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/8198#event-92945"
}
```



---

archive/issue_events_092946.json:
```json
{
    "actor": "https://github.com/categorie",
    "created_at": "2010-02-05T22:52:30Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/8198",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "d73a4a",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/8198#event-92946"
}
```



---

archive/issue_comments_065223.json:
```json
{
    "body": "<div id=\"comment:1\" align=\"right\">Comment 1</div>\n\nI must admit that I have not searched through the tracs to see if this is a duplicate. Sorry.\n\nResolving the bug would result in the resolution of #4656, too, I believe.",
    "created_at": "2010-02-05T22:53:50Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/8198",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/8198#issuecomment-65223",
    "user": "https://github.com/categorie"
}
```

<div id="comment:1" align="right">Comment 1</div>

I must admit that I have not searched through the tracs to see if this is a duplicate. Sorry.

Resolving the bug would result in the resolution of #4656, too, I believe.



---

archive/issue_comments_065224.json:
```json
{
    "body": "<div id=\"comment:2\" align=\"right\">Comment 2</div>\n\nI found this bug also, while working on #9457.  After a fair bit of struggling with elliptic curve code, I now think this is a significant part of the problem.\n\nI noticed the following also; I can't tell if it's the same bug or not.\n\n```\nsage: R = QQ.completion(5,5)\nsage: P.<T> = R[]\nsage: Q.<T> = R[[]]\nsage: P(R(0).add_bigoh(-1))\n(O(5^-1))\nsage: Q(R(0).add_bigoh(-1))\n0\nsage: P(R(0).add_bigoh(2))\n(O(5^2))\nsage: Q(R(0).add_bigoh(2))\n0\nsage: Q(R(1).add_bigoh(2))\n1 + O(5^2)\nsage: Q(R(1).add_bigoh(-1))\n0\nsage: Q(R(1/25).add_bigoh(-1))\n5^-2 + O(5^-1)\n```",
    "created_at": "2010-08-03T23:24:26Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/8198",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/8198#issuecomment-65224",
    "user": "https://github.com/nilesjohnson"
}
```

<div id="comment:2" align="right">Comment 2</div>

I found this bug also, while working on #9457.  After a fair bit of struggling with elliptic curve code, I now think this is a significant part of the problem.

I noticed the following also; I can't tell if it's the same bug or not.

```
sage: R = QQ.completion(5,5)
sage: P.<T> = R[]
sage: Q.<T> = R[[]]
sage: P(R(0).add_bigoh(-1))
(O(5^-1))
sage: Q(R(0).add_bigoh(-1))
0
sage: P(R(0).add_bigoh(2))
(O(5^2))
sage: Q(R(0).add_bigoh(2))
0
sage: Q(R(1).add_bigoh(2))
1 + O(5^2)
sage: Q(R(1).add_bigoh(-1))
0
sage: Q(R(1/25).add_bigoh(-1))
5^-2 + O(5^-1)
```



---

archive/issue_comments_065225.json:
```json
{
    "body": "<div id=\"comment:3\" align=\"right\">Comment 3</div>\n\nReplying to [@nilesjohnson](#comment%3A2):\n> I noticed the following also; I can't tell if it's the same bug or not.\n\noh, this seems to be the same as #4656",
    "created_at": "2010-08-03T23:36:56Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/8198",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/8198#issuecomment-65225",
    "user": "https://github.com/nilesjohnson"
}
```

<div id="comment:3" align="right">Comment 3</div>

Replying to [@nilesjohnson](#comment%3A2):
> I noticed the following also; I can't tell if it's the same bug or not.

oh, this seems to be the same as #4656



---

archive/issue_comments_065226.json:
```json
{
    "body": "<div id=\"comment:4\" align=\"right\">Comment 4</div>\n\nI narrowed down the last issue above. (vector calls Sequence which calls list):\n\n```\nsage: R = Qp(5,5)\nsage: x = R(5).add_bigoh(1)\nsage: list(x)\n[0]\n```\n\nagain the element is set to zero. The problem here is different than the original case. In fact list(x) should raise an error, just like list(0) does. \n\n```\nsage: list([x,x]) \n[O(5), O(5)]\n```\n\nworks correctly. So this is really about matrix multiplication.",
    "created_at": "2011-01-27T11:32:36Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/8198",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/8198#issuecomment-65226",
    "user": "https://github.com/categorie"
}
```

<div id="comment:4" align="right">Comment 4</div>

I narrowed down the last issue above. (vector calls Sequence which calls list):

```
sage: R = Qp(5,5)
sage: x = R(5).add_bigoh(1)
sage: list(x)
[0]
```

again the element is set to zero. The problem here is different than the original case. In fact list(x) should raise an error, just like list(0) does. 

```
sage: list([x,x]) 
[O(5), O(5)]
```

works correctly. So this is really about matrix multiplication.



---

archive/issue_events_092947.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2013-08-13T15:35:53Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/8198",
    "milestone_number": null,
    "milestone_title": "sage-5.11",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/8198#event-92947"
}
```



---

archive/issue_events_092948.json:
```json
{
    "actor": "https://github.com/jdemeyer",
    "created_at": "2013-08-13T15:35:53Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/8198",
    "milestone_number": null,
    "milestone_title": "sage-5.12",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/8198#event-92948"
}
```



---

archive/issue_events_092949.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-01-30T21:20:52Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/8198",
    "milestone_number": null,
    "milestone_title": "sage-6.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/8198#event-92949"
}
```



---

archive/issue_events_092950.json:
```json
{
    "actor": "https://github.com/sagetrac-vbraun-spam",
    "created_at": "2014-01-30T21:20:52Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/8198",
    "milestone_number": null,
    "milestone_title": "sage-6.2",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/8198#event-92950"
}
```



---

archive/issue_comments_065227.json:
```json
{
    "body": "<div id=\"comment:7\" align=\"right\">Comment 7</div>\n\nNote the very last bug, is not longer a problem in 6.1 as `vv = vector(x)`\nraises the error\n `TypeError: this local element is not iterable`\nand that should be ok.",
    "created_at": "2014-02-02T15:06:16Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/8198",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/8198#issuecomment-65227",
    "user": "https://github.com/categorie"
}
```

<div id="comment:7" align="right">Comment 7</div>

Note the very last bug, is not longer a problem in 6.1 as `vv = vector(x)`
raises the error
 `TypeError: this local element is not iterable`
and that should be ok.



---

archive/issue_comments_065228.json:
```json
{
    "body": "<div id=\"comment:8\" align=\"right\">Comment 8</div>\n\nI don't even understand where vector * matrix multiplication is implemented...",
    "created_at": "2014-02-02T15:39:10Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/8198",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/8198#issuecomment-65228",
    "user": "https://github.com/categorie"
}
```

<div id="comment:8" align="right">Comment 8</div>

I don't even understand where vector * matrix multiplication is implemented...



---

archive/issue_comments_065229.json:
```json
{
    "body": "<div id=\"comment:10\" align=\"right\">Comment 10</div>\n\nReplying to [@categorie](#comment%3A8):\n> I don't even understand where vector * matrix multiplication is implemented...\n\nIn `sage/matrix/matrix0.pyx` (I discovered this when working on #804).  It tries to be too smart for its own good and skips entries of the vector that are equal to 0...  I made a patch and am now testing it.",
    "created_at": "2014-04-11T01:31:34Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/8198",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/8198#issuecomment-65229",
    "user": "https://github.com/pjbruin"
}
```

<div id="comment:10" align="right">Comment 10</div>

Replying to [@categorie](#comment%3A8):
> I don't even understand where vector * matrix multiplication is implemented...

In `sage/matrix/matrix0.pyx` (I discovered this when working on #804).  It tries to be too smart for its own good and skips entries of the vector that are equal to 0...  I made a patch and am now testing it.



---

archive/issue_events_092951.json:
```json
{
    "actor": "https://github.com/pjbruin",
    "created_at": "2014-04-11T01:43:32Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/8198",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "7fff00",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/8198#event-92951"
}
```



---

archive/issue_comments_065230.json:
```json
{
    "body": "Author: **Peter Bruin**",
    "created_at": "2014-04-11T01:43:32Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/8198",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/8198#issuecomment-65230",
    "user": "https://github.com/pjbruin"
}
```

Author: **Peter Bruin**



---

archive/issue_comments_065231.json:
```json
{
    "body": "Commit: **[41cbe4c](https://github.com/sagemath/sagetrac-mirror/commit/41cbe4c6b418b2ed9e3e0175ddce0393cc21611e)**",
    "created_at": "2014-04-11T01:43:32Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/8198",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/8198#issuecomment-65231",
    "user": "https://github.com/pjbruin"
}
```

Commit: **[41cbe4c](https://github.com/sagemath/sagetrac-mirror/commit/41cbe4c6b418b2ed9e3e0175ddce0393cc21611e)**



---

archive/issue_events_092952.json:
```json
{
    "actor": "https://github.com/pjbruin",
    "created_at": "2014-04-11T01:43:32Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/8198",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20padics",
    "label_color": "0000ff",
    "label_name": "component: padics",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/8198#event-92952"
}
```



---

archive/issue_events_092953.json:
```json
{
    "actor": "https://github.com/pjbruin",
    "created_at": "2014-04-11T01:43:32Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/8198",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20linear%20algebra",
    "label_color": "0000ff",
    "label_name": "component: linear algebra",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/8198#event-92953"
}
```



---

archive/issue_comments_065232.json:
```json
{
    "body": "Branch: **[u/pbruin/ticket/8198-matrix_vector_multiplication](https://github.com/sagemath/sagetrac-mirror/tree/u/pbruin/ticket/8198-matrix_vector_multiplication)**",
    "created_at": "2014-04-11T01:43:32Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/8198",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/8198#issuecomment-65232",
    "user": "https://github.com/pjbruin"
}
```

Branch: **[u/pbruin/ticket/8198-matrix_vector_multiplication](https://github.com/sagemath/sagetrac-mirror/tree/u/pbruin/ticket/8198-matrix_vector_multiplication)**



---

archive/issue_events_092954.json:
```json
{
    "actor": "https://github.com/categorie",
    "created_at": "2014-04-11T16:23:04Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/8198",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "7fff00",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/8198#event-92954"
}
```



---

archive/issue_events_092955.json:
```json
{
    "actor": "https://github.com/categorie",
    "created_at": "2014-04-11T16:23:04Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/8198",
    "label": "https://github.com/sagemath/sage/labels/positive%20review",
    "label_color": "dfffc0",
    "label_name": "positive review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/8198#event-92955"
}
```



---

archive/issue_comments_065233.json:
```json
{
    "body": "Reviewer: **Chris Wuthrich**",
    "created_at": "2014-04-11T16:23:04Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/8198",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/8198#issuecomment-65233",
    "user": "https://github.com/categorie"
}
```

Reviewer: **Chris Wuthrich**



---

archive/issue_comments_065234.json:
```json
{
    "body": "<div id=\"comment:12\" align=\"right\">Comment 12</div>\n\nGood. All tests pass.\n\nI was not certain about the changes as I am not completely fluent in cython. Having read documentations, I think they make sense. I tested the speed in a few very limited cases and it does not seem to me that the new code is slower or faster (except of course when the field is Qp). \n\nThanks for the help.",
    "created_at": "2014-04-11T16:23:04Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/8198",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/8198#issuecomment-65234",
    "user": "https://github.com/categorie"
}
```

<div id="comment:12" align="right">Comment 12</div>

Good. All tests pass.

I was not certain about the changes as I am not completely fluent in cython. Having read documentations, I think they make sense. I tested the speed in a few very limited cases and it does not seem to me that the new code is slower or faster (except of course when the field is Qp). 

Thanks for the help.



---

archive/issue_comments_065235.json:
```json
{
    "body": "<div id=\"comment:13\" align=\"right\">Comment 13</div>\n\nThanks; hopefully this goes some way towards being able to fix the related tickets #4656, #5075 and #9457...",
    "created_at": "2014-04-11T17:03:55Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/8198",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/8198#issuecomment-65235",
    "user": "https://github.com/pjbruin"
}
```

<div id="comment:13" align="right">Comment 13</div>

Thanks; hopefully this goes some way towards being able to fix the related tickets #4656, #5075 and #9457...



---

archive/issue_comments_065236.json:
```json
{
    "body": "Changed branch from **[u/pbruin/ticket/8198-matrix_vector_multiplication](https://github.com/sagemath/sagetrac-mirror/tree/u/pbruin/ticket/8198-matrix_vector_multiplication)** to **[41cbe4c](https://github.com/sagemath/sagetrac-mirror/commit/41cbe4c6b418b2ed9e3e0175ddce0393cc21611e)**",
    "created_at": "2014-04-13T19:33:32Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/8198",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/8198#issuecomment-65236",
    "user": "https://github.com/vbraun"
}
```

Changed branch from **[u/pbruin/ticket/8198-matrix_vector_multiplication](https://github.com/sagemath/sagetrac-mirror/tree/u/pbruin/ticket/8198-matrix_vector_multiplication)** to **[41cbe4c](https://github.com/sagemath/sagetrac-mirror/commit/41cbe4c6b418b2ed9e3e0175ddce0393cc21611e)**



---

archive/issue_events_092956.json:
```json
{
    "actor": "https://github.com/vbraun",
    "created_at": "2014-04-13T19:33:32Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/8198",
    "label": "https://github.com/sagemath/sage/labels/positive%20review",
    "label_color": "dfffc0",
    "label_name": "positive review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/8198#event-92956"
}
```



---

archive/issue_events_092957.json:
```json
{
    "actor": "https://github.com/vbraun",
    "commit_id": "d351d408286d93cadff64d0ca197742ebc0dae38",
    "commit_repository": "https://github.com/sagemath/sage",
    "created_at": "2014-04-13T19:33:32Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/8198",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/8198#event-92957"
}
```
