# Issue 8866: preparse vector-valued functions and derivatives

archive/issues_008866.json:
```json
{
    "assignees": [],
    "body": "Here is a rough patch which enables the following:\n\n```\nsage: T(r,theta)=[r*cos(theta),r*sin(theta)]\nsage: T\n((r, theta) |--> r*cos(theta), (r, theta) |--> r*sin(theta))\nsage: T.diff() # Jacobian matrix\n[   (r, theta) |--> cos(theta) (r, theta) |--> -r*sin(theta)]\n[   (r, theta) |--> sin(theta)  (r, theta) |--> r*cos(theta)]\nsage: diff(T) # Jacobian matrix\n[   (r, theta) |--> cos(theta) (r, theta) |--> -r*sin(theta)]\n[   (r, theta) |--> sin(theta)  (r, theta) |--> r*cos(theta)]\nsage: T.diff().det() # Jacobian \n(r, theta) |--> r*sin(theta)^2 + r*cos(theta)^2\n\nsage: f(x,y)=x^2+y\nsage: f.diff() # gradient\n((x, y) |--> 2*x, (x, y) |--> 1)\nsage: f.diff().diff() # Hessian matrix\n[(x, y) |--> 2 (x, y) |--> 0]\n[(x, y) |--> 0 (x, y) |--> 0]\nsage: r(t)=[cos(t),sin(t)]\nsage: parametric_plot(r(t), (t,0,2*pi))\n\nsage: # multivariable 2nd derivative test\nsage: f(x,y)=x^2*y+y^2+y\nsage: f.diff() # gradient\n((x, y) |--> 2*x*y, (x, y) |--> x^2 + 2*y + 1)\nsage: solve(list(f.diff()),[x,y])\n[[x == -I, y == 0], [x == I, y == 0], [x == 0, y == (-1/2)]]\nsage: f.diff(2)  # Hessian matrix\n[(x, y) |--> 2*y (x, y) |--> 2*x]\n[(x, y) |--> 2*x   (x, y) |--> 2]\nsage: f.diff(2)(x=0,y=-1/2)\n[-1  0]\n[ 0  2]\nsage: f.diff(2)(x=0,y=-1/2).eigenvalues()\n[-1, 2]\nsage: # we have a saddle point\n```\n\n\n**Assignee:** @burcin\n\n**CC:**  @mwhansen @burcin @kcrisman @rbeezer\n\n**Author:** Jason Grout\n\n**Reviewer:** Rob Beezer\n\n**Merged:** sage-4.4.2.alpha0\n\nIssue created by migration from https://trac.sagemath.org/ticket/8866\n\n",
    "closed_at": "2010-05-08T22:14:17Z",
    "created_at": "2010-05-04T03:14:57Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20symbolics",
        "https://github.com/sagemath/sage/labels/enhancement"
    ],
    "milestone": "https://github.com/sagemath/sage/milestones/sage-4.4.2",
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "preparse vector-valued functions and derivatives",
    "type": "issue",
    "updated_at": "2010-05-08T22:14:17Z",
    "url": "https://github.com/sagemath/sage/issues/8866",
    "user": "https://github.com/jasongrout"
}
```
Here is a rough patch which enables the following:

```
sage: T(r,theta)=[r*cos(theta),r*sin(theta)]
sage: T
((r, theta) |--> r*cos(theta), (r, theta) |--> r*sin(theta))
sage: T.diff() # Jacobian matrix
[   (r, theta) |--> cos(theta) (r, theta) |--> -r*sin(theta)]
[   (r, theta) |--> sin(theta)  (r, theta) |--> r*cos(theta)]
sage: diff(T) # Jacobian matrix
[   (r, theta) |--> cos(theta) (r, theta) |--> -r*sin(theta)]
[   (r, theta) |--> sin(theta)  (r, theta) |--> r*cos(theta)]
sage: T.diff().det() # Jacobian 
(r, theta) |--> r*sin(theta)^2 + r*cos(theta)^2

sage: f(x,y)=x^2+y
sage: f.diff() # gradient
((x, y) |--> 2*x, (x, y) |--> 1)
sage: f.diff().diff() # Hessian matrix
[(x, y) |--> 2 (x, y) |--> 0]
[(x, y) |--> 0 (x, y) |--> 0]
sage: r(t)=[cos(t),sin(t)]
sage: parametric_plot(r(t), (t,0,2*pi))

sage: # multivariable 2nd derivative test
sage: f(x,y)=x^2*y+y^2+y
sage: f.diff() # gradient
((x, y) |--> 2*x*y, (x, y) |--> x^2 + 2*y + 1)
sage: solve(list(f.diff()),[x,y])
[[x == -I, y == 0], [x == I, y == 0], [x == 0, y == (-1/2)]]
sage: f.diff(2)  # Hessian matrix
[(x, y) |--> 2*y (x, y) |--> 2*x]
[(x, y) |--> 2*x   (x, y) |--> 2]
sage: f.diff(2)(x=0,y=-1/2)
[-1  0]
[ 0  2]
sage: f.diff(2)(x=0,y=-1/2).eigenvalues()
[-1, 2]
sage: # we have a saddle point
```


**Assignee:** @burcin

**CC:**  @mwhansen @burcin @kcrisman @rbeezer

**Author:** Jason Grout

**Reviewer:** Rob Beezer

**Merged:** sage-4.4.2.alpha0

Issue created by migration from https://trac.sagemath.org/ticket/8866





---

archive/issue_events_063769.json:
```json
{
    "actor": "https://github.com/jasongrout",
    "created_at": "2010-05-04T03:18:05Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/8866",
    "label": "https://github.com/sagemath/sage/labels/needs%20work",
    "label_color": "008080",
    "label_name": "needs work",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/8866#event-63769"
}
```



---

archive/issue_comments_074299.json:
```json
{
    "body": "<a id='comment:1'></a>\nRight now, all the docs are wrong or missing for the added functionality.",
    "created_at": "2010-05-04T03:18:05Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/8866",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/8866#issuecomment-74299",
    "user": "https://github.com/jasongrout"
}
```

<a id='comment:1'></a>
Right now, all the docs are wrong or missing for the added functionality.



---

archive/issue_comments_074300.json:
```json
{
    "body": "**Attachment:** [trac-8866-preparse-vector-functions-derivatives.patch.gz](https://github.com/sagemath/sage/files/ticket8866/trac-8866-preparse-vector-functions-derivatives.patch.gz)",
    "created_at": "2010-05-04T03:57:15Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/8866",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/8866#issuecomment-74300",
    "user": "https://github.com/jasongrout"
}
```

**Attachment:** [trac-8866-preparse-vector-functions-derivatives.patch.gz](https://github.com/sagemath/sage/files/ticket8866/trac-8866-preparse-vector-functions-derivatives.patch.gz)



---

archive/issue_comments_074301.json:
```json
{
    "body": "<a id='comment:2'></a>\nI added docs for each functionality that changed.",
    "created_at": "2010-05-04T04:00:41Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/8866",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/8866#issuecomment-74301",
    "user": "https://github.com/jasongrout"
}
```

<a id='comment:2'></a>
I added docs for each functionality that changed.



---

archive/issue_events_063770.json:
```json
{
    "actor": "https://github.com/jasongrout",
    "created_at": "2010-05-04T04:00:41Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/8866",
    "label": "https://github.com/sagemath/sage/labels/needs%20work",
    "label_color": "008080",
    "label_name": "needs work",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/8866#event-63770"
}
```



---

archive/issue_events_063771.json:
```json
{
    "actor": "https://github.com/jasongrout",
    "created_at": "2010-05-04T04:00:41Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/8866",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "008080",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/8866#event-63771"
}
```



---

archive/issue_comments_074302.json:
```json
{
    "body": "<a id='comment:3'></a>\nmake ptestlong appears to pass on 4.4.1 (ubuntu 64-bit).",
    "created_at": "2010-05-04T05:12:26Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/8866",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/8866#issuecomment-74302",
    "user": "https://github.com/jasongrout"
}
```

<a id='comment:3'></a>
make ptestlong appears to pass on 4.4.1 (ubuntu 64-bit).



---

archive/issue_comments_074303.json:
```json
{
    "body": "<a id='comment:4'></a>\nI'm running tests right now.  In the meantime, could this be less ugly?  I realize that the naked '4's are not callable, so there is the deprecation warning, but the error warning seems severe.\n\n```\nsage: d=matrix(SR, [[4, 4]])\nsage: d(3)\n/sage/dev/local/lib/python2.6/site-packages/IPython/iplib.py:2073: DeprecationWarning: Substitution using function-call syntax and unnamed arguments is deprecated and will be removed from a future release of Sage; you can use named arguments instead, like EXPR(x=..., y=...)\n  exec code_obj in self.user_global_ns, self.user_ns\n---------------------------------------------------------------------------\nValueError                                Traceback (most recent call last)\n\n/sage/dev/<ipython console> in <module>()\n\n/sage/dev/local/lib/python2.6/site-packages/sage/matrix/matrix_symbolic_dense.so in sage.matrix.matrix_symbolic_dense.Matrix_symbolic_dense.__call__ (sage/matrix/matrix_symbolic_dense.c:3956)()\n\nValueError: the number of arguments must be less than or equal to 0\n```\n\nI didn't know you could create a vector space of functions.  Complete with a basis.  ;-)\n\n```\nsage: g(x,y)=x^2+y^3\nsage: g\n(x, y) |--> x^2 + y^3\nsage: grad=g.diff()\nsage: grad\n((x, y) |--> 2*x, (x, y) |--> 3*y^2)\nsage: grad.parent()\nVector space of dimension 2 over Callable function ring with arguments (x, y)\nsage: grad.parent().basis()\n[\n((x, y) |--> 1, (x, y) |--> 0),\n((x, y) |--> 0, (x, y) |--> 1)\n]\n```",
    "created_at": "2010-05-05T05:07:00Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/8866",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/8866#issuecomment-74303",
    "user": "https://github.com/rbeezer"
}
```

<a id='comment:4'></a>
I'm running tests right now.  In the meantime, could this be less ugly?  I realize that the naked '4's are not callable, so there is the deprecation warning, but the error warning seems severe.

```
sage: d=matrix(SR, [[4, 4]])
sage: d(3)
/sage/dev/local/lib/python2.6/site-packages/IPython/iplib.py:2073: DeprecationWarning: Substitution using function-call syntax and unnamed arguments is deprecated and will be removed from a future release of Sage; you can use named arguments instead, like EXPR(x=..., y=...)
  exec code_obj in self.user_global_ns, self.user_ns
---------------------------------------------------------------------------
ValueError                                Traceback (most recent call last)

/sage/dev/<ipython console> in <module>()

/sage/dev/local/lib/python2.6/site-packages/sage/matrix/matrix_symbolic_dense.so in sage.matrix.matrix_symbolic_dense.Matrix_symbolic_dense.__call__ (sage/matrix/matrix_symbolic_dense.c:3956)()

ValueError: the number of arguments must be less than or equal to 0
```

I didn't know you could create a vector space of functions.  Complete with a basis.  ;-)

```
sage: g(x,y)=x^2+y^3
sage: g
(x, y) |--> x^2 + y^3
sage: grad=g.diff()
sage: grad
((x, y) |--> 2*x, (x, y) |--> 3*y^2)
sage: grad.parent()
Vector space of dimension 2 over Callable function ring with arguments (x, y)
sage: grad.parent().basis()
[
((x, y) |--> 1, (x, y) |--> 0),
((x, y) |--> 0, (x, y) |--> 1)
]
```



---

archive/issue_comments_074304.json:
```json
{
    "body": "<a id='comment:5'></a>\nReplying to [@rbeezer](#comment%3A4):\n\n> I'm running tests right now.  In the meantime, could this be less ugly?  I realize that the naked '4's are not callable, so there is the deprecation warning, but the error warning seems severe. \n\nThat's stemming from this, of course:\n\n```\n\nsage: SR(4)(2)\n---------------------------------------------------------------------------\nValueError                                Traceback (most recent call last)\n\n/home/jason/<ipython console> in <module>()\n\n/home/jason/sage/local/lib/python2.6/site-packages/sage/symbolic/expression.so in sage.symbolic.expression.Expression.__call__ (sage/symbolic/expression.cpp:15477)()\n\n/home/jason/sage/local/lib/python2.6/site-packages/sage/symbolic/ring.so in sage.symbolic.ring.SymbolicRing._call_element_ (sage/symbolic/ring.cpp:6523)()\n\nValueError: the number of arguments must be less than or equal to 0\n```\n\nI don't know what should be done about that to make it prettier.  Usually you wouldn't \"call\" an integer by itself (as just a symbolic integer is not a function...)\n\nNote that making matrices callable is just extending the existing behavior for vectors.\n\n\n>I didn't know you could create a vector space of functions.  Complete with a basis.  ;-) \n\nYes, interesting.  That stems from callable expressions being just normal expressions with a bit of extra information (default variable order for calls).  Of course, it gave you back a basis for symbolic expressions.",
    "created_at": "2010-05-05T06:17:25Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/8866",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/8866#issuecomment-74304",
    "user": "https://github.com/jasongrout"
}
```

<a id='comment:5'></a>
Replying to [@rbeezer](#comment%3A4):

> I'm running tests right now.  In the meantime, could this be less ugly?  I realize that the naked '4's are not callable, so there is the deprecation warning, but the error warning seems severe. 

That's stemming from this, of course:

```

sage: SR(4)(2)
---------------------------------------------------------------------------
ValueError                                Traceback (most recent call last)

/home/jason/<ipython console> in <module>()

/home/jason/sage/local/lib/python2.6/site-packages/sage/symbolic/expression.so in sage.symbolic.expression.Expression.__call__ (sage/symbolic/expression.cpp:15477)()

/home/jason/sage/local/lib/python2.6/site-packages/sage/symbolic/ring.so in sage.symbolic.ring.SymbolicRing._call_element_ (sage/symbolic/ring.cpp:6523)()

ValueError: the number of arguments must be less than or equal to 0
```

I don't know what should be done about that to make it prettier.  Usually you wouldn't "call" an integer by itself (as just a symbolic integer is not a function...)

Note that making matrices callable is just extending the existing behavior for vectors.


>I didn't know you could create a vector space of functions.  Complete with a basis.  ;-) 

Yes, interesting.  That stems from callable expressions being just normal expressions with a bit of extra information (default variable order for calls).  Of course, it gave you back a basis for symbolic expressions.



---

archive/issue_comments_074305.json:
```json
{
    "body": "<a id='comment:6'></a>\nReplying to [@jasongrout](#comment%3A5):\n> I don't know what should be done about that to make it prettier.\n\nMe either.  ;-)  I guess I found it odd that there was a deprecation warning, then a failure.  But maybe that's just the way it goes.",
    "created_at": "2010-05-06T03:50:33Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/8866",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/8866#issuecomment-74305",
    "user": "https://github.com/rbeezer"
}
```

<a id='comment:6'></a>
Replying to [@jasongrout](#comment%3A5):
> I don't know what should be done about that to make it prettier.

Me either.  ;-)  I guess I found it odd that there was a deprecation warning, then a failure.  But maybe that's just the way it goes.



---

archive/issue_events_063772.json:
```json
{
    "actor": "https://github.com/rbeezer",
    "created_at": "2010-05-06T03:51:39Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/8866",
    "label": "https://github.com/sagemath/sage/labels/needs%20review",
    "label_color": "008080",
    "label_name": "needs review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/8866#event-63772"
}
```



---

archive/issue_events_063773.json:
```json
{
    "actor": "https://github.com/rbeezer",
    "created_at": "2010-05-06T03:51:39Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/8866",
    "label": "https://github.com/sagemath/sage/labels/positive%20review",
    "label_color": "008080",
    "label_name": "positive review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/8866#event-63773"
}
```



---

archive/issue_comments_074306.json:
```json
{
    "body": "<a id='comment:7'></a>\nThis all checks out fine: builds and runs, passes all tests, documentation is fine.\n\nSo, positive review.",
    "created_at": "2010-05-06T03:51:39Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/8866",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/8866#issuecomment-74306",
    "user": "https://github.com/rbeezer"
}
```

<a id='comment:7'></a>
This all checks out fine: builds and runs, passes all tests, documentation is fine.

So, positive review.



---

archive/issue_comments_074307.json:
```json
{
    "body": "same as previous but with ticket number in commit message",
    "created_at": "2010-05-08T04:21:44Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/8866",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/8866#issuecomment-74307",
    "user": "https://github.com/sagetrac-mvngu"
}
```

same as previous but with ticket number in commit message



---

archive/issue_events_063774.json:
```json
{
    "actor": "https://github.com/sagetrac-mvngu",
    "created_at": "2010-05-08T22:14:17Z",
    "event": "unlabeled",
    "issue": "https://github.com/sagemath/sage/issues/8866",
    "label": "https://github.com/sagemath/sage/labels/positive%20review",
    "label_color": "008080",
    "label_name": "positive review",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/8866#event-63774"
}
```



---

archive/issue_events_063775.json:
```json
{
    "actor": "https://github.com/sagetrac-mvngu",
    "created_at": "2010-05-08T22:14:17Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/8866",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/8866#event-63775"
}
```



---

archive/issue_comments_074308.json:
```json
{
    "body": "<a id='comment:8'></a>\n**Attachment:** [trac-8866-preparse-vector-functions-derivatives.2.patch.gz](https://github.com/sagemath/sage/files/ticket8866/trac-8866-preparse-vector-functions-derivatives.2.patch.gz)",
    "created_at": "2010-05-08T22:14:17Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/8866",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/8866#issuecomment-74308",
    "user": "https://github.com/sagetrac-mvngu"
}
```

<a id='comment:8'></a>
**Attachment:** [trac-8866-preparse-vector-functions-derivatives.2.patch.gz](https://github.com/sagemath/sage/files/ticket8866/trac-8866-preparse-vector-functions-derivatives.2.patch.gz)



---

archive/issue_comments_074309.json:
```json
{
    "body": "**Reviewer:** Rob Beezer",
    "created_at": "2010-05-08T22:14:17Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/8866",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/8866#issuecomment-74309",
    "user": "https://github.com/sagetrac-mvngu"
}
```

**Reviewer:** Rob Beezer



---

archive/issue_comments_074310.json:
```json
{
    "body": "**Merged:** sage-4.4.2.alpha0",
    "created_at": "2010-05-08T22:14:17Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/8866",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/8866#issuecomment-74310",
    "user": "https://github.com/sagetrac-mvngu"
}
```

**Merged:** sage-4.4.2.alpha0
