# Issue 3348: Coercion problem: creating vectors from a mix of python and symbolic types

archive/issues_003348.json:
```json
{
    "assignees": [
        "https://github.com/robertwb"
    ],
    "body": "In the following (isomorphic) cases, the first entry is floored\n\n```\nsage: vector(eval(\"[0.78, 1, 1 + 2.38 * I]\"))\n(0, 1, 2.38000000000000*I + 1)\nsage: vector([float(5.52), int(1), 1.3*x])\n(5, 1, 1.30000000000000*x)\n```\nNote: the order of the types here seems to have to be (float, int, symbolic ring) for this to occur.  If one uses proper Sage types, the problem goes away:\n\n```\nvector(sage_eval(\"[0.78, 1, 1 + 2.38 * I]\"))\n(0.780000000000000, 1.00000000000000, 2.38000000000000*I + 1)\n```\n\n\n\n\nComponent: **coercion**\n\n_Issue created by migration from https://trac.sagemath.org/ticket/3348_\n\n",
    "closed_at": "2009-06-04T22:55:41Z",
    "created_at": "2008-06-01T20:22:01Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/bug",
        "https://github.com/sagemath/sage/labels/c%3A%20coercion",
        "https://github.com/sagemath/sage/labels/invalid"
    ],
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "Coercion problem: creating vectors from a mix of python and symbolic types",
    "type": "issue",
    "updated_at": "2009-06-04T22:55:41Z",
    "url": "https://github.com/sagemath/sage/issues/3348",
    "user": "https://github.com/NathanDunfield"
}
```
In the following (isomorphic) cases, the first entry is floored

```
sage: vector(eval("[0.78, 1, 1 + 2.38 * I]"))
(0, 1, 2.38000000000000*I + 1)
sage: vector([float(5.52), int(1), 1.3*x])
(5, 1, 1.30000000000000*x)
```
Note: the order of the types here seems to have to be (float, int, symbolic ring) for this to occur.  If one uses proper Sage types, the problem goes away:

```
vector(sage_eval("[0.78, 1, 1 + 2.38 * I]"))
(0.780000000000000, 1.00000000000000, 2.38000000000000*I + 1)
```




Component: **coercion**

_Issue created by migration from https://trac.sagemath.org/ticket/3348_





---

archive/issue_events_035817.json:
```json
{
    "actor": "https://github.com/NathanDunfield",
    "created_at": "2008-06-01T20:22:01Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/3348",
    "milestone_number": null,
    "milestone_title": "sage-4.0.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/3348#event-35817"
}
```



---

archive/issue_events_035818.json:
```json
{
    "actor": "https://github.com/NathanDunfield",
    "created_at": "2008-06-01T20:22:01Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/3348",
    "label": "https://github.com/sagemath/sage/labels/c%3A%20coercion",
    "label_color": "0000ff",
    "label_name": "c: coercion",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/3348#event-35818"
}
```



---

archive/issue_events_035819.json:
```json
{
    "actor": "https://github.com/NathanDunfield",
    "created_at": "2008-06-01T20:22:01Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/3348",
    "label": "https://github.com/sagemath/sage/labels/p%3A%20major%20/%203",
    "label_color": "ffbb00",
    "label_name": "p: major / 3",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/3348#event-35819"
}
```



---

archive/issue_events_035820.json:
```json
{
    "actor": "https://github.com/NathanDunfield",
    "created_at": "2008-06-01T20:22:01Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/3348",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "d73a4a",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/3348#event-35820"
}
```



---

archive/issue_events_035821.json:
```json
{
    "actor": "https://github.com/robertwb",
    "created_at": "2008-06-01T20:22:01Z",
    "event": "assigned",
    "issue": "https://github.com/sagemath/sage/issues/3348",
    "subject": "https://github.com/NathanDunfield",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/3348#event-35821"
}
```



---

archive/issue_comments_017821.json:
```json
{
    "body": "<div id=\"comment:1\" align=\"right\">comment:1</div>\n\nThis has been fixed in the switch to Pynac symbolics:\n\n```\n----------------------------------------------------------------------\n| Sage Version 4.0.1.rc1, Release Date: 2009-06-04                   |\n| Type notebook() for the GUI, and license() for information.        |\n----------------------------------------------------------------------\nsage: sage: vector(eval(\"[0.78, 1, 1 + 2.38 * I]\"))\n(0.78, 1.0, 1.00000000000000 + 2.38000000000000*I)\nsage: _.parent()\nVector space of dimension 3 over Symbolic Ring\nsage: sage: vector([float(5.52), int(1), 1.3*x])\n(5.52, 1.0, 1.30000000000000*x)\nsage: _.parent()\nVector space of dimension 3 over Symbolic Ring\nsage: vector(sage_eval(\"[0.78, 1, 1 + 2.38 * I]\"))\n(0.780000000000000, 1.00000000000000, 1.00000000000000 + 2.38000000000000*I)\nsage: _.parent()\nVector space of dimension 3 over Symbolic Ring\n```",
    "created_at": "2009-06-04T22:55:41Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/3348",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/3348#issuecomment-17821",
    "user": "https://github.com/mwhansen"
}
```

<div id="comment:1" align="right">comment:1</div>

This has been fixed in the switch to Pynac symbolics:

```
----------------------------------------------------------------------
| Sage Version 4.0.1.rc1, Release Date: 2009-06-04                   |
| Type notebook() for the GUI, and license() for information.        |
----------------------------------------------------------------------
sage: sage: vector(eval("[0.78, 1, 1 + 2.38 * I]"))
(0.78, 1.0, 1.00000000000000 + 2.38000000000000*I)
sage: _.parent()
Vector space of dimension 3 over Symbolic Ring
sage: sage: vector([float(5.52), int(1), 1.3*x])
(5.52, 1.0, 1.30000000000000*x)
sage: _.parent()
Vector space of dimension 3 over Symbolic Ring
sage: vector(sage_eval("[0.78, 1, 1 + 2.38 * I]"))
(0.780000000000000, 1.00000000000000, 1.00000000000000 + 2.38000000000000*I)
sage: _.parent()
Vector space of dimension 3 over Symbolic Ring
```



---

archive/issue_events_035822.json:
```json
{
    "actor": "https://github.com/mwhansen",
    "created_at": "2009-06-04T22:55:41Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/3348",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/3348#event-35822"
}
```



---

archive/issue_events_035823.json:
```json
{
    "actor": "https://github.com/mwhansen",
    "created_at": "2009-06-04T22:55:41Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/3348",
    "milestone_number": null,
    "milestone_title": "sage-4.0.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/3348#event-35823"
}
```
