# Issue 3870: scipy - bug in find_root

archive/issues_003870.json:
```json
{
    "assignees": [],
    "body": "\n```\nIt appears that find_root give the wrong result in the following\nexample:\n\n----------------------------------------------------------------------\n| SAGE Version 3.0.5, Release Date: 2008-07-11                       |\n| Type notebook() for the GUI, and license() for information.        |\n----------------------------------------------------------------------\n\nsage: var('av')\nav\nsage: f=2.00000000000000*av - (10*sqrt(36.0000000000000*(av^4 - 2*av^3\n+ av^2) + 207.360000000000*(-4*av^4 + 8*av^3 - 4*av^2) +\n365*(51.8400000000000*(4*av^3 - 4*av) + 9.00000000000000*(2*av -\n2*av^2)) + 133225*(2.25000000000000 - 51.8400000000000*av)) +\n60.0000000000000*(av - av^2) + 5475.00000000000)/(720.000000000000*(2\n- 2*av) + 131400.000000000)\nsage: find_root(f,0,0.1)\n0.0\nsage: plot(f,0,0.1)\n\nThe last command will plot f and reveal that the root is somewhere\nnear to 0.05, but certainly not 0.0. No matter what I use for xtol or\nrtol, I always get 0.0 as a result. Can anyone help?\n\nThanks!\n\nStan\n```\n\nI don't what is going on yet.  It may be a bug in scipy.\n\n**Assignee:** @garyfurnish\n\n**CC:**  @jasongrout\n\n**Keywords:** scipy\n\nIssue created by migration from https://trac.sagemath.org/ticket/3870\n\n",
    "closed_at": "2010-01-20T06:31:19Z",
    "created_at": "2008-08-15T09:30:54Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/component%3A%20calculus",
        "https://github.com/sagemath/sage/labels/bug",
        "https://github.com/sagemath/sage/labels/invalid"
    ],
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "scipy - bug in find_root",
    "type": "issue",
    "updated_at": "2010-01-20T10:43:55Z",
    "url": "https://github.com/sagemath/sage/issues/3870",
    "user": "https://github.com/williamstein"
}
```

```
It appears that find_root give the wrong result in the following
example:

----------------------------------------------------------------------
| SAGE Version 3.0.5, Release Date: 2008-07-11                       |
| Type notebook() for the GUI, and license() for information.        |
----------------------------------------------------------------------

sage: var('av')
av
sage: f=2.00000000000000*av - (10*sqrt(36.0000000000000*(av^4 - 2*av^3
+ av^2) + 207.360000000000*(-4*av^4 + 8*av^3 - 4*av^2) +
365*(51.8400000000000*(4*av^3 - 4*av) + 9.00000000000000*(2*av -
2*av^2)) + 133225*(2.25000000000000 - 51.8400000000000*av)) +
60.0000000000000*(av - av^2) + 5475.00000000000)/(720.000000000000*(2
- 2*av) + 131400.000000000)
sage: find_root(f,0,0.1)
0.0
sage: plot(f,0,0.1)

The last command will plot f and reveal that the root is somewhere
near to 0.05, but certainly not 0.0. No matter what I use for xtol or
rtol, I always get 0.0 as a result. Can anyone help?

Thanks!

Stan
```

I don't what is going on yet.  It may be a bug in scipy.

**Assignee:** @garyfurnish

**CC:**  @jasongrout

**Keywords:** scipy

Issue created by migration from https://trac.sagemath.org/ticket/3870





---

archive/issue_events_034987.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2008-08-15T09:30:54Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/3870",
    "label": "https://github.com/sagemath/sage/labels/component%3A%20calculus",
    "label_color": "08517b",
    "label_name": "component: calculus",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/3870#event-34987"
}
```



---

archive/issue_events_034988.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2008-08-15T09:30:54Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/3870",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "008080",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/3870#event-34988"
}
```



---

archive/issue_events_034989.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2008-08-15T09:30:54Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/3870",
    "label": "https://github.com/sagemath/sage/labels/invalid",
    "label_color": "008080",
    "label_name": "invalid",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/3870#event-34989"
}
```



---

archive/issue_comments_022356.json:
```json
{
    "body": "<a id='comment:1'>**Comment 1:**</a>\nStan Schymanski points out that:\n\n```\n\nI just found out that the problem can be solved using maxima's\nfind_root:\n\nsage: maxima.find_root(f,0,0.1)\n.03134446907530818\n\nIt's great that sage offers multiple ways of doing the same thing. :)\n\nStan\n```",
    "created_at": "2008-08-26T09:02:11Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/3870",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/3870#issuecomment-22356",
    "user": "https://github.com/williamstein"
}
```

<a id='comment:1'>**Comment 1:**</a>
Stan Schymanski points out that:

```

I just found out that the problem can be solved using maxima's
find_root:

sage: maxima.find_root(f,0,0.1)
.03134446907530818

It's great that sage offers multiple ways of doing the same thing. :)

Stan
```



---

archive/issue_comments_022357.json:
```json
{
    "body": "<a id='comment:2'>**Comment 2:**</a>\nI don't know if that is the cause, but I don't think find_root is prepared to deal with complex numbers:\n\n```\nsage: var('av')\nav\nsage: f=2.00000000000000*av - (10*sqrt(36.0000000000000*(av^4 - 2*av^3\n+ av^2) + 207.360000000000*(-4*av^4 + 8*av^3 - 4*av^2) +\n365*(51.8400000000000*(4*av^3 - 4*av) + 9.00000000000000*(2*av -\n2*av^2)) + 133225*(2.25000000000000 - 51.8400000000000*av)) +\n60.0000000000000*(av - av^2) + 5475.00000000000)/(720.000000000000*(2\n- 2*av) + 131400.000000000)\nsage: f(0.1).n()\n0.158699584011575 - 0.0475301543661689*I\n```",
    "created_at": "2008-09-08T20:54:42Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/3870",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/3870#issuecomment-22357",
    "user": "https://github.com/sagetrac-anakha"
}
```

<a id='comment:2'>**Comment 2:**</a>
I don't know if that is the cause, but I don't think find_root is prepared to deal with complex numbers:

```
sage: var('av')
av
sage: f=2.00000000000000*av - (10*sqrt(36.0000000000000*(av^4 - 2*av^3
+ av^2) + 207.360000000000*(-4*av^4 + 8*av^3 - 4*av^2) +
365*(51.8400000000000*(4*av^3 - 4*av) + 9.00000000000000*(2*av -
2*av^2)) + 133225*(2.25000000000000 - 51.8400000000000*av)) +
60.0000000000000*(av - av^2) + 5475.00000000000)/(720.000000000000*(2
- 2*av) + 131400.000000000)
sage: f(0.1).n()
0.158699584011575 - 0.0475301543661689*I
```



---

archive/issue_comments_022358.json:
```json
{
    "body": "<a id='comment:3'>**Comment 3:**</a>\nContinuing from the previous block:\n\n```\nsage: ff = sage.ext.fast_eval.fast_float(f, av)\nsage: ff\n<sage.ext.fast_eval.FastDoubleFunc object at 0x8a7a8f0>\nsage: ff(0)\n-0.082429990966576328\nsage: ff(0.1)\nnan\nsage: ff(0.05)\nnan\nsage: ff(0.04)\n0.02790669038508465\nsage: find_root(f, 0, 0.04)\n0.031344469075307836\n```\n\nYeah, it is clearly not prepared.  I don't know why maxima works.",
    "created_at": "2008-09-08T21:01:36Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/3870",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/3870#issuecomment-22358",
    "user": "https://github.com/sagetrac-anakha"
}
```

<a id='comment:3'>**Comment 3:**</a>
Continuing from the previous block:

```
sage: ff = sage.ext.fast_eval.fast_float(f, av)
sage: ff
<sage.ext.fast_eval.FastDoubleFunc object at 0x8a7a8f0>
sage: ff(0)
-0.082429990966576328
sage: ff(0.1)
nan
sage: ff(0.05)
nan
sage: ff(0.04)
0.02790669038508465
sage: find_root(f, 0, 0.04)
0.031344469075307836
```

Yeah, it is clearly not prepared.  I don't know why maxima works.



---

archive/issue_comments_022359.json:
```json
{
    "body": "**Changing keywords** from \"\" to \"scipy\".",
    "created_at": "2008-11-14T06:26:30Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/3870",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/3870#issuecomment-22359",
    "user": "https://github.com/jasongrout"
}
```

**Changing keywords** from "" to "scipy".



---

archive/issue_events_034990.json:
```json
{
    "actor": "https://github.com/jasongrout",
    "created_at": "2008-11-14T06:27:16Z",
    "event": "renamed",
    "issue": "https://github.com/sagemath/sage/issues/3870",
    "rename": {
        "from": "bug in find_root",
        "to": "scipy - bug in find_root"
    },
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/3870#event-34990"
}
```



---

archive/issue_events_034991.json:
```json
{
    "actor": "https://github.com/jasongrout",
    "created_at": "2010-01-20T06:31:19Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/3870",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/3870#event-34991"
}
```



---

archive/issue_comments_022360.json:
```json
{
    "body": "<a id='comment:6'>**Comment 6:**</a>\nYep.  In the scipy documentation, it assumes the function is continuous (from context, it seems over the reals).  So this function fails, as allowed by the documentation.",
    "created_at": "2010-01-20T06:31:19Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/3870",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/3870#issuecomment-22360",
    "user": "https://github.com/jasongrout"
}
```

<a id='comment:6'>**Comment 6:**</a>
Yep.  In the scipy documentation, it assumes the function is continuous (from context, it seems over the reals).  So this function fails, as allowed by the documentation.



---

archive/issue_events_034992.json:
```json
{
    "actor": "https://github.com/sagetrac-mvngu",
    "created_at": "2010-01-20T10:43:55Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/3870",
    "milestone_number": null,
    "milestone_title": "sage-4.3.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/3870#event-34992"
}
```
