# Issue 3870: scipy - bug in find_root

archive/issues_003870.json:
```json
{
    "assignees": [
        "https://github.com/garyfurnish"
    ],
    "body": "\n```\nIt appears that find_root give the wrong result in the following\nexample:\n\n----------------------------------------------------------------------\n| SAGE Version 3.0.5, Release Date: 2008-07-11                       |\n| Type notebook() for the GUI, and license() for information.        |\n----------------------------------------------------------------------\n\nsage: var('av')\nav\nsage: f=2.00000000000000*av - (10*sqrt(36.0000000000000*(av^4 - 2*av^3\n+ av^2) + 207.360000000000*(-4*av^4 + 8*av^3 - 4*av^2) +\n365*(51.8400000000000*(4*av^3 - 4*av) + 9.00000000000000*(2*av -\n2*av^2)) + 133225*(2.25000000000000 - 51.8400000000000*av)) +\n60.0000000000000*(av - av^2) + 5475.00000000000)/(720.000000000000*(2\n- 2*av) + 131400.000000000)\nsage: find_root(f,0,0.1)\n0.0\nsage: plot(f,0,0.1)\n\nThe last command will plot f and reveal that the root is somewhere\nnear to 0.05, but certainly not 0.0. No matter what I use for xtol or\nrtol, I always get 0.0 as a result. Can anyone help?\n\nThanks!\n\nStan\n```\n\nI don't what is going on yet.  It may be a bug in scipy.\n\nCC:  @jasongrout\n\nComponent: **calculus**\n\nKeywords: **scipy**\n\n_Issue created by migration from https://trac.sagemath.org/ticket/3870_\n\n",
    "closed_at": "2010-01-20T06:31:19Z",
    "created_at": "2008-08-15T09:30:54Z",
    "labels": [
        "https://github.com/sagemath/sage/labels/bug",
        "https://github.com/sagemath/sage/labels/c%3A%20calculus",
        "https://github.com/sagemath/sage/labels/invalid"
    ],
    "reactions": [],
    "repository": "https://github.com/sagemath/sage",
    "title": "scipy - bug in find_root",
    "type": "issue",
    "updated_at": "2010-01-20T10:43:55Z",
    "url": "https://github.com/sagemath/sage/issues/3870",
    "user": "https://github.com/williamstein"
}
```

```
It appears that find_root give the wrong result in the following
example:

----------------------------------------------------------------------
| SAGE Version 3.0.5, Release Date: 2008-07-11                       |
| Type notebook() for the GUI, and license() for information.        |
----------------------------------------------------------------------

sage: var('av')
av
sage: f=2.00000000000000*av - (10*sqrt(36.0000000000000*(av^4 - 2*av^3
+ av^2) + 207.360000000000*(-4*av^4 + 8*av^3 - 4*av^2) +
365*(51.8400000000000*(4*av^3 - 4*av) + 9.00000000000000*(2*av -
2*av^2)) + 133225*(2.25000000000000 - 51.8400000000000*av)) +
60.0000000000000*(av - av^2) + 5475.00000000000)/(720.000000000000*(2
- 2*av) + 131400.000000000)
sage: find_root(f,0,0.1)
0.0
sage: plot(f,0,0.1)

The last command will plot f and reveal that the root is somewhere
near to 0.05, but certainly not 0.0. No matter what I use for xtol or
rtol, I always get 0.0 as a result. Can anyone help?

Thanks!

Stan
```

I don't what is going on yet.  It may be a bug in scipy.

CC:  @jasongrout

Component: **calculus**

Keywords: **scipy**

_Issue created by migration from https://trac.sagemath.org/ticket/3870_





---

archive/issue_events_042616.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2008-08-15T09:30:54Z",
    "event": "milestoned",
    "issue": "https://github.com/sagemath/sage/issues/3870",
    "milestone_number": null,
    "milestone_title": "sage-4.3.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/3870#event-42616"
}
```



---

archive/issue_events_042617.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2008-08-15T09:30:54Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/3870",
    "label": "https://github.com/sagemath/sage/labels/c%3A%20calculus",
    "label_color": "0000ff",
    "label_name": "c: calculus",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/3870#event-42617"
}
```



---

archive/issue_events_042618.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2008-08-15T09:30:54Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/3870",
    "label": "https://github.com/sagemath/sage/labels/p%3A%20major%20/%203",
    "label_color": "ffbb00",
    "label_name": "p: major / 3",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/3870#event-42618"
}
```



---

archive/issue_events_042619.json:
```json
{
    "actor": "https://github.com/williamstein",
    "created_at": "2008-08-15T09:30:54Z",
    "event": "labeled",
    "issue": "https://github.com/sagemath/sage/issues/3870",
    "label": "https://github.com/sagemath/sage/labels/bug",
    "label_color": "d73a4a",
    "label_name": "bug",
    "label_text_color": "ffffff",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/3870#event-42619"
}
```



---

archive/issue_events_042620.json:
```json
{
    "actor": "https://github.com/garyfurnish",
    "created_at": "2008-08-15T09:30:54Z",
    "event": "assigned",
    "issue": "https://github.com/sagemath/sage/issues/3870",
    "subject": "https://github.com/williamstein",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/3870#event-42620"
}
```



---

archive/issue_comments_021433.json:
```json
{
    "body": "<div id=\"comment:1\" align=\"right\">comment:1</div>\n\nStan Schymanski points out that:\n\n```\n\nI just found out that the problem can be solved using maxima's\nfind_root:\n\nsage: maxima.find_root(f,0,0.1)\n.03134446907530818\n\nIt's great that sage offers multiple ways of doing the same thing. :)\n\nStan\n```",
    "created_at": "2008-08-26T09:02:11Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/3870",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/3870#issuecomment-21433",
    "user": "https://github.com/williamstein"
}
```

<div id="comment:1" align="right">comment:1</div>

Stan Schymanski points out that:

```

I just found out that the problem can be solved using maxima's
find_root:

sage: maxima.find_root(f,0,0.1)
.03134446907530818

It's great that sage offers multiple ways of doing the same thing. :)

Stan
```



---

archive/issue_comments_021434.json:
```json
{
    "body": "<div id=\"comment:2\" align=\"right\">comment:2</div>\n\nI don't know if that is the cause, but I don't think find_root is prepared to deal with complex numbers:\n\n```\nsage: var('av')\nav\nsage: f=2.00000000000000*av - (10*sqrt(36.0000000000000*(av^4 - 2*av^3\n+ av^2) + 207.360000000000*(-4*av^4 + 8*av^3 - 4*av^2) +\n365*(51.8400000000000*(4*av^3 - 4*av) + 9.00000000000000*(2*av -\n2*av^2)) + 133225*(2.25000000000000 - 51.8400000000000*av)) +\n60.0000000000000*(av - av^2) + 5475.00000000000)/(720.000000000000*(2\n- 2*av) + 131400.000000000)\nsage: f(0.1).n()\n0.158699584011575 - 0.0475301543661689*I\n```",
    "created_at": "2008-09-08T20:54:42Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/3870",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/3870#issuecomment-21434",
    "user": "https://github.com/sagetrac-anakha"
}
```

<div id="comment:2" align="right">comment:2</div>

I don't know if that is the cause, but I don't think find_root is prepared to deal with complex numbers:

```
sage: var('av')
av
sage: f=2.00000000000000*av - (10*sqrt(36.0000000000000*(av^4 - 2*av^3
+ av^2) + 207.360000000000*(-4*av^4 + 8*av^3 - 4*av^2) +
365*(51.8400000000000*(4*av^3 - 4*av) + 9.00000000000000*(2*av -
2*av^2)) + 133225*(2.25000000000000 - 51.8400000000000*av)) +
60.0000000000000*(av - av^2) + 5475.00000000000)/(720.000000000000*(2
- 2*av) + 131400.000000000)
sage: f(0.1).n()
0.158699584011575 - 0.0475301543661689*I
```



---

archive/issue_comments_021435.json:
```json
{
    "body": "<div id=\"comment:3\" align=\"right\">comment:3</div>\n\nContinuing from the previous block:\n\n```\nsage: ff = sage.ext.fast_eval.fast_float(f, av)\nsage: ff\n<sage.ext.fast_eval.FastDoubleFunc object at 0x8a7a8f0>\nsage: ff(0)\n-0.082429990966576328\nsage: ff(0.1)\nnan\nsage: ff(0.05)\nnan\nsage: ff(0.04)\n0.02790669038508465\nsage: find_root(f, 0, 0.04)\n0.031344469075307836\n```\n\nYeah, it is clearly not prepared.  I don't know why maxima works.",
    "created_at": "2008-09-08T21:01:36Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/3870",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/3870#issuecomment-21435",
    "user": "https://github.com/sagetrac-anakha"
}
```

<div id="comment:3" align="right">comment:3</div>

Continuing from the previous block:

```
sage: ff = sage.ext.fast_eval.fast_float(f, av)
sage: ff
<sage.ext.fast_eval.FastDoubleFunc object at 0x8a7a8f0>
sage: ff(0)
-0.082429990966576328
sage: ff(0.1)
nan
sage: ff(0.05)
nan
sage: ff(0.04)
0.02790669038508465
sage: find_root(f, 0, 0.04)
0.031344469075307836
```

Yeah, it is clearly not prepared.  I don't know why maxima works.



---

archive/issue_comments_021436.json:
```json
{
    "body": "Changed keywords from none to **scipy**",
    "created_at": "2008-11-14T06:26:30Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/3870",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/3870#issuecomment-21436",
    "user": "https://github.com/jasongrout"
}
```

Changed keywords from none to **scipy**



---

archive/issue_events_042621.json:
```json
{
    "actor": "https://github.com/jasongrout",
    "created_at": "2008-11-14T06:27:16Z",
    "event": "renamed",
    "issue": "https://github.com/sagemath/sage/issues/3870",
    "title_is": "scipy - bug in find_root",
    "title_was": "bug in find_root",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/3870#event-42621"
}
```



---

archive/issue_events_042622.json:
```json
{
    "actor": "https://github.com/jasongrout",
    "created_at": "2010-01-20T06:31:19Z",
    "event": "closed",
    "issue": "https://github.com/sagemath/sage/issues/3870",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/3870#event-42622"
}
```



---

archive/issue_comments_021437.json:
```json
{
    "body": "<div id=\"comment:6\" align=\"right\">comment:6</div>\n\nYep.  In the scipy documentation, it assumes the function is continuous (from context, it seems over the reals).  So this function fails, as allowed by the documentation.",
    "created_at": "2010-01-20T06:31:19Z",
    "formatter": "markdown",
    "issue": "https://github.com/sagemath/sage/issues/3870",
    "type": "issue_comment",
    "url": "https://github.com/sagemath/sage/issues/3870#issuecomment-21437",
    "user": "https://github.com/jasongrout"
}
```

<div id="comment:6" align="right">comment:6</div>

Yep.  In the scipy documentation, it assumes the function is continuous (from context, it seems over the reals).  So this function fails, as allowed by the documentation.



---

archive/issue_events_042623.json:
```json
{
    "actor": "https://github.com/sagetrac-mvngu",
    "created_at": "2010-01-20T10:43:55Z",
    "event": "demilestoned",
    "issue": "https://github.com/sagemath/sage/issues/3870",
    "milestone_number": null,
    "milestone_title": "sage-4.3.1",
    "type": "issue_event",
    "url": "https://github.com/sagemath/sage/issues/3870#event-42623"
}
```
